{
  "2": [
    {
      "barNumber": "1",
      "description": "Y was GU to ATH, but DD so S SB. since small BLB, weak S SB.Small GU on\nmonthly chart and small gaps usually close before the bar closes so before end\nof December. Y closed near the open. Most days in Nov closed near the open or in\nthe middle of the bar and that is a sign of a rally that usually does not go to\nfar. BO back below Nov H and Nov 9 H, but tail, at 60 ma, PS LOM. GD after Y GU\nso 1 day island top, but small gap usually closes early. HPW"
    },
    {
      "barNumber": "2",
      "description": "BLB but tail, LOM. L1 but BLB just above 60ma, BB, LOM"
    },
    {
      "barNumber": "4",
      "description": "H2 at 60MA, PL, F BO LOY 2EB, PS OUD, but BRD, HPW"
    },
    {
      "barNumber": "6",
      "description": "CCBLB1C, but tails, just below MA, and BBSB 4 so 4 H MGB. If B, NWSS since PP\nwill get PB to 4 H"
    },
    {
      "barNumber": "7",
      "description": "HHDT 2, L2 at MA, 4H MGB, PH, but AIL, DD, HPWS2"
    },
    {
      "barNumber": "9",
      "description": "H1, SPBL, AIL, BL want OUD, but BRD, just below MA, TRO. PS W if BO above 7\nand then REVD. so far, TRO"
    },
    {
      "barNumber": "10",
      "description": "OU, AIL, OK to be long with stop below 4, but TTR just below MA, PP TRO, HPW.\n4 H MGB, but AIL, HPWS2"
    },
    {
      "barNumber": "12",
      "description": "BO, PS MMU, PS SPBL, but small BO, Y TR 69 is PP FF so MGA. BL need FT, else\nW 2 7 and F BO"
    },
    {
      "barNumber": "13",
      "description": "W 2 7 at MA, PH, BRB, AIBLE, but might get 1 more leg up after strong 5 6,\nand COY MGA, HPWS2"
    },
    {
      "barNumber": "14",
      "description": "II so BOM for H1 and for W. PS II FF and W 6 12"
    },
    {
      "barNumber": "16",
      "description": "W 7 12, PH, AIBLE. BR want HOD or at least 2LSD to 8 L at start of W. BL want\nH1 17 and more SPBL"
    },
    {
      "barNumber": "17",
      "description": "H1, still AIL, SPBL, but BRD, W, CC BRB, HPWB2"
    },
    {
      "barNumber": "18",
      "description": "COH, AIL, but BOM, BR want DT 15 W, BO want BO above 15 W and MMU."
    },
    {
      "barNumber": "19",
      "description": "BO, small SBU, but not BBLBC so BL need FT. PP will go at least a little\nhigher since SBU and BO above W. BR want F BO and 2nd REVD."
    },
    {
      "barNumber": "20",
      "description": "H1, SPBL, 2LU likely, but BRB, PP BLTR, PS SA, HPWB2. BL want OUD"
    },
    {
      "barNumber": "22",
      "description": "H1, SPBL, but BRB, weak rally, PP BLTR, PS SA, BB2"
    },
    {
      "barNumber": "23",
      "description": "MDT, weak rally, but BLB, AIL, PS BB and TTR just above MA, SS2"
    },
    {
      "barNumber": "24",
      "description": "H1, AIL, SPBL, but TTR in Y TR, weak rally, PP BLTR, HPWB2, PS LOM"
    },
    {
      "barNumber": "26",
      "description": "COH, still SPBL, AIBLE4, but not strong BTC, PP BLTR. no top yet"
    },
    {
      "barNumber": "27",
      "description": "F BO 21 23 DT, BRB, AIBLE4, but TC, SPBL, PS BB, SS2"
    },
    {
      "barNumber": "28",
      "description": "H1, AIL, SPBL, GXH and HOY MGA, but weak rally"
    },
    {
      "barNumber": "29",
      "description": "small BO. weak BLT but LBRNM so PP will go HR and might get SBU as BR finally\ngive up. still likely BLTR but no top yet. PS CC W 7 12 15 and then BO 19 and BR\nwant 2ndd CC W 19 21 26 29. BR need SSB or SBD, else BB and more SPBL"
    },
    {
      "barNumber": "31",
      "description": "H1, SPBL, TC, LBRNM, but very slow rally, not much profit for BL, PP CCCT\nsoon. CC W 2ES, but DD, PP BB. should evolve into TR or TTR soon"
    },
    {
      "barNumber": "35",
      "description": "H1, still AIL 6, but 7 BBRMC, PP TTR 20, PP SA, BB2"
    },
    {
      "barNumber": "37",
      "description": "L1, SPBR, but AIL, at MA and 22 start of W BL CH, PP LOM, HPW"
    },
    {
      "barNumber": "40",
      "description": "OU, AIL, H2, but tail, TTR, HPW"
    },
    {
      "barNumber": "41",
      "description": "BO but tail, PS BLTP in TTR. HH MTR, PH, but BLB, bottom of TTR 20, HPW"
    },
    {
      "barNumber": "42",
      "description": "HH MTR, PH, but bottom of TTR, tail, HPWS2, still AIL and in TTR"
    },
    {
      "barNumber": "43",
      "description": "H1, but CC BRB, TTR, HPW"
    },
    {
      "barNumber": "45",
      "description": "3 CC BLB, still AIL 6, but top of TTR, LP BTC"
    },
    {
      "barNumber": "46",
      "description": "LH MTR, but AIL, just above MA, 3 BLB, TTR, LOM, PP BB, SS2"
    },
    {
      "barNumber": "49",
      "description": "BO below TTR 20, 3 CC BRB, PS STC, but HPW for CC C below 35 since 50% chance\nBTC and F BO"
    },
    {
      "barNumber": "50",
      "description": "F BO, AIL, C above MA, DB 35, but TR, better to wait for breakout or 2nd\nsignal. Low probability, bad for stop entries.\">BBBR, in middle of TTR so LRP,\nHPWB2. L1 but BLB, LRP"
    },
    {
      "barNumber": "51",
      "description": "SBD, C below 35 bottom of TTR, PS MMD to 17 L, 8 L, 4 H, OOD. BR need 1 more\nbar for AIS"
    },
    {
      "barNumber": "52",
      "description": "CC C below TTR and MA, AIS, but tails, TRD, not strong BRT, PP bounce soon,\nbut PP 2LSD"
    },
    {
      "barNumber": "53",
      "description": "F BO, AIBRE4, but tail, BB2"
    },
    {
      "barNumber": "54",
      "description": "L1, AIS< MGB, but TR, better to wait for breakout or 2nd signal. Low\nprobability, bad for stop entries.\">BBBR, tails 52 53 so LRP, NS"
    },
    {
      "barNumber": "55",
      "description": "W 49 52, AIBRE, but tail, TGTB, HPWB2"
    },
    {
      "barNumber": "58",
      "description": "SBUM, AIL, reversed about 10 closes and 10 highs"
    },
    {
      "barNumber": "59",
      "description": "DT LH MTR 26, but BL FT, PP BB and around MA and 50PB, SS2"
    },
    {
      "barNumber": "60",
      "description": "OU, BO GXH after F BO GXL, BL still trying for OUD, but HOY might be too far\nabove"
    },
    {
      "barNumber": "62",
      "description": "ET 21 29, L2 59, late BLTP, PH, AIBLE, but tail, LPS, SS2, PS SPBL and MMU to\nHOY for OUD"
    },
    {
      "barNumber": "63",
      "description": "H1 but CC BRB, HPWB2, else NWSS"
    },
    {
      "barNumber": "67",
      "description": "4 BWBRB, still AIL, but not CCBBLBC, PS TR 62, LRP BTC, AIBLE4, might get PB\nto MA and 63 L. DT 61 but 4 BWBRB, HPWS2"
    }
  ],
  "4": [
    {
      "barNumber": "1",
      "description": "LDW. Y was ET and ended with huge MDB. still in Y TR. BLB, AIL 81, but tail.\nHOY and GXH MGA"
    },
    {
      "barNumber": "2",
      "description": "CCBLB1C. TGTA, but Y was ET so PS SA HOY. MMTA from Y MDB 75 77"
    },
    {
      "barNumber": "3",
      "description": "5 CC BLB, still BTC, but tail so some PTG at HOY and GXH"
    },
    {
      "barNumber": "4",
      "description": "ET Y 21 31 54 71 77, tail, F BO HOY, but 4 CC BLB, BB, SS2"
    },
    {
      "barNumber": "5",
      "description": "BRB so DBTCBL 4."
    },
    {
      "barNumber": "6",
      "description": "H1, COH, AIL, MMTA, AIL, but DBL 4 C so PS SA around 4 C, LRP B"
    },
    {
      "barNumber": "9",
      "description": "BBRB but tail. AIBLE, PS, but tail, TTR, HPW2. BL will BTC to prevent S signal\nfrom triggering. H1, AIL, but BRB, PS PW 4 8, PP SA, BB2, HPWB2. sstill 50%\nchance of swing down soon"
    },
    {
      "barNumber": "11",
      "description": "H1, SPBL, but PS PW 4 8, HPWB2. PW, but BLB, SPBL, HPWS2"
    },
    {
      "barNumber": "12",
      "description": "H1, SPBL, but BBRB, TTR, HPWB2"
    },
    {
      "barNumber": "13",
      "description": "BBLBC, AIBLB but LRP since weeak rally, LBRM, HPW"
    },
    {
      "barNumber": "14",
      "description": "BLB, C above 10, still SPBL so OK BTC, but not yet HP"
    },
    {
      "barNumber": "15",
      "description": "SBU, PP PTG and PB. PS EG, but still BTC, PS MG"
    },
    {
      "barNumber": "16",
      "description": "BX, PH, BBRB, AIBLE, but still AIL, PP MRV, HPWS2"
    },
    {
      "barNumber": "18",
      "description": "H1, COH, AIBLBA, but CC BRB16 PS more SD, HPWB2. still on 17 S, but AIBRE or\nabove 16. confusion so small TR likely"
    },
    {
      "barNumber": "19",
      "description": "OD, BTCBL 15 sold and created MDT so PS swing down."
    },
    {
      "barNumber": "20",
      "description": "H2, AIL, but DD, far above MA, HPWB2. H2 and AIL, AIBRE or stop above 19 or\n16. Confusion usually results in TR. BL want BLF and BR want BX and HOD. HPW."
    },
    {
      "barNumber": "22",
      "description": "H2, but BRB, TC, EPBD, still on 17 S. AIBRE4"
    },
    {
      "barNumber": "23",
      "description": "COH, H2 18, AIL, AIBRE, but BRB 22, PP MRU and TR"
    },
    {
      "barNumber": "26",
      "description": "BO 19 LH but tail, PP TR 16. still AIL. DT LH MTR 19, AIBLE4, but BLB, 4\nBWBRB, 6 BBLMC, AIL, SS2"
    },
    {
      "barNumber": "28",
      "description": "H1, AIL, BL hope resumption of SPBL, but PS top of TR, PS SA 26 and 16"
    },
    {
      "barNumber": "30",
      "description": "LH MTR, still on 17 S, but TR more likely, LOM, HPWS2, still AIL, but PP top\nof TR, MA MGB"
    },
    {
      "barNumber": "31",
      "description": "H2 28, AIL, but top of TR 16, NS, HPWB2"
    },
    {
      "barNumber": "35",
      "description": "OU, 20GBB, but TTR, still on 16 S, PP will trade down to 21 L and 50% chance\nof test of 6 L and HOY since most days have closed in middle of their range. BB2"
    },
    {
      "barNumber": "38",
      "description": "H2 36, above MA, but apex of TRI, still on 16 S, HOY and MP of day MGB, HPW"
    },
    {
      "barNumber": "40",
      "description": "LH, but TRI, just above MA, no C below MA today, still AIL, but more reward\nfor BR since TG is MP of range. HPW"
    },
    {
      "barNumber": "41",
      "description": "20GBB, W 36 38, C above MA, no C below MA in 41 bars, but apex of TTR, 6\nBWBLB, HPW. BOM"
    },
    {
      "barNumber": "42",
      "description": "COH and above MA, OK B but NS, HPW. No C below MA, should get at least one C\nbelow MA today and probably several, PP will not go up much until then, and PP\nwill not go up much at any point. BOM, TRSV"
    },
    {
      "barNumber": "47",
      "description": "L1 in weak BRCH, 2nd C below MA all day. BOM, 21 L and MP of day MGB, but\nHPW. still on 16 S"
    },
    {
      "barNumber": "48",
      "description": "W 35 41 but TC, still in TTR 16, BOM, HPW, still on 16 S with stop now above\n43"
    },
    {
      "barNumber": "50",
      "description": "SBU, BO above BRCH and MA, still AIL, BR exit above 43, BL want TRESU, HPW\nfor BL FT sicne PS BRTP like 29 and 35"
    },
    {
      "barNumber": "51",
      "description": "BLTP 50, but just above MA, 50 was SBU, PS BB for 2LSU, middle of TTR, LOM,\nSS2"
    },
    {
      "barNumber": "53",
      "description": "3 CCBRB, C below pas 30 bars, HPW for BR FT since PS BRTP and F BO of TTR. BR\nneed 1 more BRB for AIS so BL will BTC to prevent that"
    },
    {
      "barNumber": "54",
      "description": "4 CCBRB, 2 C below MA and 35, AIS, but still need C below 21 bottom of TTR.\nMO of day and HOY MGB. most days over past month have closed in middle or near\nOOD"
    },
    {
      "barNumber": "55",
      "description": "LLDB 21, but BLD, AIS, HPWB2. AIBLE4. L1, MGB, but BLD, bottom of TR, LRP"
    },
    {
      "barNumber": "56",
      "description": "L1 but CCBLB at bottom fo TR, PS BB, HPW"
    },
    {
      "barNumber": "57",
      "description": "OD, but BRD, CC BLB, bottom of TR, still on 51 S, HPW"
    },
    {
      "barNumber": "58",
      "description": "SBU, but need FT, else STC like 15 29 35 50"
    },
    {
      "barNumber": "59",
      "description": "L2 at MA, AIS, MP of day MGB, but bottom of TR so LRP"
    },
    {
      "barNumber": "60",
      "description": "BO, but PS BRTP since TTR since 16. BR want FT 61, BL want BLB for F BO"
    },
    {
      "barNumber": "61",
      "description": "F BO, AIBRE, but tail, HPWB2. L1, MGB, but BLB, LRP"
    },
    {
      "barNumber": "62",
      "description": "II, BOM, L1 but PP BB around MP of day and HOY. W 35 54, BL want TRESU for\nweek to C at HOD and HOW"
    },
    {
      "barNumber": "63",
      "description": "SBU, C far above MA, best BLB of day, AIL, but top of TR, BL need FT"
    },
    {
      "barNumber": "64",
      "description": "BRD, weak FT, LP H1, top of TR 16, PS SA, AIBLE or AIBLE4. BLTP but tail,\nHPWS2, PP BB and around MA"
    },
    {
      "barNumber": "65",
      "description": "DT 16, MDT 63, but tail, PP BB and around MA, SS2, should go HR"
    },
    {
      "barNumber": "66",
      "description": "H1, PP will go HR, but TR, better to wait for breakout or 2nd signal. Low\nprobability, bad for stop entries.\">BBBR, top of TR 16, LRP"
    },
    {
      "barNumber": "67",
      "description": "HH MTR, L2 64, W 58 63, COL, PH, AIBLE, but NS, PP BB around MA, BL want C\nabove 3700 BRN"
    },
    {
      "barNumber": "81",
      "description": "End of Day"
    }
  ],
  "7": [
    {
      "barNumber": "1",
      "description": "GD to Y TTR. Y was BBLC on daily, but CC BLBC happened only once in 2 months,\nso PP not BBLC on daily chart today. BLB at MA, HL 72 so H1, but BLD after 3\nBBRB and W 73 75 78, PP 2LSD, PP SA and TRO. HPW"
    },
    {
      "barNumber": "2",
      "description": "H1 but DD, PP 2LSD likely from Y W, PP LOM, HPWB2"
    },
    {
      "barNumber": "4",
      "description": "L1, LH, but DD, TTR, in Y TTR, PP LOM, PP BB"
    },
    {
      "barNumber": "6",
      "description": "SBU, BO abovd MA and TTR, PL, but top of TTR, PS LH and 2LSD from Y W, HPW B2"
    },
    {
      "barNumber": "7",
      "description": "L2 4, but PS PB from 6, HPW S2"
    },
    {
      "barNumber": "8",
      "description": "H1 6, PL, but tail, top of TR, PS LH and 2LD from Y W, HPWB2, NS"
    },
    {
      "barNumber": "10",
      "description": "MW 6 8, but BLCH, PS SPBL, still on B above 6 and above 8. AIBLE4. PP AIL 6,\nbut TRO, HPW"
    },
    {
      "barNumber": "14",
      "description": "W 9 11, LH MTR, BRB, AIBLE, but tail, SPBL, HOY and GXH MGA, HPWS2"
    },
    {
      "barNumber": "15",
      "description": "H1, SPBL, AIL, but CC BRB, still on 14 S, weak rally, HPW"
    },
    {
      "barNumber": "17",
      "description": "C above 14 so BO and PS MMU, but Y, traders sold most BLBC, so PS STC, HPW@"
    },
    {
      "barNumber": "18",
      "description": "SBD, but LOM, PS BTC, HPWS2"
    },
    {
      "barNumber": "19",
      "description": "H1, above MA, still AIL, but SBD 18, PS SA, BB2, LOM, HPW"
    },
    {
      "barNumber": "21",
      "description": "L1 18, but C just above MA, middle of TTR, BOM, HPW"
    },
    {
      "barNumber": "22",
      "description": "CC BRB, COL and below MA, but middle of TTR, LOM, HPW"
    },
    {
      "barNumber": "24",
      "description": "OO, but TTR so LRP. BR want LH MTR 18, BL want DB, and a measured move\nup\">DBBLF 18 24. BOM"
    },
    {
      "barNumber": "25",
      "description": "IOI and OO, BOM, HPWB2 and HPWS2"
    },
    {
      "barNumber": "26",
      "description": "II after OO, still BOM, HPW for BOUD. COH and above MA, OK B but TTR, LOM,\n45% chance SA. for 2 days, LOM, traders S strong BLB and B strong BRB."
    },
    {
      "barNumber": "27",
      "description": "MDB, did not fall below II 25 so still II B"
    },
    {
      "barNumber": "28",
      "description": "DT 17 after DB 24 18, still BOM, but on OO and II B, but BL will give up\npbelow 24 so OK Swing S for MMD to LOD. HPWF"
    },
    {
      "barNumber": "30",
      "description": "SBU, new HOD, ran stops on BR, but tail, still in TTR, HPW. PS BLTP"
    },
    {
      "barNumber": "31",
      "description": "H1 from 30 BO to new HOD, IOI, but after big DD, middle of TTR, HPW"
    },
    {
      "barNumber": "33",
      "description": "BR IB, C below L, PS 30 was to trap bears out before mkt goes down to new\nLOD, but TTR, LPS"
    },
    {
      "barNumber": "38",
      "description": "II below MA, still on 33 S, LOD and GX L MGB, but TTR 36 and TTR all day, HPW"
    },
    {
      "barNumber": "41",
      "description": "OD, working down to GX L, but weak BRT"
    },
    {
      "barNumber": "42",
      "description": "CCBBRC, STC, but at LOD and GXL PP too far to get there without more and\nstronger SG"
    },
    {
      "barNumber": "45",
      "description": "BBRBL, at MMT, just above 60MA, not good STC, PP PTG soon. PP TTRD"
    },
    {
      "barNumber": "46",
      "description": "SX, COH, AIBRE. OK B but PP MRV and might get one more new L before start of\nLTR"
    },
    {
      "barNumber": "47",
      "description": "CCBBLBC after SX and near 60ma SP, PP start of LRTR, PP 2LSU after SX"
    },
    {
      "barNumber": "48",
      "description": "L1, AIS, COL, AIBLE, but CC BLB, PP LTR, PP BB or below 46, SS2. H1, room to\nMA and 6 L, but BRB, TR likely, PS SA"
    },
    {
      "barNumber": "50",
      "description": "OO, 60ma and LOD and GXL MGB, but after CCBBLB 47, TR likely, middle of TTR\nso LRP"
    },
    {
      "barNumber": "52",
      "description": "H2 at 60ma, PP start of LTR, AIBRE, PS 2LSU to MA and 50 H."
    },
    {
      "barNumber": "54",
      "description": "L1, AIS, AIBLE, but CCBLBC, H2, PP 2LSU and TR, far below MA, PP BB abd below\nLOD, HPWS2, else NWSS"
    },
    {
      "barNumber": "56",
      "description": "W 46 52, AIBRE, PP 2LSU. L1, GXL MGB, but BLB, HPWS2. LTR likely"
    },
    {
      "barNumber": "57",
      "description": "DTBF 54, GXL MGB, but at 60MA, W, PS BB and below 55, NS. W 46 52 but BRB. PP\nLTR in TTRD"
    },
    {
      "barNumber": "58",
      "description": "W 55, MDB, but tail so LRP. AIBRE, but still on DTBRF 57 unless goes above\n56, which it PP will. LTR likely"
    },
    {
      "barNumber": "60",
      "description": "20GBS, L2 57, DT 54, AIBLE, GXL MGB, but DD, PP BB for test 50 top of W and\nmaybe 6 L, HPWS2"
    },
    {
      "barNumber": "62",
      "description": "H1 but near 50 H top of W so PP TR soon"
    },
    {
      "barNumber": "64",
      "description": "LHDT 40, PS top of LTR, but 7 BBLMC, PP BB, MGA 6L, HPWSS2, else WSS"
    },
    {
      "barNumber": "65",
      "description": "COL, but PP will get HL MTR and HSB 51 55, SS2"
    },
    {
      "barNumber": "67",
      "description": "HL MTR, HSB, but big DD after 3 BRB, HPWB2. still on DT S but PP TR"
    },
    {
      "barNumber": "81",
      "description": "End of Day"
    }
  ],
  "8": [
    {
      "barNumber": "1",
      "description": "Y was ID so B and S signal. NW on daily but Y is weak SSB. Most days have had\nat least one swing up and down. Lots of TTR PA for a few days so fewer stop\nentry setups. If small GD, gap will usually close in 1st hour. ET, F BO LOY, PL,\nbut tail, just below 60ma, NS"
    },
    {
      "barNumber": "2",
      "description": "CCBLB1C, PP BB. L1, BX at MA, but CC BLB, AIL, GXH and COY MGA, BL want OUD,\nPP BB, SS2"
    },
    {
      "barNumber": "4",
      "description": "OO. L2 S, abd PB from T1BU. BOM"
    },
    {
      "barNumber": "5",
      "description": "IOI after OO, still BOM. since LP, NS."
    },
    {
      "barNumber": "6",
      "description": "L2, but still AIL and on B below 2 and above 4 OO, PP BB"
    },
    {
      "barNumber": "8",
      "description": "BO above L2, PS MG, but need FT. test of GXH"
    },
    {
      "barNumber": "9",
      "description": "BRD, F BO, AIBLE. F BO L2 so W but only DD, HPWS2"
    },
    {
      "barNumber": "10",
      "description": "SBD, PS AIS, but HPW for FT since bottom of Y ET TR"
    },
    {
      "barNumber": "11",
      "description": "CCBBRB1C, but not good STC since traders have BT BBRBC and SD BBRBC for 2\ndays. BR need BO below 1, else HL DB and LOD"
    },
    {
      "barNumber": "12",
      "description": "HL DB, test LOY, OU, COH, HL MTR, PL but strong SBD, PP MRV, HPWB2. AIBRE.\nlike Y, LOM, BR S BLBC and BL B BBRBC. HPW"
    },
    {
      "barNumber": "14",
      "description": "3 CC BLB, might be AIL, but shrinking bodies, still below 8 HOD, still BOM,\nnot reliable BTC, HPW"
    },
    {
      "barNumber": "16",
      "description": "BO above 15 so PS MG, but LH 8, PS TRI, need FT and need BO above 8. PS OUD"
    },
    {
      "barNumber": "17",
      "description": "BLB, FT, BT 15 H, BTC, PS MMU to above HOY for OUD"
    },
    {
      "barNumber": "18",
      "description": "COH, TGT, but bigger bar so PS some PTG soon. HOY MGA, should get there, even\nif PB below 8 H 1st"
    },
    {
      "barNumber": "19",
      "description": "tail so some PTG, but 9 BBLMC, PP 2LU even if get PB for 1 hour and test of\n18 BX L. BR want ET top, but SS2, PP only MRV,"
    },
    {
      "barNumber": "21",
      "description": "H1, but II late in BLT so PS FF. should get OUD, but BX so PP TR soon"
    },
    {
      "barNumber": "23",
      "description": "BRB, PP II FF, AIBLE, even though only BRD. MGA, 12 BBLMC so strong BL, but\nBX so PS TR soon"
    },
    {
      "barNumber": "24",
      "description": "COH, MGA, but BX so PP TR soon"
    },
    {
      "barNumber": "25",
      "description": "BO HOY so OU, ATH and 2700 BRN MGA, but tail, PW 19 22, PB likely soon so\nHPWB2. only B if WSS. most should wait to B PB"
    },
    {
      "barNumber": "26",
      "description": "PW, BRB, AIBLE, but PP MRV, might get 2LSD, PS to 21 II FF and BX L and MA.\nBX because of W and 17 BBLMC"
    },
    {
      "barNumber": "27",
      "description": "H1 but CC BRB, PW, PS SA for 2LSD, HPWB2"
    },
    {
      "barNumber": "32",
      "description": "OD, but PP TR, LOM, HPW"
    },
    {
      "barNumber": "34",
      "description": "H1 but 2 DD. most OUD enter TR and this looks like early TR. ATH MGA and\nstrong enough rally to get there at some point today, but PP not far above"
    },
    {
      "barNumber": "37",
      "description": "IB, AIL, 5 BLB, ATH MGA, but PS top of TR soon"
    },
    {
      "barNumber": "39",
      "description": "F BO ATH, 7 CC BLB so BX, W 8 25, TR likely soon, AIBLE4, but BLB, TC, MRV,\nHPWS2"
    },
    {
      "barNumber": "40",
      "description": "H1 but BRB, PP SA, PP TR soon, HPW B2"
    },
    {
      "barNumber": "42",
      "description": "41M, F BO ATH 2ES, AIBLE, PP TR here or soon, but PP MRV"
    },
    {
      "barNumber": "43",
      "description": "H1, SPBL, but MDT 39 41, PP TR soon"
    },
    {
      "barNumber": "45",
      "description": "MDT 41, TR likely soon, but BLB, SPBL, HPWS2, PP only MRV to around MA"
    },
    {
      "barNumber": "47",
      "description": "H1 but DD, PS TR, PP SA 41 for W 25 41, should get PB to MA by 11:30 AMPST"
    },
    {
      "barNumber": "49",
      "description": "COH in SPBL so BTC, but PP SA 41 for SD to MA by 11:30 AMPST"
    },
    {
      "barNumber": "50",
      "description": "W 25 41, F BO tr 40, OD, but tail, SPBL, HPWS2 or S above bars for scalp"
    },
    {
      "barNumber": "51",
      "description": "H1, COL, but DD after BRB, PP SD to MA soon, HPWB2"
    },
    {
      "barNumber": "53",
      "description": "OD but just above MA, HPWS2, TR likely, but might test HOY and 27 start of BL\nCH"
    },
    {
      "barNumber": "55",
      "description": "20GBB, H2 52, DB 43, but 4 BRB, TR, PP SA and more TR. mkt searching for\nbottom of TR, which is PP around 40 L of 27 L"
    },
    {
      "barNumber": "56",
      "description": "H2, 20GBG, MDB, bur TC 50, PP 2LSD so PP SA, HPWB2"
    },
    {
      "barNumber": "59",
      "description": "BO, PS MMU from TR 40 56 DB, but PP SA and ET 41 43 50 56"
    },
    {
      "barNumber": "61",
      "description": "BX, PS FF 56 TR, COL, PH, AIBLE, but SBU 57 - 60, HPWS2. BL want H1 62, but\nPP not much more up today since PS FF 56"
    },
    {
      "barNumber": "63",
      "description": "3 CC BRB, FF 56 MGB, PP SA, PP HOD 60"
    },
    {
      "barNumber": "65",
      "description": "H1 at MA, but 4 BRBC, BX 60, PP 2LSD so PP MRVU and LH, HPWB2"
    },
    {
      "barNumber": "68",
      "description": "H2 but TTR and PP MRU, HPW"
    },
    {
      "barNumber": "81",
      "description": "End of Day"
    }
  ],
  "10": [
    {
      "barNumber": "2",
      "description": "F BO, 2BR, PS, FF and COY MGA, PP AIL, but TR, better to wait for breakout or\n2nd signal. Low probability, bad for stop entries.\">BBBR"
    },
    {
      "barNumber": "3",
      "description": "weak EB, but PL 1"
    },
    {
      "barNumber": "4",
      "description": "COH, PP AIL, COY MGA and 60ma, and 78 H for PS ET"
    },
    {
      "barNumber": "6",
      "description": "PW 1 3, test COY, but 6 BBRMC, AIL, MGA, PP BB. still in Y TR so PP PB soon,\nbut 1 will PP remain LOD, and should get above 78 H at some point today for PS\nET. might test LOY"
    },
    {
      "barNumber": "7",
      "description": "H1, AIL, MGA, but BRB, top of Y TR. PS SA, HPWB2"
    },
    {
      "barNumber": "8",
      "description": "OU, but tails, top of Y TR. might get PB before test 60ma and 78 H, but still\nAIL"
    },
    {
      "barNumber": "9",
      "description": "L2 at top of Y TR, AIBLE, but AIL, TGTA, SPBL, MRV"
    },
    {
      "barNumber": "10",
      "description": "H1, SPBL, MGA, but tail, still on 9 L2 top, top of Y TR, PP PB soon PS W 6 8,\nHPWB2"
    },
    {
      "barNumber": "11",
      "description": "MDT 9 TW, still on 9 S, but PP MRVD. might test LOY for HL MTR"
    },
    {
      "barNumber": "13",
      "description": "3 CCBRBC, PP SA for 2LSD from MW 11"
    },
    {
      "barNumber": "14",
      "description": "SBU, BT 3 so PS MMU to above 60ma, but PS BLTP, PS STC, still on 11 S, but PS\nBB around MA and 8 L, then TR"
    },
    {
      "barNumber": "15",
      "description": "LH, BLTP 14, but BDUC, TTR, LOM, HPW. BL want BO above 60m H for H2 and test\nof 60ma, BR want test LOY. HPW"
    },
    {
      "barNumber": "16",
      "description": "H1 after 14, AIL, MGA, but BRD, CC BRB, HPWB2"
    },
    {
      "barNumber": "17",
      "description": "BO above 60m H so triggered 60m H2, but just below 60ma and at top of TR on 5\nmin. should get above 78 H and test 60ma, but might get PB from above 60m H"
    },
    {
      "barNumber": "18",
      "description": "F BO, PH, L2 11, AIBLE, but tail, MGA, might get 3LU to 60ma, lots of\nreversals so TR PA, HPWS2"
    },
    {
      "barNumber": "20",
      "description": "SBD, lots of BRB since 7 so PP TR. might test 13 L at bottom of TR, or LOY,\nbut LOM so PS BTC"
    },
    {
      "barNumber": "21",
      "description": "HL, H1 at MA, AIL, COH, but top of TR, LOM, NS, HPW, PS SA 18 for W 11 18 and\nDT 78"
    },
    {
      "barNumber": "24",
      "description": "W 9 18, COL, PH, AIBLE, but 3 BLB, NS"
    },
    {
      "barNumber": "27",
      "description": "streak of 4 BRB, AIS, should test 13 L and PS LOY"
    },
    {
      "barNumber": "28",
      "description": "BO, C below 15, AIL, but PS BB 21 or 13 and then TR"
    },
    {
      "barNumber": "29",
      "description": "BBRBC, but late in STC so PP PTG soon. SP around LOY and 13 L, TR likely, but\nSBD, BB2"
    },
    {
      "barNumber": "30",
      "description": "SX, AIBRE4 or take profits at market. HL MTR, LL DB 13, but 7 CC BRB, HPWB2"
    },
    {
      "barNumber": "31",
      "description": "SBU, PP SA around MA and 28 SXH and 50P, HPWB2"
    },
    {
      "barNumber": "32",
      "description": "CCBLBC, but PP TR since 6 and now middle of TR, BDUC, PP BR will start to\nscale into shorts for 2LSD"
    },
    {
      "barNumber": "33",
      "description": "LHMTR, MA, 50P, but SBU, HPWS2. PP LBR SA"
    },
    {
      "barNumber": "34",
      "description": "LH MTR, MDT at MA and 50P, but SBU31 32, might go SW"
    },
    {
      "barNumber": "35",
      "description": "H1 but DD, middle of TR, PS LOM, HPW"
    },
    {
      "barNumber": "37",
      "description": "LHMTR, L2 34, PS test 30 or LOY, but TTR, LOM, HPW"
    },
    {
      "barNumber": "40",
      "description": "OD, SBD, 30 L and LOY MGB, but TTR, LRP, PS BTC"
    },
    {
      "barNumber": "41",
      "description": "CCBBRBC, AIS, SBDm but PP TR and BB around 30 L and LOY"
    },
    {
      "barNumber": "42",
      "description": "HL DB 30, TW 13 30, but SBD, LOY MGB, BB2"
    },
    {
      "barNumber": "44",
      "description": "REVU from TW and HLMTR, back to AIL, but middle of TR 6, NWS"
    },
    {
      "barNumber": "45",
      "description": "BO 37, AIL, MGA 24 HOD, 78 H, 60ma, but top of TR, PS SA 37, BL need WSS, BR\nneed MDT"
    },
    {
      "barNumber": "47",
      "description": "H1 but BRB, top of TR, PP SA"
    },
    {
      "barNumber": "48",
      "description": "MDT 45, W 37 45, top of TR, L2 46, but BLB, SBU 42-45, MA just below, PP BB\naround MA, PP TTR, HPW"
    },
    {
      "barNumber": "50",
      "description": "HL at MA, MW 47 49, but middle of TRD so MRVU, HPW"
    },
    {
      "barNumber": "52",
      "description": "HL in BL CH, MW, but 4 BRB, LRP"
    },
    {
      "barNumber": "53",
      "description": "L1, but BLB, bottom of TR, PS BB, SS2"
    },
    {
      "barNumber": "55",
      "description": "H2, bottom of TR, HL DB 42, but BRB. might try to test LOY"
    },
    {
      "barNumber": "56",
      "description": "L1, LOY MGB, but BLD, bottom of TR. H2 but DD, SPBR, HPW B2"
    },
    {
      "barNumber": "57",
      "description": "BO 30, but PP just test LOY instead of MMD to LOD. BR need FT, but PP will\nnot get new LOD"
    },
    {
      "barNumber": "58",
      "description": "H2 30, L1=2, test LOY, but only DD after BBRB and in SPBL, HPWB2. FT since\nnot BLB, but not strong STC since bottom of TR, HPWS2"
    },
    {
      "barNumber": "59",
      "description": "H2 30, test LOY, but TC, BRB, HPWB2, else NWS. AIBLRE4"
    },
    {
      "barNumber": "60",
      "description": "L1 but PP near bottom fo TR, DD, PP BB"
    },
    {
      "barNumber": "62",
      "description": "SBU, but small, just below MA, BL need FT and BO above MA, else BR with STC.\nslightly more likely that this is REVU than PB in BRT"
    },
    {
      "barNumber": "63",
      "description": "L2 60 at MA, COL, but SS2 since SBU 62 63 and PS start of swing up in TRD"
    },
    {
      "barNumber": "65",
      "description": "WBRF 60 62 at MA, but TTR, PS BB, PP BB 69 for W 30 59. still on 59 B but\nAIBLE below 64 or BRB COL 62. Now, 50-50 UD. BL want BO above WBRF, BR want BO\nbelow 59"
    },
    {
      "barNumber": "67",
      "description": "BRTP, HL DB 59, but TTR so LRP, abd TR, better to wait for breakout or 2nd\nsignal. Low probability, bad for stop entries.\">BBBR. BL want MMU to 48 LH"
    },
    {
      "barNumber": "68",
      "description": "L2 64 at MA, BLTP, but small BRB, PS PB from BO above 64. AIBLE3, HPWS2"
    },
    {
      "barNumber": "81",
      "description": "End of Day"
    }
  ],
  "11": [
    {
      "barNumber": "1",
      "description": "BGD. LDW. start trading March contractt today. HL DB LOY, but tail, HPW"
    },
    {
      "barNumber": "2",
      "description": "OU HL DB LOY, PL, bt small bars so LRP"
    },
    {
      "barNumber": "3",
      "description": "BBRBC, OO, but far below MA, cc BLB, LPS, HPW"
    },
    {
      "barNumber": "4",
      "description": "H2 1, F BO Y TR, F BO LOY, PL but 4 BTTR, LRP, PS TRO. if goes above 3 then OO\nB after F OO S"
    },
    {
      "barNumber": "5",
      "description": "OU, 4 BLB, PP AIL, but TTR, still below 3 OO, PS TRO"
    },
    {
      "barNumber": "6",
      "description": "BRD, but AIL. AIBLE4, PP BB, should BO above 3 OO, which will trigger OO B and\nF OO S 4"
    },
    {
      "barNumber": "8",
      "description": "MDT, L2 2 at MA, but PP BB. still AIL, but weak rally so far. H1 but tail,\njust below MA. PS PW 5 7 or 2 7. BL want OUD, but PP not get it"
    },
    {
      "barNumber": "10",
      "description": "PW at MA, AIBLE4, PH, 42t above 4 so BL can take 10 pts (40t), but 6 BBLMC,\nPS BB for more T1BU, PP MRV, HPWS2"
    },
    {
      "barNumber": "11",
      "description": "H1, T1BU, but BBRB at MA, PS SA for PW 2 10, HPWB2"
    },
    {
      "barNumber": "12",
      "description": "DD IB, weak H1 at MA, weak L1 for PS BRT 11, PP TR soon"
    },
    {
      "barNumber": "14",
      "description": "5 BWBLB, BGUC 2, not yet AIS, PP TRO"
    },
    {
      "barNumber": "16",
      "description": "BO, PS MG, but TRO more likely uless BR get FT 17"
    },
    {
      "barNumber": "17",
      "description": "CCBRB1C, but smaller body, consoicuous tail so PP BRTR and not MG. DBR, PP\nmore BTC than STC. HLMTR but 7 CC BRB, PP MRU. AIBRE4"
    },
    {
      "barNumber": "18",
      "description": "HL MTR, BLBC, AIBRE, but PP MRVU to MA and maybe 13 H at top of PW, HPWB2"
    },
    {
      "barNumber": "19",
      "description": "CC BRB, SBU, but PP SA around MA and 50P, HPWB2, PP BB since CC BLB is weak\nL1 in bottom half of TR"
    },
    {
      "barNumber": "21",
      "description": "H1, PS BLTR, but just below MA, PS SA for MDT 19, middle of TRD, OOD MGN, HPW"
    },
    {
      "barNumber": "22",
      "description": "L2 just below MA, AIS, but middle of TRD, tail, LP, NS, HPWS2"
    },
    {
      "barNumber": "23",
      "description": "SBD"
    },
    {
      "barNumber": "24",
      "description": "FT, CCBRBC, but already AIS 17, BR need BO below LOD and Nov 9 H. BL want HL\nMTR, LL DB 17 but BLD, HPWB2, AIBRE4"
    },
    {
      "barNumber": "26",
      "description": "10BO, SBD, PS MMD, PS TTRD, GXL MGB, but BR need FT, else PS F 18BO"
    },
    {
      "barNumber": "27",
      "description": "BR FT, PP 2LSD, PP TTRD, but tail on top so weaker BO, PP bounce soon"
    },
    {
      "barNumber": "28",
      "description": "BBLBC, F 18BO, PL, MMD from HOD to OOD so OOD might be MGN all day andi\nincreased chance of TRD with C around OOD, AIBRE"
    },
    {
      "barNumber": "29",
      "description": "BL EB, FT after 28 REVU, OOD MGA, but small bar might get 50P. L1 but PP AIL,\nPP BB"
    },
    {
      "barNumber": "30",
      "description": "No more typing today"
    },
    {
      "barNumber": "81",
      "description": "End of Day"
    }
  ],
  "14": [
    {
      "barNumber": "1",
      "description": "BGU. AIL, GXH and ATH MGA, but BLD, HPW B2."
    },
    {
      "barNumber": "2",
      "description": "BBLBC, CCBLB1C. above GXH, ATH MGA. AIBLE4 since 50% of strong moves on open\nreverse"
    },
    {
      "barNumber": "3",
      "description": "F BO, but 3 BLB, BB"
    },
    {
      "barNumber": "4",
      "description": "outside bar, AIL, but BRD, PS TRO"
    },
    {
      "barNumber": "5",
      "description": "IOI, BOM, H1, AIL, still on 2 BTC, but DBL, DD, DBL, HPWB2. L2 3 but only one\nsmall BRB today, HPWS2"
    },
    {
      "barNumber": "6",
      "description": "II, AIL, H1, but 4 BTTR so LRP"
    },
    {
      "barNumber": "7",
      "description": "small EB, but still AIL. AIBLE4. small bars, TTR 6, far above EMA, PS TRO"
    },
    {
      "barNumber": "8",
      "description": "L2, F BO HOY 2ES, PH, but small bars, PS BB and SPBL, ATH MGA, HPWS2"
    },
    {
      "barNumber": "9",
      "description": "H1, SPBL, ATH MGA, but BRB, PS TTR 3, HPWB2. still on 8 L2 top, PH, but small\nSW bars, HPWS2. PS TRO"
    },
    {
      "barNumber": "10",
      "description": "MDT 8, still on 8 S, but still AIL and SPBL. TTR 3, LOM, HPW"
    },
    {
      "barNumber": "11",
      "description": "H2, AIL, but TTR so LRP"
    },
    {
      "barNumber": "13",
      "description": "F BO HOD, COL, W 4 8, PH, but TTR 3 so LRP,"
    },
    {
      "barNumber": "14",
      "description": "CC BRBC, PS start swing down. W so PP 2LSD"
    },
    {
      "barNumber": "16",
      "description": "SBD, but PS DB 1 at MA. SBD and W top so PP 2LSD, but PB to MA and DB 1 so PS\nLOD, PS BTC. ok to take partial profits on shorts, but HPWB2"
    },
    {
      "barNumber": "17",
      "description": "DB 1 at MA, but PP 2LSD. AIS 16, AIBLE4, but HPWB2. L1, PS MMD to 60ma"
    },
    {
      "barNumber": "18",
      "description": "SBD, but 2LD lots of early TR PA, ok to take partial profits. BL want F BO,\nH2 17"
    },
    {
      "barNumber": "19",
      "description": "PW 13 16, H2 17, F BO LOD, COL, PL, AIBRE. OL but small bar, 60ma MGB, PP\nMRV, HPWB2"
    },
    {
      "barNumber": "21",
      "description": "MW 16 18, AIBRE, PL, but PP MRV to MA and 17 top of W"
    },
    {
      "barNumber": "23",
      "description": "L1 at MA, AIS, DT 20, DT 18, but PP 2LSU after MW, HPW S2"
    },
    {
      "barNumber": "26",
      "description": "W 1 20, ET 18 20, PL, AIBRE, but DD, HPWB2. L1, 60ma MGB, but DD PP TR since\n17, HPWS2. PP TR soon"
    },
    {
      "barNumber": "27",
      "description": "II, W, PL, PS 2LSU, but PP TR soon. L1 but PP FF so only S if you can make\nquick decisions"
    },
    {
      "barNumber": "28",
      "description": "L1, but stop for BL is below 27 II, not 28. TR likely here or soon"
    },
    {
      "barNumber": "29",
      "description": "BLBC, but just below MA in BRCH so PP STC. PP TR and BB 30 and 25"
    },
    {
      "barNumber": "30",
      "description": "L1, AIS, BRCH, but PP 2LSD after W, PP TR here of soon, PS BB, HPWS2"
    },
    {
      "barNumber": "32",
      "description": "H1, 2LSU likely after W, but 3 BRB, just below MA, still in BRCH, HPWB2.\nstill on 31 L1, AIS, but TTR, PP 2LSU after W, LL2"
    },
    {
      "barNumber": "35",
      "description": "L1, AIS, BRCH, but DD, TTR, W 25, 60MA SP just below, PS BB, HPWS2"
    },
    {
      "barNumber": "36",
      "description": "HLMTR, BLB, but small body, TTR 26, just below MA, HPWB2. BRCH, but PP TR and\n25 still might be LOD"
    },
    {
      "barNumber": "42",
      "description": "41M, 41 COH, MDB, test 60ma and HOY, PL, but TC 30, HPWB2, BL need BO above\nMA"
    },
    {
      "barNumber": "43",
      "description": "L1, SPBR, but DD, PL 42, at 60ma, PS BB and below HOY, HPWS2"
    },
    {
      "barNumber": "46",
      "description": "W 36 42, at 60ma and HOY, PL, but TC, NS, might NWSS. AIBRE, but still SPBR"
    },
    {
      "barNumber": "47",
      "description": "L1, OOM MGB, but PP at least 2 small legs sideways to up, HPWS2. SBR, but PP\nwill reach MA. small EB so PP DBL. L1, SPBR, but stalling at 60ma and HOY, W 36\n40, HPWS2, PS 2LU, PS BB"
    },
    {
      "barNumber": "48",
      "description": "HL MTR, OU, but TC, just below MA, AIBRE, HPW for BO above MA to B. might get\nback to MP of dat and 289 start of CH"
    },
    {
      "barNumber": "50",
      "description": "L2 at MA, AIS, but DD at SP HOY and 60ma, PS SPBL. BL need SBU above MA. TTR\n41. still on B above 46 and 49, but LP since top of TTR and still no BO above MA"
    },
    {
      "barNumber": "51",
      "description": "COL, L2 at MA, but PP MBO, TTR at SP"
    },
    {
      "barNumber": "52",
      "description": "HL MTR, LL DB 48, but TTR and just below MA, NS. HPW for SBU"
    },
    {
      "barNumber": "54",
      "description": "W 47 51 below MA, AIS, but TTR at SP, still on 46 B, HPW. MGA 29 H at top of\nCH and MP of day"
    },
    {
      "barNumber": "56",
      "description": "L1 at MA, but TTR at SP, HPW"
    },
    {
      "barNumber": "59",
      "description": "L1 just below MA< OOM MGB, SPBR, but tail, TTR"
    },
    {
      "barNumber": "61",
      "description": "SBD, but just above COY, and BL might BTC of big BRB at new L in SPBR, like\n20 25 44, not strong STC"
    },
    {
      "barNumber": "63",
      "description": "F BO FF 60 TTR, W 25 45, test 60ma and MA, PP LOD"
    },
    {
      "barNumber": "65",
      "description": "BO, 3 CC BLB, but C only slightly above MA, need 1 more bar for AIL. might\nget stuck in 59 FF TTR"
    },
    {
      "barNumber": "66",
      "description": "L1 at MA, but PP 2LSU after SX and FF, PP BB"
    },
    {
      "barNumber": "67",
      "description": "I had to leave early today so the chart does not include the final bars"
    },
    {
      "barNumber": "81",
      "description": "End of Day"
    }
  ],
  "16": [
    {
      "barNumber": "1",
      "description": "FOMC announcement at 11 am PST today. Day traders should exit positions before\nthe report and wait until at least 10 minutes after the report before trading\nagain to allow for a trend to begin.\">FOMCD. SGU. YBX. F BO HOY, FF Y TR, DT\nMonday's H, PH, room to MA and 73 bottom of TR, ET 44 64 so HH MTR, but tail,\nHPWS2"
    },
    {
      "barNumber": "2",
      "description": "BBRB, CCBRB, but tail, middle of TR, at MA, not good STC, HPW"
    },
    {
      "barNumber": "3",
      "description": "SX at MA, PL, but small bar after big BRB, middle of TR, GXL MGB, HPW"
    },
    {
      "barNumber": "4",
      "description": "weak EB, but PL, should test 1 L for SBL, should test HOY. BL need BBLBC if\nswing up"
    },
    {
      "barNumber": "6",
      "description": "LH DT 1, F BO HOY 2ES, but 4 CC BLB, TR, LOM, BB, HPW. still AIS 2, bu4 4 BLB,\nBOM"
    },
    {
      "barNumber": "7",
      "description": "H1, ATH MGA, but BRB, top of TR, LRP"
    },
    {
      "barNumber": "8",
      "description": "BBLBC, but just below HOD and top of TR. BL want BO and MMU to ATH, BR want DT"
    },
    {
      "barNumber": "9",
      "description": "BBRB, DT 1, PH, but SPBL, TR, better to wait for breakout or 2nd signal. Low\nprobability, bad for stop entries.\">BBBR, NS. BL want new HOD and MMU to ATH, BR\nwant BO below 2 NL of DT and MMD to 60ma"
    },
    {
      "barNumber": "10",
      "description": "MDT, PH, but 6 BTTR, NS. still SPBL, just above MA, but AIBLE"
    },
    {
      "barNumber": "11",
      "description": "H1, SPBL, but top of TTR 6 and TR Y 45, NS, HPW"
    },
    {
      "barNumber": "12",
      "description": "BO, C above 1, PS MG up to ATH, but need FT"
    },
    {
      "barNumber": "13",
      "description": "BLB so FT, PS MMU, but tail and bars not big so weaker BO. still BTC, but\nAIBLE4"
    },
    {
      "barNumber": "14",
      "description": "F BO, AIBLE4, but tail, SBU 12, HPWS2"
    },
    {
      "barNumber": "15",
      "description": "II so BOM, PH, F BO 1, F BO DT 1 9. H1, but II late in BLT is ofter FF"
    },
    {
      "barNumber": "16",
      "description": "BRB, but not big so BL not pannicking out."
    },
    {
      "barNumber": "17",
      "description": "H1, but tail, HPWB2, Weak REVD, stop above 15 ii"
    },
    {
      "barNumber": "18",
      "description": "BO but tail, C at 8 C and not below so still BDGU and PS WBLF 14 16. TR PA"
    },
    {
      "barNumber": "19",
      "description": "WBLF but 6 BBRMC, BUDC, TR, better to wait for breakout or 2nd signal. Low\nprobability, bad for stop entries.\">BBBR, MRVU, NS, TR likely"
    },
    {
      "barNumber": "20",
      "description": "DT 13, but SBU 19, PP LOM, HPW"
    },
    {
      "barNumber": "22",
      "description": "H2 at MA, AIL 12, ATH and GX H MGA, but TR, better to wait for breakout or\n2nd signal. Low probability, bad for stop entries.\">BBBR, top of TTR 13, NS,\nHPW, LOM"
    },
    {
      "barNumber": "24",
      "description": "CCBLB, AIL, ATH MGA, but top of TTR 13, NS"
    },
    {
      "barNumber": "25",
      "description": "CCBLBC, PS MM. BR want W 1 13, but PP need MDT after 24 25. AIBLE4"
    },
    {
      "barNumber": "26",
      "description": "W 1 13, PH, AIBLE4 but only BRD, SBU 24 25, HPWS2"
    },
    {
      "barNumber": "29",
      "description": "W 1 13, L2 26, PH, but 4 DD, LRP. AIBLE. HPWS2, PS TTR. remember, FOMC 11\nAMPST. I will resume talking around 10:45 AMPST"
    },
    {
      "barNumber": "32",
      "description": "still on 29 W and L2 S, but TTR, HPW"
    },
    {
      "barNumber": "33",
      "description": "BRBC, still on 29 S, stop above 29, but not yet STC, still above MA, still\nAIL. WBLF 27 30, but TTR, BB2. HPW"
    },
    {
      "barNumber": "35",
      "description": "SBD, C below MA, AIS, 8 BBRMC, should test HOY, but tail,TR likely"
    },
    {
      "barNumber": "36",
      "description": "HL in BL CH, AIBRE4, but 9 BBRMC, BB2, MRV"
    },
    {
      "barNumber": "39",
      "description": "MDB, but 4 BB, just below MA, PS SA, HPWB2"
    },
    {
      "barNumber": "40",
      "description": "OO, AIS, but bottom of TR 22 and test HOY. BR want MMD to GXL and 60ma"
    },
    {
      "barNumber": "41",
      "description": "F OO, test HOY. LL DB 22, DB 11, PW 30 36, AIBRE, BB2, or NWSS"
    },
    {
      "barNumber": "42",
      "description": "SBU, PP 2LSU after PW and strong BSB, but PP TR after tight BR CH"
    },
    {
      "barNumber": "43",
      "description": "DT 40, but SBU 41 42, PP 2LSU, SS2, H1 but BRB, middle of TR, PS SA, BB2"
    },
    {
      "barNumber": "44",
      "description": "SBD, but PP 2LSU after 41 42, PP TR into FOMC"
    },
    {
      "barNumber": "45",
      "description": "HL, but SBD 44, NS, TR likely into FOMC"
    },
    {
      "barNumber": "48",
      "description": "TRI 41 44, DB PB 42, AIL, but FOMC in 30 min and BTW"
    },
    {
      "barNumber": "55",
      "description": "FOMC announcement. Big OD, but DD at apex of TTR 36 in middle of day's range,\nstill in BOM, HPW"
    },
    {
      "barNumber": "56",
      "description": "CC BRB, PP AIS, but tail, C above 55 L, PW WBLF 22 41, HPW"
    },
    {
      "barNumber": "57",
      "description": "WBLF 22 41, AIBRE4, but TR, better to wait for breakout or 2nd signal. Low\nprobability, bad for stop entries.\">BBBR, AIL, 60ma and GXL MGB"
    },
    {
      "barNumber": "60",
      "description": "L1, GX L MGB, but tail, after BBLBC, HPWS2. WBLF 22 41, but bad EB 60, just\nbelow MA, HPWB2"
    },
    {
      "barNumber": "61",
      "description": "SBU, C above MA, becoming AIL"
    },
    {
      "barNumber": "62",
      "description": "CC BBLBC, GXH and ATH MGA"
    },
    {
      "barNumber": "63",
      "description": "H1, but BRB so PS SA, NWSS if B. PS SA since DBTCBL 62"
    },
    {
      "barNumber": "64",
      "description": "COH, should make new ATH and GXH, but BRB 63 so might get PB 1st"
    },
    {
      "barNumber": "65",
      "description": "MDT 62, AIBLE, but GX H and ATH MGA and should get there today, HPWS2"
    },
    {
      "barNumber": "66",
      "description": "H1, MGA, but PS PW 62 64. MDT 63 65, but TC, BRD 65, MGA, MRV, SS2, PS BB 66\nBLB"
    },
    {
      "barNumber": "67",
      "description": "H1, MGA, but BRB, HPW, or NWSS"
    },
    {
      "barNumber": "81",
      "description": "End of Day"
    }
  ],
  "18": [
    {
      "barNumber": "1",
      "description": "LDW. F BO HOY, ATH, PH but middle of Y TR, tail. Y had small range so PS OD.\nTesla enters S&P on Monday so expect huge buying in Tesla just befor 1 pm, and\nit can affect ES. also, qusruple witching so PS big move into end of day"
    },
    {
      "barNumber": "2",
      "description": "CCBRB, AIS, but tails"
    },
    {
      "barNumber": "3",
      "description": "BBRBC, STC, PP will go OD. GXL and 60ma also MGB"
    },
    {
      "barNumber": "6",
      "description": "L1, OD, but BLB, just above 60ma, PP BB, HPW S2. Y was small range so PP MMD\nbased on Y range. BL want REVU to above HOY for OU after OD."
    },
    {
      "barNumber": "8",
      "description": "MDB, F BO LOY and 60ma, PL, AIBRE, but 8 BBRMC, PP MRV, TR, better to wait for\nbreakout or 2nd signal. Low probability, bad for stop entries.\">BBBR"
    },
    {
      "barNumber": "9",
      "description": "DTBF 6, AIS, but at LOY and 60ma, tail, MDB 8 8, PP BB, still on 8 B for PL,\nPP BB"
    },
    {
      "barNumber": "11",
      "description": "C below MP, AIBRS, but bottom of TTR, PS W 5 7, at 60ma, tail, PS LOM, HPWS2"
    },
    {
      "barNumber": "12",
      "description": "W 5 7, but BRB, AIS, HPWB2. tail, at 60ma, not good STC. HPW, PS BB"
    },
    {
      "barNumber": "14",
      "description": "MW 7 12, PL, 60ma, F BO LOY 2EB, but BLD, SPBR, 6 BBRMC, HPWB2"
    },
    {
      "barNumber": "17",
      "description": "H2 14, W 7 12 14, SX, 60ma, PL, AIBRE, but SPBR so PS MRV"
    },
    {
      "barNumber": "18",
      "description": "EB has BLB but tail, just below MA, still AIS, but still on 17 B for PL,\nHPWB2. L2 15 at MA but CC BLB, PP BB, HPWS2"
    },
    {
      "barNumber": "20",
      "description": "SPBL, H1, but BRD just below MA, AIS, PS SA, HPWB2. BOM, HPW. BR need BRB for\nSSB, BL need BO above MA. LDW, OOW MGB"
    },
    {
      "barNumber": "21",
      "description": "SBD, OOW MGB, PS MG, but need FT. BL want F BO but need BLBC 22"
    },
    {
      "barNumber": "22",
      "description": "BBLBC, PS BRTP 21, PL, AIBRE, but OOW MGB, lots of RV today, HPWB2"
    },
    {
      "barNumber": "24",
      "description": "L1, still AIS, but strong enough REVU so PP 2LSU so PP BB. COL and AIS so\nHPWB2. 2LSU likely, far below MA, still on 22 B, HPWS2"
    },
    {
      "barNumber": "25",
      "description": "HL, PS SPBL, but only DD, NS"
    },
    {
      "barNumber": "26",
      "description": "L2, AIS, but far below MA after strong REVU, still PP 2LSU so PP BB, HPWS2"
    },
    {
      "barNumber": "27",
      "description": "MDB, HL, PL, might test 21 SX H, but PP SA at MA, BL need BO above MA if this\nis start of BLT"
    },
    {
      "barNumber": "29",
      "description": "3 CC BLB, 2 closed near H of bar, but at MA, 20GBS, STC BR will S. still AIS,\nbut 3 BLB, BL need BO above MA for AIL. BR need BR SSB for L2 at MA"
    },
    {
      "barNumber": "30",
      "description": "L2, AIS, 20GBS, but still on 22 B, stop PP below 27, PP MRV, but PS TR. 22 is\ngood candidtate for either LOD or bottom of TR. BE need BRB 31, esp BBRBC. BL\nwant BLBC for H1. otherwise TR"
    },
    {
      "barNumber": "31",
      "description": "OU but at MA and PS W 24 29. BL need BO above MA, else WBRF and PS test 27 L"
    },
    {
      "barNumber": "32",
      "description": "WBRF at MA, but TC, SPBL, HPWS2. AIBLE or AIBLE4, or stop below 27. BL want\nBO abovw W and MMU to LOY"
    },
    {
      "barNumber": "33",
      "description": "OU, C above MA and 32 W, AIL, PS MMU to LOY"
    },
    {
      "barNumber": "36",
      "description": "ii, but PS SA for L2. should reach LOY since exactly MMU from 27 L and 32 top\nof W, but might go SW 1st. BR want REVD to 27 L and TRD. weak rally so LRP H1,\nHPW or NWSS"
    },
    {
      "barNumber": "38",
      "description": "SBU but at MGN of LOY and 6 H at top of BRCH, PP PTR soon, PP EG instead of\nMG"
    },
    {
      "barNumber": "39",
      "description": "F BO LOY and 6 start of BRCH, AIBLE, PS EG, but TC so PP MRV to 38 BX L and\nMA"
    },
    {
      "barNumber": "40",
      "description": "SBD, TR likely, not yet STC"
    },
    {
      "barNumber": "41",
      "description": "3 CC BBRBC, but still above MA. SBD. BR want test 27 start of CH, but PP BB\naround MA, 2LSD likely after SBD 39 40 41. AIL, but BB2, PP SA"
    },
    {
      "barNumber": "42",
      "description": "DB 37 at MA, but BUDC, BB2"
    },
    {
      "barNumber": "44",
      "description": "50P, but 6 BRB, PP AIS, but TR likely. AIBRE, but PP SA at around 50P for LH\nand TR"
    },
    {
      "barNumber": "45",
      "description": "L1 but BLB, PP TR here or soon PP BB, SS2"
    },
    {
      "barNumber": "47",
      "description": "SBD, but PS DB 27, TR likely so LP STC. PP EG instead of MG"
    },
    {
      "barNumber": "48",
      "description": "PW 41 43, HL DB 27, PP EG 47, AIBRE, but 9 BBRMC, MRVU, TR likely, HPWB2 or\nNWSS"
    },
    {
      "barNumber": "49",
      "description": "another BBRBC, PP EG, DB 27, PP bounce soon. AIBRE. PW but 11 BBRC, BB2"
    },
    {
      "barNumber": "51",
      "description": "CC SX, CC BBRBC, still STC but PP BRTR, PP EG, AIBRE, HPWS2 near MA. 12\nBBRMC, BB2"
    },
    {
      "barNumber": "52",
      "description": "L1, AIS, but PP bottom of TR, PP BB, SS2. MGA 45 L for LBL. also, 50P and MA"
    },
    {
      "barNumber": "53",
      "description": "H2, bottom of TR here or soon, should test MA and 45 L, but TBRCH, NWSS"
    },
    {
      "barNumber": "54",
      "description": "L2 but BLB, TR more likely than BRT, LPS, PS FF"
    },
    {
      "barNumber": "56",
      "description": "55 BBRBL, HL DB 22. PS FF 54 L2, PP BRTR. AIBRE. might get 2LSU after SX.\nTail, TBRCH, PP MRV. L1, OOW MGB, but PP bottom of TR here or soon, HPWS2"
    },
    {
      "barNumber": "58",
      "description": "LLMTR, FBO LOD, W 50 55, PL, TR likely soon, 55 SX H MGA, AIBRE, but BRB, LRP"
    },
    {
      "barNumber": "59",
      "description": "L1 but DD, SX 55, PP BB for 2LSU"
    },
    {
      "barNumber": "60",
      "description": "H2 but 3 DD just below MA, OOD MGB, HPW"
    },
    {
      "barNumber": "63",
      "description": "L2 at MA, AIS, OOW MGB, but TTR 56 so LRP, HPW"
    },
    {
      "barNumber": "64",
      "description": "H1, F L2, but DD at MA, HPW. OOW MGB. might stay sideways until after 12:30\nPMPST when traders start reacting to Tesla. PP huge volume in Tesla, ES, and\neverything in final seconds before 1 PMPST"
    },
    {
      "barNumber": "66",
      "description": "reversed up from test OOW, but still could be MGN for rest of day. PS TR\nsince 51 so 52 H MGA. BR want week to C on L of week to be better SSB on weekly\nchart for next week. BL want BLB on weekly chart."
    },
    {
      "barNumber": "67",
      "description": "LL MTR, test OOD, FF 51 T!, but BRD, just below MA, HPW. L1 but BLB at OOW,\nHPW"
    }
  ],
  "21": [
    {
      "barNumber": "1",
      "description": "BGD. PS selloff into EOY since Y is at the H and most bars do not COH so\nyearly chart migth not COH. BBLBC, PL, but TR, better to wait for breakout or\n2nd signal. Low probability, bad for stop entries.\">BBBR."
    },
    {
      "barNumber": "2",
      "description": "CCBLBC, AIL. PP LOD, LOY MGA, but smaller body and bigger tail so not strong\nrally yet. AIBLE4. L1, OOM MGB,. CC BBRB far below MA so weak L1 and PP BB, SS2"
    },
    {
      "barNumber": "3",
      "description": "BBRBC, PH, but far below MA and after CCBBLB, PP BB, SS2"
    },
    {
      "barNumber": "4",
      "description": "CC BBRBC, but still above LOD, BUDC, but stll on 1 B. H2, but CC BRB, PP SA.\nPP TRO"
    },
    {
      "barNumber": "5",
      "description": "L1, OOM MGB, but BLB far below MA, PP TRO, HPWS2"
    },
    {
      "barNumber": "6",
      "description": "OO, Nov 9 H and LLW MGB"
    },
    {
      "barNumber": "7",
      "description": "SBD, GXL MGB but PP too far to reach. also, test LLW and Nov 9 H, far below\nMA, PP bounce soon"
    },
    {
      "barNumber": "8",
      "description": "SX, test of Nov 9 H and LLW, H2 4, H2 1, AIBRE4, PL, but BRD, HPWB2"
    },
    {
      "barNumber": "9",
      "description": "L2, but tails 7 8 9, SX at SP, PS BB, HPWS2. BR want SCD, but more likely\nexhaustion and TR soon"
    },
    {
      "barNumber": "11",
      "description": "PW 1 8, PW 4 8, SX, at Dec 11 bottom of TR, PL, AIBRE"
    },
    {
      "barNumber": "12",
      "description": "L1 but DD, PL 11, but DBL might exit around BE at H of 11 and then B again\nabove BLBC"
    },
    {
      "barNumber": "13",
      "description": "H2 11, PL, but 2 DD, PS TTR ,HPWB2"
    },
    {
      "barNumber": "14",
      "description": "BLB, PL 11, but small body and big tail, TTR 8, LRP, PS LOM"
    },
    {
      "barNumber": "15",
      "description": "L2, AIS, GXL MGB, but 3 BLB, far below MA, HPWS2, PS LOM"
    },
    {
      "barNumber": "17",
      "description": "H1, SPBL, but TTR, LOM, tail. BL want BO and MMU. BR want L3 W, but need to\nbe closer to MA"
    },
    {
      "barNumber": "18",
      "description": "BO, PP AIL, SPBL, OOM and MA MGA, but tail, C below 15, not quite BTC, PS TR\ninstead of BLT"
    },
    {
      "barNumber": "19",
      "description": "SBU, test OOM and MA, AIL, but need FT and BO above MA"
    },
    {
      "barNumber": "20",
      "description": "BL FT, AIL, but 20GBS, PS BLT. AIBLE4, BR need BBRC. PP 2LSU after SBU. OOD\nMGA"
    },
    {
      "barNumber": "21",
      "description": "OD at MA and OOM, AIBLE, but 5 BLB, PS TTR around OOM, HPWS2"
    },
    {
      "barNumber": "22",
      "description": "OD so PB and H1, but BRB, PS SA, HPWB2"
    },
    {
      "barNumber": "23",
      "description": "C above 22 but PP SA 22 and PB soon. most bars have tals so hesitation,\nincreases chance of 1 - 2 hour TR at some point"
    },
    {
      "barNumber": "24",
      "description": "H1 but BRB, PS W 21 23, PS SA, BB2"
    },
    {
      "barNumber": "25",
      "description": "MW 21 23, but BLD, TC, HPWS2. AIBLE4. might soon enter TTR"
    },
    {
      "barNumber": "26",
      "description": "BLB but tail, PP MRVD soon to maybe 22 start of CH and then TR. still AIL but\nnot strong BTC since tails, BR bars, BDUC"
    },
    {
      "barNumber": "28",
      "description": "Still BTC, 6 SXH and HOD and LOY MGA but PP OOD and OOM MG and TR soon.\nAIBLE4"
    },
    {
      "barNumber": "29",
      "description": "BX, BRB, AIBLE, but 8 BBLMC, HPWS2, PS BB and more SPBL"
    },
    {
      "barNumber": "30",
      "description": "H1, SPBL, 6 SX H MGA, but 8 BBLMC is BX so PP 2LSD soon for MRV"
    },
    {
      "barNumber": "31",
      "description": "bigger BLBC so might attract PTG soon. just below MG 6 SXH. other MGA HOD and\nLOY, but PP TR soon"
    },
    {
      "barNumber": "32",
      "description": "H1, SPBL, but BRB, PS SA for MW 29 31, HPWB2, PP TR soon"
    },
    {
      "barNumber": "34",
      "description": "IOI, H2 32, 6H and HOD MGA,but DD, TTR, PP MBO"
    },
    {
      "barNumber": "35",
      "description": "BO, HOD MGA, but BBLBL"
    },
    {
      "barNumber": "36",
      "description": "CC BLB, BL want MG, but more likely EG. LOY and 60ma MGA, SBU, but PP MRV and\nTR soon"
    },
    {
      "barNumber": "37",
      "description": "BX, PP PB soon, 35 BXL MGB, but PP only MRV. AIBLE4"
    },
    {
      "barNumber": "38",
      "description": "PP EG and PB soon, AIBLE4. still SPBL, LOY MGA, but just below LOY, so might\nget PB here"
    },
    {
      "barNumber": "39",
      "description": "OD, AIBLE, might test 35 BXL, but SPBL, LOY and 60ma MGA, HPWS2. DBTCBL 38 so\nPS PB soon"
    },
    {
      "barNumber": "40",
      "description": "BO, SPBL, still BTC, LOY and 60ma MGA, 2LU likely aftr 35 36 SBU, but BX, PP\nexhaustion and PTG soon for MRVD or TTR, often get PB around"
    },
    {
      "barNumber": "42",
      "description": "BX, PW 31 38, but SPBL, TC, HPWS2, PP only small selloffs for test of day, BL\nwill B small PB . H1, PS SA and start of TTR, HPWB2 or NWSS"
    },
    {
      "barNumber": "44",
      "description": "IOI, H1, MMU from LOD to OOD TGTA, but just below 60ma, BX, PP MBO and TTR\nsoon. IOI so L2, but SPBL, MRV, LPS wiht stop"
    },
    {
      "barNumber": "46",
      "description": "MW 41 43, AIBLE, PP only MRVD since SPBL, HPWS2. should get PB to MA within\nan hour so OK S, esp if WSS"
    },
    {
      "barNumber": "48",
      "description": "OU, but MMTA, 60ma, PP small SD to MA soon, but then PP new HOD, PP not much\nprofit potential for bears for rest of day. better to only B"
    },
    {
      "barNumber": "52",
      "description": "F BO 60MA, BX 51, AIBLE, but PP only MRV SD to MA. SPBL, and every PB has\nlasted only 1 - 2 bars. TR, better to wait for breakout or 2nd signal. Low\nprobability, bad for stop entries.\">BBBR, too far below H to S. might get LOS,\nbut HPWS2 or wait to B PB"
    },
    {
      "barNumber": "53",
      "description": "H1, SPBL, but 3 BTTR, PP PB to MA before 11:30, so PP MBO, PS SA. better to\nwait for PB to MA before buying again"
    },
    {
      "barNumber": "54",
      "description": "MDT, MA MGB, but SPBL, LRP, PP MRV to MA"
    },
    {
      "barNumber": "56",
      "description": "H1, but 3 CC BRB, MA MGB, PP SA. should get touch of MA, BB2"
    },
    {
      "barNumber": "57",
      "description": "OU, strong SPBL, but PP TTR, should touch EMA before EOD and usually before\nnoon"
    },
    {
      "barNumber": "60",
      "description": "COH, but not as good BTC since PS TR since 50 and MA MGB. LS LOM, HPW to B PB\ninstead of at the H"
    },
    {
      "barNumber": "62",
      "description": "HHMTR, COL, AIBLE, but 6 BWBRB, SPBL, PP MRV, still SPBL, PP BB around MA"
    },
    {
      "barNumber": "63",
      "description": "H1, SPBL, but CC BRB, PS SA for PB to MA, HPWB2"
    },
    {
      "barNumber": "64",
      "description": "HH, L2, MA MGB, but 3 DD, strong BLT, MRV"
    },
    {
      "barNumber": "67",
      "description": "H1, MDB 63, but BL want COH. PS TR since 42 so might get test 20"
    },
    {
      "barNumber": "81",
      "description": "End of Day"
    }
  ],
  "23": [
    {
      "barNumber": "1",
      "description": "2 days ago in GX session, there was 6-bar ledge on 15-min chart at 3695 so\nshould go above that today. GU but tail,. should get above 3700 BRN and Y GXH. Y\nhad ledge at GXH so 80% chance will go above it today. Tail, HPW"
    },
    {
      "barNumber": "2",
      "description": "CC BLB after GU, AIL, but tail, HPW"
    },
    {
      "barNumber": "3",
      "description": "F BO HOY, BX 1 2, PH, but tail, AIL, 3700 BRN and ATH MGA, SS2"
    },
    {
      "barNumber": "4",
      "description": "H1, AIL, MGA, but TR, better to wait for breakout or 2nd signal. Low\nprobability, bad for stop entries.\">BBBR, all 4 bars have tails, PS TRO, NS"
    },
    {
      "barNumber": "5",
      "description": "F BO HOY 2ES, L2 top, but 4 BLB, MGA, HPWS2, PP BB, TRO so far"
    },
    {
      "barNumber": "6",
      "description": "H1 but tail, top of TRO, HPW. 5 of 1st 6 bars have BL bodies but all 6 bars\nhave tails and OL each other. AIL, but TRO, not good BTC. LOM"
    },
    {
      "barNumber": "8",
      "description": "OD, TW 2 5, but TRO, LOM, HPW. BR want OD and BO below 60ma. 60ma was RS all\nday Y so PP SP today"
    },
    {
      "barNumber": "9",
      "description": "H2, but DD, top of LOM, 60ma MGB, HPWB2. might have to test 60ma since it was\ntested many times Y from below"
    },
    {
      "barNumber": "10",
      "description": "BBRB, 60ma MGB, but bottom of LOM so PS BTC. HPW"
    },
    {
      "barNumber": "11",
      "description": "L1 in PS early BRT, but DD at bottom of TR, LOM, BPWS2. H3 so W but DD after\nBBRB, HPWB2"
    },
    {
      "barNumber": "13",
      "description": "HL DB 4 10 at MA, PL, COH, C above 12 so BO, but need 1 more bar for BTC. BR\nwant BO below LOD and test 60ma. AIL, but still TRO"
    },
    {
      "barNumber": "14",
      "description": "LH, 60ma MGB, PS ODD, but 4 BWBRB, LOM, PP BB, HPWS2. smaller body, tail,\nweak FT 13, not strong BTC, but AIL, ATH MGA. still TRO"
    },
    {
      "barNumber": "15",
      "description": "BRB, PB, but still PS SPBL. BR want 2 bar PB since that would increase chance\nof LH and REVD to 60ma"
    },
    {
      "barNumber": "16",
      "description": "H1, SPBL 11, but bad FT 13, LOM, PS SA for BO below 4 10 DB and test of 60ma"
    },
    {
      "barNumber": "17",
      "description": "OD, but tails, still AIL, all 17 bars above MA. BOM but sligthtly more\nbullish. LOM, BOM, HPW"
    },
    {
      "barNumber": "19",
      "description": "H1, early SPBL, COH, becoming BTC since 3rd bar with COH 13 16. HPW for one\nmore bar. BR want LH and BR BO. still in BOM, but above MA, AIL, slightly more\nbullish"
    },
    {
      "barNumber": "20",
      "description": "F BO DT so W, but PS BTC since BL hope rally is early SPBL. only 1t BRB,\nHPWS2"
    },
    {
      "barNumber": "21",
      "description": "failed to C above 20 so still no BO. AIL, but not reliable BTC, still BOM."
    },
    {
      "barNumber": "23",
      "description": "LH MTR, CC BRB, COL, AIBLE, but 21 was SSB and had BLB, still SPBL, HPWS2"
    },
    {
      "barNumber": "27",
      "description": "20GBB, BL IB, AIL, but 7 BBRMC, HPWB2"
    },
    {
      "barNumber": "28",
      "description": "BO, COH, AIL, but still in TR, BOM. BL need FT for BTC. BR want F BO for TRI\n5 21"
    },
    {
      "barNumber": "31",
      "description": "LH DT MTR, W 14 21, but 5 BWBRB, HPWS2"
    },
    {
      "barNumber": "32",
      "description": "H1, SPBL, but BRB, top of TR, PS SA, HPW"
    },
    {
      "barNumber": "34",
      "description": "F BO HOD, L2 31, W 14 21, PH, AIBLE, but TC, PP MRV, 3700 BRN MGA"
    },
    {
      "barNumber": "36",
      "description": "H1, DB 32, but 3 BRB, PW 28 31, PP 2LSD, BPWB2. still on S 34, but LP, HPWS2."
    },
    {
      "barNumber": "38",
      "description": "DT 34, F BO HOD, AIBLE, PH, but NS, PP MRV, still SPBL, 3700 and ATH MGA"
    },
    {
      "barNumber": "42",
      "description": "41M, iii, L4, CC L2 14 21 then BO and 34 39, but tail, HPWS2. NS, PS swing\ndown for an hour. H1 SPBL, MGA. iii late in BLT is PS FF"
    },
    {
      "barNumber": "46",
      "description": "CCCT, L2 then W, AIBLE, PH, 2BR, AIBLE"
    },
    {
      "barNumber": "47",
      "description": "H1, SPBL, but after CCCT, 3700 BRN, HPWB2"
    },
    {
      "barNumber": "48",
      "description": "H1, AIL, SPBL, but still on CCCT S so LRP"
    },
    {
      "barNumber": "53",
      "description": "top of CH, weak rally, PP will go SD for an hour, AIBLE, but SPBL, LP"
    },
    {
      "barNumber": "56",
      "description": "H2, 9t, AIBRE, but PP more SD, HPWB2"
    },
    {
      "barNumber": "60",
      "description": "H2, bottom of UTR in TTRD, test of 32 L PB From 28 BO, but TC, HPWB2. PP\nbottom of UTR soon. might test MP of day and less likely LOD. PP TR for rest of\nday"
    },
    {
      "barNumber": "63",
      "description": "L2 at MA, PP AIS 59, but PP near bottom of UTR, HPWS2. BL want at least small\nDB to B. Might have seen both HOD and LOD since TR likely"
    },
    {
      "barNumber": "65",
      "description": "BO, BR want MMD to LOD, but BL want F BO"
    },
    {
      "barNumber": "66",
      "description": "BRB ao FT, increaseed chance of test of LOD, but tail, middle of TTRD, PP not\nmuch more down."
    },
    {
      "barNumber": "67",
      "description": "H2 60, W 47 60, C above MP, AIBRE, but TC, tail, LRP B, NS"
    },
    {
      "barNumber": "81",
      "description": "End of Day"
    }
  ],
  "24": [
    {
      "barNumber": "1",
      "description": "Y SX. LDW. 10:15 AMPST close so rarely more than 1 swing. GU, BBLB, but BUDC,\n2 flat MA near one another, PS TRO, PS STC, HPW. 77 SX H MGA, LOY MGB"
    },
    {
      "barNumber": "3",
      "description": "MDT but BLB, TTR, HPW"
    },
    {
      "barNumber": "5",
      "description": "DB 1 at MA, PL, but TRO, HPWB2"
    },
    {
      "barNumber": "7",
      "description": "small TRI 1 5 7, still on 5 B, but still TRO, HPW"
    },
    {
      "barNumber": "9",
      "description": "DT 2, but BLB, TTR, still on 5 B, HPWS2"
    },
    {
      "barNumber": "10",
      "description": "ii, AIL, 6 BBLMC, TGTA 77 SXH, but small bars, AIBLE4"
    },
    {
      "barNumber": "14",
      "description": "SBD, 4t below 13 so OK to exit, or below BRB 14, but still SPBL, PS BRTP, BR\nneed more BRB to S"
    },
    {
      "barNumber": "15",
      "description": "CC BRB so FT. still AIL, but PP need H2 to B again. BRB need more and bigger\nBRB since 13 is BLB and weak SSB for L2 3"
    },
    {
      "barNumber": "16",
      "description": "DB 8 BXL, 2 flag MA, BUDC, HPW"
    },
    {
      "barNumber": "19",
      "description": "HL DB 1, PL, AIBRE, PP still AIL, but 7 BBRMC, SBD, BUDC, HPWB2, 2 flat MA\nnear one another so TR PA"
    },
    {
      "barNumber": "20",
      "description": "CCBLBC, SBU, but BUDC, PP SA around 2 H and 13 L"
    },
    {
      "barNumber": "21",
      "description": "HST BRF, but 3 BLBC, HPWS2, PS BB, still TRO"
    },
    {
      "barNumber": "22",
      "description": "BBRBC, but 2LSU likely after SBU so PP BTC. still TRO"
    },
    {
      "barNumber": "24",
      "description": "BO below 5 19 DB, PS MMD, but need FT for STC"
    },
    {
      "barNumber": "25",
      "description": "F BO LOD, F BO DB 5 19 so W, H2 19 in TRD, LBLM, COH, PL, but TR, better to\nwait for breakout or 2nd signal. Low probability, bad for stop entries.\">BBBR,\nNS, HPWB2"
    },
    {
      "barNumber": "26",
      "description": "L1 in BR CH, AIBLE, but PS BB for PB from 25"
    },
    {
      "barNumber": "29",
      "description": "W 19 25, LBLM all day, AIBRE, PL, but TC, LRP, HPWB2"
    },
    {
      "barNumber": "30",
      "description": "L1, GXL and LOY MGB, but DD, W, HPWS2, PS BB. W 19 25, PL, but TC, HPWB2.\nmore of LOM, even though BRCH"
    },
    {
      "barNumber": "31",
      "description": "BBRBL, PS BTC, ESP since LBLM, but GXL MGB"
    },
    {
      "barNumber": "32",
      "description": "W 19 25 28, PL, 25 H MGA, most days closed near OOD or MP so OOD MGA, but TC,\nGXL MGB, TR, better to wait for breakout or 2nd signal. Low probability, bad for\nstop entries.\">BBBR 32"
    },
    {
      "barNumber": "33",
      "description": "CCBBLB, SBU after W so PP 2LSU, but LBR S OOD and 31 H"
    },
    {
      "barNumber": "35",
      "description": "HL, should get 2LSU after SX and W, but tail, just below MA, risk PP bigger\nthan reward"
    },
    {
      "barNumber": "36",
      "description": "SBU, AIL, PS MG 33 H, but 2LU and middle of TRD so not strong BTC"
    },
    {
      "barNumber": "38",
      "description": "2LT, AIBLE, but tail, HOD MGA, PS BB, HPWS2"
    },
    {
      "barNumber": "39",
      "description": "H1, HOD GXH and Y 77 H MG, but NS since eaerly close and 2 pt risk"
    },
    {
      "barNumber": "81",
      "description": "End of Day"
    }
  ],
  "28": [
    {
      "barNumber": "1",
      "description": "BGU to new ATH. triggered weekly and daily H1, but top of 3 week TR. BBRB but\ntail. PH but HPWS2"
    },
    {
      "barNumber": "2",
      "description": "CC BRB, PS T1BD, but BRD, and 1 has big tail, PP TRO. H1, PL, but far above\nEMA and 2 BRB, HPWB2. PS LOM"
    },
    {
      "barNumber": "3",
      "description": "BLB but tail. L1, MA MGB, but BLB, TRO, PS LOM, HPWS2. 2 is H1, GXH MGA, but\nBRD."
    },
    {
      "barNumber": "5",
      "description": "MDT, but 5 BBLMC, PP BB, GXH MGA, SS2. TTR, TRO"
    },
    {
      "barNumber": "6",
      "description": "II, TTR, BOM. 6 BBLMC so PP BB but CC BRB, HPW"
    },
    {
      "barNumber": "7",
      "description": "iii, BOM, but 7 BBLMC, HPWS2"
    },
    {
      "barNumber": "8",
      "description": "F BO below III, GXH MGA, but still TTR, HPWB2"
    },
    {
      "barNumber": "10",
      "description": "L2 7, F BO HOY 2es, F BO above III after F BO below, PH, but more likely PB\nfrom 9 and BB, PP AIL, GXH MGA"
    },
    {
      "barNumber": "11",
      "description": "SBU, should go above GXH, PS start of BLT"
    },
    {
      "barNumber": "12",
      "description": "BLB so BL FT, BTC, PS SPBL, but tail, earlier TTR"
    },
    {
      "barNumber": "13",
      "description": "2nd FT bar, but tail. BR want FF 10 TTR and BL want continued SPBL"
    },
    {
      "barNumber": "14",
      "description": "H1, 4 CC BLB, but tails, small body, NS, NWSS, might get PB soon. AIBLE4. PS\nSA, but SPBL, better to not S, despite PS FF TTR 10"
    },
    {
      "barNumber": "15",
      "description": "FF 10 TTR, AIBLE4, but 5 CC BLB, PP BB, SS2"
    },
    {
      "barNumber": "16",
      "description": "BRBC, AIBLE, PS HOD and FF 10 TTR, PS PW 9 15, but PP BB and BTC for 2LSU\nafter 10 SBU. H1 but BRB, PS SA, HPWB2"
    },
    {
      "barNumber": "18",
      "description": "BX, FF 10, IOI, BRB, AIBLE, PH, but tail, BLB 15, PS TTR, HPWS2, PS H2"
    },
    {
      "barNumber": "19",
      "description": "CC BRB, COL, PS FF 10 MGB. BL want BLB for H!, but weak rally, PP SA 15 and\nthen W 1 15, PP not going to be big BLT"
    },
    {
      "barNumber": "21",
      "description": "BRB, EPBD, FF 10 TTR. BL want REVU from BT 9 H"
    },
    {
      "barNumber": "22",
      "description": "WBLF 16 19, BT 9, AIL, but 6 BBRMC, EPD, FF MGB, PS SA, BB2. might enter TR\nsoon since not clearly bullish or bearish"
    },
    {
      "barNumber": "26",
      "description": "WBLF, BT, MDB, COH, but TTR, small bars, FF MGA, HPW. small bars in TTR so PP\nnot swing up"
    },
    {
      "barNumber": "28",
      "description": "LH, 5T, W 23 25, 10 FF MGB, but 3 BLB, MA SP just below, TTR, LOM, HPW"
    },
    {
      "barNumber": "30",
      "description": "F BL MDB, BT 9, but CC BRB, room to MA, BB2"
    },
    {
      "barNumber": "34",
      "description": "DTBF 28, MA and OOD MGB, but TTR 22 HPW. LOM"
    },
    {
      "barNumber": "37",
      "description": "L2 34, MA and OOD MGB, 99% chance will get to MA before 11 am, but AIL, PS\nSPBL. beat choice is flat since ned WSS"
    },
    {
      "barNumber": "40",
      "description": "LH MTR, MW 33 37, MA MGB, AIBLE, but AIL, SPBL, need WSS, HPW."
    },
    {
      "barNumber": "43",
      "description": "BRTP, 20GBB, DB 35, but TTR 13, LOM, PP SA and aboce 40. PP will test OOD\nbefore EOD since TRD and OOD in middle 3rd"
    },
    {
      "barNumber": "46",
      "description": "DT 40, but SPBL 30, AIL, just above MA,SS2"
    },
    {
      "barNumber": "48",
      "description": "H1 but TTR 37, near top of TR 13, NS. stilll 50% chance of test of OOD by EOD"
    },
    {
      "barNumber": "50",
      "description": "BO, SPBL, HOD MGA, but small bar, weak BTC, NS, HPW"
    },
    {
      "barNumber": "51",
      "description": "DT 15, PH, but 4 BLB, HPWS2. LBRM. BL might Baround MA. 50% chance will test\nOOD since OODM"
    },
    {
      "barNumber": "53",
      "description": "H1 at MA, SPBL, but tail, weak rally, LBRM, PP SA 15, HPW"
    },
    {
      "barNumber": "54",
      "description": "H1 at MA, SPBL, but small rally and small bars, NS, still 50% chance of REVD\nbefore EOD, maybe to OOD"
    },
    {
      "barNumber": "57",
      "description": "BO, SPBL 30, but still small bars, 50% chance of REVD to 30 L at start of BL\nCH before EOD"
    },
    {
      "barNumber": "59",
      "description": "F BO 15, PH, but 6 BLB, SPBL, tail, AIBLE4, HPWS2"
    },
    {
      "barNumber": "60",
      "description": "H1, SPBL, LBRNM, but 2 BRB, MMTA, SCBL, 30 L and OOD MGB, HPWB2, PS DBL 58\nand SA and above 58"
    },
    {
      "barNumber": "64",
      "description": "F BO 15 2ES, but SPBL, DD, HPWS2"
    },
    {
      "barNumber": "65",
      "description": "LBRM 58 H, but still SPBL, PS BB 64 for W 58 63. TCH, but PP will enter TR\nbefore EOD aftet SCBL, 11 spike, 30 CH"
    },
    {
      "barNumber": "66",
      "description": "H1 just above MA, DB 60, SPBL, but 1st time all day with 3 CC BRB, PP SA 63\nand PS SA 66, HPW B2. odds favor TR or MRVD in final hour so BR will be more\nwilling to SA 66 or 64"
    },
    {
      "barNumber": "68",
      "description": "SBD, but at EMA, BLT, still AIL"
    },
    {
      "barNumber": "69",
      "description": "H2 66 at MA, but might get TR and deeper PB to 1t below 51 H BOP for LBR, so\nLR P, NS"
    },
    {
      "barNumber": "81",
      "description": "End of Day"
    }
  ],
  "30": [
    {
      "barNumber": "1",
      "description": "PS inside day and IOI on daily chart. GU, but DD and in middle of Y TR, PS TRO\nand PS TRD"
    },
    {
      "barNumber": "2",
      "description": "H1 after Y HL MTR 78, but tail, and 1 was DD, PS LOM and TRO, HPWB2"
    },
    {
      "barNumber": "3",
      "description": "F BO of Y LTR, but 3 BLB, PP TRO, PS LOM and BB, HPW. still AIL, GXH MGA and Y\n26 top of TR MGA. PS ID, lots of room to HOY and LOY."
    },
    {
      "barNumber": "4",
      "description": "H1, AIL, but small bars, big tails, just below Y 26 H top of TR, PP TRO, HPW"
    },
    {
      "barNumber": "6",
      "description": "another BLB, MGA Y 26 H and GXH, AIL, SPBL, but lots of OL, LOM, HPWB2"
    },
    {
      "barNumber": "7",
      "description": "BO, AIL, GXH MGA, C above 6, but big tail, not strong BTC, BR want L2 3"
    },
    {
      "barNumber": "9",
      "description": "CCBRB1C, but PS DB 1 at MA"
    },
    {
      "barNumber": "10",
      "description": "BRTP, LLDB 1 at MA, PL, but TR, better to wait for breakout or 2nd signal.\nLow probability, bad for stop entries.\">BBBR, still TRO, HPWB2."
    },
    {
      "barNumber": "11",
      "description": "L1 but CC BLB, AIL, DB at MA< BB. tails 10 11 so not strong BTC"
    },
    {
      "barNumber": "13",
      "description": "LH DT 7, HLWS2, AIBLE4. still TRO"
    },
    {
      "barNumber": "14",
      "description": "BO 10 but C above 10 L. SBD, but BR need FT since PS LL DB 10, H2 2 at MA.\nstill TRO"
    },
    {
      "barNumber": "15",
      "description": "F BO, BRTP, H2 10 at MA, PL, but SBD 14, tail, LRP B, HPWB2. still TRO"
    },
    {
      "barNumber": "17",
      "description": "tested 13 L for LBL who BT 13 L and scaled in. DT PB, PH, but strong enough\nREVU so AIL so NS. BL will try to get HL for DB PB. still TRO, BOM. ok to exit\nlong below or AIBLE4."
    },
    {
      "barNumber": "18",
      "description": "H1, PL, only 1 C below MA today, but middle of TRO, NS, HPWB2"
    },
    {
      "barNumber": "19",
      "description": "L2, but tail, above MA, still on 18 H1 B, HPWS2. middle of TRO, but only 1 C\nbelow MA so slightly more bullish"
    },
    {
      "barNumber": "20",
      "description": "W 16 18., LH in BRCH 7, but BLB just above MA, HPWS2. AIBLE4 or below 18.\nmiddle of TRO"
    },
    {
      "barNumber": "23",
      "description": "IOI above MA, AIL, but TTR and apex of TRO, LRP, HPW"
    },
    {
      "barNumber": "24",
      "description": "SBD, C below MA, but need FT since still in TRO. BL BTC of BBRBC 9 and 14 and\nmight BTC here"
    },
    {
      "barNumber": "25",
      "description": "F BO, 1st HL all day, PL, AIBRE, but tail, C below MA, HPWB2. still TRO"
    },
    {
      "barNumber": "26",
      "description": "L1 after 24 SBD, 3 C below MA, but only BRD, bottom half of TRO, HPWS2"
    },
    {
      "barNumber": "29",
      "description": "HL DB 14, W 21 24, but middle of TRO, LOM, HPW. L1, BRCH< but bottom of TRO,\nHPW"
    },
    {
      "barNumber": "32",
      "description": "L2 below MA, COL, but TR, better to wait for breakout or 2nd signal. Low\nprobability, bad for stop entries.\">BBBR, too near bottom of TR so LRP, HPWS2.\nstill BOM, TRO"
    },
    {
      "barNumber": "36",
      "description": "OU, DB PB from 14 28 DB, but apex of TRO, big tail, LOM"
    },
    {
      "barNumber": "38",
      "description": "II, CC C below MA, best stop entry setup in a while, but bottom fo TTR"
    },
    {
      "barNumber": "40",
      "description": "L1, 4 CC BRB, but at bottom of TR, PP BB 14. BR want MMD to OOW and 60ma"
    },
    {
      "barNumber": "42",
      "description": "F 18BO, AIBRE, PL, but 5 CC BRB, HPWB2"
    },
    {
      "barNumber": "43",
      "description": "SBU, CC BLB, should get above BR TL and 36 H since TRD and expect BO beyond\nSR, but might need test 14 L since 5 CC BRB41 and PS MRU here"
    },
    {
      "barNumber": "44",
      "description": "3 CCBLB, 2 CCBLBC, AIL, but might test 14 L. LH in BR CH, but PP BB, SS2"
    },
    {
      "barNumber": "45",
      "description": "H1, but BRB, middle of TRD, PP SA, BB2"
    },
    {
      "barNumber": "46",
      "description": "H1, AIL, 36 H MGA, but NWSS since PS SA and might get test 14 L before 36 H.\nMDT but PP will get HL 41, SS2"
    },
    {
      "barNumber": "47",
      "description": "H1, but BBRB, HPWB2"
    },
    {
      "barNumber": "49",
      "description": "L1, BR CH, OOW MGB, but after SBD 48, but bottom of TRD, PP BB and below 41,\nHPWS2"
    },
    {
      "barNumber": "51",
      "description": "F BO 41 at bottom of BR CH, PW 45 48, OU, OO, AIBRE, but TR, better to wait\nfor breakout or 2nd signal. Low probability, bad for stop entries.\">BBBR. BR\nwant LH in BRCH, but SBU so PP 2LSU to above 44 LH"
    },
    {
      "barNumber": "54",
      "description": "LH, CC BRB, but bottom of BR CH. OO 51 still BOM, but TR, better to wait for\nbreakout or 2nd signal. Low probability, bad for stop entries.\">BBBR, and bottom\nof BR CH so PS BB. HPW"
    },
    {
      "barNumber": "55",
      "description": "BO below OO after f BO above so HRP of MMD to OOW, but BL bought every new L\ntoday, HPWS2"
    },
    {
      "barNumber": "57",
      "description": "5 CC BRB, OOW and 60ma and GXL MGB, but small bars, tails, PP bounce soon"
    },
    {
      "barNumber": "60",
      "description": "L1, OOW MGB, GXL MGB, 60ma MGB, but II so PS FF. Late BO of TR usually gets\nreversal back up to above bottom of TR 51 L"
    },
    {
      "barNumber": "61",
      "description": "BBRB, test OOW, but PS EG and PS II FF 60. room to 60ma and GXL MGB"
    },
    {
      "barNumber": "62",
      "description": "F BO, FF 60 II, test OOW, PL, but NS, still might reach 60ma just below.\nshould get back above 51 L either from her or from test 60ma"
    },
    {
      "barNumber": "64",
      "description": "DTBF 59 at MA, 60ma MGB, AIBLE4, but 3 BLB, PP BB 62 and at 60ma, LPS"
    },
    {
      "barNumber": "66",
      "description": "ET 58 61, W 58 61, OOD MGA, AIBRE. L1 60ma MGB, but BLB, just above 60ma. GXL\nand LOY also MGB but PP too far below"
    },
    {
      "barNumber": "67",
      "description": "MDB, AIBRE, PL, but PP not strong leg up"
    },
    {
      "barNumber": "81",
      "description": "End of Day"
    }
  ]
}