{
  "3": [
    {
      "data": [
        "<article class=\"post-57341 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"September or October stock market correction Emini weekend update: September 3, 2016\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">September or October stock market correction<br>Emini weekend update: September 3, 2016</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2016-09-03T00:30:36-07:00\">September 3, 2016</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>September or October stock market correction</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/09/m.png\"><img loading=\"lazy\" src=\"2016-9-3.png\" alt=\"The monthly Emini chart has 8 consecutive bull trend bars, which is a buy climax.\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart had its 7th consecutive bull trend bar last month. Although today is early in the month, there is a 70% chance that September will close below its open.<p>While the monthly S&amp;P500 Emini candlestick chart in August was only a doji bar, it had a bull body. It was therefore the 7 consecutive bull trend bar on the monthly chart. While there have been many strong rallies over the past 20 years, few have had 7 consecutive bull trend bars. Hence, this is rare and therefore unsustainable. This rally therefore is a type of buy climax. Maybe it gets another bull trend bar this month. The odds are against it. There is a 70% chance that September will close below it open of 2168.25 from yesterday. The Emini can still rally to a new high this month. Yet, the odds are that it will close below its open.<p>Furthermore, if you look back at all of those other times when the monthly chart rallies for 6 or 7 months, most were soon followed by about a 100 point pullback. That means that the Emini will probably fall about 100 points in September or October. Significantly, September historically is the weakest month of the year, and the market has had some major selloffs in October.<p>Finally, the stops for the bulls is about 100 points below. Bulls have to reduce risk. The easier way is to take profits. The rally is a crowded trade. Therefore, even a little profit taking could make many traders sell. Hence, the market could quickly fall 100 points.<h3>The case for the bulls</h3><p>There always is an opposite argument. There is a 25% chance of a strong breakout above the 2 year trading range that relentlessly rallies to the 2400 measured move target. That means that there is a 75% chance of at least a 1 – 3 month, 100 point pullback before reaching that target. Even if there is a 100 point pullback, 7 consecutive bull trend bars represent eager bulls. Therefore, bulls will buy even a 100 point selloff, betting that the 1st reversal down will become a bull flag. The probability is on their side.<p>In conclusion, the Emini will probably soon correct about 100 points, whether or not it 1st rallies to the 2200 – 2220 measured move targets first. Furthermore, bulls will probably buy the selloff for a test back up to the high. While the 2 year trading range probably will be the<a href=\"https://www.brookstradingcourse.com/price-action/10-best-price-action-trading-patterns/#final-flags\" target=\"_blank\">Final Bull Flag</a>on the monthly chart, the reversal down to 1500 – 1800 might not begin until after the Emini rallies to the 2400 measured move target.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Tight trading range</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/09/w.png\"><img loading=\"lazy\" src=\"2016-9-3-1.png\" alt=\"The weekly Emini chart has a buy climax and a bull flag.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart had another doji candlestick pattern this week. This is the 6th consecutive week in a tight trading range.<p>The weekly S&amp;P500 Emini futures candlestick chart had its 6 consecutive doji candlestick pattern this week. It is therefore neutral and in breakout mode. While it is in a strong bull trend, the rally was climactic. The bulls hope to work off the excess by going sideways, and then get trend resumption up. Yet, the Emini broke above a 2 year trading range late in a bull trend. Because this breakout is so late in the bull trend, the gap between the current price and the top of the 2 year trading range will probably close.<p>If there is a bull breakout above the 6 week trading range, it probably will fail. Therefore, the odds are that the Emini will trade below 2100 and close the gap, even if it 1st goes a little higher.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Two month tight trading range</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/09/d.png\"><img loading=\"lazy\" src=\"2016-9-3-2.png\" alt=\"the daily Emini chart is breaking above a bull flag.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart had been in a tight trading range for 2 months. The bulls have momentum on their side, and the bears have a buy climax in their favor.<p>The daily S&amp;P500 Emini futures candlestick chart rallied strongly in July and is holding the moving average. Yet it has been in tight trading ranges in July and in August. The stop for the bulls is still below the July 6 pullback low, which is about 100 points below. Because that means their risk is great, they need to reduce that risk. The easiest way is to take profits.<p>Many of the buyers over the past 2 months bought simply because the Emini was going up. These momentum bulls will be quick to get out if the Emini starts to go down. Once institutions begin to take profits to reduce risk, that slight pullback can panic the momentum bulls. As a result, the Emini could sell off very quickly to below the 2100 top of the 2 year trading range.<h3>Lower highs so early bear trend</h3><p>The bears see the August 15 and 23 double top as a reasonable start of the bear trend. They see July as the Final Bull Flag.<p>They also see lower highs since then on the 60 minute chart. The 60 minute chart has an interesting pattern. IT formed a Wedge Bull Flag with its reversal up yesterday. Yet, that bull flag has a problem. When a Wedge Bull Flag is mostly horizontal and has big swings, the 3rd breakout is a small breakout of the 2nd breakout, which is a small breakout below the 1st leg down. This is a Small Breakout of a Small Breakout pattern. The final component to the sell setup is a rally up from that 3rd low. The Thursday and Friday rally fulfilled that requirement.<p>If the Emini then falls below the Thursday bottom of the Wedge, it would have have a 50 – 60% chance of a measured move down. That would be about a 100 point correction.<h3>The bull case</h3><p>The bulls think that the July rally was so strong that it will have a 3rd push up. The momentum up was strong enough to make that more likely than not. Furthermore, there are still measured move targets around 2200 – 2220.<p>While the 2 month tight trading range has about a 50% chance of a breakout up or down, the probability is slightly higher for the bulls. Yet, if the bulls get their 3rd push up to the targets above, the breakout will probably fail. That would therefore be a wedge top at resistance, and it would probably lead to the 100 point pull back.<p>There is also a 30% chance that the Emini continues up to the 2400 measured move target without closing the gap at 2100. That probability would go up to 40 – 50% if there is a strong breakout above 2220.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2016-9-3"
    }
  ],
  "10": [
    {
      "data": [
        "<article class=\"post-57593 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"September stock market crash is unlikelyEmini weekend update: September 10, 2016\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">September stock market crash is unlikely<br>Emini weekend update: September 10, 2016</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2016-09-10T00:30:13-07:00\">September 10, 2016</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Failed bull breakout</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/09/m-1.png\"><img loading=\"lazy\" src=\"2016-9-10.png\" alt=\"The monthly emini candlestick chart has a bear trend reversal for its candlestick pattern.\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has a bear body. It will probably have a bear body when the month closes because the rally has been climactic.<p>The monthly S&amp;P500 Emini futures candlestick chart had 7 consecutive bull trend bars as of last month. That is rare. Therefore, an 8th is even more rare. Hence, the odds are that September will have a bear body, which means a close below its open.<h3>Buy climax</h3><p>The Emini formed a big bull trend bar in July. It broke far above the 2 year trading range. Therefore, there is a big<a href=\"https://www.brookstradingcourse.com/how-to-trade-manual/support-and-resistance/#gaps\" target=\"_blank\">gap</a>between its close and the top of the 2 year trading range. Furthermore, there is a gap between the lows of August and September and the top of that range. Yet, that gap shrunk Friday because of the strong reversal down. The gap will probably close next week.<p>When a gap forms after 20 bars in a trend, it is more likely an exhaustive end of the trend than the start of a new leg up. Weak bulls who have been waiting to buy can wait no longer. They buy the big bull bar, thinking that they finally have to buy what is clearly a strong bull trend. Weak bears keep selling the rally. They thought it could not last long, but finally cannot take the stress any longer. They therefore buy back their shorts. The result of this desperate buying by traders willing to buy at any price is a big bull trend bar that has no one left wanting to buy.<h3>What do strong bulls and bears do after a buy climax?</h3><p>Strong bulls see the big bull breakout as a gift. They use it to take profits, and then wait for a pullback before buying again. Strong bears see it as a great chance to sell at a very high price. They are selling because they believe that the top is near. These bears are strong because they can withstand the pressure of a continued rally. They use it to sell even more. These bears are never planning to buy back their shorts until after they get their bear trend.<p>Realistically, if the rally continues for many months, even the strong bears will buy back their shorts for a loss. However, many see this rally as a climactic end of a 7 year bull trend. They will only exit if the Emini continues much above the 2400 measured move target (based on the height of the 2 year trading range).<h2>Sell entry bar?</h2><p>If the bears get their bear trend bar this month, September would then be a strong sell entry bar for a failed breakout above a 2 year trading range. A trading range late in a bull trend is usually the Final Bull Flag. While that is likely here, the 7 month bull breakout is not just a climax. It is also a sign of strong bulls.<p>Therefore, the reversal down will probably be brief. As a result of this bull momentum, the odds are that the bulls will buy the selloff. This would then create a 2nd leg up. Because of the Final Flag, the rally might not last long. The bears will try to create a double top or lower high, and then a TBTL Ten Bar, Two Leg reversal down over the next year.<h3>1500 within 3 years</h3><p>While there is a 60% chance of a drop to the 1500 area over the next few years, the current bull trend has a 40% chance of reaching the 2400 measured move target, based on the height of the 2 year trading range. I have talked about the 1500 target many times over the past year. The 2000 and 2007 highs formed a double top on the monthly chart. Yet, the bulls got a breakout above the double top. However, the market never tested the breakout point. Since the Emini usually comes back to breakout points, the odds are that the Emini will test 1500 before going much higher.<h3>Pullback more likely than bear trend</h3><p>While it is possible that this reversal is the start of the move down to 1500, it is more likely going to be a pullback on the monthly chart. The momentum up in July was strong. Therefore, bulls will probably see a 5% pullback here as a chance to buy stocks on sale.<p>The bears need to do much more before they can convince traders that this is a bear trend. Even if they are able to take the market down to the 1800 bottom of the 2 year trading range, there would probably be a bounce. Bears would take profits and bulls would buy. This would result in a rally. Yet, many traders would sell that rally, betting on either a trading range or a lower high major trend reversal (Head and Shoulders Top).<p>This top would probably require 10 – 20 bars. It therefore would take place over at least a year or two. While a reversal down from a Final Flag can be shockingly violent and relentless, the selloff usually finds support at the bottom of the final flag. Therefore, a Head and Shoulders Top is more likely than a collapse.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Outside down reversal</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/09/w-2.png\"><img loading=\"lazy\" src=\"2016-9-10-1.png\" alt=\"emini trend reversal and outside down bear trend bar\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart this week traded above last week’s high and then below last week’s low. This means that this week was an outside down week, which is a sign of strong bears. The minimum targets are the bull trend line, the moving average, and a test to just below the top of the 2 year trading range.<p>The weekly S&amp;P500 Emini futures candlestick chart had an outside down bar in a bull trend, and hence created a sign of strong bears. Because it formed late in a bull trend and after a potential Final Bull Flag, it has more significance. It increases the chances that the reversal attempt will be successful.<p>Whenever there is an outside down bar in a bull trend, traders have to be ready for a bull inside bar. This is an ioi buy setup. While the context for lower prices is good, traders can never ignore the opposite of what they believe because the opposite usually happens at least 40% of the time.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Bear trend reversal, but September stock market crash is unlikely</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/09/d-4.png\"><img loading=\"lazy\" src=\"2016-9-10-2.png\" alt=\"Emini bear trend reversal for candlestick pattern\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart formed a big bear trend bar on Friday and it closed below the August and September<a href=\"https://www.brookstradingcourse.com/how-to-trade-manual/trading-ranges/#tight-trading-ranges\" target=\"_blank\">tight trend range</a>.<p>The daily S&amp;P500 Emini futures candlestick chart had a tight trading range in August and a lower one in July. Friday formed a big bear trend bar and it closed below the both trading ranges. It therefore closed below the lows of about 40 bars. Furthermore, it closed on its low. These are signs of strong bears.<p>Because it was a big bear trend bar at the end of a bull trend, it is a “give up” bar. Hence, it tells traders that a lot of bulls are finally giving up. It therefore increases the chances of lower prices over the next week or two.<p>It is also a possible start of a bear trend on the daily chart. The first target is the top of the 2 year trading range. Some computers see that as the 2104.25 June high. More see it as the 2084.50 July 2015 high.<p>Since the rally from the July low was a Spike and Channel bull trend, the bottom of the 1st pullback after the bull breakout is a target. That is the July 6 low of 2059.25. In any case, if Friday is the start of the correction, the minimum objective is a closure of the gap on the monthly chart, which means a drop below the 2084.50 July 2015 high. There is also a bull trend line in that area.<h3>The importance of next week</h3><p>Whenever there is a big bear breakout bar, traders pay special attention to the next bar. If it is also a big bear trend bar closing on its low, it increases the chances of some kind of measured move down. The minimum that the bears want to see is the absence of a bull body on Monday. Therefore, if Monday is a bull bar, traders will wonder if the bear breakout will fail. Many will buy a reversal up.<p>With this week’s bear bar as big as it was, and with it closing below the lows of so many bars, the odds are that there will be at least one more leg down. This is true even if Monday has a bull body, and even if there is a rally for a few days. The bulls would need a strong bull reversal next week to convince traders that this week is just a 2 legged pullback from the August high (where September 1 was the 1st leg down).<h3>Greater Fools Theory and a crowded trade</h3><p>I have written many times over the past month that many of the buyers in July and August were momentum bulls. Hence, they were buying because the Emini was going up, not because they thought the Emini was cheap. They are therefore “greater fool theory” bulls, betting that there will be a bigger fool who will buy from them at a higher price so that they can make a profit.<p>Once the momentum stops or there is a minor reversal, these bulls exit quickly. This is called a “crowded” trade, which means too many traders buying high. As a result of their eagerness to get out on a minor selloff, the reversal down can be fast and quickly fall for 5% or more.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2016-9-10"
    }
  ],
  "17": [
    {
      "data": [
        "<article class=\"post-57921 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"September FOMC Fed rate hike Emini weekend update: September 17, 2016\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">September FOMC Fed rate hike<br>Emini weekend update: September 17, 2016</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2016-09-17T00:30:16-07:00\">September 17, 2016</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Reversal down into a bull flag</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/09/m-3.png\"><img loading=\"lazy\" src=\"2016-9-17.png\" alt=\"monthly candlestick chart has bull flag\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart is pulling back into a bull flag. Less likely, this is the start of a major Final Bull Flag reversal.<p>The monthly S&amp;P500 Emini futures candlestick chart had 7 consecutive bull trend bars prior to this month. Because that is very unusual on the monthly chart, it is unsustainable. Hence, it is a type of buy climax. While the monthly chart is still bullish, the odds are that it will have a bear body this month.<p>Seven consecutive bull trend bars is a sign of strong bulls. As a result, the bulls will probably buy the 1st pullback, which is the current selloff. In conclusion, the Emini is short-term bearish as it pulls back after a buy climax. Yet, the pullback will probably lead to a new high after a month or two.<h3>Exhaustion gap more likely than measuring gap</h3><p>The gap between the low of the month and the July 2015 top of the trading range will probably close before there is a new high. This is because the 2 year trading range formed after close to 100 bars in the bull trend. A breakout above a trading range late in a bull trend rarely can maintain a gap. Thus, the odds are that the gap will close.<p>The bears see the 2 month trading range as the Final Bull Flag. Hence, they are hoping that this reversal is the start of a bear trend. There is a 40% chance that they are right. Since the momentum up is strong, it is more likely that bulls will soon buy the pullback. As a result, the odds favor one more new high.<p>While it is possible that the gap stays open and becomes a measuring gap, the probability is that it will close.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Bad follow-through selling after last week’s strong bear bar.</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/09/w-3.png\"><img loading=\"lazy\" src=\"2016-9-17-1.png\" alt=\"weekly emini candlestick chart has possible wedge top\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart bounced at the moving average this week. Furthermore, this week’s candlestick had a bull body.<p>The weekly S&amp;P500 Emini futures candlestick chart this week had a bull body. It therefore was weak follow-through for the bears. Because the momentum up from the July rally was so exceptionally strong, the odds are that the current selloff will be a bull flag. However, the odds are that the Emini will hit the bull trend line and fall below the July 2015 high before the bulls return. Because both are obvious support and the Emini is now close to them, the odds are that the Emini cannot escape their magnetic pull. Therefore, many bulls will wait for a test below support before buying a reversal up.<h3>Possible Wedge Top</h3><p>While it is possible that the Emini reverses up here at the moving average, it is more likely that it will close the gap first. If the Emini rallies to a new high and then reverses down, then the rally from the July low would be a Wedge Higher High Major Trend Reversal. The 2 year trading range would be the Final Bull Flag.<p>Most wedge tops have overlapping legs. Hence, the rally usually does not have gaps. This therefore means that the pullback from the 2nd leg up usually falls below the top of the 1st leg up. The second leg up ended with the August 26 high on the weekly chart. The high of the 1st leg up was the June 10 high of 2104.25. Therefore the odds are that the current selloff will fall at least a little below 2104.25 before the 3rd leg up begins.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Tight trading range bear flag before September FOMC Fed rate hike</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/09/d-5.png\"><img loading=\"lazy\" src=\"2016-9-17-2.png\" alt=\"daily emini candlestick chart should have 2nd leg down\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart has been in a tight trading range for 6 days. This is a bear flag after last week’s strong bear breakout.<p>The daily S&amp;P500 Emini futures candlestick chart has bee in a tight trading range for 6 days. Because it follows a strong reversal down, it is a bear flag. Thus, it is more likely to have a bear breakout. Since the gap up on the monthly chart will probably close this month, that is another reason to expect a bear breakout.<h3>Spike and Channel Bull Trend</h3><p>The daily chart has a Spike and Channel Bull Trend. The spike is the July rally. The channel began with the July 6 1st pullback. When Spike and Channel tops reverse down, there is a 50% chance that the selloff will reach the bottom of that 1st pullback. That low is 2059.25. Spike and Channel trends usually lead to trading ranges.<h3>Measuring Gap unlikely</h3><p>Traders always have to be respectful of institutions with the opposite opinion. They see this selloff as a breakout test of the top of the 2 year trading range. Furthermore, they want the gap to remain open and become a Measuring Gap. Because the 2 year trading range is 300 points tall, the bulls are looking for a rally to around 2350 – 2400. While there is a 40% chance that they will reach their target, there is a 60% chance that the Final Bull Flag will reverse down before the bulls hit their target.<h3>September FOMC meeting and a possible interest rate hike</h3><p>TV pundits say that the market has priced in the rate hike, but that the hike will be in December, not September. I don’t know and I don’t care. All I care about is what the market is doing, not what the Fed is doing. I make money trading the market, not trading the Fed.<p>The FOMC meeting is a potential catalyst to a breakout up or down. I will trade in the direction of the breakout if it is strong. Since 50% of breakouts of tight ranges reverse, I will be ready to trade in the opposite direction if the breakout fails. Because the charts say that the 2104.25 gap will close, the odds are an FOMC rally will fail if the Emini does not 1st close the gap. Yet, if the rally is strong and the gap stays open, I will buy and not worry that a low probability event is unfolding.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2016-9-17"
    }
  ],
  "24": [
    {
      "data": [
        "<article class=\"post-58199 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Stock market island bottom but October correction likelyEmini weekend update: September 24, 2016\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Stock market island bottom but October correction likely<br>Emini weekend update: September 24, 2016</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2016-09-24T00:30:25-07:00\">September 24, 2016</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>1st time Emini has ever had 8 consecutive bull trend bars so buy climax</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/09/m-4.png\"><img loading=\"lazy\" src=\"2016-9-24.png\" alt=\"monthly emini candlestick chart has breakout near all-time high\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has one more week before the month closes. It has been staying around the open of the month. If Friday closes above the 2161.75 open of the month, September will be the 8th consecutive bull trend bar on the monthly chart.<p>Because the monthly S&amp;P 500 candlestick chart is doing something unusual, it is in a buy climax. While there have been several instances of 7 consecutive bull trend bars on the monthly Emini chart in its 18 year history, there has never been 8. Furthermore, every time it has had 7 consecutive bull bars, it soon fell for about 100 points. Therefore, what is more likely? An 8th and maybe even a 9 consecutive bull trend bar? Or, a bear bar, and a 100 point correction within the next month or two? In conclusion, the odds favor a 100 point correction soon, whether or not there is one more new high first.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Bull channel, but possible wedge top</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/09/w-4.png\"><img loading=\"lazy\" src=\"2016-9-24-1.png\" alt=\"wmini wedge top of weekly chart\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart reverse up over the past 2 weeks from a test of the top of the 2 year trading range. The momentum is good enough for the bulls to test the all-time high next week.<p>The weekly S&amp;P500 Emini futures candlestick chart has been in a bull channel since the February low. Yet, the channel has a wedge shape. If the rally continues to a new high, but then reverses, the chart would have a wedge top. Hence, bears will be looking to sell the reversal down.<h3>Wedge top with only 2 legs up?</h3><p>Sometimes when a pattern is particularly obvious like this, bears begin to sell just below the old high. They do so just in case the Emini forms a lower high instead of a wedge top. If enough bars do this, the 3rd push up does not go above the 2nd top. The reversal therefore becomes a lower high major trend reversal.<p>While it does not have the 3rd push up and therefore is not a wedge, it if functionally the same as a wedge. This is because the same forces created it. As a result, traders would expect a 10 bar, 2 legged correction.<h3>The bull case</h3><p>The Emini weekly chart has been in a bull trend since the February low. While the bears have had a couple strong reversal attempts, they lacked conviction. The bulls saw them as bull flags and bought them. The momentum up over the past 2 weeks is strong enough to make a new high likely.<h3>Gap above July 2015 high: Measuring Gap or Exhaustion Gap?</h3><p>Because the selloff 2 weeks ago failed to drop below the July 2015 high, there is a gap above that high and the low of 2 weeks ago. The bulls expect it to be a Measuring Gap. They therefore are looking for a 300 point rally, based on the height of the 2 year trading range.<p>When a bull gap occurs after 20 bars in a bull trend, it is more likely an exhaustion gap. This simply means that it will close because of exhausted bulls. It can lead to a reversal, but the minimum goal is a pause in the bull trend.<p>Because this gap came after 20 bars since the July low, there is a 70% chance it will close soon. While the 2 week reversal up make it a possible measuring gap, the odds are that the rally will fail and the Emini will trade back below the July 2015 high. If it does, the selloff would probably be the start of the 100 point correction that traders expect based on the monthly chart.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>stock market island bottom but October correction likely</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/09/d-6.png\"><img loading=\"lazy\" src=\"2016-9-24-2.png\" alt=\"island top and bottom in the S&amp;P500 emini\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart gapped up 2 days ago and created a 3 week island bottom. While the Emini closed the gap on Friday, the odds still favor follow-through buying next week.<p>The daily S&amp;P500 Emini futures candlestick chart gapped up Thursday after a gap down 3 weeks earlier. This created an island bottom, which is a sign of strong bulls. Because the Emini reversed up from the strong support at the top of a 2 year trading range, the odds are that the bulls will buy again soon. Therefore, the Emini will probably reach a new all-time high next week. Yet, because of the buy climax on the monthly chart, the odds are that the new high will soon reverse back down.<h3>Possible island top</h3><p>While the Emini broke above its 2 year trading range, the breakout is still uncertain. It therefore might simply be an expansion of the range. When the Emini is in a range it often forms gaps up or down, and many create island tops or bottoms, or almost island tops or bottoms. This means that traders should be aware that a gap down next week would create an island top. This is true even though Friday closed the gap up by trading below Wednesday’s high. Hence, that would be a sign of strong bears and it would erase the bullishness of this week’s island bottom.<p>It would also be follow-through after Friday triggered a lower high major trend reversal sell signal. Yet, until there is a strong bear breakout with follow-through selling, the island top is just another reversal in a trading range. It therefore is not important without strong follow-through selling.<h3>Open of the month is a magnet this week</h3><p>Because the Emini has never had 8 consecutive bull trend bars on the monthly chart, and it is now trading around the open of the month, it might accomplish that when the month closes on Friday. The Emini has traded sideways around the open of the month for 2 days.<p>This is a sign that traders understand the importance of that price. Hence, this increases the chances that the Emini will trade in a narrow range around the open of the month for the entire week, waiting until the final minutes of the month to decide if September will be the 8th consecutive bull trend bar.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2016-9-24"
    }
  ]
}