{
  "3": [
    {
      "data": [
        "<article class=\"post-61151 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Trump rally pausing before Fed FOMC interest rate hike Emini weekend update: December 3, 2016\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Trump rally pausing before Fed FOMC interest rate hike<br>Emini weekend update: December 3, 2016</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2016-12-03T00:30:24-08:00\">December 3, 2016</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Strong bull breakout, but possible exhaustion gap</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/12/m.png\"><img loading=\"lazy\" src=\"2016-12-3.png\" alt=\"Monthly emini chart trump breakout rally and end of year christmas rally\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart formed a big outside up month in November. It closed at a new all-time monthly high. Because of the 3 pushes up from February, bears will try to create a reversal down from a parabolic wedge top.<p>The monthly S&amp;P500 Emini futures candlestick chart had a big outside up bar in November. It closed at a new all-time monthly high, and therefore is a sign of strong bulls. Yet, it was the 3rd push up in a tight channel since February. Hence, the bears will try to create a parabolic wedge top reversal this month or next.<p>The bulls instead want a measuring gap. They therefore want any pullback in December to stay above the August high, and especial above the October high. If the gap between the November close or the December low closes, then November has an increased chance of being an exhaustion gap. That would therefore increase the chance of a reversal down.<p>Because the 11 month rally has been strong, the bears will a strong sell signal bar before traders will short. If December closes on its low, it would be a sell signal bar for a parabolic wedge top. Furthermore, the 2 year trading range might be the Final Bull Flag in the 7 year bull trend. Even if the bears get their sell setup, the probability of the reversal down would only be 40%. More likely, the reversal would be minor. Therefore several sideways months would be more likely than a reversal down.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Wedge top and failed breakout</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/12/w.png\"><img loading=\"lazy\" src=\"2016-12-3-1.png\" alt=\"weekly emini wedge top and failed trump rally breakout\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart formed a bear bar this week after a 3 week bull breakout. While this is a possible top, the 3 bull bars were strong enough to make a pullback and bull flag more likely than a reversal.<p>The weekly S&amp;P500 Emini futures candlestick chart formed a bear bar closing on its low this week. Because this followed 3 big bull trend bars, the odds are that there are buyers below. Yet, the bears see it as a sell signal bar in a wedge top. Some computers see November 6, 2015 as the 1st push up. Others see April 22 as the 1st leg up in the wedge.<p>Because the last leg up was strong, the odds are that there are buyers below this week’s low. Furthermore, the bears will probably need at least a micro double top before they can reverse the bull trend. That means the downside risk is small for at least a couple of weeks.<p>While it is possible for this to be the top without a micro double top, the bears would probably need 3 or more consecutive bear bars to convince traders that they have taken control. The probability still favors the bulls. A pullback into a bull flag is therefore more likely than a reversal into a bear trend.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Trump rally pausing before Fed FOMC interest rate hike</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/12/d.png\"><img loading=\"lazy\" src=\"2016-12-3-2.png\" alt=\"emini buy climax after trump rally\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart sold off for several days after a new all-time high. Yet, the selloff is more likely to be minor. Therefore a trading range is more likely than a bear trend.<p>The daily S&amp;P500 Emini futures candlestick chart pulled back for 3 days after a new all-time high. I said last week that the bulls had a 12 bar bull micro channel. That was therefore unsustainable and climactic. Yet, it is also a sign of strong bulls. As a result, bulls bought the 1st pullback.<p>Furthermore, I said that the pullback usually leads to a brief new high. The bulls got that on Wednesday. Finally, I said that the Emini then often goes sideways for about 10 days. That means that the Emini might stay mostly sideways until the December 14 FOMC meeting.<p>While the Fed is likely to raise interest rates, which is bearish, the institutions have already factored that into the current price. Therefore, wherever the Emini is at the time of the announcement, the probability of a rally or a selloff will be 50%.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2016-12-3"
    }
  ],
  "10": [
    {
      "data": [
        "<article class=\"post-61799 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"December FOMC Fed interest rate hikeEmini weekend update: December 10, 2016\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">December FOMC Fed interest rate hike<br>Emini weekend update: December 10, 2016</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2016-12-10T00:30:47-08:00\">December 10, 2016</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Strong bull breakout before the December FOMC Fed interest rate hike</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/12/m-1.png\"><img loading=\"lazy\" src=\"2016-12-10.png\" alt=\"emini trump rally\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has a bull trend bar this month. This is therefore good follow-through buying after last month’s big outside up bar.<p>The monthly S&amp;P500 Emini futures candlestick chart closed at a new all-time monthly high close in November. This month is currently a bull bar that is trading at the high. This is good follow-through buying. If the month closes near its high, it would therefore increase the chances of higher prices in January.<p>While there are 3 pushes up this year, they are in a tight bull channel. In addition, the pullback from the 2nd rally was deep. This therefore makes a parabolic wedge top unlikely. In addition, the tight bull channel makes any reversal down likely to be minor. As a result, the bears will probably need at least a micro double top before they can create a reversal. Less likely, the can begin a reversal with a big bear bar or a series of bear bars. The odds favor higher prices.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Strong bull breakout to a new all-time high</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/12/w-2.png\"><img loading=\"lazy\" src=\"2016-12-10-1.png\" alt=\"weekly stock market christmas rally\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart formed a big bull trend bar this week.<p>The weekly S&amp;P500 Emini futures candlestick chart is breaking strongly to a new high. Because last week was a bear bar, the odds were that this week would not be a big bull week. Yet it was. Hence, the odds are that the Emini will go higher.<p>Whenever a market does something that is unlikely, it traps traders. Bulls get trapped out because they wanted to buy a pullback and therefore did not buy the breakout. Bears expected sellers above last week and sold. Hence, they are trapped in a losing trade. Both bulls and bears will use any pullback to buy. As a result, there will probably be at least one more small leg up after the next reversal attempt.<p>Never assume that low probability events have no probability. While it is unlikely that next week will be a big bear bar and reverse this week’s rally, there is a 30% chance that it will. Therefore traders have to be willing to sell if a clear, strong reversal develops.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Strong bull breakout and good follow-through buying.</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/12/d-1.png\"><img loading=\"lazy\" src=\"2016-12-10-2.png\" alt=\"dow 20,000 soon\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart broke strongly to a new all-time high on Wednesday. In addition, Thursday was a bull bar that closed near its high. That follow-through buying therefore increased the odds of higher prices over the next week or two.<p>Thursday and Friday have smaller bodies. Hence, the breakout is weakening. This therefore increases the chances of at least a small pullback next week. Furthermore, Wednesday is an FOMC meeting. The Emini will probably go sideways into the report.<p>The daily S&amp;P500 Emini futures candlestick chart broke strongly to a new all-time high this week. Furthermore, there was good follow-through buying. As a result, even if there is a pullback this week, the odds are that the Emini will go higher for at least the next week or two.<h3>Wednesday’s FOMC meeting and probable interest rate hike</h3><p>Because there is a 90% chance of a Fed interest rate hike, the raise in rates will not surprise traders. Yet, if the Fed says that it plans many more increases in 2017, that would be a surprise. Therefore there is a potential of a big move down immediately after the report.<p>Traders are expecting a big move on Wednesday. There is a 50% chance that it will be up. In addition, there is a 50% chance it will be down. Since the Emini will be in Breakout Mode, there is also a 50% chance that the 1st breakout will reverse.<p>As always, traders will respect the bear case. Wednesday’s FOMC meeting is especially relevant. It is a catalyst that can lead to a big move up or down. Yet, because the bull breakout was so strong, the odds are that a bear reversal will probably be minor. That means that it would more likely become a bull flag than the start of a bear trend.<p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2016-12-10"
    }
  ],
  "24": [
    {
      "data": [
        "<article class=\"post-62394 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini bull flag at Dow 20,000 big round numberEmini weekend update: December 24, 2016\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini bull flag at Dow 20,000 big round number<br>Emini weekend update: December 24, 2016</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2016-12-24T00:30:48-08:00\">December 24, 2016</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Strong follow-through buying</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/12/m-2.png\"><img loading=\"lazy\" src=\"2016-12-24.png\" alt=\"emini strong bull breakout as dow tests 20,000\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has a big bull bar with one week left to the month. Hence, this is good follow-through buying after last month’s bull breakout.<p>The monthly S&amp;P500 Emini futures candlestick chart is in a bull breakout. Because the channel up since February is tight, bulls will probably buy the 1st reversal down. Hence, a reversal attempt will more likely create a bull flag than a bear trend. In addition, there are several measured move targets above 2300. Therefore the odds are that the Emini will go at least a little higher over the next few months.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Weak follow-through buying after buy climax</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/12/w-3.png\"><img loading=\"lazy\" src=\"2016-12-24-1.png\" alt=\"Emini at top of channel in year end trump stock market rally\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart had a 2nd consecutive doji this week.<p>The weekly S&amp;P500 Emini futures candlestick chart has had consecutive doji bars. Because these represent hesitation after the buy climax of 2 weeks ago, there is an increased chance of a reversal. Yet, they are part of an 8 bar bull micro channel. Hence, the bulls are are strong. Therefore, a reversal attempt will more likely create a bull flag than a bear trend.<h3>Exhaustion gap or measuring gap?</h3><p>There is a gap below this week’s low and the August high breakout point. This gap is after at least 20 bars in a bull trend (the trend began in February and hence has more than 40 bars). It is therefore more likely an exhaustion move than the start of a new leg up. Furthermore, the strong rally from July pulled back below its breakout point. As a result, the odds are that the Emini will pull back to around the August high before it gets too much higher.<p>Can it rally to the measured move targets 1st? Of course it can. But, whether is does or does not, the odds are the Emini will test around 2185 in the next few months.<h3>Exhaustion usually leads to a pullback, not a reversal</h3><p>Exhaustive buy climaxes usually lead to pullbacks and trading ranges that last 10 or more bars. They less often lead to trend reversals. When they do, the Emini usually has to go sideways for at least 5 – 10 bars and form at least a small double top. Hence, the downside risk over the next several weeks is probably to the 2175 breakout point. Bulls will probably buy any reversal attempt by the bears.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Emini bull flag at Dow 20,000 big round number</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/12/d-2.png\"><img loading=\"lazy\" src=\"2016-12-24-2.png\" alt=\"dow testing 20,000 big round number in year end stock market rally\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart has been in a tight trading range for 9 days. The bears see a small double top. The bulls see a double bottom bull flag.<p>The daily S&amp;P500 Emini futures candlestick chart has been in a bull flag for 9 days. The odds still favor a bull breakout. Dow, 20,000 is especially relevant. The Dow got to within 13 points of its big round number this week. That is equivalent to about 1 point on the Emini. If the Emini makes a new all-time high next week, the Dow will probably get above 20,000.<p>Then what? Because the stock market is so far above its average price (moving averages), the upside near term is probably not great. Yet, the momentum up has been strong. As a result of the combination of strong bullish momentum and an overbought market, the stock market is confused. Because confusion is a hallmark of a trading range, the Emini will probably continue sideways, but in a broader range over the next week or two.<h3>Buy climax so trading range likely soon</h3><p>Since the the bull trend is strong, the odds are that it will make a new high within the next few weeks. It might even reach the measured move target between 2300 and 2400 over the next few months. Yet, the odds are that there is not much left to this rally before bulls will take profits. When they do, the Emini will probably enter a trading range lasting 20 or more bars.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2016-12-24"
    }
  ],
  "31": [
    {
      "data": [
        "<article class=\"post-62756 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"2017 stock, bond, and Forex market predictionsEmini weekend update: December 31, 2016\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">2017 stock, bond, and Forex market predictions<br>Emini weekend update: December 31, 2016</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2016-12-31T00:30:03-08:00\">December 31, 2016</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>2017 stock, bond, and Forex market predictions</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/12/m-3.png\"><img loading=\"lazy\" src=\"2016-12-31.png\" alt=\"monthly emini failing at dow 20,000\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart had a bull trend bar this month. Yet, it had a big tail on top and the month closed in the middle. While the bull body confirms last month’s bull breakout, the bulls are disappointed.<p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/12/m-mmt.png\"><img loading=\"lazy\" src=\"2016-12-31-1.png\" alt=\"trump rally is failing and there are measured move targets above and below\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has targets above and below.<p>The monthly S&amp;P500 Emini futures candlestick chart has been in a strong bull trend since the February low. Because it has had 3 pushes up in a tight channel, the bears hope this is a parabolic buy climax. While possible, the deep pullbacks after the 1st 2 legs up reduced the climactic nature of the rally. Hence, a parabolic wedge top is not likely. Since the channel is tight, the first reversal down will probably be minor. It would therefore likely create a small bull flag rather than a bear trend.<p>In addition to the good momentum up, there are several measured move targets around 2350. These are magnets that increase the chance for at least a little more rally.<p>There is a gap below this month’s low and the August high. Because the gap is late in a bull trend, the odds are that it will close before the Emini gets to its targets above. Yet, the bulls will probably buy the reversal. They therefore would be correctly betting that the probability favors a breakout test more than a reversal down.<h3>The next 4 years</h3><p>What will Trump do? I don’t care. All I care about is the chart. The monthly chart is in a bull trend. Yet, it went sideways for about 20 bars before the July bull breakout. Therefore, the current breakout might lead to a Final Bull Flag reversal down. Because there is no sign of a top, the bears will probably need at least several sideways months to create at least a micro double top.<p>Since there is a potential Final Flag below, it is a magnet once there is a reversal down. Hence, the reversal will probably trade down to the bottom of the flag, which is around 1800. Furthermore, the March, 2000 and the October, 2007 highs formed a double top. Since the breakout above those highs has never been tested, the odds are the Emini will fall to around 1500 to test those highs at some point in the next several years. That is also a measured move down below the 2015 – 2016 trading range source<a href=\"https://www.top10forex.net/\" style=\"text-decoration:none;color:#000\" rel=\"noopener\">top10forex.net</a>.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Failed breakout above the August high</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/12/w-4.png\"><img loading=\"lazy\" src=\"2016-12-31-2.png\" alt=\"weekly emini wedge top and failure at dow 20,000\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart created a strong bear bar this week. Since the prior 2 weeks were dojis after a buy climax, this week has an increased chance of leading to at least slightly lower prices. Because the Emini has not tested the breakout above the August high, traders are wondering if this is the start of the test.<br>The Emini broke strongly above a Low 2 top attempt. That increases the chances of a 2nd leg up after the November breakout. If there is another leg up and then a reversal down, that would create consecutive Low 2 tops. Hence, that would be a Low 4 top. Therefore, traders would look for a couple legs down.<p>The weekly S&amp;P500 Emini futures candlestick chart sold off this week. Since this was after the Dow repeatedly failing to break above the 20,000 Big Round Number, it might trade a little lower. Yet, the weekly chart was in an 8 bar bull micro channel until this week’s reversal. The bulls therefore have been strong. As a result, this reversal is more likely minor than the start of a bear trend. A minor reversal is either the start of a bull flag or a trading range. While it is possible that a minor reversal setup like this can lead to a major reversal down, that is unlikely.<p>In addition, the Dow is still close enough to 20,000 to still be within its gravitational field. Therefore, the odds are that it will get above 20,000 in the next few weeks.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Pullback to the moving average</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/12/d-3.png\"><img loading=\"lazy\" src=\"2016-12-31-3.png\" alt=\"trump rally failed at dow 20000\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart pulled back to the moving average after being above it for about 40 bars. While the selloff has been strong, this is a 20 Gap Bar buy setup, and the odds are that the downside is small.<p>The daily S&amp;P500 Emini futures candlestick chart sold off this week. Yet, the bulls have been willing to buy above the moving average for 2 months. Since they now get a chance to buy at an average price instead of above average, many will. As a result, the downside over the next week is probably limited.<p>Sometimes the selloff to the moving average after a 20 Gap Bar buy setup can be strong. The Emini can therefore break strongly below the average. Yet, scale in bulls usually are able to either make a profit or avoid a loss.<h3>Start of a stock market correction?</h3><p>Because this selloff is following an extreme buy climax, it has an increased chance of being the start of a bear trend. In addition, the Emini will probably test the August high breakout point at some time in the next few months. Is this the start of that test? Probably not. Despite the strong rejection of Dow 20,000, the odds at the moment still favor another rally before reaching the August high.<p>For traders to believe that the high is in, the bears will need either a major trend reversal or a stronger reversal down. A major trend reversal is always a type of double top. Therefore, the bears will need at least one more rally to test the December high. Less likely, the current selloff can continue down relentlessly and accelerate. While unlikely, if there is a series of bear trend bars next week, traders will believe that the Emini has begun its test of the August high.<h2>Bond market top for the next 20 years</h2><p>I began trading in 1987. At the time, I noticed that the bond market was falling. I was confused because the stock market was rallying while the bond market was creating a great, low risk alternative in the form of CDs. Eventually, traders saw that the high risk stock market was too dangerous, and the market repriced down 25% in one day in October, 1987.<p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/12/US.png\"><img loading=\"lazy\" src=\"2016-12-31-4.png\" alt=\"\"></a><p class=\"caption\">The monthly chart of the 30 year bond market had a strong bear breakout after nested wedge tops. While the sell climax will probably lead to a rally over the next couple of months, the odds favor a lower high major trend reversal and a bear trend.<p>The bond market has rallied strongly for the past 30 years. Yet, its monthly chart has nested wedge tops. In addition, there has been a big bear breakout. Wedge tops that reverse down strongly typically have at least one more leg down. How far down will it go? Every prior higher low in the bull trend is a target. Especially relevant is the gap below the August 2013 low. In addition, that low formed a double bottom bull flag with the March 2012 low, around 125. That is therefore an obvious magnet over the next few years.<p>Like 1987, higher interest rates on CDs provide a low risk alternative to stocks. As a result, money will probably begin to shift from stocks to CDs. Hence, the stock market will probably reprice down as interest rates rise.<p>While the bond selloff has been climactic and a significant bounce is likely, the odds favor a top. Hence, the rally will probably form a lower high major trend reversal on the monthly chart.<h2>EURUSD Forex market: Test of par in 2017</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/12/EC-month.png\"><img loading=\"lazy\" src=\"2016-12-31-5.png\" alt=\"EURUSD bear flag testing par 1.0000\"></a><p class=\"caption\">The monthly EURUSD Forex chart broke below a double top bear flag that was below the moving average. While it has not yet broken strongly below the low of the flag, the odds are that it will fall for a measured move down to around par (1.0000)<p>The monthly EURUSD chart has been in a bear trend since 2008. After a 6 year trading range, it broke strongly to the downside in 2014. It formed a double top bear flag in 2015. After going sideways until it hit the moving average, it broke to the downside. That pattern was therefore a Low 2 sell setup at the moving average.<p>This month’s breakout below the bear flag is also a new 14 year low. Yet, the month was a doji candlestick pattern instead of a strong bear bar. While this is not a strong breakout, it is not a good buy setup either. A measured move down based on the height of the year long trading range is far below par (1.0000).<p>While the weekly chart is trying to bounce, the odds are that the monthly chart will reach par in 2017. It is a strong psychological magnet, the momentum down is strong, and it is now nearby.<h3>Final Bear Flag?</h3><p>Whenever a bear flag forms late in a bear trend, there is an increased chance that it will be the Final Bear Flag. Therefore traders watch to see if the bear breakout reverses back up. While the year long trading range might in fact be the Final Bear Flag, there is no sign of a bull reversal. Furthermore, there is still room down to the important magnet of par.<h3>January reversal up?</h3><p>Over the past 20 years, there have been about 10 major reversals on the monthly chart. Three have come in January. Traders know that there is an increased chance of a major reversal in January. Yet, the probability is still low. Because of this tendency, traders will be more willing to buy if there is a strong reversal up in January. Since there is no clear reversal yet, the odds still favor lower prices.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2016-12-31"
    }
  ]
}