{
  "7": [
    {
      "data": [
        "<article class=\"post-52351 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini weekend update: May 7, 2016:  Learn how to trade a wedge bull flag candlestick pattern\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weekend update: May 7, 2016:<br>Learn how to trade a wedge bull flag candlestick pattern</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2016-05-07T00:10:25-07:00\">May 7, 2016</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart: Sell signal bar</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/05/m.png\"><img loading=\"lazy\" src=\"2016-5-7.png\" alt=\"S&amp;P Emini futures market analysis weekly report for May 7, 2016.  Those learning how to trade the markets see a trend reversal down from small breakout above the top of the 2 year trading range as the candlestick pattern for the price action on the monthly chart.\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart reversed down in April after reaching a new all-time high. That makes April a sell signal bar on the monthly chart.<p>If the monthly S&amp;P500 Emini futures candlestick chart trades 1 tick below the April low of 2026, it will trigger the sell. Since the sell signal bar has a bull body and the rally up from February was so strong, the odds are that there are more buyers below the April low than sellers. The bear breakout will probably form a pullback instead of a swing down.<p>The close of last year is only 1 tick above the April low and is another magnet. The bears want the stock market to be down on the year and therefore want it to fall far below the December 31 close of 2026.25. That area is support and therefore a magnet. When the market is in a trading range, and the monthly chart has been in a trading range for 2 years, it usually goes beyond support and resistance before reversing. Just look at April, which went above the top of the range and reversed down. Similarly, many traders will not look to buy a selloff unless the selloff falls below support and reverses up. This means that if the Emini rallies for a few days next week, it might come down to the 2026 area before testing the April high.<h2>Weekly S&amp;P500 Emini futures candlestick chart: Bull flag</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/05/w.png\"><img loading=\"lazy\" src=\"2016-5-7-1.png\" alt=\"S&amp;P Emini futures market analysis weekly report for May 7, 2016. Those who trade the markets for a living see a bull flag after an 11 week bull micro channel, which is a buy climax on the Emini weekly chart. \"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart pulled back for the past 2 weeks after an 11 week bull micro channel.<p>The weekly S&amp;P500 Emini futures candlestick chart had an eleven week bull<a href=\"https://www.brookstradingcourse.com/how-to-trade-manual/trend-channels/#microchannels\" target=\"_blank\">micro channel.</a>This has only happened 2 other times in the past 10 years, and both prior times were followed by a trading range. That is likely this time as well.<p>An 11 bar micro channel is unsustainable and therefore climactic. Three weeks ago, I wrote that there was a 90% chance of a pullback within the next 2 weeks. When there is a bear break below a bull micro channel, it is usually bought within 3 weeks. Although it is a buy climax, it is also a sign of very eager bulls. They usually come back within 3 weeks. This means that this pullback will probably end by the end of next week.<p>Because the pullback has fallen relatively far, there is a Big Up, Big Down pattern on the weekly and daily charts. It is a sign that the bears are fairly strong, and they will be willing to sell the first rally. With the bulls hesitant to buy without a test of 2026, they will probably scalp out of a reversal up. With both bulls and bears looking to sell a rally, the odd are that the Emini will go sideways for at least a few more weeks.<h2>Daily S&amp;P500 Emini futures candlestick chart: Learn how to trade a wedge bull flag candlestick pattern</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/05/d.png\"><img loading=\"lazy\" src=\"2016-5-7-2.png\" alt=\"S&amp;P Emini futures market analysis weekly report for May 7, 2016. Online day traders saw a trend reversal up from a micro wedge bull flag, which was the candlestick pattern on the daily chart. \"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart had 3 pushes down over the past 6 days, which means that it formed a micro wedge bull flag.<p>The daily S&amp;P500 Emini futures candlestick chart has a micro<a href=\"https://www.brookstradingcourse.com/price-action/10-best-price-action-trading-patterns/#wedges\" target=\"_blank\">wedge bull</a>flag, which is a normal size wedge bull flag on a smaller time frame, like the 60 minute chart. A small pattern usually leads to a minor reversal instead of bull trend resumption. This means that the daily chart will probably be in a trading range for at least a couple of more weeks.<p>The odds are that the Emini will test the bottom of its April<a href=\"https://www.brookstradingcourse.com/price-action/10-best-price-action-trading-patterns/#final-flags\" target=\"_blank\">Final Bull Flag</a>before it tests the April high. That bottom is the April 7 low of 2026. So that price is the close of last year, the bottom of last month’s sell signal on the monthly chart, and the bottom of the Final Bull Flag on the daily chart.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>, and a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>is available.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.</p></div></article>"
      ],
      "dateId": "2016-5-7"
    }
  ],
  "14": [
    {
      "data": [
        "<article class=\"post-52349 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini weekend update: May 14, 2016:  Trade a trend reversal candlestick pattern\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weekend update: May 14, 2016:<br>Trade a trend reversal candlestick pattern</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2016-05-14T00:30:56-07:00\">May 14, 2016</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart: Might trigger sell signal</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/05/m-2.png\"><img loading=\"lazy\" src=\"2016-5-14.png\" alt=\"S&amp;P Emini futures market analysis weekly report for May 14, 2016.  Those learning how to trade the markets see a sell signal bar at the top of the 2 year trading range as the candlestick pattern for the price action on the monthly chart.\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart is moving down and it might fall below last month’s low. This would trigger a sell signal for a failed breakout above a 2 year trading range.<p>The monthly S&amp;P500 Emini futures candlestick chart still has not triggered the short by falling below last month’s low. Many bulls are hesitant to buy until they see how aggressively the bears will sell below that sell signal bar. Since April had a bull body and it followed 2 strong months up, the odds are that there are buyers below the April low. However, traders want to know, and they only way that they find out is if May trades below the April 2026.00 low. The odds are that it will happen this month.<h2>Weekly S&amp;P500 Emini futures candlestick chart: 3 week trading range after bull micro channel</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/05/w-1.png\"><img loading=\"lazy\" src=\"2016-5-14-1.png\" alt=\"S&amp;P Emini futures market analysis weekly report for May 14, 2016. Those who trade the markets for a living see a trading range after an 11 week bull micro channel, which is a buy climax on the Emini weekly chart. \"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart has had 3 consecutive bear bars after its 11 week bull micro channel. It might have to pull back to the moving average before the bulls will return.<p>The weekly S&amp;P500 Emini futures candlestick chart had an 11 bar bull micro channel, which is unusual and therefore climactic. When the Emini traded below the low of the prior week, it created a pullback. That signaled the end of the bull micro channel. When a micro channel lasts about 10 bars, the 1st bear breakout is usually limited to 1 – 3 bars. This week was the 3rd bar. Even if it falls several more weeks, the rally was so strong that the best that the bears can probably get is a trading range and not a bear trend.<p>Once the pullback ends, the Emini usually tests the top of the bull micro channel, which is the April all-time high. Whether or not it reaches a new high, the Emini then usually enters a trading range. It already has been in a trading range for about 7 weeks, and the trading range would just get a little taller if the Emini turns down from a new high.<p>After the Emini has been in a trading range for 10 or more bars, it then can begin to create a top (like a double top) with a reasonable chance of having a swing down. Traders will look at reversals down at that point more seriously because they would then have a reasonably chance of beginning a swing down.<h2>Daily S&amp;P500 Emini futures candlestick chart: Learn how to trade a trend reversal candlestick pattern</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/05/d-3.png\"><img loading=\"lazy\" src=\"2016-5-14-2.png\" alt=\"S&amp;P Emini futures market analysis weekly report for May 14, 2016. Online day traders saw a trend reversal down from a double top bear flag, which was the candlestick pattern on the daily chart.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart is turning down from a double top bear flag. The measured move projection is around 1990.<p>The daily S&amp;P500 Emini futures candlestick chart is back in the April Final Bull Flag. When there is a reversal from a Final Flag, the selling usually extends to at least a little below the flag. That low is the April 7 low, which is the low of April. If the Emini falls below it, it would trigger a sell signal on the monthly chart.<p>The daily chart has been in a trading range for 2 months and it is near the bottom. Most trading range breakouts fail. Every trading range always has a valid buy setup and a valid sell setup. The bulls want a double bottom with last week’s low. The bears want a breakout below that low, which is the neck line for a 2 week double top bear flag. A double top bear flag is more likely to reach a measured move target if the selloff before it was strong. The selloff from the April high has lacked big consecutive bear trend bars. It therefore was not a strong bear trend. Most breakouts fail. If the Emini falls below the neck line or below the April low, the breakout will probably not fall far before the bulls reverse the Emini back up. However, the bigger the breakout, the more likely it will reach the measured move target. It could then fall to lower support levels like the March measuring gap, which is a 50% pullback of the rally from the February low.<p>Since the reversal down this week only followed 3 bars up, it is a minor reversal. A major trend reversal usually is a bigger pattern with at least 5 – 10 bars in the rally to the lower high. This means that the selloff of the past 3 days will probably be part of a trading range. It also increases the chances that a breakout below the April low will be bought, and a trading range would then unfold. This is consistent with the weekly and monthly charts, which are more likely to go sideways than very far down.<p>Whenever something is much more likely than not, traders always have to pay more attention to the “not.” This is a setup for a Pain Trade, which is a low probability trade that many traders deny can happen, even as it is happening. They keep betting on reversals, and the Pain Trade ends up lasting much longer than they think is possible. Here, the Pain Trade would be a successful bear breakout in the face of good arguments based on the weekly and monthly charts that make a bear breakout unlikely. Also, the lower high major trend reversal on the daily chart does not have enough bars to be a major reversal, so a major reversal is unlikely.<p>This Pain Trade possibility means that Monday might even gap down and quickly fall below the April low, and fall much further than traders believe is realistic. Price is truth. If that happens, instead of denying it and looking for buy setups, trade stupid. Stop thinking so much. Don’t question it, only sell, and calmly say to yourself, “Well, look at that. It should rally, but it is going down. I’m going to just sell.”<p>What is most likely to happen next week? The Emini is at the bottom of a 2 month trading range. Most breakout attempts fail. The odds are that this one will fail and lead to a reversal up either next week or the week after. There is no sign of a bottom yet, but there probably will be at least a bounce early next week, and the 2 month trading range will then add more bars, as trading ranges typically do. There is always eventually a successful breakout, but traders know that they make more money buying low, selling high and scalping until they see a clear breakout.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>, and a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>is available.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.</p></div></article>"
      ],
      "dateId": "2016-5-14"
    }
  ],
  "20": [
    {
      "data": [
        "<article class=\"post-52347 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini weekend update: May 21, 2016:  Learn how to trade failed candlestick patterns\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weekend update: May 21, 2016:<br>Learn how to trade failed candlestick patterns</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2016-05-20T10:08:28-07:00\">May 20, 2016</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart: Weak sell signal</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/05/m-3.png\"><img loading=\"lazy\" src=\"2016-5-20.png\" alt=\"S&amp;P Emini futures market analysis weekly report for May 21, 2016.  Those learning how to trade the markets see that the monthly sell signal triggered by this week falling below last month’s low, which was a reversal candlestick pattern on the monthly chart.\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart had a weak sell signal last month after a very strong rally. So far, the sell entry bar is also weak.<p>Regarding the monthly S&amp;P500 Emini futures candlestick chart, I have been saying since the end of April that May would probably trade below the April low, and it did this week. April broke above the top of a 2 year trading range to a new all-time high. Most trading range breakouts fail. April closed below its midpoint and it was therefore a<a href=\"https://www.brookstradingcourse.com/how-to-trade-manual/candlestick-charts/#setups-and-signals\" target=\"_blank\">sell signal bar</a>for the failed breakout on the monthly chart. Because February and March were strongly bullish and April had a bull body, the odds were that there would be more buyers than sellers below the April low, even though April was a sell signal bar.<p>There is still a week left to the month. That is enough time for a big move up or down. May could again fall below the April low and even get down to the bottom of the March bull trend bar, totally reversing that bull breakout. That is unlikely.<p>April was a small bar. May traded below the April low. May could continue up and trade above the April high. May would then be an outside up month, and that would be a sign of bull strength. What is most likely is that the Emini will continue to do what it has been doing for 2 months, and that is stay sideways. If so, May would end up being a small bar, just like April, and have no predictive value. Bulls would see it as a buy signal bar for the pullback from the April breakout to a new all-time high. Bears would see it as a micro double top with the April high. The micro double top would make them then conclude that the probability of a selloff was then a little higher if June fell below the May low.<h2>Weekly S&amp;P500 Emini futures candlestick chart: Bull flag</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/05/w-2.png\"><img loading=\"lazy\" src=\"2016-5-20-1.png\" alt=\"S&amp;P Emini futures market analysis weekly report for May 21, 2016. Those who trade the markets for a living see a 4 trading range at the moving average after an 11 week bull micro channel on the Emini weekly chart. \"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart has pulled back to the moving average after a strong rally. This bull flag is a 4 bar tight trading range, and this week is a weak buy signal bar. The Emini will probably be mostly sideways for at least another week.<p>The weekly S&amp;P500 Emini futures candlestick chart has been sideways for 4 weeks after breaking below an 11-week<a href=\"https://www.brookstradingcourse.com/how-to-trade-manual/trend-channels/#microchannels\" target=\"_blank\">bull micro channel</a>. No pullback to below the low of the prior bar for 11 weeks is a sign of strong bulls, but it is also unsustainable and therefore climactic. Once there is a pullback, it usually last 1 – 3 bars, and then the Emini resumes up to test the top of the micro channel.<p>The current pullback has lasted 4 weeks, which is getting long. This increases the chance of a bounce within the next 2 weeks, especially since the weekly chart is testing its 20 week EMA. Yesterday was a Friday and the week closed above the open of the week. This means that this past week was the 1st bull bar in the past 4 weeks. However, after 3 bear bars, the bulls will probably have to go sideways for a week or two before they can test up. Also, the weekly chart now has 3 dojis, which also increases the chances of at least a little more sideways trading.<p>The 11-week bull micro channel represents strong bulls. The odds still favor a test up within the next few weeks.<h2>Daily S&amp;P500 Emini futures candlestick chart: Learn how to trade failed candlestick patters</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/05/d-5.png\"><img loading=\"lazy\" src=\"2016-5-20-2.png\" alt=\"S&amp;P Emini futures market analysis weekly report for May 21, 2016. Online day traders saw a trend reversal up from a below a 2 month trading range. Thursday was a reversal candlestick pattern on the daily chart.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart is in a tight trading after a strong rally. The right should of the top only has 4 bars. This is small, and therefore likely will only lead to a minor reversal down in a trading range.<p>The daily S&amp;P500 Emini futures candlestick chart on Thursday fell below the bottom of its 2-month trading range and reversed up, but stalled at the 20 day EMA on Friday. It is trapped between the daily and weekly moving averages. Most trading range breakouts fail. However, Thursday was a weak buy signal bar because it had a small body. Also, the daily chart has been in a tight trading range for 2 months and that makes a big move up or down unlikely. The best indication of what the bars to the right will look like is the appearance of the bars to the left. The odds are that the trading range will continue.<p>It might continue up to the June FOMC meeting, which is important because it is probably the final chance for the Feds to raise rates before the election. This means that the Feds might be forced to raise rates earlier than the might want to avoid waiting to raise them longer than they might want. Although everyone says that the rate increase will result in a selloff, you always have to remember that the market probably has already factored in a rate hike. If so, the stock market could actually rally instead of selling off.<p>Those confident experts on TV do not have a clue. Their sole purpose is to attract eyeballs so that CNBC can collect advertising dollars. No one knows what will happen. Traders will just wait to see the reaction. If the market goes up, I will buy. If it goes down, I will sell. I don’t care about whether the Fred raises rates or not. All I care about is whether I can make money from the market going up or down, and I have to wait to see the reaction after the announcement to find out.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>, and a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>is available.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.</p></div></article>"
      ],
      "dateId": "2016-5-20"
    }
  ],
  "28": [
    {
      "data": [
        "<article class=\"post-52345 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini weekend update: May 28, 2016:  Price action shows bull trend resumption after small bull flag\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weekend update: May 28, 2016:<br>Price action shows bull trend resumption after small bull flag</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2016-05-28T00:30:07-07:00\">May 28, 2016</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart: Strong reversal up from sell signal</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/05/m-4.png\"><img loading=\"lazy\" src=\"2016-5-28.png\" alt=\"S&amp;P Emini futures market analysis weekly report for May 28, 2016.  Those learning how to trade the markets see that the monthly sell signal was bought, and this month’s candlestick pattern on the monthly chart will probably be an outside up bar.\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has one trading day left. The bulls have a 50% chance of turning May into an outside up month (with a low below April and a high above April) with a close at a new all-time high.<p>The monthly S&amp;P500 Emini futures candlestick chart triggered a sell signal in early April when May&nbsp;traded 1 tick below April’s low. I have written many times since late April that there would probably be more buyers than sellers below April’s low. The sell signal bar (April) had a bull body, and the reversal up in February and March was very strong. Also, the monthly chart has been in a strong bull trend for 7 years, since the 2009 low.<p>The correction over the past 2 years has had enough bars so that profit-taking bulls were getting confident that the chances of a 20% selloff and measured move down were getting small. They began to buy and quickly discovered that there were not many bears who were willing to sell. There is only 1 trading day left in May and the April high, which is the all-time high, is only about 8 points above Friday’s close. That is close enough so that the bulls could easily get above it on Tuesday, the final trading day of the month, and even close at an all-time high.<p>If the bulls do get a breakout to a new high, the odds of follow-through buying are greater if the breakout candlestick&nbsp;is big and closes far above the trading range and prior high. Also, if there is&nbsp;a series of consecutive big bull bars, the odds of a measured move up go up. The 2 year trading range is 300 points tall so the measured move target is around 2,400.<p>The bears see this 2 year trading range as a potential Double Top, or, if there is a bull breakout, a Final Bull Flag. They expect any bull breakout to fail and reverse back down. They want a relentless reversal that leads to a breakout below the 2 year range. If they get it, their target is a measured move down. That 300 point selloff would take the Emini down to second high of the double top from 2007, which is around 1500.<p>If May is an outside up month, traders have to be ready for a possibly<a href=\"https://www.brookstradingcourse.com/how-to-trade-manual/stop-orders/#ii-setup-and-ioi-setup\" target=\"_blank\">ioi setup</a>on the Monthly chart. This meas that June might be an inside bar. If so, then the 3 month pattern is a breakout mode setup. If June is a bear inside bar closing on its low, it would be a sell setup. It would the the 2nd sell signal for the failed breakout above the 2 year range (April was the 1st sell signal).<h2>Weekly S&amp;P500 Emini futures candlestick chart: Price action shows bull trend resumption after small bull flag</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/05/w-3.png\"><img loading=\"lazy\" src=\"2016-5-28-1.png\" alt=\"S&amp;P Emini futures market analysis weekly report for May 28, 2016. Those who trade the markets for a living see price action by the bulls, who are getting a breakout above a 4 bull at the moving average after an 11 week bull micro channel on the Emini weekly chart. \"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart had a 4 week tight trading range at the moving average, which is a weak bull flag. However, this week’s breakout was strong, and the bulls will try for a new all-time high next week.<p>The weekly S&amp;P500 Emini futures candlestick chart had a 4 week pullback from an 11 bar bull<a href=\"https://www.brookstradingcourse.com/how-to-trade-manual/trend-channels/#microchannels\" target=\"_blank\">micro channel</a>. Most bear breaks below strong bull micro channels like this usually fail with 3 weeks and become a bull flag. Here, the bull flag lasted 4 weeks and was filled with dojis. This usually results in further sideways trading. Instead, it was followed by a strong bull breakout this week.<p>When there is a bear breakout below a bear channel and then a trend resumption up, the rally usually fails within about 5 bears. The bull micro channel is a buy climax, and a buy climax is usually followed by a trading range. It is too early to know if that will happen here. At the moment, there is probably about a 50% chance of a trading range withing the next 4 weeks or so, even if there is 1st a strong 5 bar rally. Remember, the Fed might raise interest rates in June or July, and that could result in several weeks of selling.<p>Can the breakout be big and relentless like the 1995 bull breakout on the monthly chart? That is not likely after an 11 bar bull micro channel, which is a buy climax, but traders will buy as the market goes up until there is evidence that the breakout has ended.<h2>Daily S&amp;P500 Emini futures candlestick chart: Strong bull breakout, testing all-time high</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/05/d-6.png\"><img loading=\"lazy\" src=\"2016-5-28-2.png\" alt=\"S&amp;P Emini futures market analysis weekly report for May 28, 2016. Online day traders saw a trend reversal up from a below a 2 month trading range. There is a bull breakout candlestick pattern on the daily chart. \"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart broke strongly above a 4 week, 2 legged bear channel (High 2 bull flag). The breakout was strong enough so that the 1st reversal down will probably be bought. The odds are that the Emini will reach a new all-time high next week.<p>The bulls are trying to get Tuesday, the final day of May, to close above the April high, which is the all-time high. If they succeed, and Tuesday is a big bull trend bar that closes far above April on the daily and monthly charts, and there is strong follow-through buying, the odds of a strong rally from there go up.<p>The Emini has been in a trading range for 2 years. One of the hallmarks of a trading range is disappointment. This means that the odds are, the bulls will be at least a little disappointed once May closes on Tuesday. For example, Tuesday might break to a new all-time high, but then close below the April high. The bulls want the character of the market to change to that of a strong bull breakout. Markets have inertia. This makes it more likely that they bulls will not get all of the signs of strength that they hope to get, and they will be disappointed.<p>The daily S&amp;P500 Emini futures candlestick chart was in a bear channel for the past month. It had 2 legs down, and the 2nd leg fell below the bottom of the 2 month trading range. This was followed by a strong reversal up. The 2 legs down created a High 2 bull flag. There is also a lower low double bottom with the April low (the April 7 low).<p>The rally of the past 4 days has been strong enough to show everyone that the bulls are very eager to buy. When they are buying at the high of every day, they are usually very eager to get a chance to buy below the low of the prior bar. This means that the odds are that the 1st pullback will be bought. The bears will probably need at least a micro double top if they are going to get a swing down. Strong rallies are usually not followed by strong selloffs. The market usually has to go sideways for at least a few bars first.<p>The bears are hoping for a major trend reversal with the April 20 all-time high. They know that they are taking a low probability trade by selling here, but the risk is small. They will exit 10 – 20 points&nbsp;above the all-time high. The reward is very big. They want a bear breakout below the 2 year range and a measured move down to around 1800. This strong<a href=\"https://www.brookstradingcourse.com/how-to-trade-manual/traders-equation/#trade-off-between-probability-and-risk-reward-ratio\" target=\"_blank\">risk/reward</a>more than offsets the low probability of success.<p>Whenever a market tests any major resistance, traders watch the price action carefully. Will the rally suddenly stall and evolve into a tight trading range? If so, bulls will begin to take profits and bears will sell. The bears want a swing down from the top of the 2 year trading range. This could result in a double top with the April 7 all-time high (a double top major trend reversal). However, the odds of that leading to a swing down are only 40%. There is a 60% chance that the reversal down&nbsp;will be bought.<p>The bulls want a strong bull breakout and a measured move up. The breakout usually happens in one of two ways. First, there can be 1 – 5 big bull trend bars closing near their highs. This is a strong bull breakout. The further the breakout bar closes above prior resistance (like the old all-time high) and the smaller the tail on top of the bull breakout, and the more consecutive bull trend bars that follow, the more likely the rally will be followed by a measured move up.<p>The 2nd common type of successful bull breakout begins slowly with a series of 2 – 5 small bull trend bars closing near their highs. Once a critical mass of small bull trend bars is reached, bulls and bears suddenly decide that the bulls are winning and therefore higher prices are likely. The bulls sell out of their longs, and bears buy aggressively, betting on a measured move up after the breakout. This the results in a delayed breakout bar, but the odds of a measured move up are then still good.<p>Whenever something looks especially obvious (high probability), traders have to be ready for a Pain Trade, which is the exact opposite of what the market apparently so clearly wants to do. If there is a strong reversal down, those who trade the markets for a living will not be in denial. They will sell. Bulls should get out quickly because the selloff could be fast and last a lot of bars. If the bulls hold, denying what is in front of them, they can lose a lot of money.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>, and a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>is available.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.</p></div></article>"
      ],
      "dateId": "2016-5-28"
    }
  ]
}