{
  "1": [
    {
      "data": [
        "<article class=\"post-58471 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"October 5% correction before presidential election Emini weekend update: October 1, 2016\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">October 5% correction before presidential election<br>Emini weekend update: October 1, 2016</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2016-10-01T00:30:51-07:00\">October 1, 2016</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>October 5% correction before presidential election</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/10/m.png\"><img loading=\"lazy\" src=\"2016-10-1.png\" alt=\"The monthly sp500 emini has a sell climax and there will be an october correction\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart had a bear bar in September. After 7 consecutive bull trend bars, this therefore ends the buy climax.<p>After 7 consecutive bull trend bars, the monthly S&amp;P500 Emini futures candlestick chart finally had a bear body in September. While it was only a bear doji, it marked the end of the buy climax. In the 18 year history of the Emini, there have been several other times when there were 7 consecutive bull trend bars. Each one was soon followed by about a 100 point correction. The odds therefore are that the Emini will fall about 100 points in October or November.<p>Because this month was a pullback, it is a High 1 buy signal bar for October. Since there are consecutive dojis, the buy setup is weak. This increases the chances that the breakout will not go far before failing. This is the monthly chart’s version of the wedge on the weekly chart. While a 3rd push up is likely, it will also probably lead to a reversal. Because the monthly chart is so bullish, the reversal will probably be minor. Yet a couple of months and 100 points down would be a major reversal on the daily chart.<h3>Trading a possible 100 point correction</h3><p>While the bulls have a 40% chance of a bull breakout to a new all-time high before the correction, the odds remain at 70% that the correction will come. As a result, bears will look to sell strong rallies over the next few weeks. They therefore will bet that bull breakout attempts will have disappointing follow-through.<p>Furthermore, they are confident that one of the reversals will fall for about 100 points. While some will try to swing trade every entry, many traders will take quick profits on most or all of their positions. Rather than risking many trades with no profit, they will try to take at least some profit on every trade.<h3>The bull case</h3><p>While perennial bull Tom Lee is regularly on Fast Money and he was on this week again saying that the correction is over, he is basing his prediction on fundamentals and not charts. The stock market has been in a bull trend for 7 years and many traders will continue to buy every pullback until the market is clearly in a bear trend.<p>Because that strategy has been very good for years, bulls have a good reason to be sanguine. They therefore expect that the current breakout will rally 300 points. This is the Measured Move up based on the height of the 2 year trading range.<p>The bulls see the past 2 months as a brief bull flag. They are aware that the rally from the July low is in a Parabolic Wedge and has had 2 legs up. Yet, the believe that there will be at least one more leg up.<h3>The gap above the 2 year trading range</h3><p>A gap is a space between support and resistance. A traditional gap is one example, and many traders believe it is the only type of gap. A trader who believes that is missing much of what the market it saying. The gap on the monthly chart is the space above the 2 year trading range and the September low.<p>Strong trends commonly create gaps. Yet, when a trend forms a gap in a trend that has gone 20 or more bars without a significant pullback, the odds are that the gap will soon close. It would therefore become an Exhaustion Gap.<p>The monthly chart broke above a 2 year trading range in a bull trend that has lasted about 100 bars. Hence, it is more likely that the gap will close than become a Measuring Gap.<p>How far can the rally continue before closing the gap? There is a 70% chance that the gap will close before the bulls reach their measured move target around 2400.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Wedge Top or Lower High Major Trend Reversal</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/10/w.png\"><img loading=\"lazy\" src=\"2016-10-1-1.png\" alt=\"the weekly emini sp500 stock market chart is forming a wedge top\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart is forming a topping pattern. A reversal down from here would be a Lower High Major Trend Reversal, while a reversal from a new high would create a wedge top.<p>The weekly S&amp;P500 Emini futures candlestick chart is in a strong bull channel. Yet, the channel has a wedge shape and it is follows a 2 year trading range after a 7 year bull trend. This rally is more likely the final leg before a correction than it is the start of a new leg up. Because traders know the risk of a top in this environment is high, they will look to sell a reversal down from a new all-time high. Hence, the reversal would create a wedge top.<h3>Wedge top where the 3rd leg up is a lower high</h3><p>As a result of traders looking to sell a new high, many traders wonder if the Emini might not quite reach a new high. Hence, many will begin to sell the rally to the new high, and plan to sell more on a reversal down from a new high. No one knows yet how many traders are doing this. If enough do it with enough volume, the Emini will turn down from below the old high. While the top would then be either a Double Top or a Lower High Major Trend Reversal, the forces would be the same as in a Wedge Top. Therefore, the top would be a type of Wedge Top, despite having a lower high on the 3rd leg up<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>October correction from Wedge Bear Flag</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/10/d.png\"><img loading=\"lazy\" src=\"2016-10-1-2.png\" alt=\"daily emini stock market chart is forming wedge lower high trend reversal for an october correction\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart is forming a Wedge Bear Flag after a strong selloff 4 weeks ago. The bulls want a bull breakout above the bear flag. The bears want a bear breakout. The Emini is therefore in Breakout Mode.<p>While the Emini daily S&amp;P500 Emini futures candlestick chart had a double top major trend reversal from the August 15 and 23 tops, and a strong bear breakout on September 9, it has rallied since then. Yet, the rally has lacked consecutive big bull trend bars, and most of the bars are overlapping. This is more common when a rally is part of a trading range or a bear flag. While the bulls can still get a bull breakout above this bear flag, the odds still slightly favor the bears.<p>There are two reasons why the bears have an edge. The first is that the bear breakout was unusually big, and the bulls have failed to rally strongly above its high.<h3>The importance of a tight trading range</h3><p>The 2nd reason is arcane. Traders tend to dismiss tight trading ranges as noise. Only a lazy fool believes that the stock market has periods of noise.<p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/10/es-TTR.png\"><img loading=\"lazy\" src=\"2016-10-1-3.png\" alt=\"tight trading range double top reversal in emini\"></a><p class=\"caption\">This is an example of a double top within a tight trading range on the 5 minute chart from 2014. There was a strong bull trend and then a tight trading range. After a small double top within the range, there was a bear breakout. The 2nd leg down was very big and fast.<p>When there is a double top reversal in a tight trading range, as there was in August, the Emini usually has 2 legs down. Furthermore, the 2nd leg is often shockingly big and fast. Was the September 9 bear day that 2nd, fast bear leg? It might have been. Yet, this is not clear. Therefore, traders must be open to the possibility that the selloff was the end of a complex 1st leg down. As a result, the current 3 week rally would be the pullback from the 1st leg. If this this the case, and the odds slightly favor this scenario, then the 2nd, shockingly fast, but brief, 2nd leg will come in the next few weeks.<p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2016-10-1"
    }
  ],
  "8": [
    {
      "data": [
        "<article class=\"post-58722 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Brief October selloff then new all-time high Emini weekend update: October 8, 2016\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Brief October selloff then new all-time high<br>Emini weekend update: October 8, 2016</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2016-10-08T00:30:24-07:00\">October 8, 2016</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Buy climax</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/10/m-1.png\"><img loading=\"lazy\" src=\"2016-10-8.png\" alt=\"Monthly Emini chart is weak bull flag and buy climax\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart is forming its 3rd consecutive doji bar. While this is a small bull flag, it is a weak buy setup and there are probably sellers above.<p>The monthly S&amp;P500 Emini futures candlestick chart had 7 consecutive bull trend bars prior to September. Every time that has happened in the 18 year history of the Emini, the Emini sold off about 100 points within a month or two. Hence, the probability of a big bull breakout from here is small.<p>Furthermore, last month’s low created a gap above the 2 year trading range. Since this gap formed after about 100 bars in a bull trend, it is more likely an exhaustion gap than a measuring gap. Therefore, the odds are that the Emini will drop back below the July 2015 high of 2084.50 before going much above the all-time high. Because the bull trend has been so strong, the odds are that the 1st reversal down will attract buyers. As a result, the bulls will likely get their new high.<p>In conclusion, the odds favor a new high and a pullback below 2084.50. Yet, traders do not know which will come first. Whichever one does will create a high probability setup for a test of the other.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Both a potential wedge top and an exhaustion gap.</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/10/w-1.png\"><img loading=\"lazy\" src=\"2016-10-8-1.png\" alt=\"emini candlestick pattern is bull flag\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart has an ii pattern. It is deciding between rallying to a new high and selling off to close the gap above the July 2015 high. It will probably do both, yet no one knows which will come first.<p>The weekly S&amp;P500 Emini futures candlestick chart has had strong momentum up since the July low. Yet, the August pullback created a gap above the 2 year trading range high. When a breakout late in a trend creates a gap, there is a 70% chance that the gap will close, and only a 30% chance that it will lead to a measured move up. Therefore, the Emini is more likely to fall below 2084.50 before reaching the 2400 measured move target.<p>Because there was a strong bear breakout in early September, the weak rally since then is a bear flag. Yet, once a bear flag grows to 20 bars, the odds of a bear breakout drop to the same as for a bull breakout. That is the current Breakout Mode situation.<p>As much as this is true, the bulls might get one more new high before the gap closes. If there is a new high and a reversal down, that would be a wedge top since the February low. The odds would then favor about a 10 bar, 2 legged correction on the Emini chart. The target would be the 1st pullback on the daily chart after the strong reversal up. This is the July 6 low of 2059.25. As a result of that test, the monthly chart would have its correction of about 100 points.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Brief October selloff then new all-time high</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/10/d-1.png\"><img loading=\"lazy\" src=\"2016-10-8-2.png\" alt=\"emini triangle candlestick patter so breakout soon\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart has been in a triangle for 3 weeks and is therefore in Breakout Mode.<p>The daily S&amp;P500 Emini futures candlestick chart has a small double top in the August tight trading range. This lead to a brief strong selloff in September, and a month-long weak rally. Hence the bear flag of the last month has an equal probability of bull breakout and a bear breakout. Traders expect that if there is an October selloff, it will probably be brief and then lead to a new all-time high.<h3>October selloff</h3><p>October often sells off into the middle of the month and then rallies to the end of the year. That can still happen this year because the monthly chart has a buy climax that will probably correct down about 100 points at any point in October or November. Because the odds are that bulls will buy the pullback and create a rally to a new all-time high, bears should be careful selling too low in the breakout. The odds are there will be more buyers than sellers 100 points down from the high.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2016-10-8"
    }
  ],
  "15": [
    {
      "data": [
        "<article class=\"post-59033 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Weak October stock market rallyEmini weekend update: October 15 2016\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Weak October stock market rally<br>Emini weekend update: October 15 2016</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2016-10-15T00:30:00-07:00\">October 15, 2016</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Pullback for 2nd month</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/10/m-3.png\"><img loading=\"lazy\" src=\"2016-10-15.png\" alt=\"monthly emini candlestick chart shows bear trend bar\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart traded below last month’s low and therefore has pulled back for 2 months. While the bears see August as a Low 2 sell signal bar, it was a doji. It was therefore a low probability sell. This is especially true after 7 consecutive bull trend bars.<p>The monthly S&amp;P500 Emini futures candlestick chart is still in a bull trend, but the trend is climactic. Yet, the 2 year trading range will probably be the Final Bull Flag. As a result, the current bull breakout will probably be unable to go far before the Emini reverses back down into the 2 year range.<p>A trading range is a magnet. Because the breakout has not gone far, the Emini is still being held back by the magnetism of the trading range. While the bulls can create a much stronger breakout and move up for a measured move, they have given no sign that they are about to do that. Therefore, it is more likely that the Emini returns to the trading range than continues much higher.<p>Because the rally since July is in a tight channel and there have been 2 legs up, traders will probably sell a rally to a new high. They would do so because they know that a reversal down would create a Parabolic Wedge top above a likely Final Flag. There would be a 60% chance of at least a couple small legs down after a reversal.<h3>Exhaustion Gap or Measuring Gap?</h3><p>Last month was the entry bar for the bears, yet it was also a doji bar. Hence, it was another sign that the bears are not yet strong. While this month is the 2nd month of the pullback, it is not yet a big bear trend bar. The bears need to do more to close the gap above the July 2015 high of 2084.50. Because that gap formed late in a bull trend, the odds are that it is an Exhaustion Gap rather than a Measuring Gap. As a result, the Emini will probably close it before it can go much above the all-time high.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Break below ii lower high</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/10/w-2.png\"><img loading=\"lazy\" src=\"2016-10-15-1.png\" alt=\"weekly emini candlestick chart  sell entry bar\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart broke below the ii pattern of the past 2 weeks and bull trend line, yet closed back around the breakout point.<p>The weekly S&amp;P500 Emini futures candlestick chart has had 2 strong legs up from the February low. As a result, traders will look to sell a reversal down from a new high. They would see the entire rally as a wedge higher high major trend reversal after the 2 year trading range. Furthermore, they would see September as the Final Bull Flag.<p>Because the breakout above the 2 year trading range did not go far, the reversal down might have already begun. Yet, without one or two big bear bars closing on their lows, most traders believe that a continued trading range is more likely than a breakout up or down.<h3>High 2 bull flag</h3><p>While the bears are looking for a climactic top, the bulls see the past month as a High 2 buy setup. They bought below the September low, expecting a failed breakout and a lower low double bottom. While they might be right, they need to do more. Because this week had a bear body, it is a low probability buy signal bar. Yet, if the bulls can create a bull bar next week, traders will be more interested in buying above its high. This is especially true if next week is a bull bar closing on its high.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Weak October stock market rally and risk of sharp selloff</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/10/d-2.png\"><img loading=\"lazy\" src=\"2016-10-15-2.png\" alt=\"daily emini candlestick cahrt has low 1 sell setup\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart reversed up Thursday after breaking below the bottom of the 2 month trading range. Yet, the reversal bar had a big tail and Friday was a weak entry bar.<p>The daily S&amp;P500 Emini futures candlestick chart pulled back from a breakout below the September low and the bull trend line. The bulls want the reversal up to be the end of the 2 month pullback. Yet, without a strong buy signal bar or entry bar, the odds are that it will go sideways for at least a couple more days. If it then falls below this week’s low, the September support would fail. As a result, there could be a fast measured move down.<h3>Bear flag or failed bear breakout?</h3><p>The bears see the weak reversal up and believe it is just a brief pullback from the breakout below the September low. Yet, the pullback had a reasonably strong bull body on Thursday. This increases the chances of a few more sideways bars. As a result, the Emini might create a Low 2 bear flag next week.<p>If it does, the bears will sell the bear breakout below the flag or below this week’s low. The bulls will buy below the Low 2 sell signal bat. This is because they believe that the bears will fail. They then want a bull breakout above the bear flag, and then a measured move up.<p>In conclusion, because the bears did not create a strong breakout and the bulls did not create a strong reversal up, the odds are that the Emini will go sideways for at least a couple more days.<h3>Risk of brief big bear breakout</h3><p><a href=\"https://www.brookstradingcourse.com/analysis/october-5-correction-before-presidential-election/\" target=\"_blank\">I wrote a couple of week’s ago</a>about a subtle, but important pattern that is unfolding on the daily chart. If you scroll to the bottom of that weekly update, you will see an example on a 5 minute chart. The daily chart had a double top in a tight trading range. The September selloff might be just the 1st of 2 legs down. If so, the 2nd leg can be shockingly big and fast.<p>Therefore, this means that there is a 40% chance of a 50 – 100 point selloff lasting 2 – 5 days starting within the next week or so. Bulls usually buy the selloff. As a result, the rally could then last to the end of the year and make a new all-time high. Since the monthly chart is probably topping out, bears will sell the new high. Hence, the overbought monthly chart might begin a sideways to down correction that could last for a couple of years.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2016-10-15"
    }
  ],
  "22": [
    {
      "data": [
        "<article class=\"post-59438 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Presidential election stock market rally or reversalEmini weekend update: October 22, 2016\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Presidential election stock market rally or reversal<br>Emini weekend update: October 22, 2016</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2016-10-22T00:30:21-07:00\">October 22, 2016</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Continued pullback after buy climax</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/10/m-4.png\"><img loading=\"lazy\" src=\"2016-10-22.png\" alt=\"Monthly Emini bull flag\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has a small bear body after 2 dojis. This is weak follow-through buying after the July breakout above a 2 year trading range.<p>The monthly S&amp;P500 Emini futures candlestick chart has a bear doji so far this month. Because it traded below last month’s low, it is now the 2nd month of the pullback. Yet, without a strong reversal down, the odds are that bulls will buy the pullback.<h3>Buy climax</h3><p>The monthly chart had 7 consecutive bull bodies through August. Since that is unusual, it is climactic. Each time it happened in the 18 year history of the Emini, it led to about a 100 point correction over the next few months. Therefore the odds favor more selling.<h3>Exhaustion Gap more likely than Measuring Gap</h3><p>Furthermore, the gap above the July 2015 is still open. When a gap forms more than 20 bars into a trend, the odds are it will close. This gap is about 100 bars into the bull trend. The odds are 70% that it will close before the Emini goes much above the old high. What traders do not yet know is if the gap will close over the next few weeks, or after a new high. There is a 60% chance that it will close over the next few weeks.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Doji ioi above moving average so Presidential election stock market rally or reversal</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/10/w-3.png\"><img loading=\"lazy\" src=\"2016-10-22-1.png\" alt=\"Emini ioi bull flag \"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart formed a bull doji inside bar this week. Because last week was an outside bar, this is an ioi Breakout Mode pattern.<p>The weekly S&amp;P500 Emini futures candlestick chart formed a small doji inside bar this week. It is therefore neutral. In addition, it has been in a tight trading range for 7 weeks. This is a further sign of the neutrality.<p>The bulls see this week as a buy signal bar for a double bottom bull flag. They will therefore buy next week if next week goes above this week’s high.<p>The bears see this week as a pullback from last week’s bear breakout. They will therefore sell below this week’s low.<p>While both the bulls and bears are correct, the tight trading range lowers the probability of their trades. A tight trading range is a limit order market. Therefore the odds are that there are sellers above and buyers below. Hence, the Emini is more likely to remain within the tight trading range.<h3>Wedge rally or lower high?</h3><p>If the bulls rally above this 7 week double bottom bull flag, they would probably reach a new high. Yet, that high would be the 3rd push up. Bears would therefore sell a reversal down from the wedge top. Furthermore, the 2 year trading range broke below the 7 year bull channel. Therefore, traders would see the reversal down as a Final Flag Top and a Higher High Major Trend Reversal. Most major reversals go sideways. Only 40% lead to an actual opposite swing. Yet, traders need to be ready because the reversal down can be fast, and therefore easy to miss.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>8 day tight trading range</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/10/d-3.png\"><img loading=\"lazy\" src=\"2016-10-22-2.png\" alt=\"Apex if Emini triangle and nested tight TRs.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart has been in a tight trading range below the moving average for 8 days. It is therefore in Breakout Mode.<p>The daily S&amp;P500 Emini futures candlestick chart is still in its 8 day tight trading range. Hence, there is a 50% chance of a bull breakout or a bear breakout. Furthermore, there is a 50% chance that the 1st breakout will fail and lead to a breakout in the opposite direction.<p>Trading ranges always have both credible buy and sell setups. While the bears see a Micro Double Top, the bulls see a Micro Double Bottom. Friday closed on its high. It is therefore a buy signal bar for Monday. Yet, the probability of a breakout is still low. The bulls need a strong break above the moving average and the double top at the top of the 8 day range. Otherwise, the trading range will continue.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2016-10-22"
    }
  ],
  "29": [
    {
      "data": [
        "<article class=\"post-59714 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Presidential election stock market correction or rallyEmini weekend update: October 29, 2016\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Presidential election stock market correction or rally<br>Emini weekend update: October 29, 2016</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2016-10-29T00:30:31-07:00\">October 29, 2016</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Stock market presidential election pullback</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/10/m-5.png\"><img loading=\"lazy\" src=\"2016-10-29.png\" alt=\"monthly emini exhaustion gap before presidential election\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart dipped below the September low. It is therefore the 2nd month of the pullback. Yet, it is a small bar following 2 dojis, and therefore neutral.<p>The monthly S&amp;P500 Emini futures candlestick chart is in a bull trend. October closes on Monday, and the month will probably be the 3rd consecutive small bar after a breakout to a new all-time high. This is not how strong breakouts typically behave. It therefore increases the chances of lower prices. Furthermore, it has a bear body after 2 dojis. Hence, the bears are a little stronger. In addition, if November trades below October’s low, it would be the 3rd consecutive month with lower lows.<p>Most noteworthy is that these lows are still above the July 2015 high. There is therefore a gap. The bull trend has lasted more than 100 bars. Hence, the gap is late in the trend. Because it is late, it is more likely an Exhaustion Gap than a Measuring Gap. As a result, the odds are the it will close before the Emini rallies for a Measured move up.<p>The bull case is especially relevant because the monthly chart is still in a bull trend. While a rally to a new high probably will fail, there is a 40% chance that it would be the start of another strong leg up.<h3>The next 3 years</h3><p>The bond market is putting in a high for the next 20 years. While there still could be one more brief new high, there are nested wedge tops on the monthly chart. This is enough for traders to conclude that an reliable top is in.<p>The Emini has a Final Bull Flag on the monthly chart. Yet, there is no credible reversal down yet. The bulls might get one more push up and create a parabolic wedge top first. If the bears get their reversal, the first target is the bottom of the final flag. This is the 1800 bottom of the 2 year trading range.<p>The bulls will probably buy the bottom of the trading range. Yet, because the Final Flag is a major top, the odds are that the bears will sell the rally and create a lower high. At that point, there would be a Head and Shoulders top where the left shoulder is the 2015-2016 trading range. As a result, the monthly chart would be in Breakout Mode. The bulls would see a double bottom at 1800. The bears would see a Head and Shoulders top. If the bears then got their breakout, a 300 point measured move would test the monthly double top at around 1500.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Failed buy signal</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/10/w-4.png\"><img loading=\"lazy\" src=\"2016-10-29-1.png\" alt=\"weekly emini in triangle before presidential and congressional election breakout\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart traded above last week’s high, triggering a buy signal. Yet, it reversed down strongly and traded below last week’s low. It was therefore an outside down bar.<p>The weekly S&amp;P500 Emini futures candlestick chart traded up from a double bottom bull flag 2 weeks ago. But, the reversal up last week was weak. Furthermore, this week was a strong bear bar. While the 8 week trading range is still above the moving average, there have been several big bear bars. Because this week was an outside down week, it was a sign of strength for the bears.<p>Most noteworthy is the gap between the bottom of the double bottom and the July 2015 top of the 2 year trading range. This therefore is the same problem that the monthly chart has. The gap is too late in the bull trend. It is therefore more likely to close than to lead to a measured move up.<p>While the bulls realize that a new high could create a wedge top, they are still willing to buy unless the bears break below the 2 month double bottom. Their risk is small compared to their reward, and their probability is at least 40%. This means that the Trader’s Equation is still good for the bulls. As is always the case, when one side has good risk/reward, the other side has higher probability.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Bear flag below the moving average</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/10/d-5.png\"><img loading=\"lazy\" src=\"2016-10-29-2.png\" alt=\"daily emini candlestick pattern is triangle\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart continues to fail to get above the moving average. Yet, the bears have been unable to break strongly below the 7 week triangle or the 3 week tight trading range.<p>The daily S&amp;P500 Emini futures candlestick chart broke below a bear flag this week. Most noteworthy is that the bear flag was below the moving average. This increases the chances of a measured move down. Yet, the Emini is still above the September-October double bottom low. If the bears break below the October low, the odds are that it would fall below the July 2015 high of 2084.50. In addition, it would probably test the July 6 pullback low. Buyers might not come back until 2040 – 2050.<p>I have written about this many times over the past 2 months. If there is a selloff, it could be very fast. Hence, it could fall 50 – 80 points in 2 – 5 days. Yet, it would still be a pullback on the monthly chart and bulls wold look to buy the selloff.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2016-10-29"
    }
  ]
}