{
  "2": [
    {
      "data": [
        "<article class=\"post-55125 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Reversal Emini candlestick pattern Emini weekend update: July 2, 2016\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Reversal Emini candlestick pattern<br>Emini weekend update: July 2, 2016</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2016-07-02T00:30:41-07:00\">July 2, 2016</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Hesitation at the all-time high</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/07/m.png\"><img loading=\"lazy\" src=\"2016-7-2.png\" alt=\"S&amp;P Emini futures market analysis weekly report for July 2, 2016.  Those learning how to trade the markets see that this month’s candlestick pattern on the monthly chart is formed a bull doji. \"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart had a doji candlestick pattern in June after 2 small sideways months. Although there have been 5 consecutive bull months, the bears have been able to prevent a strong breakout.<p>The monthly S&amp;P500 Emini futures candlestick chart started a new month on Friday. June ended on Thursday and it was an outside month, trading both above and then below May’s range. Yet, it only had a doji body. This is bullish, but the Emini is also at the top of its 2 year range. Hence, despite 5 consecutive months with bull bodies, the bulls have not yet been strong enough to get a strong breakout.<p>The cash index is 32 points below its all-time high from July 2015. The momentum up is strong so it will probably get close to its all-time high. As a result, the Emini will also rally. The Emini is only 14 points below its all-time high, which formed last month. Consequently, if the cash index gets very close to its all-time high, the Emini will make a new all-time high. This is likely this summer. Yet, most breakouts fail so there is only a 40% chance that the breakout will go far before the Emini reverses back into the range.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Strong bull reversal, but still within trading range</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/07/w.png\"><img loading=\"lazy\" src=\"2016-7-2-1.png\" alt=\"S&amp;P Emini futures market analysis weekly report for July 2, 2016. Those who trade the markets for a living see a huge bull reversal candlestick pattern on the weekly chart.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart had a huge bull reversal bar last week. However, it is within a 3 month tight trading range. This context makes more sideways trading likely.<p>The weekly S&amp;P500 Emini futures candlestick chart created a huge bull reversal bar during the past week. However, the Emini is just below the top of its 3 year range. Buying at the top of a trading range is a low probability way to trade. As a result of the past week being a big bar, bulls who buy above it next week have a lot of risk. They will put their stop below last week’s low.<p>Think about this. Stop entry bulls have low probability and big risk. That means that buying on a stop above last week’s high will probably result in a loss. Consequently, limit order bears who sell above last week’s high and manage their trades well will probably make money.<h3>Context</h3><p>This is a good example of the importance of context. Here, there is a good buy candlestick pattern. Yet, the bar is forcing traders to take a low probability buy that has big risk. The big risk is due to the bars to the left, which is what I mean by context. Especially relevant here is that traders need context in addition to a candlestick pattern.<p>Can the buy above last week’s high be profitable? Of course, but that does not mean it is a profitable strategy. While a trade can be profitable, traders need to know if they will make money taking a similar trade 10 – 20 times. That is the problem here. More likely, next week will be sideways whether or not it triggers the buy signal by going above last week’s high.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Reversal Emini candlestick pattern</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/07/d.png\"><img loading=\"lazy\" src=\"2016-7-2-2.png\" alt=\"S&amp;P Emini futures market analysis weekly report for July 2, 2016. Online day traders saw a Big Down, Big Up bull reversal candlestick pattern on the daily chart.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart had 3 big bull trend bars this past week. Friday was a fourth, but less strong. The rally totally reversed the prior week’s selling. A Big Down, Big Up candlestick pattern usually leads to a trading range for at least a few bars.<p>The daily S&amp;P500 Emini futures candlestick chart had 3 big bull trend days this past week. Friday was a smaller bar that did not close on its high. The selloff and rally of the past 2 weeks is a Big Down, Big Up candlestick pattern. As a result, traders are confused. Consequently, they are quick to take profits. If neither bulls nor bears will hold onto positions, the legs up and down will be small. Hence, a trading range begins to form. This is likely next week.<h3>Last week of June usually bullish</h3><p>I mentioned last week that the final week of June until July 5 is one of the most reliably<a href=\"https://www.brookstradingcourse.com/how-to-trade-manual/price-action-genetically-based/#seasonal-tendencies\" target=\"_blank\">bullish times of the year</a>. This past week was exceptional. By inference, you can correctly conclude that the bullishness ends around July 5. When a market is bullish and then it is not, it probably is then in a trading range. This is especially likely after such a strong rally.<p>While it is possible that this coming week will be comparably strongly bulls and break out strongly, the odds are against it. The stop for the bulls is below last week’s low. That is far. When the risk is big, bulls have to reduce risk. The 1st thing that they do is reduce the size of their position. Consequently, a their selling some of their longs creates a pullback. That is likely what traders will see for several days next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>, and a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>is available.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.</p></div></article>"
      ],
      "dateId": "2016-7-2"
    }
  ],
  "9": [
    {
      "data": [
        "<article class=\"post-55371 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"New all time high breakout Emini weekend update: July 9, 2016\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">New all time high breakout<br>Emini weekend update: July 9, 2016</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2016-07-09T00:30:51-07:00\">July 9, 2016</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>New all time high breakout</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/07/m-1.png\"><img loading=\"lazy\" src=\"2016-7-9.png\" alt=\"S&amp;P Emini futures market analysis weekly report for July 9, 2016.  Those learning how to trade the markets see that this month’s candlestick pattern on the monthly chart is a strong bull breakout to a new all-time high. \"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart had a new all-time high breakout. While the month has a long time before it closes, its current close is at a new high. The bulls need a strong close at the end of July. Furthermore, they need follow-through buying in August.<p>The monthly S&amp;P500 Emini futures candlestick chart is at a new all-time high, and the current close is above last month’s high. It is still early in the month. The bulls want this month’s close to be far above last month’s high. Furthermore, they want this month to close on its high.<p>While the bulls want a strong<a href=\"https://www.brookstradingcourse.com/price-action/10-best-price-action-trading-patterns/#breakouts\" target=\"_blank\">breakout</a>, the bears always want the opposite. Although they do not want the Emini to be at a new high, they will still be happy if they can create a reversal. They want July to close on its low and to be a big bear trend bar. At a minimum, the want July to not be a big bull trend bar. Even if July is strong, the bears will try to create bad follow-through in August.<p>At the moment, the bulls are in control and there is no sign of a top. This is the 6th consecutive bull month. Hence, the bulls are strong and they will buy a reversal down.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Strong entry bar for a bull breakout</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/07/w-1.png\"><img loading=\"lazy\" src=\"2016-7-9-1.png\" alt=\"S&amp;P Emini futures market analysis weekly report for July 9, 2016. Those who trade the markets for a living see a big bull trend bar for the entry bar as the candlestick pattern on the weekly chart. \"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart had a buy signal bar 2 weeks ago. This past week was a strong entry bar for the bulls.<p>The weekly S&amp;P500 Emini futures candlestick chart 2 weeks ago created a<a href=\"https://www.brookstradingcourse.com/how-to-trade-manual/candlestick-charts/#setups-and-signals\" target=\"_blank\">buy signal bar</a>. However, the bar was very big. Therefore, the risk for the bulls buying above it high was big. Hence, they had to trade very small. While Thursday’s breakout above the high triggered the buy signal, there bears created a deep pullback immediately afterwards.<p>The bulls once again broke above the buy signal bar high on Friday. They were strong enough to close the week at a new all-time high. While next week could be a bear bar and therefore represent bad follow-through buying, the odds favor higher prices over the next few weeks. The bears need a strong reversal down next week or the week after. Without that, the bulls might reach a measured move up based on the 100 point height of the 4 month trading range.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>New all-time high breakout</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/07/d-1.png\"><img loading=\"lazy\" src=\"2016-7-9-2.png\" alt=\"S&amp;P Emini futures market analysis weekly report for July 9, 2016. Online day traders saw a breakout to a new all-time high as the candlestick pattern on the daily chart. \"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart broke to a new all-time high. It also closed at a new high. Yet, if the breakout fails, the reversal will create an Expanding Triangle Top.<p>The daily S&amp;P500 Emini futures candlestick chart gapped up and rallied to a new all-time high today. It also closed at a new all-time high and consequently created a sign of strong buying pressure. The odds favored at least a small 2nd leg up after the strong bull reversal 2 weeks ago. While it is possible that today was the end of that 2nd leg up and today’s breakout fails, it is more likely that there will be at least some follow-through buying next week.<h3>The S&amp;P500 Cash Index</h3><p>Today’s Emini rally was caused by a buy vacuum in the cash index. The cash index was drawn up to test its all-time high. Since the Emini is so closely tied to the cash index, the cash index bulls caused the rally in the Emini.<p>The cash index came to within 3 points of its all-time high of May, 2015. This is close enough for traders to conclude that the current rally tested the all-time high. If it reverses down from here or from slightly above the old high, the bears will conclude that it formed a double top candlestick pattern. Hence, they will sell the reversal down, looking for a test of the bottom of the 4 month trading range.<h3>The bull case</h3><p>The bulls want a breakout to a new all-time high. Furthermore, they want the breakout to be strong. A strong breakout can be a single big bull trend bar followed by at least one more day with a bull body. Yet, it can be less dramatic, but just as strong. If there is a series of ordinary size bull trend bars closing on their highs, they would create a strong breakout. On a higher time frame chart, they would form a single big bull trend bar. As a result, they would represent a strong breakout on the daily chart.<h3>The bear case</h3><p>The bears always want the opposite. They want the breakout to fail. Since the breakout so far is strong, the bears would usually need at least a micro double top. They then would need a strong reversal down with follow-through selling. While the reversal can be a single huge bear trend bar, it more often is a series of consecutive bear trend bars. There is no sign of a reversal yet. The bulls still have a 40% chance of a strong rally and a measured move up.<h3>Will the breakout succeed?</h3><p>Because most breakouts fail, traders will watch next week for follow-through buying. If next week begins with several strong bull trend bars that close on their highs, expect higher prices. There would therefore be a high probability that the Emini would continue higher and reach<a href=\"https://www.brookstradingcourse.com/price-action/10-best-price-action-trading-patterns/#measured-moves\" target=\"_blank\">measured moves</a>targets.<p>It is more likely that the follow-through buying next week will not be strong. At a minimum, the bulls want to avoid a bear reversal. The bears obviously want a strong reversal down early next week. If they get it, it would be a failed breakout on the daily Emini chart. The candlestick pattern would be an<a href=\"https://www.brookstradingcourse.com/price-action/10-best-price-action-trading-patterns/#expanding-triangle\" target=\"_blank\">Expanding Triangle Top</a>, which is a type of a<a href=\"https://www.brookstradingcourse.com/price-action/10-best-price-action-trading-patterns/#major-trend-reversals\" target=\"_blank\">Higher High Major Trend Reversal</a>. Because the cash index is testing its high, the reversal would create a double top in the cash index.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>, and a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>is available.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.</p></div></article>"
      ],
      "dateId": "2016-7-9"
    }
  ],
  "16": [
    {
      "data": [
        "<article class=\"post-55650 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"How to trade a breakout to an all time high Emini weekend update: July 16, 2016\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">How to trade a breakout to an all time high<br>Emini weekend update: July 16, 2016</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2016-07-16T00:30:28-07:00\">July 16, 2016</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>How to trade a breakout to an all time high</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/07/m-2.png\"><img loading=\"lazy\" src=\"2016-7-16.png\" alt=\"S&amp;P Emini futures market analysis weekly report for July 15, 2016.  Learn how to trade a breakout to an all-time high. Those learning how to trade the markets see that this month’s candlestick pattern on the monthly chart is a strong bull breakout to a new all-time high. \"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart is breaking strongly above a 2 year trading range.<p>The monthly S&amp;P500 Emini futures candlestick chart has a big<a href=\"https://www.brookstradingcourse.com/price-action/10-best-price-action-trading-patterns/#breakouts\" target=\"_blank\">bull breakout bar</a>above a 2 year trading range. While there are still 2 weeks left to the month, this is good for the bulls. They want the month to close on its high and far above the range. They then want August to also be a big bull trend bar closing on its high. Finally, they want a series of consecutive big bull bars closing on their highs, like in 1994. The more signs of strength that the bulls create, the higher the probability of a big move up.<p>The odds are against them getting everything that they want. The bears know what the bulls want and they want the opposite. They therefore want July to reverse strongly and close on its low. Otherwise, they want other signs that the bull breakout is weak. For example, they do not want the month to close on its high. They want August to have a bear body, and they prefer August to be a strong bear reversal bar.<h3>Target for the bulls</h3><p>At the moment, the monthly chart is strongly bullish. The obvious target for the bulls is a measured move up based on the 300 point height of the 2 year trading range. That target is around 2400. Will it get there? They have about a 40% chance.<p>Because the trading range is late in the bull trend, it probably will be the<a href=\"https://www.brookstradingcourse.com/price-action/10-best-price-action-trading-patterns/#final-flags\" target=\"_blank\">Final Bull Flag</a>before at least TBTL Ten Bars, Two Legs sideways to down. A 10 bar correction on the monthly chart is about a year. The minimum target for the bears after the failed bull breakout is a test to the bottom of the trading range, around 1800. Because there is no sign of a top, it is better to think about being long than planning for a reversal.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Moderate follow-through buying after breakout</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/07/w-2.png\"><img loading=\"lazy\" src=\"2016-7-16-1.png\" alt=\"S&amp;P Emini futures market analysis weekly report for July 15, 2016. Learn how to trade a breakout to an all-time high. Those who trade the markets for a living see a big bull trend bar for the follow-through bar as the candlestick pattern on the weekly chart. \"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart had a strong bull trend bar after last week’s breakout to a new all-time high. After 3 strong bull bars, bulls will probably buy the 1st reversal down. The bulls this week wanted a bigger bull body and a close on the high. Because the candlestick pattern was not as strong as it could have been, the risk of a pullback is greater.<p>The weekly S&amp;P500 Emini futures candlestick chart formed a good bull follow-through bar after last week’s breakout to a new all-time high. After 3 consecutive strong bull trend bars, there is enough buying pressure so that traders will buy the 1st reversal down. Hence, any reversal down will probably lead to at least one more leg up.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Outside down day, but bull micro channel</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/07/d-4.png\"><img loading=\"lazy\" src=\"2016-7-16-2.png\" alt=\"S&amp;P Emini futures market analysis weekly report for July 15, 2016. Learn how to trade a breakout to an all-time high. Online day traders saw an outside down bar after a breakout to a new all-time high as the candlestick pattern on the daily chart.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart formed an outside down day on Friday. As a result of the strong 7 day bull micro channel, the reversal attempt will probably become a bull flag.<p>The daily S&amp;P500 Emini futures candlestick chart had a 7 bar<a href=\"https://www.brookstradingcourse.com/how-to-trade-manual/trend-channels/#microchannels\" target=\"_blank\">bull micro channel</a>and a strong breakout to a new all-time high. As bullish as this is, the stop for the bulls is now at least 100 points, or 5% below. An increasing number of institutions will conclude that this risk is unacceptable. Hence, they will need to reduce their risk. The easiest way is to reduce their position size.<h3>2 – 5 day pullback soon</h3><p>When a lot of institutions stop buying and instead begin to sell out of part of their long positions, the Emini will begin to pullback. However, the institutions have been so eager to buy that they have been buying above the prior day’s high all week. Most will be eager to buy below the prior day’s low. The odds are high that the bulls will buy the first reversal down.<p>However, because the Emini is so overbought on the daily chart, they will take quick profits if there is not an immediate strong bull trend resumption. The odds are that there will not be. This means that there will then probably be a 2nd pullback shortly after the 1st one.<h3>Start of bull flag</h3><p>Friday’s outside down day is a pullback, and it is probably the start of a small bull flag. As a result of the strong bull trend, the 1st bull flag will probably be small. Bulls will eagerly buy it. Many will wait for a High 2 buy setup, which is a micro double bottom. Because the bull trend is so strong, any reversal down over the next week will probably be minor.<p>The bears need either a huge bear trend bar or a series of small bear trend bars before traders will begin to believe that the breakout has failed. Even then, both of these reversals will probably need at least a micro double top before they begin. In conclusion, the downside risk is minimal next week, and the best the bears can reasonably hope to see is a pullback. However, that pullback will probably be a bull flag and not the start of a reversal down.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.</p></div></article>"
      ],
      "dateId": "2016-7-16"
    }
  ],
  "23": [
    {
      "data": [
        "<article class=\"post-55957 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Political conventions and the stock marketEmini weekend update: July 23, 2016\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Political conventions and the stock market<br>Emini weekend update: July 23, 2016</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2016-07-23T00:30:55-07:00\">July 23, 2016</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Political conventions and the stock market</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/07/m-3.png\"><img loading=\"lazy\" src=\"2016-7-23.png\" alt=\"Emini strong bull breakout  to all time high\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has a big bull trend bar in its breakout to a new all-time high. It is the 6th consecutive bull trend bar in a strong bull trend.<p>Some beginning traders erroneously think that there is a significant link between political conventions and the stock market. There is not. Like any news event, a convention might cause a one day move in the market. However, support and resistance on all time frames are far more important forces. Traders should not give the conventions any thought as they plan their trades.<h3>Strong bull breakout</h3><p>The monthly S&amp;P500 Emini futures candlestick chart has one week left in the month. This month is forming the 6th consecutive bull trend bar. Most noteworthy, the rally is a strong breakout to a new all-time high.<h3>The importance of follow-through buying in August</h3><p>Because this month is breaking out of a trading range, August is important. The bulls want to see another big bull trend bar. As a result, it would increase the chances that the breakout would lead to a 300 point measured move up. At a minimum, they do not want a bear bar in August.<p>The bears always want the opposite of the bulls. They do not mind this month being a big bull trend bar. Their concern now is also August. At a minimum, they need it to have a bear body because that would be an early sign of a possible failed breakout. Their ideal bar would be a big bear trend bar closing on its low and below the July low. While this is unlikely, it would mean that the July breakout was probably failing. The 2 year trading range would then be the Final Bull Flag in a 7 year bull trend.<p>Most likely, August will be somewhat disappointing to both the bulls and bears. The most common candlestick pattern that confuses and disappoints both is a doji. August will probably have a tail on top. If it is big and the month closes below its midpoint, the bar would be slightly better for the bears. If it is small and August closes above its midpoint, that would be slightly more bullish.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Strong breakout, but losing momentum</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/07/w-3.png\"><img loading=\"lazy\" src=\"2016-7-23-1.png\" alt=\"Emini breakout that is getting weaker\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart has had 4 consecutive bull trend bars. Yet, the bodies are getting smaller, which indicates a loss of momentum.<p>The weekly S&amp;P500 Emini futures candlestick chart had a small bull bar for its candlestick pattern this week. This is weak follow-through after a strong breakout above a 2 year trading range over the past 2 weeks. Although the prior 3 weeks were strong bull trend bars (big bodies, closes near highs), the bodies have been shrinking. This represents waning momentum. It therefore is a sign that the Emini will probably pull back next week.<p>A pullback means that next week will trade below this week’s low. The bulls will probably buy the pullback. With the rally as strong as it has been, the odds are that the pullback will last 1 – 2 weeks and become a small bull flag. If so, bulls will buy above the high of the pullback bar, expecting at least one more week in the bull trend.<p>The bears want next week’s pullback to be a big bear trend bar closing on its low. Instead of just a pullback, they want the pullback to be so big that becomes a reversal. If they can make next week become a bear trend bar closing on its low, they would significantly increase the probability that the breakout will fail and reverse back into the 2 year trading range. While the odds are against this, it would change everyone’s expectation for the coming weeks.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Bull flag in an overbought bull trend</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/07/d-5.png\"><img loading=\"lazy\" src=\"2016-7-23-2.png\" alt=\"Emini bull flag after breakout\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart is trying to resume up after a 7 day bull flag.<p>The daily S&amp;P500 Emini futures candlestick chart has been in a trading range for 7 days. Last weekend, I said that this was likely to happen. The bulls see this pullback as a bull flag and they therefore expect trend resumption up next week.<p>The bears see it as a small trading range above a big trading range. That is a type of reversal candlestick pattern. They then hope for a bear breakout below the small trading range and a strong move back down into the 2 year trading range. Hence, they want a failed breakout above the 2 year range. While the odds still favor the bulls because the momentum has been so strongly up for 6 months, the bears have a reasonable case.<h3>Bulls have a wide stop</h3><p>For the past couple of weeks, I have talked about the problem the bulls have with their protective stop. It is still below the July 6 low, which is about 100 points and 5% below. This is more risk than many institutions will allow. They have to reduce their position size to reduce their risk.<p>Their profit taking over the past 7 days has created the current pull back. The bulls now need a strong bull breakout to another all-time high. If they get it, they will then move their stop to just below the bull flag&nbsp;of the past 2 weeks. This will greatly reduce their risk.<h3>Bulls need a strong breakout before raising stops</h3><p>If the Emini got the strong bull breakout and then fell below this week’s higher low, traders would begin to wonder if the bull trend has ended. As long as a bull trend continues to make higher lows, it is intact. Once it falls below a major higher low, the bull trend has evolved into a trading range. It might even have reversed into a bear trend.<p>If the bull trend resumes up, but not strongly, the bulls will assume that the rally is a bull leg in the ongoing pullback. They will not raise their stops from below the July 6 low. The bulls instead will use the rally to reduce their position size ever further. They need a strong bull breakout to believe that the bull trend has resumed. Only then will they tighten their stops, which will allow them to build their position back up.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2016-7-23"
    }
  ],
  "30": [
    {
      "data": [
        "<article class=\"post-56008 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"August stock market crash unlikelyEmini weekend update: July 30, 2016\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">August stock market crash unlikely<br>Emini weekend update: July 30, 2016</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2016-07-30T00:30:21-07:00\">July 30, 2016</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Strong breakout to a new all-time high</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/07/m-5.png\"><img loading=\"lazy\" src=\"2016-7-30.png\" alt=\"S&amp;P Emini futures market analysis weekly report for July 30, 2016.  Those learning how to trade the markets see that this month’s candlestick pattern on the monthly chart is a strong bull breakout to a new all-time high. August stock market crash is unlikely.\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart had a big bull trend bar closing on its high. The gap is the space between the close of this month and the high of last month. This is a strong bull breakout. However, it is the 6th consecutive bull bar and therefore a buy climax.<p>The monthly S&amp;P500 Emini futures candlestick chart is breaking above a 2 year trading range. July was a big bull trend bar closing on its high. It therefore is a strong bull breakout bar.<p>August is important. The bulls need follow-through buying, which consequently would validate the bull breakout. Hence, it would increase the chances of higher prices over the coming months. The bears want a bear bar and therefore a potential failed breakout. The bulls have 6 consecutive bull trend bars on the monthly chart. While this is a sign of strong bulls, it is rare and therefore unsustainable. Hence, it is a type of buy climax.<p>The odds are that August will have a bear body. Because the bulls are strong, the first reversal down will probably be bought. Therefore, the downside risk on the monthly chart is small. The best the bears probably will get is a 1 – 3 bar (month) pullback.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Weakening bull breakout</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/07/w-4.png\"><img loading=\"lazy\" src=\"2016-7-30-1.png\" alt=\"S&amp;P Emini futures market analysis weekly report for July 30, 2016. Those who trade the markets for a living see a weakening bull trend bar for the follow-through bar as the candlestick pattern on the weekly chart. Traders doubt August stock market crash.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart formed an outside up bar this week. Yet, it was only a doji bar. Furthermore, it is the 5th consecutive week where the bull bodies have been shrinking.<p>The weekly S&amp;P500 Emini futures candlestick chart formed an outside up bar this week. However, it was only doji candlestick pattern and not a big bull trend bar closing on its high. While this comes after 4 consecutive bull trend bars, the bars have been getting less bullish. The bodies are shrinking. As a result, traders see the momentum decreasing. Consequently, there is a 60% chance of a pullback within the next 3 weeks.<p>Because this week was a small sideways bar in a bull trend, it is a buy signal bar. Yet, it was a doji and the momentum is dissipating. As a result, if next week goes above this week’s high and triggers the buy signal, bulls will be quick to take profits. Limit order bears will probably begin to sell above bars, betting that the buy setup is weak. They expect a pullback within the next few weeks and will begin to sell strength for scalps.<p>As a result of a weak buy setup, the odds are against a strong move up without a pullback. However, the Emini will probably trigger the buy and go at least a little higher.<p>The potential Black Swan is a big bull breakout, which would create a potential measuring gap. If the bulls are surprisingly strong, traders cannot be paralyzed by the unexpected happening. Never question what any market is doing. If it goes up, look to buy. If it goes down, look to sell.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Unfounded fear of an August stock market crash</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/07/d-8.png\"><img loading=\"lazy\" src=\"2016-7-30-2.png\" alt=\"S&amp;P Emini futures market analysis weekly report for July 30, 2016. Online day traders saw weak breakout to a new all-time high as the candlestick pattern on the daily chart. Traders think pullback, not August stock market crash.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart broke above its 12 day tight trading range on Friday. The breakout so far is small.<p>The daily S&amp;P500 Emini futures candlestick chart has been in a tight trading range for 12 days. While today broke above the range to a new all-time high, the Emini soon reversed down. Hence, the bull breakout was not strong. Because the tight trading range is in a bull trend, the odds favored a bull breakout. That breakout began on Friday. As a result, the Emini might trade up for another week or two. Yet, the rally will probably fail.<p>The stop for the bulls is still about 100 points below. Many institutions cannot tolerate that much risk. Hence, they will look to reduce their position size. This means that bullish institutions will start selling to take profits. Due to the bulls selling in addition to the bears who are always selling, the Emini will pullback soon.<p>If there is a rally, how far up will it go? A minimum target is a 12 point measured move up, based on the height of the 2 week tight trading range. If it breaks above that, the next target is the 2,200 round number. If the bears get a strong bear breakout, that could be the start of the pullback. Because most trading range breakouts fail, the odds are that the bulls will buy bear breakout. As a result, the bulls will then probably get their final rally before the pullback begins.<h3>40 – 100 point pullback in August</h3><p>The July reversal pulled back on July 6. The 2065.75 low was the start of the 2nd leg up after the bull breakout (bull spike). While the leg was strong, it was also a type of a parabolic channel in a Spike and Channel bull trend. Hence, it is a magnet.<p>Will the Emini reverse all of the way there in August? Although the top of the 2 year trading range at around 2,100 is support, this July rally was extreme. An extreme move is unsustainable and therefore climactic. As a result, the pullback might be more than 2%. A 2% pullback is 40 points. A test of that low is about 100 points and 5%.<h3>Compare today to 2014</h3><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/07/d2-3.png\"><img loading=\"lazy\" src=\"2016-7-30-3.png\" alt=\"The Emini will probably not have a stock market crash in August.\"></a><p class=\"caption\">The chart on the left shows the strong bull reversal in October 2014. The Emini then briefly entered a tight trading range. After a small breakout, it formed a double top in November. The 100 point selloff in December lasted only 7 days. The chart on the right shows the current July strong reversal up and then a 12 day tight trading range.<p class=\"caption\">While the Emini probably will not follow 2014 exactly, 2014 illustrates the concept. When the stop is far below, the Emini has an increased probability of a deep, fast selloff. The selloff will probably be 2 – 5%, which is 40 – 100 points.<p>The Emini formed a similar chart pattern in 2014. It rallied strongly in October and then entered a tight trading range for 5 days until November 17. The bull trend resumed for a few weeks, formed a double top, and reversed down 100 points. The selloff fell far below the breakout point, which traders thought should have been support.<p>Chart comparisons like this can mislead traders. I am not saying that the Emini will do the same thing in August. I am using that 2014 rally as an example of what might happen when the stop is far below. It shows that this kind of buy climax can quickly reverse 100 points down. The odds are against that, but there is a 40% chance of it happening. There is a 60% chance of at least a 40 point pullback over the next few weeks.<h3>Fear of an August stock market crash?</h3><p>While crashes on the 5 minute chart come a couple of times a week, and almost daily on the 1 minute chart, crashes on the daily chart are rare. I have been trading for 30 years and have seen some surprisingly big selloffs in August and October. The odds are high that August will correct down. The selloff might be fast, scary, and far. Yet, traders will correctly see it as a pullback in a bull trend and they will buy it.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2016-7-30"
    }
  ]
}