{
  "5": [
    {
      "data": [
        "<article class=\"post-72080 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini buy climax continuing with Trump’s tax cutsEmini weekend update: November 4, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini buy climax continuing with Trump’s tax cuts<br>Emini weekend update: November 4, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-11-05T14:30:55-08:00\">November 5, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Emini buy climax continuing with Trump’s tax cuts</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/11/m.png\"><img loading=\"lazy\" src=\"2017-11-5.png\" alt=\"Emini monthly chart in buy climax and micro channel.\"></a><p class=\"caption\">Every low for the past 12 months on the monthly S&amp;P500 Emini futures candlestick chart has been above the low of the prior bar. This is a 13 bar bull micro channel. It is a sign of a strong bull trend and a buy climax.<p>The monthly S&amp;P500 Emini futures candlestick chart is in an 13 bar bull micro channel. This has happened only once in the S&amp;P500 cash index in the past 50 years, and therefore represents extreme buying. Since it is a sign of aggressive bulls, the odds of a significant reversal over the next 6 months are small. The bears usually need at least a micro double top before they can get a 20% correction.<p>However, markets rarely stay far beyond their typical behavior for long. Consequently, the odds are that there will be a pullback within the next couple of months. A pullback simply means that the low of a bar falls below the low of the prior bar. Because the bull trend is so strong, the odds are that the pullback will be brief. It will therefore probably last 1 – 3 months and be a bull flag.<p>Yet, because the climax is extreme, the rally back up has a 50% chance of stalling at the high. This could result in another small leg down, which would begin a tight trading range. Less likely, that reversal down from the micro double top could lead to a 10 – 20% correction. This would still be a minor reversal on the monthly chart.<h4>Endless pullback or collapse unlikely</h4><p>About 20% of the time, a pullback just keeps growing to 20 or more bars. That is an endless pullback. If that were to develop, the bears would have a 40% chance of a bear break below that extended bull flag and then a measured move down. Since this is a monthly chart, the bears would need more than a year to create a pullback that qualifies as endless.<p>Can the Emini simply selloff 20% without a micro double top or an endless pullback? Anything can happen, but that is unlikely. The bulls would buy the 1st reversal down, even if it was 500 points. The bears might then get a bear trend if the rally up reversed back down strongly. This would be a lower high major trend reversal.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Extreme buy climax, but no strong top yet</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/11/w.png\"><img loading=\"lazy\" src=\"2017-11-5-1.png\" alt=\"Emini weekly chart is breaking above bull channel\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart has been above its 20 week moving average for 51 weeks. Last week was a small bull bar and the prior week was a doji bar. These therefore represent a loss of momentum. This is the 5th week in a bull breakout above the top of a bull channel.<p>The weekly S&amp;P500 Emini futures candlestick chart has been above its 20 week exponential moving average for 51 weeks. While this represents aggressive buying, it has never happened in the 18 year history of the Emini. It is therefore unsustainable and therefore climactic.<p>Although it means that a pullback to the average is likely to begin in the next couple of months, the bull channel of the past 9 months is very tight. Even if next week trades below this week’s low, this week had a bull body. It is therefore a weak sell signal. This reduces the chances that this week will be the start of a 5% correction.<h4>Bull breakout above bull channel</h4><p>When there is a breakout above a channel that has legs that last at least 5 – 10 bars, there is a 75% chance that the breakout will fail and begin to reverse within 5 bars. The pullbacks in the tight bull channel that began in March have only lasted 2 – 3 bars. Therefore, the 75% rule does not apply. The bears will probably need at least a micro double top before they can create a pullback to below the 20 week exponential moving average and the bottom of the tight 9 month bull channel.<p>The current leg up is an 11 tight bull channel. This rally has had bad follow-through bars after big bull bars. That series of bull bars is a series of consecutive buy climaxes, and it usually leads to exhaustion. An exhausted bull trend usually evolves into a trading range for at least 10 bars. Ten bars is about 2 – 3 months. About 25% of the time, it quickly reverses into a bear trend.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Wedge bull channel in strong bull trend</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/11/d.png\"><img loading=\"lazy\" src=\"2017-11-5-2.png\" alt=\"Daily Emini chart has a wedge top just below 2600.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart is forming a small wedge top in a strong bull trend<p>Last week, I posted a chart that showed that the daily S&amp;P500 Emini futures candlestick chart has not had a 3% correction in 242 days. This is the longest stretch since before the Great Depression that began in 1929. Yet, there is no top yet, and the streak continues to grow.<p>Theoretically, the Emini never has to have even a 1 point correction, but that is not what happens in the real world. It obviously has 1 point corrections every couple of minutes every day. When will there be a 3 – 5% correction? Markets are based on rational human behavior, and that means patterns form and the behavior repeats itself regularly. Consequently, the Emini will again likely have a 5% correction beginning within the next few months.<p>In fact, it will probably have a 50% correction at some point in the next 20 years because that is what is has always done. There are always going to be unanticipated huge disruptions that result in a deep repricing of the stock market. Similarly, the Emini will eventually reach 100,000, but not in my lifetime.<h4>Wedge top, but most tops fail</h4><p>The Emini has been forming a wedge top over the past few weeks. Yet, look back at any bull trend. You will see countless tops and 80% of them fail. What are the chances that the current one will finally be the one that works? Since the buy climax is extreme, a correction is increasingly likely. However, the odds still are that every top will fail and lead to at least another small leg up.<p>The bears need a strong reversal down and good follow-through selling before traders will conclude that a 5% correction is underway. That usually means consecutive big bear bars on the daily chart. Look back over the past 6 months. There have been many big bear bars, but no consecutive big bear bars. The bulls are buying every reversal down. This leads to a series of new highs in a growing buy climax. Traders need to see the absence of this buying to conclude that the market is behaving differently and a pullback is beginning.<h4>Minor seasonal weakness for 2 weeks</h4><p>I have said many times that I never base trades on calendar tendencies because I do not believe that they create profitable strategies. However, I enjoy watching to see if they play out the way the math predicts. I have written several times that I found that the market has a high probability of having a November 5th close above the October 26 close. That happened again this year. I have tested using November 6th and 7th and other dates as well. They, too, are usually above the October 26 close. However, the seasonality disappears soon after November 5. There is a slight tendency for the market to trade down into Thanksgiving.<p>I do not think this alone is useful to structure a profitable trade. Again, I never use these tendencies in my trading. I also don’t consider oscillators and many other factors because I do not believe they will make me more money. Many people do use indicators. I think that is reasonable as long as they can do it profitably.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-11-5"
    }
  ],
  "11": [
    {
      "data": [
        "<article class=\"post-72367 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini wedge top before Trump’s tax reform and budget votes Emini weekend update: November 11, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini wedge top before Trump’s tax reform and budget votes<br>Emini weekend update: November 11, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-11-11T00:30:58-08:00\">November 11, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Strong bull trend, but buy climax</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/11/m-1.png\"><img loading=\"lazy\" src=\"2017-11-11.png\" alt=\"Emini monthly chart in buy climax before congress votes on Trump's tax cuts and reform and on budget.\"></a><p class=\"caption\">Every bar for the past 12 months has a low above the low of the prior month on the monthly S&amp;P500 Emini futures candlestick chart. This is a 13 bar bull micro channel and therefore a strong bull trend. Since it is extreme, it is unsustainable and therefore climactic.<p>The monthly S&amp;P500 Emini futures candlestick chart is in a 13 bar bull micro channel. This has happened only once in the S&amp;P500 cash index in the past 70 years, and never in the 18 year history of the Emini. It is therefore extreme behavior. While it can get much more extreme, it will more likely return to more typical behavior. That means that a 1 – 3 month pullback will probably begin before year end.<p>Since the micro channel is a sign of very eager bulls, they will probably be eager to buy below the prior month’s low. Consequently, the downside risk is probably limited to a 1 – 3 bar (month) pullback. Since the bars are about 80 points tall, a pullback below a prior month’s low would be at least 80 points. A pullback will probably go more than 1 tick below the prior month’s low. Therefore, the pullback will probably be at least 100 points and about 5%.<h4>Biggest buy climax in S&amp;P500 cash index in 70 years</h4><p>I mentioned that the S&amp;P500 cash index had another 13 bar pullback in the past 70 years. It might be more than 70 years, but that is as far as I checked. That was in 1995 at the start of the biggest bull trend in my 30 year trading history. The pullback lasted one month and it was about 4%. Since the current micro channel is late in a bull trend and not at the start, the odds are that this pullback will be at least as deep. In addition, it will probably last a little longer. However, even if it is much deeper and longer, the bulls will buy it because the bull trend is so strong. This is true even if the Emini falls 20% over the next 6 months, which is unlikely.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Extreme buy climax</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/11/w-1.png\"><img loading=\"lazy\" src=\"2017-11-11-1.png\" alt=\"Weekly Emini candlestick chart in buy climax before Trump tax cuts and budget vote.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart has been in a tight bull channel for 12 weeks. This is a strong bull trend. However, it has a series of bull bars separated by dojis. This is a consecutive buy climax pattern. In addition, the Emini has not touched its 20 week exponential moving average in 52 weeks. In a buy climax, every bar is a sell signal bar for the next week.<p>The S&amp;P500 cash index was above its 20 week moving average for 62 weeks in 1995. That stretch was the longest in the past 70 years. The current streak is 52 weeks, and it is the 2nd longest in 70 years. The weekly Emini&nbsp; chart has never been this overbought in its 18 year history. While it got close to its 20 week EMA in August, it did not touch it.<p>Although the market never has to touch its average, it always eventually does. Therefore, the odds are that a pullback will begin soon. The politics surrounding either Trump’s tax reform including tax cuts or the budget vote could be the catalyst for a reversal. This is also the end of a great earnings season, and many bulls will take some profits before the end of the year. Yet, until there is a strong reversal down, the odds continue to favor at least slightly higher prices.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Wedge top in buy climax</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/11/d-1.png\"><img loading=\"lazy\" src=\"2017-11-11-2.png\" alt=\"Daily Emini chart in tight trading range after wedge top.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart broke below last week’s small wedge top. It is now in a 3 week tight trading range. Friday was a bull inside bar above the moving average. It is therefore a buy signal bar.<p>The bears have been selling new highs during this 3 week wedge rally. In addition, the bulls have been taking partial profits at new highs. With both the bulls and bears selling high, the odds are increasing that the bull trend is evolving into a trading range. However, if the bulls get a strong breakout above the high, they have a 40% chance of a quick measured move up.<p>Prior to the current rally, the daily S&amp;P500 cash index has not gone more than 241 days without a 3% correction in 90 years. It has now gone 251 days. Like the weekly and monthly buy climaxes, this is extreme. However, until there are consecutive big bear bars, the odds are that the bulls will continue to buy every selloff. Yet, everyone knows how extreme the market is. As a result, once it begins to correct, the bulls will be very quick to get out. That increases the odds that the 5% correction could be very fast.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noopener\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-11-11"
    }
  ],
  "18": [
    {
      "data": [
        "<article class=\"post-72559 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Trump’s tax cut vote is catalyst for 5% correctionEmini weekend update: November 18, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Trump’s tax cut vote is catalyst for 5% correction<br>Emini weekend update: November 18, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-11-18T00:20:05-08:00\">November 18, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Trump’s tax cut vote is catalyst for 5% correction</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/11/m-2.png\"><img loading=\"lazy\" src=\"2017-11-18.png\" alt=\"Monthly Emini star doji after buy climax at 2600 after Trump tax cut plan.\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has a small bar so far this month. Every bar for the past 12 months has a low above the low of the prior bar. That is a 13 bar bull micro channel and a sign of strong bulls. It is also unsustainable and therefore climactic.<p>The monthly S&amp;P500 Emini futures candlestick chart is in a 13 bar bull micro channel. This has happened only once in the S&amp;P500 cash index in the past 70 years and never in the 18 year history of the Emini. The monthly S&amp;P500 cash index chart has never had a 14 bar bull micro channel. While the micro channel can continue to grow, it is already extremely unusual. Therefore, the odds are that the monthly chart will soon begin to behave as it has done throughout its history. This means that there is a 90% chance of a pullback within the next few months.<h4>A pullback is a bull flag, not a trend reversal</h4><p>A pullback simply means that a bar falls below the low of the prior bar. The bulls have been so eager to buy that they have not waited for pullbacks. They have been so confident that the market was going up that they were afraid to miss the move. Therefore, the monthly bulls have been buying at the market and on any dip during every month.<p>Once a bar falls below the low of the past month, they will finally be able to buy a pullback. When they have been as aggressive as they have for the past year, there is a 70% chance that they will buy the 1st pullback before it grows to more than 3 bars (months).<p>Since the bars on the monthly chart are about 80 points tall, a pullback could easily be 100 points. That is close enough to a 5% correction so that it would probably continue down to about 5%. In addition, the one other time that the S&amp;P500 cash index had a 13 bar bull micro channel, the pullback was a little more than 4%. Since that was in 1995 at the start of a huge bull trend, the odds are that the current pullback will be at least as big. Also, that pullback only lasted 1 bar. The upcoming pullback might last 2 – 3 bars, but probably not much longer.<h4>How much of a rally after the bull flag?</h4><p>A pullback means that the bull trend will probably resume and not reverse. It is therefore a bull flag. When there is a 1st pullback in a micro channel that lasts 10 or more bars, the rally above usually lasts at least 2 – 3 bars. Therefore, the odds are that the pullback will lead to at least a 2 – 3 month rally. However, the micro channel is a buy climax. Consequently, there is a 50% chance that the rally above the bull flag will then soon enter a tight trading range for 5 – 10 bars (months).<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>53 weeks above 20 week EMA so buy climax</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/11/w-2.png\"><img loading=\"lazy\" src=\"2017-11-18-1.png\" alt=\"The weekly Emini chart has a doji high line sell signal after Trump's tax cut vote in the House and Senate.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart has not touched the 20 week exponential moving average in 53 weeks. While this means that the bull trend is strong, it is also climactic. By trading below last week’s low, the Emini triggered a sell signal. But, the sell signal bar and the entry were both weak. Therefore, this is so far a low probability sell.<p>The weekly S&amp;P500 Emini futures candlestick chart has not touched its 20 week EMA in 53 weeks. This has never happened in the 18 year history of the Emini, and it is therefore extreme behavior. The odds favor a return to typical behavior before it becomes much more extreme. That means that the odds favor a pullback to the 20 week EMA beginning before the end of the year.<p>The S&amp;P500 cash index’s longest streak was in 1994 – 1996. It stayed above the 20 week moving average for 62 weeks. When it reached the moving average, the bulls were waiting. Whenever a market stays above its 20 bar EMA for 20 or more weeks, the bulls are strong. When it finally pulls back to the average price, that creates a 20 Gap Bar buy signal. There was a gap between the low of every bar and the EMA for 20 weeks. The bulls are usually eager to finally buy at an average price.<p>The 1st pullback to the 20 week moving average was in 1996. It lasted for 1 week. However, the pullback became the middle of a 7 month tight trading range. The bull trend resumed and the rally from 1995 tripled the price of the S&amp;P500 in 5 years. While that big of a rally is very unlikely now because the current bull trend has already lasted 8 years, the odds are that the Emini will go at least a little higher after the pullback.<h4>Weekly sell signal</h4><p>Since the weekly chart is far above its 20 week EMA and in a buy climax, every bar is a sell signal bar. This is because the odds of a reversal back to below the 20 week EMA are high. This week triggered a sell signal by falling below last week’s low. However, last week was a doji bar. That usually would not lead to a strong reversal down. This week was the entry bar. It had a bull body, and it is disappointing for the bears. As a result, the sell signal so far is weak. The odds therefore continue to favor more sideways to up trading, even though a reversal down will probably begin by year-end.<p>Because this week was a pullback in a bull trend and it was a bull reversal bar, it is a buy signal bar for next week. However, many bulls want to buy much closer to the 20 week EMA. Furthermore, the past 4 weeks have been in a tight trading range. Most breakouts from tight ranges fail. This further lowers the chances of a big rally next week.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>251 days without a 3% correction so buy climax</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/11/d-2.png\"><img loading=\"lazy\" src=\"2017-11-18-2.png\" alt=\"The daily Emini has a bear inside bar sell signal for next week after a pullback from a wedge top.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart had a single close below the 20 day exponential moving average on Wednesday. However, the bull trend resumed on Thursday. Until there is a strong breakout above or below the month-long trading range, the odds are that it will continue.<p>The daily S&amp;P500 Emini futures candlestick chart is in a strong bull trend. It has not had a 3% correction in 251 bars. The longest prior streak in the past 90 years was 241 bars. Since markets are reflections of rational human behavior, tendencies repeat. Therefore, the odds are against the current streak growing much longer. However, there is a true adage on Wall St. that says that a market can continue in an irrational way longer than you can remain solvent betting against it. This means that the odds continue to favor failed reversals and at least minor new highs.<h4>Buy climaxes usually lead to trading ranges, not bear trends</h4><p>Since the buy climaxes on the daily, weekly, and monthly charts have never all been this extreme, traders should expect exhaustion. Exhausted bulls take profits and wait to buy lower. The bears usually cannot create a bear trend without first forming a trading range. Therefore, the 1st reversal down on the weekly and monthly charts will be minor. On the monthly chart, it will probably be a bull flag. If that pullback lasted 2 – 3 months, it would result in a trading range on the weekly chart.<p>It could also lead to a bear trend on the daily chart. I said that a bull trend usually has to evolve into a trading range before reversing into a bear trend. Since the daily chart has been in a trading range for about 20 bars, there is enough selling pressure for the bears to take control at any point. However, until there are consecutive big bear bars on the daily chart, the odds are that the bulls will buy every reversal down. Furthermore, once there are consecutive big bear bars, the correction will probably already be about half over.<h4>Every breakout usually has a catalyst</h4><p>News happens many times every day. Reporters claim that every move up or down is directly caused by the news. That is ignorant. The market reverses because it has gone too far. It always reverses at support or resistance. There is often a news item that triggers the reversal, but if a bear trend follows, it was caused by traders concluding that the rally went too far and now needs to find how low is too low.<p>Some catalysts are predictable. For example, if there is a problem with the tax or budget bills, everyone knows the market might sell off. Others are entirely unexpected, like 9/11. Most often, after the reversal begins, reporters then claim that the news of that day caused the bear trend. That is nonsense. There are bear news items every day. Traders should not sell simply because of the news. The momentum up is far more important. Until there is strong, sustained momentum down, traders should assume that the bull trend will continue.<p>Once there is a strong reversal, traders should not buy when there is bullish news. There is bullish news every day. Trade the trend, not the news.<h4>Target for the bears is the August 8 high</h4><p>The target for the bears is the August 8 high. That is a breakout point. While it was tested on September 25, the test was only a doji. That is usually not a strong enough test. Consequently, traders will want to see it tested one more time. That would be a 5% pullback to below 2500. However, until there is a top and a strong reversal down, the odds continue to favor at least slightly higher prices.<h4>Bull breakout of a wedge top?</h4><p>Everyone knows that the stock market is overbought. Yet, buy climaxes often last longer and extend higher that what seems reasonable. Every top has failed since the bull channel began in March. The bears have stopped the bulls for a month, but the bear breakout attempt failed this week. Therefore traders have to be thinking that if the market tried hard to go down and failed, maybe it will have more success going the other way.<p>As overbought as the market is, traders have to be ready for another leg up. A measured move up based on the 40 – 50 point tall, month-long trading range is around 2650. If there is a strong breakout to a new high and a good follow-through bar, the odds would favor the measured move up before the bears would try again to reverse the buy climax.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-11-18"
    }
  ],
  "25": [
    {
      "data": [
        "<article class=\"post-72773 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Trump corporate tax cut rally might stall with budget vote Emini weekend update: November 25, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Trump corporate tax cut rally might stall with budget vote<br>Emini weekend update: November 25, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-11-25T00:30:09-08:00\">November 25, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>13 months without a pullback</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/11/m-3.png\"><img loading=\"lazy\" src=\"2017-11-25.png\" alt=\"Monthly Emini candlestick chart in strong bull trend but exhaustive buy climax at 2600 big round number before trump tax cut vote and possible government shutdown.\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has not had a pullback in 13 months. With 4 days remaining in November, this month so far is a small bull bar. If it closes below its high, it would represent a loss of momentum after 2 strong bull bars.<p>The monthly S&amp;P500 Emini futures candlestick chart has not had a pullback in 13 months. This has never happened in the 18 year history of the Emini. It only happened once in the history of the S&amp;P cash index. That was in 1995 at the start of the strongest bull trend in 50 years. The 14th month fell below the low of the 13th month, and then the bull trend resumed after that one month pullback. The S&amp;P tripled over the next 5 years. The one bar pullback was about 4.6% from the high.<p>If November remains a small month, a pullback below its low would require only about a 50 point selloff from the all-time high. That is only 2%. Because the buy climax is so extreme, the pullback will probably be deeper. Furthermore, it might last several months. If it tested the beginning of the tight channel that started in March, it would fall about 100 points and 5%.<h4>Bull micro channel is created by strong bulls</h4><p>A 13 bar bull micro channel is a strong bull trend. It could therefore easily continue for many more months before pulling back. However, since the S&amp;P has never been this overbought, the odds are against this rally continuing much longer without at least a small pullback.<p>Since the rally is strong, the bulls will buy the pullback. That is true even if it lasts 6 months and reaches 20%. There is only a 20% chance of a major reversal after a tight bull channel without at least a micro double top.<h4>It’s the close that matters</h4><p>This month is currently a strong bull trend bar. However, there are 4 days left in November. In addition, the open of the month is only about 20 points lower. Therefore, this month could easily close back at the open. That would turn the month into a doji bar after 2 big bull bars. It would be a sign of a loss of momentum after a 2 bar climax in a bigger climax. Traders would see it as a possible start of a pullback. It would therefore be a sell signal bar for the bears in December.<p>If the month closes near its low on Thursday, this month would be a bear reversal bar in a buy climax. That would make December likely to trade below the November low. If it did, it would officially be a pullback and the end the 13 bar bull micro channel. Because the bull trend is so strong, the odds are that the pullback will last only 1 – 3 months before the bulls buy again.<p>If there was then a rally back up to the November high, the bears would try to get a 2nd reversal down. That small double top would then have a 40% chance of growing into a TBTL (Ten Bar, Two Leg) correction. Hence, it could be the start of a trading range that could last about a year. The odds that more than a 20% or more correction would begin within the next few months are only about 30%.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Breakout above weak buy signal in extreme buy climax</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/11/w-4.png\"><img loading=\"lazy\" src=\"2017-11-25-1.png\" alt=\"weekly emini candlestick chart breakout of tight trading range and final flag with dojis so odds favor failed breakout.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart this week broke above last week’s high. Since last week was a pullback in a bull trend, it was a one bar bull flag. However, it was a doji, which usually does not lead to a strong rally.<p>The weekly S&amp;P500 Emini futures candlestick chart has not touched its 20 week exponential moving average in 54 weeks. That has never happened in the Emini, and it happened only once in the history of the S&amp;P500 cash index. During the strong 1995 bull breakout, the weekly chart of the S&amp;P500 cash index held above its 20 week EMA for 62 weeks. This was during that 13 month bull micro channel that I mentioned above.<p>The 20 week EMA is just below 2520. A pullback would therefore have to be at least 80 points. That would be getting close to the August 8 high, which is a magnet on the daily chart. This is consistent with the approximately 5% correction that is likely on the monthly chart.<h4>One week pullback so small bull flag</h4><p>This week was a bull bar and it broke above last week’s high. Since last week was a pullback in a bull trend, it was a buy signal bar. However, it was a doji bar and therefore a low probability buy signal bar. In addition, 5 of the past 6 bars were doji bars. A doji bar contains at least one reversal. When there is a series of doji bars, there is an increased chance of other dojis (1 bar reversals) and 2 bar reversals. That a bull bar has an increased chance of leading to a bear bar, creating a 2 bar reversal.<p>The tight trading range represents a balanced market. Breakouts of tight trading ranges usually do not go far. Therefore, this breakout is likely to not be as strong as all of the other breakouts since March. Yet, markets have inertia. This means that they have a strong tendency to continue to do what they have been doing. Since the weekly chart has been in a tight bull channel, the odds will continue to favor at least slightly higher prices.<p>However, the extreme buy climax should begin to pull back to the 20 week EMA soon. While a chart never has to pull back to its average price, that has never happened. Hence, the pullback will come. Furthermore, markets are based on rational human behavior and therefore patterns repeat. Consequently, the odds are high that the Emini will begin to pullback within a month or two. Yet, until there is a clear reversal, the odds continue to favor at least slightly higher prices.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Trump corporate tax cut rally might stall with budget vote</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/11/d-3.png\"><img loading=\"lazy\" src=\"2017-11-25-2.png\" alt=\"Emini daily chart has consecutive wedge tops and higher high major trend reversal.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart broke above a 7 bar bear channel this week. In addition, it broke above a month-long tight trading range to a new all-time high. Yet, it has consecutive wedge tops, and this 2nd one is also a higher high major trend reversal.<p>The bull breakout on the daily S&amp;P500 Emini futures candlestick chart lacked consecutive bull bull bars closing on their highs. Furthermore, the breakout to a new high was a breakout above a month long tight trading range. A tight trading range late in a bull trend is often the final bull flag. Consequently, the rally will probably not go far before reversing back into the tight trading range.<h4>Longest streak without a 3% correction</h4><p>The daily chart of the S&amp;P500 cash index has not had a 3% correction in 256 bars. That is the longest streak in 90 years, and probably in history. The odds therefore are that it will have at least a 3% correction beginning soon. A 3% correction would be about 75 points. That would be about 40 points above the August 8 high.<p>Since that breakout point was only tested briefly by the September 25 low, and that day was only a small doji bar, many traders believe the test was not reliable. Therefore, the odds favor another test below that high. That would require about a 115 point pullback. This would be about a 5% correction, which is what is likely on both the weekly and monthly charts.<h4>Consecutive wedge tops</h4><p>Wedge tops are common in bull trends, but most lead to bull flags. The 7 day rally has 3 legs and is in a converging channel. It is therefore a wedge. Moreover, it is a higher high major trend reversal. Friday was a doji and it is therefore a sell signal bar for next week. If Monday trades below Friday’s low, it will trigger the sell signal. There have been many other sell signals over the past 6 month, and there has been something wrong with every one of them. This signal bar and the wedge top both are good enough for a credible top.<h4>The bears need to create selling pressure</h4><p>The bears need to create many signs of strength (selling pressure) before traders will believe that this reversal attempt is different from all of the others. For example, if Monday is a big bear day closing near its low, it would be a strong sell entry bar. It that happens, the bears would next want Tuesday to be a strong follow-through day. That means that the bears would like consecutive big bear bars. In addition, the bigger the bear bars are and the closer they close to their lows, the more traders will begin to see the reversal as possibly more than a pullback into another bull flag.<p>While everyone knows that a 5% correction is likely soon, betting on any one reversal as the start is a low probability bet. However, one of these reversals will start to look like the bears are taking control. Traders will be ready for a swing down only after they see evidence that this selloff is different from all of the others.<p>Because this is a 2nd consecutive attempt at a wedge top (the November 7 high was the 1st), it has a higher probability of leading to at least a TBTL (Ten Bars, Two Legs) pullback. Since there are extreme buy climaxes on the daily, weekly, and monthly charts, there is an increasingly likely chance that a pullback will grow into a 5% correction. Yet, until the bears get consecutive big bear bars, the odds still favor every reversal failing and the bull trend continuing.<h4>Bull trends are tough on the bears</h4><p>Everyone knows that the Emini will correct at some point. Yet, the bulls keep buying every selloff, no matter how strong. Look at the daily chart. There have been many big bear bars. But what do they all have in common? There has been no follow-through selling. Until there are consecutive big bear bars, the odds are that the bulls will continue to buy every strong selloff. The bears continue to buy back their shorts, and many are taking repeated losses.<p>Once everyone agrees that the daily chart has flipped to Always In Short, the selloff will already be half over. This is because traders want to see at least 2 consecutive big bear bars closing near their lows. That will probably require a drop of at least 50 points from the all-time high.<p>Since many bulls will buy around 2500, which is also a 100 point and 5% pullback, the selloff will probably end around there. Consequently, by the time everyone is confident of a test of the 2500 support level, the selloff will already be half over.<p>This is common when a bull trend reverses. It takes a lot to convince traders that a reversal is a correction and not another bull flag. Yet, the monthly chart is so bullish that any selloff will probably not be too deep. Hence, by the time the daily chart is clearly bearish, the monthly bulls will begin to look to buy and the selloff will soon end.<h4>Congress votes on December 8 to pass a spending bill</h4><p>Markets always look to catalysts. Most have no significant effect. However, the market is as extremely overbought. Therefore, traders know that a correction is likely soon. Consequently, they will watch for reactions to catalysts. An important one comes on December 8.<p>That is when Congress has to vote to pass a spending bill to avoid a government shutdown. The problem with the vote is that it requires 8 Democrats in the Senate to reach the 60 vote threshold to avoid a filibuster. In addition, the Democrats know that the public always blames Republicans for government shutdowns because they know that the Republicans try to reduce spending.<p>This gives the Democrats leverage, especially since the Republicans can pass the tax bill without any votes from the Democrats. The Democrats therefore will be particularly eager to get something from the spending bill after getting nothing in the tax cut bill.<p>If they force the republicans to shut the government down temporarily, the market will likely sell off. If they extract other symbolic or real concessions that hurt corporations, the market might sell off as well. Therefore, this is a precarious time for the market, and there is an increased risk of the 5% correction beginning around the December 8 vote.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-11-25"
    }
  ]
}