{
  "5": [
    {
      "data": [
        "<article class=\"post-69577 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini risk from low volatility, algorithms, and central banks Emini weekend update: August 5, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini risk from low volatility, algorithms, and central banks<br>Emini weekend update: August 5, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-08-05T00:30:36-07:00\">August 5, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 futures candlestick chart:<br>9 bar micro channel</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/08/m-1.png\"><img loading=\"lazy\" src=\"2017-8-5.png\" alt=\"Monthly S&amp;P500 cash index is in buy climax at measured move target.\"></a><p class=\"caption\">The monthly S&amp;P500 cash index is at a measured move up from the 2002 and 2009 double bottom. Every bar for the past 9 bars on the monthly chart has a low at or above the low of the prior month (cannot see on this bar chart). This is a 9 bar bull micro channel. In addition, it is the 3rd push up in an 18 bar parabolic wedge rally (see last week’s chart). Finally, the monthly chart has been in a strong bull trend for about 90 months.<p>The monthly S&amp;P500 Emini futures candlestick chart is in a strong bull trend. In fact, the 18 month rally is in a tight bull channel where there has not been a pullback for 9 months. This is therefore a 9 month bull micro channel, which is a sign of strong bulls.<h4>Buy climax with Emini risk from low volatility, algorithms, and central banks</h4><p>When exceptional strength occurs late in a trend, it is usually climactic. A buy climax does not mean that there will be a reversal into a bear trend. However, the stop for the bulls gets further away. Since that increases risk, the bulls need to reduce their risk. The easiest way is to take some profits. Consequently, that is what is likely to happen soon.<p>The bulls have been so eager to buy that they have not waited for a bar to fall below the low of the prior month. They will probably get that opportunity in the next few months, and will likely buy the 1st 1 – 3 month pullback.<p>However, once the rally resumes, traders will pay attention to what the Emini does once it gets back to the high. If it reverses, that will create a micro double top, which could lead to a bigger pullback. Yet, since the 18 month rally is in a tight bull channel, the first bigger reversal down will still probably be minor. That means that a trading range or a bull flag is more likely than a reversal into a bear trend.<h4>Risk of surprisingly big reversal?</h4><p>Traders are aware that the volatility has been unusually low. This means the puts are cheap. If institutions need to lower the price of puts to be able to sell them, then traders do not think there is much risk. In addition, those option selling institutions will do whatever they can to make those puts expire worthless. One way to do this is to keep buying stock. If enough do it, the Emini will not fall and the puts will expire worthless.<p>This is one of the reason why the market usually gives traders a lot of time to sell a top. This is the exact opposite of the incorrect adage, “The market never gives traders a lot of time to sell a top.” Most tops come from trading ranges, which means there is usually a lot of opportunity to sell.<p>Many central banks will make interest rate decisions in September. This could be a catalyst for a reversal down.<h4>Risk from computer algorithms</h4><p>Most trading is done by computers. They pay attention to volatility. When it is low, they have to increase their risk to maintain their returns. This added leverage creates the potential for an unexpectedly sharp reversal in a strong bull trend. Once the market begins to turn, usually on some news item, it can accelerate down as all of the leveraged firms have to quickly reduce their leverage. They do so by selling, and their selling causes other firms to reduce leverage.<p>Also, option selling firms suddenly hold losing positions. They then have to sell stock to offset their losses from their short puts. That further accelerates the selling. Therefore there is always a risk of a big, fast reversal when there is a strong bull trend. However, the risk is small. Bulls have been so eager to buy that they will probably aggressively buy a 5 – 10% correction.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Extreme buy climax</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/08/w-1.png\"><img loading=\"lazy\" src=\"2017-8-5-1.png\" alt=\"The weekly emini chart is the most overbought that is has been in the 8 year bull trend.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart has not touched is 20 week exponential moving average in 38 weeks. Therefore, the Emini is the most overbought that it has ever been in its 18 year history. The past 2 weeks were small doji bars. While this past week is not a strong buy or sell signal bar, it does represent a loss of momentum.<p>The weekly S&amp;P500 Emini futures candlestick chart is in a strong bull trend. Yet, it is too strong. The Emini has never been this far above its average price for this long in its 18 year history. While there is no top and no reversal down yet, the odds are that it will fall 20 – 50 points below its average within the next few months. Reasonable targets are the May and March lows, which would be about a 150 point pullback from the high.<p>Since this month is an inside bar in a bull trend, it is a High 1 bull flag. Yet, it is a weak buy signal bar in an overbought bull trend. It is also a sell signal bar for a failed breakout above the June high. Again, a doji bar is neutral and therefore a lower probability signal bar.<p>Because the channel up from the November low is so tight, the 1st reversal down will probably be minor. This means that the best that the bears probably can get is a trading range. If the selloff were to fall 150 points, the Emini might take 2 – 3 months to get there. The bulls will probably buy the pullback. However, after a 150 point pullback, if one comes, the bears will probably sell the 1st rally. The result would be that the trading range could last for 3 – 6 months.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Broad bull channel</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/08/d-2.png\"><img loading=\"lazy\" src=\"2017-8-5-2.png\" alt=\"The daily Emini chart is in a bull channel, which is a bear flag.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart has been in a broad bull channel since March. There is no reversal yet.<p>The daily S&amp;P500 Emini futures candlestick chart has been in a broad bull channel for 6 months. There is a 75% chance that there will be a bear breakout below the bull trend line. This can come from the Emini going sideways or down. This means that a bull channel behaves like a bear flag.<p>From the market cycle, traders know that the market typically has a breakout, like in February. It then pulls back. Once the rally resumes, it usually is in a channel, like the current one that began in March. The channel typically evolves into a trading range, which should happen soon. Once it is in a trading range, there are both buy and sell setups. The market would therefore then be in breakout mode. Consequently, the breakout from the range can be up or down.<h4>Downside target</h4><p>Traders should expect an eventual break below the bull trend line, and then a selloff to the beginning of the channel. That is the March low. At that point, the bulls buy again and the bears take profits. As a result, there is usually a rally. If all of this unfolds, traders would then conclude that the daily chart had entered a trading range. Since the rally took several months, the test down to the March low will probably take several months as well.<p>It is important to remember that there is no top yet. Consequently, the rally could continue much higher before there is a swing down to the March start of the channel. Yet, because the weekly chart is so overbought, the odds are that the rally will not last much longer.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-8-5"
    }
  ],
  "12": [
    {
      "data": [
        "<article class=\"post-69741 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Trump and North Korea are catalysts for 5% technical correctionEmini weekend update: August 12, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Trump and North Korea are catalysts for 5% technical correction<br>Emini weekend update: August 12, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-08-12T00:30:57-07:00\">August 12, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Trump and North Korea are catalysts for 5% technical correction</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/08/m-2.png\"><img loading=\"lazy\" src=\"2017-8-12.png\" alt=\"Monthly Emini chart trend reversal after parabolic wedge top.\"></a><p class=\"caption\">Each bar for the past 9 months on the monthly S&amp;P500 Emini futures candlestick chart has had a low above the low of the prior month. This is therefore a 10 bar bull micro channel.<p>The monthly S&amp;P500 Emini futures candlestick chart has been in a bull trend for 8 years. The 19 month rally up from 1800 has been in a tight bull channel and is therefore very strong. Yet it has 3 legs and the channel is tight. It is therefore a parabolic wedge. A parabolic wedge has a 40% chance of leading to a major reversal. There is a 60% chance that the reversal will fail and become a bull flag.<p>The current 10 bar bull micro channel is unsustainable and therefore climactic. This micro channel contains the 2nd and 3rd legs of the parabolic wedge. The 1st pullback in a bull micro channel typically lasts 1 – 3 bars. However, a pullback from a parabolic wedge rally often lasts 5 – 10 bars. Therefore, the odds are that if this week is the start of a pullback, it will probably last only a few months, but it might last a year. In either case, there is a 60% chance that it would then have at least a small bull breakout.<p>This pullback will probably be mostly technical. It will be more the result of a rally that has gone too far than by a sudden change in the market’s fundamentals. Technical corrections tend to be brief, as this one probably will be on the monthly chart.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Correcting from buy climax</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/08/w-2.png\"><img loading=\"lazy\" src=\"2017-8-12-1.png\" alt=\"Weekly Emini chart outside down bear trend reversal after buy climax.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart traded above last week’s high and then below last week’s low. This is an outside down week and a sign of strong bears. Since the chart has been above its exponential moving average for 39 weeks, it is extremely overbought.<p>The weekly S&amp;P500 Emini futures candlestick chart is fascinating because it has never been this overbought in its 18 year history. It has never been this far above the 20 week exponential moving average for this many weeks. In theory, the bars never have to come back to the average price. In reality, they do 100% of the time. The pullback usually comes within about 20 bars. This is now 39 bars, which is extreme. Extreme means unsustainable and therefore climactic.<p>Since buy climaxes usually lead to about 10 bars and 2 legs sideways to down, that is likely here. Hence, if the correction has begun, it will probably last 2 – 3 months. In addition, it will probably fall at least 20 – 40 points below the weekly moving average, as it typically does. Since the average is now around 2420, that means the correction will likely reach 2380. That is close enough to the May higher low at around 2350 to make that a reasonable target over the next few months.<p>There is always a bull case. Yet, since this buy climax is the most extreme in history, betting that it will continue much further without dipping below the moving average is a low probability bet. More likely, the bulls will wait for a couple of months before they will be willing to buy again.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Likely start of bear trend for 2 – 3 months</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/08/d-4.png\"><img loading=\"lazy\" src=\"2017-8-12-2.png\" alt=\" Daily Emini bear trend reversal for 5% correction to 2350\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart broke strongly below a 4 week trading range. The bears need a strong bear trend day next week to confirm the bear breakout.<p>The daily S&amp;P500 Emini futures candlestick chart has been in a bull channel for 6 months. Since a bull channel has a bear breakout 75% of the time, it behaves like a bear flag. Thursday’s reversal and Friday’s follow-through have shifted the probability in favor of the bears. The minimum objective is a 2nd leg down. The next targets are the higher lows in the channel.<h4>Channels evolve into trading ranges</h4><p>The channel began with March 27 low. Most channel reversals find support at the beginning of the channel. Therefore, if this selloff continues down to that low around 2315, the bears will begin to take profits and the bulls will buy again. Consequently, there is usually a rally from that low.<p>Yet, a move down there would be big. After the big rally that began in March, that selloff would create a Big Up, Big Down pattern. As a result, traders would be confused. Since confusion is a hallmark of a trading range, the bull channel will have evolved into a trading range.<p>Once traders conclude that the bulls and bears are balanced, they switch to buying low, selling high, and taking quick profits. That means that the rally from the test of the March low would probably form a lower high. If the Emini then tests back down a 2nd time, traders would see that lower high as the right shoulder of a head and shoulders top.<p>Because most tops fail to lead to trend reversals, there is only a 40% chance that there would be a bear break below the neck line and then a measured move down. However, the 1st selloff down the March low, the rally back up, and the test back down could take many months. Therefore, the bull trend might be beginning to convert into a trading range that could last at least 3 – 6 months.<h4>Market inertia: markets resist change</h4><p>Trends resist change. Because the bull trend has been in a tight channel, the chance of it immediately reversing into a big bear trend is small. Consequently, the current reversal will probably be minor. This is true even if it falls to the March low over the next 3 months. While a 150 – 200 point selloff would be a small bear trend on the daily chart, I think it would be more accurate to call it a big bear leg in a developing trading range.<p>However, once a trend evolves into a trading range, the bears would have become as strong as the bulls. As a result, the bears will try to create a major trend reversal within that range. For example, a lower high major trend reversal or a head and shoulders top.<h4>The bull case</h4><p>While the bears would have a 40% chance of a break below the trading range and a swing down, the odds would still favor a bull breakout. If the range extends to 50 or more bars, then the probability for the bears would be about the same as for the bulls.<p>The bulls will buy this selloff before it falls to the bottom of the March pullback. It is impossible to know if they will be successful. If they are, this selloff will not be deep and the bull trend will soon resume. That happened many times over the past several years. Most noteworthy were the failed selloffs in 2014 and 2015.<p>Although they might succeed in reversing the trend back up over the next couple of weeks, the odds are against a rally far above the old high. This is because of how extreme the weekly buy climax is. In addition, the 6 month bull channel will probably need at least a 50% and 2 legged correction before the bulls would be confident that the bears had failed.<h4>Friday’s bull close</h4><p>Because Friday had a bull body, it was a bad follow-through day for the bears. Furthermore, it is now a buy signal bar for a failed bear breakout. Sometimes follow-through selling comes after 2 – 3 days. Yet, if the bulls get a big bull bar on Monday or Tuesday, they will have erased the bearishness of Thursday’s selloff. A 10 point tall bull body on the daily chart will reduce the probability for the bears to about the same as the bulls. However, if the bulls get two 10 point bull bodies or one 20 point bull body, the Emini will probably test the all-time high. In any case, the odds are that a 2 – 3 month correction has either begun, or it will begin after a test of the high.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-8-12"
    }
  ],
  "19": [
    {
      "data": [
        "<article class=\"post-69944 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Trump is catalyst for 5 percent S&amp;P500 stock market correctionEmini weekend update: August 19, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Trump is catalyst for 5 percent S&amp;P500 stock market correction<br>Emini weekend update: August 19, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-08-19T00:30:30-07:00\">August 19, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Trump is catalyst for 5 percent S&amp;P500 stock market correction after parabolic wedge buy climax</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/08/m-3.png\"><img loading=\"lazy\" src=\"2017-8-19.png\" alt=\"monthly emini parabolic wedge buy climax and possible outside down month.\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has had 10 bars where the low of each bar is above the low of the prior bar. This is a bull micro channel. Since it has 3 legs up in the tight bull channel, it is a parabolic wedge buy climax. If the current bar closes near its low, it will be a sell signal bar for next month.<p>The monthly S&amp;P500 Emini futures candlestick chart is in a strong bull trend. Yet, a 10 bar bull micro channel is extreme strength in a trend that has lasted about 100 bars. When a bull trend shows a great increase in strength late in the trend, it is more often an exhaustive buy climax than the start of another strong leg up. Therefore, the odds are that the bulls will soon take a break from buying for a few bars.<p>Since August traded above July’s high and is now near its low, this month could become an outside down month. This would be a sign of strength for the bears. It would therefore increase the chances that the bulls are taking profits and the Emini will pull back for a few months.<p>Since a 3 month reversal in a bull trend is much more likely going to be a bull flag than a bear trend, the odds are that the bulls will buy within a few months. Consequently, the selloff will then likely lead to a rally that will test this month’s all-time high.<h4>Final bull flag</h4><p>Since the monthly chart is around a measured move up from the 2014 – 2015 trading range, it is at resistance. When a trading range forms late in a bull trend, it usually is the final bull flag. However, the 20 month rally from the 1800 low of that range is in a tight bull channel. That is a strong bull trend, and therefore the odds are against an immediate reversal down to the bottom of that trading range.<p>However, if the Emini begins to go sideways for 5 – 10 bars (months), the bears will start to create a credible top. Since the odds are that the Emini will test down to the bottom of that 2 year trading range at some point in the next few years, the bears will look to sell the rally after the upcoming pullback. But, without the upcoming pullback and then at least a micro double top, the risk of a major reversal is small. Consequently, the best the bears can probably get over the next few months is a pullback or a bear leg in what will become a trading range.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Turning down from an extreme buy climax</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/08/w-3.png\"><img loading=\"lazy\" src=\"2017-8-19-1.png\" alt=\"The weekly emini chart had good follow-through selling and is close to its 20 week EMA>\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart has not touched its 20 week exponential moving average in 40 weeks. It has reversed down strongly over the past 2 weeks, and it will likely continue down to test the May or March lows over the next few months. The tail on the bottom of this week’s bar is a sign that the bears are not as aggressive as they could be. This is consistent with the reversal probably being minor.<p>The weekly S&amp;P500 Emini futures candlestick chart has never been this overbought in its 18 year history. It has not come close to its moving average in 40 bars, and that has never happened before. Consequently, this is unsustainable behavior. It is therefore an extreme buy climax.<p>Most buy climaxes result in about 10 bars sideways to down, and then a trading range. In addition, they usually test support. The obvious support is the 20 week moving average, which is now around 2412. However, most pullbacks to the weekly moving average fall at least 20 – 50 points below. That means the minimum goal based on the moving average buy climax is between 2360 and 2390.<p>Since the rally from the March low has had 3 or 4 legs, it is a wedge. A wedge rally usually corrects down in two or more legs. In addition, it typically tests the bottom of the wedge, which is the March low at around 2320. It often falls a little below. Consequently, a reasonable goal for the bears is a 2 – 3 month pullback to between 2300 and 2350.<h4>The bull case</h4><p>The 20 month rally has been in a tight bull channel. Therefore the 1st reversal down will probably be minor. Since the Emini has not touched its moving average in more than 20 bars (actually, 40 bars), there will be 20 Gap Bar bulls who will buy at the moving average. The bulls therefore expect a rally up from the moving average. That is also at the June 29 low, which is the most recent major higher low.<p>Normally, this would be the most likely outcome. The bulls would buy at the moving average, and the bull trend would then resume to a new high. However, because the buy climax is so extreme, the pullback will probably last at least 10 weeks, which is 2 – 3 months. The bulls will try to buy at the support of the moving average and the June 29 low. However, it is more likely that the best they will get is a tight trading range, like in June. The odds favor at least one more leg down after that trading range.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Strong bear reversal</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/08/d-5.png\"><img loading=\"lazy\" src=\"2017-8-19-2.png\" alt=\"The Emini daily chart had a doji after yesterday's strong bear breakout.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart had a big bear day on each of the past 2 Thursdays. This is the 1st time in the 20 month rally that there have been 2 big bear bars within a short period of time. Hence, it is a sign that the bull channel is probably evolving into a bear swing. The odds are that it will fall about 150 points over the next 2 – 3 months. Friday’s bull body was weak follow-through for the bears. The bulls therefore see the selloff as a High 2 bull flag.<p>The daily S&amp;P500 Emini futures candlestick chart had a strong rally in February. This was a bull spike. It then rallied in a bull channel since March. This is therefore a Spike and Channel bull trend. It broke below the bull trend line this week. When a Spike and Channel bull trend reverses, it usually pauses about halfway down. That would be around the June trading range and 2400. However, the odds are that the selloff will test down to the beginning of the channel. Hence, this selloff will probably test the May or March lows between 2320 and 2350.<p>Friday had a close around its middle after Thursday’s strong selloff. Friday is therefore a weak buy signal bar for a High 2 pullback from the all-time high. While this is a buy setup for the bulls, the odds still favor lower prices over the next 2 months because of the weekly buy climax. Yet, bulls will buy, looking for trend resumption up. However, they need to get a strong reversal up next week, or a series of bull bars closing on their highs. Otherwise, the bears will see the reversal as weak, like the rally at the start of this week. Consequently, they will sell again, expecting another lower high and then a new leg down. In addition, the bulls will sell out of their longs if the rally is weak.<h4>Channels evolve into trading ranges</h4><p>Once a Spike and Channel bull trend reverses to the start of the bull channel, bears take profits and bulls buy. However, after a 5% correction, the odds are that the Emini will have entered a trading range.<p>Remember the Market Cycle. A bull channel typically has a bear breakout and then evolves into a trading range. That is likely here. The channel is therefore a bull leg in what will become a trading range. Since the channel up lasted several months, the bear channel down to the March low will also likely last at least 2 months.<p>After a big move up and down, the market is confused. Traders will assume that the 1st reversal up will form a lower high. The selloff from that lower high typically bounces around the developing trading range low. At that point, there will be both a double bottom bull flag and a lower high major trend reversal.&nbsp;Here, that would also be a head and shoulders top. All trading ranges are breakout mode environments with both reasonable buy and sell setups. That is likely here. Because of how long the channel up lasted, the trading range could last 6 months or more before there is a breakout up or down.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noopener\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-8-19"
    }
  ],
  "26": [
    {
      "data": [
        "<article class=\"post-70214 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini has begun 5 percent correction down to 2350Emini weekend update: August 26, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini has begun 5 percent correction down to 2350<br>Emini weekend update: August 26, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-08-26T00:30:21-07:00\">August 26, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Parabolic wedge buy climax</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/08/m-4.png\"><img loading=\"lazy\" src=\"2017-8-26.png\" alt=\"Emini monthly chart has 10 bar bull micro channel so it is a buy climax.\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has a bear body so far this month. If August trades below the July low, it will be an outside down month. In addition, it is in a 20 month tight bull channel that has had 3 pushes up This is therefore parabolic wedge buy climax. Finally, since every bar for the past 10 bars has a low above the low of the prior bar, this is a micro channel. When one forms late in a bull trend, it, too, is a type of buy climax.<p>The monthly S&amp;P500 Emini futures candlestick chart has been in a strong bull trend for 8 years. In addition, it has rallied especially strongly for 20 months. The low of every bar for the past 10 months is above the low of the prior month. This is extremely strong buying. Since it is occurring late in a bull trend, it is likely too strong. Hence, it is climactic.<p>Yet, a buy climax in a tight bull channel only has a 20% chance of immediately reversing into a bear trend. A reversal usually requires a transition into 10 or more bars of sideways trading before traders become confident that the bears might be strong enough to take control. Consequently, the odds are that the best the bears can get over the next few months is a pullback and not a bear trend. A pullback means that the odds are greater that it will lead to an attempt to resume the bull trend instead of reversing it.<h4>Possible outside down month</h4><p>This month so far has a bear body. While it could rally over the final days and have a bull body, it would probably be a doji. This would be poor follow-through buying. Additionally, the 20 month rally is in a parabolic wedge bull channel, which is a buy climax. That therefore further increases the odds of a pullback beginning soon.<p>Alternatively, the Emini could trade below the July low by the end of the month. This is unlikely at the moment. Since it traded above the July high, that would turn August into an outside down month. That is a sign of strong bears. It therefore would increase the odds that a 2 – 3 month pullback might be beginning.<h4>How big might a pullback be?</h4><p>A reasonable goal for the 1st reversal down into a bull flag is a 2 – 3 bar (month) pullback. It might test the March low. Therefore, the pullback could be 5 – 10%. If the pullback contains one or two big bear bars, or 3 consecutive bear bars, the odds are that there would be a 2nd leg down. Therefore the pullback could last maybe 6 months. If it then tests the high and falls back again, the pullback could last more than 10 bars.<p>Once a pullback lasts that long, traders begin to refer to it as a trading range. Since a trading range always has a reasonable buy and sell setup, the odds of a reversal down eventually could approach 50%.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Buy climax pulling back to the 20 week exponential moving average</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/08/w-4.png\"><img loading=\"lazy\" src=\"2017-8-26-1.png\" alt=\"Emini weekly chart in extreme buy climax\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart has been above the 20 week exponential moving average for 41 weeks. The bulls hope that this week was an adequate test of the average. If so, bulls will buy, since this would be a 20 Gap Bar buy setup. There has been a gap below the low of every bar and the moving average for more than 20 weeks. This means that the bulls have been so eager to buy that they have been buying above the average price. Many bulls will be eager to finally buy at the average price.<p>The weekly S&amp;P500 Emini futures candlestick chart has been very unusual. It has never been this far above its 20 week exponential moving average for 41 weeks in its 18 year history. It is now very close to the moving average.<h4>How does a moving average test take place?</h4><p>If a trader looks at a weekly chart and the moving average is above the low of the week, he might assume that the Emini fell to the moving average and then rallied. This week has been an example of how that is not always true. At the close of trading on Monday, the low of the week was 1 point above the average. It traded up strongly on Tuesday.<p>Remember that the average uses the current close of the bar in its calculation. By the close of Tuesday, the moving average got pulled up to 1 point above the low of the Monday. Consequently, it is easy to assume that the Emini fell below the average and reversed up. However, in this example, that assumption is wrong. The strong bull close on the weekly chart as of Tuesday pulled the average above the low of the week. However, the low never actually fell below the average.<p>By Friday’s close, there was enough of a selloff from Tuesday’s close so that the EMA fell back to one point below this week’s low. Hence, it has not been touched in 41 weeks. The odds are that the low will touch the weekly average within the next few weeks. Furthermore, it typically falls 20 – 50 points below once it finally touches.<h4>Bull flag at the moving average</h4><p>Had this week closed just a little higher, the moving average would have been pulled above this week’s low. Therefore, if a trader looked back at the weekly chart many weeks from now, he would have seen this week’s low below the average. He would have correctly assumed that the pullback tested the average. It does not matter that in real-time, it never got there. Because the week closed far above enough its low, the close pulled the average above the low of the week. While not accurate, traders will say that this week touched the average.<p>It does not matter that the assumption was wrong. Since many traders and computers will conclude incorrectly that the pullback reached the average, all that matters is their conclusion. It is irrelevant that their reasoning was wrong. They will look to trade based on the assumption that it did. As a trader, that is the only concern, not what really happened.<p>As I said above, this did not happen this week. I am only making a point about how moving averages work. This week’s low ended up just above the moving average. While that is close enough for the bulls to conclude the test is over and the bull trend will resume, the odds are that the Emini has to trade below the average soon.<h4>Moving average gap bars</h4><p>The low of each of the past 41 bars has been above the average. There is therefore a gap between each low and the moving average. These bars are therefore all moving average gap bars. Once there are 20 or more, the bulls will usually buy the 1st pullback to the moving average. Therefore this week is a buy signal bar for next week. Hence, this pullback is a 3 week bull flag.<p>Since 41 gap bars is extreme, the odds are that the pullback will last about 10 bars. Therefore, even though this week is a buy signal bar, there will probably be sellers above. Hence, the 1st reversal up will probably fail and lead to at least one more leg sideways or down.<p>Since the weekly chart is so strongly bullish, the break above this week’s high could lead to a new high. However, since a 10 week trading range is likely, that new high would probably reverse back down. Consequently, it would therefore probably simply be a failed breakout early in a developing trading range.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Emini has begun 5 percent correction down to 2350</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/08/d-6.png\"><img loading=\"lazy\" src=\"2017-8-26-2.png\" alt=\"Emini daily chart in bear flag\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart is reversing up from a 2 legged pullback. It is also a wedge bull flag when including the July 27 low. Yet, it is forming lower highs in a bear channel, and has a Low 2 bear flag going into Monday. Therefore it is in breakout mode.<p>The daily S&amp;P500 Emini futures candlestick chart pulled back from Tuesday’s strong bull breakout. This pullback is therefore likely a bull flag. Furthermore, the Emini has a bullish bias from August 26 to September 5. This adds to the likelihood of a test up next week.<p>The bears need a series of major lower highs to continue their broad bear channel down from the all-time high. Consequently, if the bulls break strongly above the August 16 major lower high, most traders will conclude that the bulls won. They therefore will assume that the Emini will be in a trading range or a bull trend.<p>However, the buy climax on the weekly chart is exceptionally overdone. As a result, 3 weeks down from the high on the weekly chart will probably not be enough for exhausted bulls to buy aggressively again. As a result, if there is a new high, it will probably fail. The bulls will probably take profits and the bears will sell again, looking for a 150 point correction down to the March low.<h4>Broad bear channel</h4><p>The Emini is in a broad bear channel. Therefore, the bears will sell again around the middle of the last leg down. Hence, that is around Tuesday’s high. Friday’s Low 2 bear flag just below the moving average could be the start of the next leg down.<p>Since the Emini is seasonally bullish over the next week and there is a bull flag on the weekly chart, the odds are that the Emini will test higher over the next several days. If the bears are in control, they will start to sell again there, and especially at and below the August 16 major lower high. The math favor the bears, even if the Emini trades up a little next week.<h4>Bull trap</h4><p>There is a wedge bull flag created by the lows of July 27, August 10, and this week’s low. When there is a strong reversal up from a wedge bull flag, like on Tuesday, it creates a possible bull trap. The bulls bought strongly, confident that the bull trend is resuming. What will they think if the bears break below the bottom of the wedge bull flag? They will give up.<p>Whenever the Emini falls below an obvious location for a stop for the bulls, there is generally a 50% chance that the bear breakout will fail. This means that the bulls will get another reversal up.<p>However, Tuesday’s reversal up was very strong, and therefore was created by confident bulls. If they get stopped out, many will be hesitant to buy again. In addition, the weekly buy climax will likely need 2 – 3 months before the bulls will return on the weekly chart. Consequently, the odds that the bears would get a measured move down if they break below that wedge are almost 60%, not 50%. If they get a strong breakout and follow-through selling, the odds would rise to above 60%. This is because the trapped bulls would conclude that the 5% correction was underway and likely to test the start of the 6 month bull channel at the March low.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-8-26"
    }
  ]
}