{
  "7": [
    {
      "data": [
        "<article class=\"post-71126 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Strong Emini breakout above bull channel after proposed tax reform Emini weekend update: October 7, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Strong Emini breakout above bull channel after proposed tax reform<br>Emini weekend update: October 7, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-10-07T00:30:51-07:00\">October 7, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Extremely strong breakout, but climactic</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/10/m-2.png\"><img loading=\"lazy\" src=\"2017-10-7.png\" alt=\"Emini monthly chart is buy climax after Trump decides to pull out of Iran nuclear deal.\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart so far has a bull trend bar this month. Yet, this is the 12th consecutive month without a pullback, and therefore the rally is a buy climax.<p>The monthly S&amp;P500 Emini futures candlestick chart has 12 consecutive bars where the low of every bar is above the low of the prior bar. This has only happened once in S&amp;P futures or Emini contracts the past 50 years. That was in the strong bull breakout of 1995 when the republicans took over congress. That micro channel had its 1st pullback after the 13th month, and the bull trend continued up for 4 years. The breakout led to the biggest rally in at least 50 years, with the market quadrupling over those next 4 years.<p>Because the current rally is coming 8 years into a bull trend, it is unlikely to lead to a move that is anywhere near as strong as the one after the 1995 breakout. However, because it is so strong, the best the bears will probably get over the next few months is a 100 – 200 point pullback. The bulls will buy it so it would therefore be a bull flag.<p>After testing the high, the bears might get a micro double top. But, even if they do, probably the best they will get over the next 6 months is a trading range with a 5 – 10% pullback. Consequently, the downside risk over the next 6 months is small. The bulls will buy reversals down and they will become bull flags.<br><h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Strong breakout above a wedge top</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/10/w.png\"><img loading=\"lazy\" src=\"2017-10-7-1.png\" alt=\"Emini strong breakout above wedge top and now testing 2550 Big Round Number.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart tried to turn down from a wedge top in August. Instead, the bulls bought the selloff and the Emini is now breaking strongly above. The odds are that the bulls will buy the 1st reversal down from the current breakout.<p>The weekly S&amp;P500 Emini futures candlestick chart is in a strong breakout above a wedge top. Bulls will therefore buy the 1st reversal down. Consequently, the odds favor at least one more leg up.<p>While the August pullback got to within a point of the 20 week exponential moving average, it did not touch it. This means that it has remained completely above for the past 47 weeks. The only other time in the 19 year history of the Emini that was longer was in 2003. Then, the rally stayed above for 50 weeks. When it finally pulled back to the average price, the pullback was about 10%. In addition, the Emini went sideways for the next 10 months.<p>Since the current rally is just as extreme, the odds again will favor a longer and possibly deeper pullback than what traders might expect. At a minimum, the pullback will probably fall at least 100 points, but it might be 5 – 10%.<h4>Only small chance of a reversal for at least a couple weeks</h4><p>Since the current rally is so strong, the risk of the pullback beginning withing the next couple of weeks is small. The bears will need at least a micro double top. That would require a 1 – 3 bar pullback, and then a 1 – 3 bar rally back up to high.<p>Even if the bears then get a bigger pullback, the weekly chart is in a tight bull channel. Therefore, the best the bears will probably get over the next few months is a trading range. The bulls will buy any pullback, even if it is surprising deep.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Strong Emini breakout above bull channel after proposed tax reform</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/10/d-1.png\"><img loading=\"lazy\" src=\"2017-10-7-2.png\" alt=\"Emini strong breakout above bull channel after Trump's tax cut and reform proposal.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart is breaking strongly above a bull channel that began in March. The odd favor at least a small 2nd leg up. It stalled on Thursday at the 2550 Big Round Number and the top of the tight bull channel.<p>The daily S&amp;P500 Emini futures candlestick chart had 5 pushes up in a bull channel since the March low. There was a 75% chance of a bear break below the bull trend line and then an evolution into a trading. Hence, there was only a 25% chance of a strong bull breakout. The current 8 day rally is one of those rare successful breakout. The rally has been so strong that the odds favor at least a small 2nd leg up. Consequently, the bulls will buy the 1st pullback. As a result of how eager the bulls are, the 1st pullback will probably only last 1 – 3 days. Furthermore, the best the bears will probably get over the next 2 weeks is a trading range.<p>A broad bull channel functions as a wedge top. A measured move up from the breakout above this top is around 2650. Will the bulls get there without more than a 50 point pullback? Probably not. However, even if the bears get a 100 point reversal, the odds are that the bulls will buy it because this 8 day rally has been exceptionally strong. The odds therefore favor higher prices over the next week or two.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-10-7"
    }
  ],
  "14": [
    {
      "data": [
        "<article class=\"post-71385 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini October earnings season pullback below 2500  Emini weekend update: October 14, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini October earnings season pullback below 2500<br>Emini weekend update: October 14, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-10-14T00:30:02-07:00\">October 14, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Extremely strong breakout, but climactic</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/10/m-4.png\"><img loading=\"lazy\" src=\"2017-10-14.png\" alt=\"Monthly Emini candlestick chart in 12 bar bull micro channel so buy climax.\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart is in a 12 bar bull micro channel (every low is above the low of the prior bar). This is an extremely strong bull trend, but it is unsustainable and therefore climactic.<p>Every bar on the monthly S&amp;P500 Emini futures candlestick chart for the past 12 months has a low above the low of the prior month. The only other time that I can find this happening in the S&amp;P in the past 50 years was in 1995. Then, the pullback came after the 13th month, and it was only a single bar. The rally continued for 5 years and the market quadrupled in price.<p>A 12 bar bull micro channel is a sign of very aggressive buying. Therefore, the odds are that traders will buy below the low of the prior bar. While the pullback can last a few bars (months), and it sometimes can be 10 – 20% deep, the odds are that the best the bears can get over the next 6 months is a bear leg in a trading range. Even if the bears got a 20% correction, the bulls would probably buy it. This is because they know bull trends only rarely immediately reverse into bear trends. More likely, the 1st pullback will be around 5% and last 1 – 3 months. It would therefore be a bull flag.<h4>Longest streak without a 3% pullback?</h4><p>The longest that the Emini has gone without a 3% correction in the past 25 years, and possibly in history of the S&amp;P index, is 241 days. That was in 1995. The current streak is now 236 days just 5 days shy of the record. The next longest streak was only 162 days. This tells traders just how unusual the current streak is. Markets always set new records, and this rally is about to set a new one. However, the odds of it becoming much more extreme are small because that is not how markets behave. They usually regress to the mean. This means that they eventually behave like they have done in the past.<h4>How big can a pullback be?</h4><p>Because the rally is so extreme, the bulls might need 5 – 10 bars before they will buy relentlessly again. Consequently, the rally up from the pullback might only last 1 – 3 bars, and be a part of a tight trading range that could last much longer.<p>In conclusion, while the monthly bull trend is extremely strong, it is historically overbought. As a result, it will likely have a 100 – 200 point pullback that begins within the next month or two. But, the odds are that it will not be the start of a bear trend.<h4>The yearly chart?</h4><p>While I do not have a yearly candlestick chart, it would show that this year is a big bull trend bar. On any time frame, when there is a big bull trend bar, there is usually at least a small tail on top. This is usually from profit taking after the strong rally.<p>The current bar on the yearly chart is over 300 points tall. After an extremely strong bull trend, some firms will take partial profits before the bar closes. This means before the end of the year. This will create a tail on the top of the bar on the yearly chart.<p>What constitutes a tail? Obviously, a close of the year that is 1 tick below the high is all that is required. However, more likely, the tail will be noticeable. For it to be visible on a yearly chart where the bar is more than 300 points tall, the tail would have to be at least 20 – 50 points tall.<h4>What does a tail on the top of a candlestick bar mean?</h4><p>Think about that for a moment. If the Emini closes 20 – 50 points below the high of the year, does that mean that the pullback was only 20 – 50 points? Of course not!! The pullback could easily have been 150 points. If the bulls bought that pullback, they could create a rally back up to near the high of the year.<p>This means that the Emini could selloff 100 – 200 points between now and the end of the year, but then rally to close the year just below the year’s high. I think the odds are that there will be a pullback of at least 100 points before the end of the year. It could be more, but that does not matter. The yearly chart will probably have a visible tail at the top, and the bulls will buy even a 100 – 200 point selloff.<br><h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Pause after buy climax</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/10/w-2.png\"><img loading=\"lazy\" src=\"2017-10-14-1.png\" alt=\"emini weekly candle stick chart in extreme buy climax\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart has not touched the 20 week exponential moving average in 48 weeks. While this is a sign of strong bulls, it is climactic and therefore unsustainable. Furthermore, a bull breakout above a bull channel usually reverses within 5 weeks.<p>The weekly S&amp;P500 Emini futures candlestick chart this week formed a small bar after the prior week’s big bull trend bar. Since all bull trend bars are buy climaxes, and that one was big, there is an increased chance of a pause in the bull trend. When a small bar follows a big buy climax, it is bad follow-through. Hence, this past week is a sell signal bar for next week.<p>The bulls have a breakout above the top of a bull channel. There is only a 25% chance of strong follow-through. In addition, there is a 75% chance of a reversal down below the bottom of the channel beginning within 5 weeks.<h4>20 week exponential moving average</h4><p>While most reversals fail, the odds favor a pullback soon. The Emini has held above its weekly moving average for this many bars only once in its 18 year history. That was in 2003 when it stayed above for 48 weeks. For several months, I have been saying that the 2003 rally was “about 50 weeks,” but I just counted and it was 48 weeks. I don’t know if there is another rally that stayed above for more than 25 weeks so what is going on now is unusually extreme. The pullback in 2003 began on the 47th week. The Emini then went sideways for 10 months, and the pullback reached 10%.<p>The current rally has stayed above the average price for 48 bars, just like in 2003. However, the Emini is now far above the average. It will therefore take at least one more week to reach it. Consequently, the current rally is the most extreme buy climax, by this one measure, in the history of the Emini. The odds are that it will end within a few weeks.<p>Yet, the weekly chart is in a strong bull trend. Therefore, even if the selloff tests the March low, the best the bears can probably get is a bear leg in a trading range. This is true even if the trading range is 200 points tall and lasts several months.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>buy climax, but measured move targets slightly higher</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/10/d-3.png\"><img loading=\"lazy\" src=\"2017-10-14-2.png\" alt=\"Daily Emini candlestick chart in buy climax at 2550 big round number.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart is in a climactic bull trend. It has formed a small wedge rally for 6 days. Although small, the context is good for a reversal soon.<p>Two weeks ago, the daily S&amp;P500 Emini futures candlestick chart broke strongly above the top of a 6 month bull channel. It is now at the top of a steeper 2 month bull channel. After the 6 day rally at the start of October, the odds favored at least a small 2nd leg up. The small wedge rally over the past 6 days met that minimum objective.<p>The bull channel up from the August low is tight and therefore the bull trend is strong. In addition, the 6 day rally since September 28 is exceptionally strong. When there is exceptional strength late in a bull trend, it is more likely a climactic end of the trend and not the start of an even strong leg up. While the 6 day wedge top would typically be minor, the context here is not typical. This small top has a higher probability of signaling the end of the rally up from the August 21 low.<h4>Buy climaxes usually lead to trading ranges, not bear trends</h4><p>Buy climaxes eventually lead to an end of a trend, and not an opposite trend. Therefore, traders should be ready for the trend to evolve into a trading range. Trading ranges can have deep bear legs. Consequently, the pullback from the high can retrace most or all of the last bull leg. That leg began on August 21 and its low is about 140 points below today’s high.<p>Picking a top is a losing strategy. Traders know when a market is overbought and likely to correct, but they can never be certain when the correction will come. Only rarely is there a clear pattern. However, since the weekly and monthly charts are historically overbought, the odds are that the rally will enter a trading range within the next few weeks. The pullback from the high will probably be at least 3 – 5%. In addition, a small wedge top at the end of a buy climax can be the start of that correction. As an example, look at the small wedge top on the weekly chart in March, 2004. That led to a 30 bar (week) trading range.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-10-14"
    }
  ],
  "21": [
    {
      "data": [
        "<article class=\"post-71617 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Buy climax at 30th anniversary of 1987 stock market crash  Emini weekend update: October 21, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Buy climax at 30th anniversary of 1987 stock market crash<br>Emini weekend update: October 21, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-10-21T00:30:11-07:00\">October 21, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Protracted buy climax</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/10/m-5.png\"><img loading=\"lazy\" src=\"2017-10-21.png\" alt=\"Emini parabolic buy climax is accelerating up\"></a><p class=\"caption\">Every bar for the past 11 months has a low above the low of the prior month on the monthly S&amp;P500 Emini futures candlestick chart. This is therefore a 12 bar bull micro channel. Although this means the bull trend is strong, it is also a buy climax. The past 2 months are accelerating upward. While it could be a measuring gap, it will more likely be the start of a blow-off top.<p>The monthly S&amp;P500 Emini futures candlestick chart is in 12 bar bull micro channel. The only time in the past 50 years when the monthly S&amp;P500 cash index had a longer bull micro channel was in 1995. That micro channel lasted 13 months. The pullback lasted only one month, and it was about 4%. The bull trend then continued up 4 fold over the next 5 years.<p>While the current rally will almost certainly not quadruple over the next 5 years, the pullback will probably be comparable to the one in 1995. Therefore, the odds favor about a 5% pullback before the current micro channel lasts much longer.<p>Theoretically, there does not ever have to be a pullback. However, that is not how markets behave. Since it is now showing extreme behavior, it is likely to do what it has always done before it becomes much more extreme. The odds therefore favor a 1 – 3 month pullback beginning within the next few months. Since the bull trend is so strong, the bulls will buy the pullback. This is true even if it lasts a year and falls 20% from the high. The bears would need a reversal at least that big before traders would begin to conclude that the bull trend had ended.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Continuing buy climax</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/10/w-3.png\"><img loading=\"lazy\" src=\"2017-10-21-1.png\" alt=\"emini parabolic wedge buy climax that has not touched it 20 week ema for 49 weeks.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart has not touched the 20 week exponential moving average in 49 weeks. This is a very strong bull trend, but overbought.<p>The weekly S&amp;P500 Emini futures candlestick chart has been above its 20 week moving average for 49 weeks. This has never happened in the 18 years of the Emini. In 2003, it stayed above for 48 weeks and finally touched on the average on the 49th week. It then entered a trading range for the next 10 months. Furthermore, the bottom of that range was 10% below the high.<p>Although the weekly chart can stay above its average price indefinitely, the basis of technical analysis is that the charts are a reflection of rational human behavior. Since the current behavior has to be rational, it is unlikely to deviate from past behavior for too long. Consequently, the odds are that the Emini will soon begin to go sideways to down to its average. To get there quickly, it would have to fall at least 80 points.<p>More likely, once it begins to pull back, it will take several weeks to get there. That would require only about a 50 point drop from the high. However, it will probably fall at least 20 – 50 points below the average after being so far above it for so long. That means that the pullback will probably be 100 – 150 points. However, there is no top yet, and until there is a strong reversal down, the odds favor higher prices.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Buy climax at 30th anniversary of 1987 stock market crash</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/10/d-6.png\"><img loading=\"lazy\" src=\"2017-10-21-2.png\" alt=\"Emini gap up in buy climax so possible exhaustion gap or island top.Buy climax at 30th anniversary of 1987 stock market crash.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart was in a wedge bull channel for 2 weeks. After breaking below it on Thursday, it reversed up. It then gapped up to a new all-time high on Friday. The next target is a measured move up, based on the height of the wedge.<p>The daily S&amp;P500 Emini futures candlestick chart broke below a small wedge top on Thursday, but immediately reversed back up. It gapped up to a new all-time high on Friday. The bulls want strong follow-through buying and at least a measured move up, based on the height of the wedge.<p>The bears want the rally to a new high to fail, and then they want a break below Thursday’s low. That low is a major higher low because it led to a strong reversal up to a new high. A break below would convert the bull trend into either a trading range, or possibly a bear trend.<p>When there is a gap up, the Emini often goes sideways for a few days. The bulls see the small range as a bull flag, but the bears see it as a potential island top. Because Friday closed on its high, it will probably go at least a little higher before there is a 2 – 5 day pause. Then, the Emini will again decide between a reversal down or higher prices. Since most tops fail, the odds always favor higher prices. Yet, because the buy climaxes are so extreme on the weekly and monthly charts, the odds of a reversal are increasing.<h4>Blow-off top?</h4><p>Because of the extreme buy climaxes on the weekly and monthly charts, there is an increased risk of a blow off top. By this, I means a very strong, brief rally that reverses down violently. This rarely happens, but when it does, it usually comes when the Emini is already in a buy climax, like now.<p>Whenever there is an extreme buy climax, there is always an increased chance of one or more big bear days coming at any time. If that happens, it can be the start of a correction that can last 20 or more bars. Since the buy climaxes on the weekly and monthly charts are extreme, when there is a correction, the Emini might go sideways for many months. However, until there is a strong reversal down, the odds are that the buy climax will continue to get more climactic.<h4>Gap up in buy climax so possible island top</h4><p>Whenever there is a gap up to a new high, there is a buy climax on the daily chart. That means that there is an increased chance of a reversal down. This is especially true because the weekly and monthly charts are also in buy climaxes.<p>If the Emini gaps down within the next couple of weeks, that gap down would create an island top with Friday’s gap up. This would slightly increase the odds of a correction, but most tops fail. Therefore, the odds are that an island top would lead to a minor reversal. However, the Emini has never been this overbought in its 18 year history. In addition, the S&amp;P cash index has only been this extreme once in the past 50 years. Hence, there is an increased chance of a 100 point, 5% correction beginning in the next few weeks. Yet, until there is a strong reversal down, the odds continue to favor higher prices.<p>Instead of gapping down, sometimes the Emini trades down and closes the gap. This would happen if the Emini fell back below Thursday’s high. That gap then becomes an exhaustion gap. It has the same significance as an island top.<h4>30 years after the 1987 stock market crash</h4><p>I remember being heavily short that morning 30 years ago. I sold 13 full-size (there were no “minis” back then) S&amp;P futures contracts early that day, which is the equivalent of 65 Emini contracts today. Yes, the price was much less, but it was still a good position, given how volatile the market was and how I was a new trader. Since I had a full surgery schedule that day, I had to close out my position early so that I could go to the operating room.<p>As I was driving to work, I listened to the radio and heard that the stock market was collapsing, but all of the stations said that it was impossible to know how far down it was. The technology could not keep up. There were no bids. No one was buying, and that made it impossible to go short once the selling began. Anyone who bought was stuck with their position for the entire day. Remember, someone has to buy from you for you to go short, and there were zero buyers. None. At the end of the day, the Dow was down 22% and I think the S&amp;P fell 26%. It was the biggest one day crash in history. In fact, it was even bigger than the 1929 crash, although that one continued down for a few years and the Dow ultimately lost about 90%.<h4>Would a beginner manage his trade well during a crash?</h4><p>Had I been able to stay home, and had I held until the close, I would have made $400,000 that day. That would be about a million dollars in today’s money. Even if I made that money, I was a beginner back then. I therefore probably would have given a lot of it back over the next few weeks because there were several extreme reversals. I probably would have bought high and sold low, and lost money. However, it is fun to think back to that time.<p>Will it happen next week? Rare things are rare because they rarely happen. To bet that a rare thing will happen is a low probability bet. Therefore, the odds of a crash anytime soon are tiny, despite the current buy climaxes.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-10-21"
    }
  ],
  "28": [
    {
      "data": [
        "<article class=\"post-71863 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini buy climax before Trump’s tax cuts and FOMC rate hikeEmini weekend update: October 28, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini buy climax before Trump’s tax cuts and FOMC rate hike<br>Emini weekend update: October 28, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-10-28T00:30:01-07:00\">October 28, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Emini buy climax before Trump’s tax cuts and FOMC rate hike</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/10/m-6.png\"><img loading=\"lazy\" src=\"2017-10-28.png\" alt=\"S&amp;P500 Emini chart is in a strong bull trend and buy climax going into FOMC interest rate meeting and Trump's tax cuts.\"></a><p class=\"caption\">The monthly Emini chart has another strong bull bar with just a few days left in the month. The low of every bar has been above the low of the prior bar for 11 months on the monthly S&amp;P500 Emini futures candlestick chart. This is a 12 month micro channel. While it is a sign of a strong bull trend, it is extremely climactic.<p>The monthly S&amp;P500 Emini futures candlestick chart has a 12 bar bull micro channel. The longest bull micro channel in the S&amp;P500 cash index in the past 50 years was 13 weeks. That was in 1995 and at the start of a huge bull trend. The current micro channel is 8 years into a bull trend. It is therefore not likely to lead to a strong rally that will last for the next several years.<p>The 13 month bull micro channel in 1995 led to about a 5% pullback. The bull trend resumed and the stock market quadrupled over the next 5 years. The odds are that the current micro channel will end within the next few months. This is because markets rarely ever get more extreme than in the past. The pullback will probably be similar to the one in 1995. Since the current buy climax is late in bull trend, it might lead to a deeper pullback, and it could last a few bars.<p>However, the odds are that the bulls would buy even a 20% pullback that lasted 6 months. This is because they know that the 1st reversal down in a strong bull trend is usually minor. That means that there is a 70% chance that it will be either a bull flag or a bear leg in what will become a trading range. If it were to be a bear leg in a trading range, it would lead to a bull leg that would test the current all-time high. Consequently, a bull buying now or in a pullback could scale in and have a 70% chance of making at least a small profit.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Historic buy climax</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/10/w-4.png\"><img loading=\"lazy\" src=\"2017-10-28-1.png\" alt=\"Weekly Emini chart in extreme buy climax without touching its 20 week EMA for 50 weeks.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart formed an outside up bar this week. However, it closed near the open and is therefore a neutral bar in a bull trend. It has not touched its 20 week exponential moving average in 50 weeks. It got to within a point in August, but did not touch. This has never happened in the 18 year history of the Emini. It is therefore unsustainable and climactic. Finally, every bull bar or series of bull bars is a climax and a breakout. Each breakout over the past couple of months has led to a doji. This is consecutive buy climaxes and usually leads to a trading range.<p>When the Emini weekly chart this week traded below the last week’s low, it triggered a sell signal. However, last week was a bull bar and therefore a weak sell signal bar. Furthermore, this week rallied back above last week’s high, erasing the sell signal. The bears continue to need consecutive big bear bars on the daily chart before traders believe that a correction is underway.<p>The weekly S&amp;P500 Emini futures candlestick chart has never been this overbought in its 18 year history. This is using its EMA as a measure of the buy climax. The weekly chart stayed above the average for 48 weeks in 2003. This led to a 10 month trading range and a 10% correction. The minimum target for the pullback this time is probably 5% and 2 months. However, since this buy climax is the most extreme in history, there is maybe a 25% chance of a 20% correction lasting more than 6 months.<p>Even if this were to happen, the bulls would buy the selloff. This is because the weekly chart is in a tight bull channel. The odds are that any reversal down will be minor. This means that the best the bears can reasonably hope to get is a trading range. Bulls will buy the selloff, knowing that a bear leg in a trading range will lead to a bull leg in the range, and possibly a resumption of the bull trend.<h4>Can markets be random and irrational?”</h4><p>Because charts are a reflection of rational human behavior, they cannot go much beyond their historical norms. This is because that would be irrational. There are too many firms participating in the market for the chart to stay irrational much longer.<p>However, betting on a return to normalcy is always a low probability bet. There is an adage on Wall St. that highlights this concept:<em>Markets can stay irrational for much longer than you can stay solvent in your bet against the trend.</em>When will it begin to pullback? Probably within the next few weeks. However, the market so often does surprising things that no one should be surprised if the buy climax continues for several more months.<p>Does the Emini ever have to touch any moving average? Yes and no. In theory, no, but in practice, yes. There are always going to be wars and disasters that create reversals that are big enough to return any overbought or oversold market to the Emini’s average prices. I discussed this in a comment after last week’s report, and in case you not see it, I am posting it again here:<blockquote><h4>“Can a chart stay above its 20 bar average forever without accelerating up in a parabolic climax?</h4><p>I agree that everything has to hit “average” at some point in the real world. This is because there is always eventually going to be a major news event that would create a selloff that was big enough to fall below the average. Therefore, I specifically chose the word “indefinitely” instead of “forever.” I want readers to understand that the chart can stay above an average price for much longer than what seems logical when one thinks about what an average is.<p>I have given this some thought over the years, but I have never spent time doing the math. However, from a mathematical perspective, I believe “forever” is correct. The 20 week exponential moving average is based on closes, and it uses almost exclusively those of the past 20 weeks. This week’s close replaces the close of 21 week ago.<p>The candlestick bars on the weekly chart show every price during every week. Can those bars stay above the 20 week average forever without accelerating upward in a parabola? Instead of a candle stick chart, use a line chart, which simply connects closes and is therefore a 1 bar moving average. The question is, can a 1 bar average stay above a 20 bar average without acceleration?<p>Let’s look at a bull trend that keeps going up at the exact same rate every week. Let’s say that every week closes 1 point above the close of the prior week. The rate of change (which is the slope of the line and also the velocity) is constant and therefore there is no acceleration. Both the 1 week and 20 week moving averages are increasing at 1 point per week. Both lines are straight and sloped up at exactly the same angle, and therefore parallel.<p>The 20 week average lags (is lower) because it is held down by prices that go back 20 weeks, and those prices are lower. A 1 bar average is based only on this week’s close. It therefore only “averages” this week, which is higher than each of the the 19 prior closes. It therefore remains above the average of the past 20 bars. Although I might be missing something, this makes me conclude that a chart (candle stick or line), which is always a 1 bar average, can stay above its 20 bar average forever without accelerating.”</blockquote><h2>Daily S&amp;P500 Emini futures candlestick chart:<br>SUMMARY</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/10/d-7.png\"><img loading=\"lazy\" src=\"2017-10-28-2.png\" alt=\"Daily S&amp;P500 Emini chart has buy climax without 3% correction in 241 days.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart triggered a sell signal by falling below Tuesday’s low. It was an inside bar after a breakout to a new high, and therefore a sell signal bar. However, the strong reversal up from the 20 day exponential moving average after triggering the sell signal makes sideways to up more likely.<p>The daily S&amp;P500 Emini futures candlestick chart is in a strong bull trend. There was a 2 week wedge top after the early October strong breakout. That was a reasonable top. Yet, the bulls bought the bear breakout and the Emini rallied to a new high.<p>It then formed an ioi sell setup (inside bar-outside bar-inside bar) on Tuesday. When Wednesday traded below Tuesday’s low, the Emini triggered the sell signal. Because the 2nd half of the week reversed up strongly above Tuesday’s low, the Emini erased the sell signal.<p>The bears continue to need consecutive big bear bars to convince traders that they have taken control. Without that, any reversal down will probably lead to a bull flag or a trading range on the daily chart instead of a correction. The odds would continue to favor at least slightly higher prices.<h4>Breakout Test is a magnet</h4><p>The August 21 low is a major higher low. The August 8 high was a strong reversal down and therefore also major. Therefore, the measured move target based on those prices is major as well. This is especially true because the September 25 low tested the August 8 high and reversed up strongly.<p>The Emini has been oscillating around the measured move target for 2 weeks. It is therefore clearly an important price. In addition, the September 25 low only dipped a little below the August 8 high, which is the breakout point. When a breakout test bar has a big tail, but it only dips a few ticks below support, there is an 80% chance that the Emini will test the breakout again before too long.<p>While the rally from the test has lasted over a month, the odds still are that there will be a reversal down to test that August 8 high again. That reversal probably will begin within a month. This is consistent with the buy climaxes on the weekly and monthly charts. Furthermore, the test would be about a 100 point and 5% correction. This is also consistent with the higher time frame minimum targets.<h4>Longest streak without 3% correction in 90 years</h4><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/10/Streak-chart-4.png\"><img loading=\"lazy\" src=\"2017-10-28-3.png\" alt=\"Stock market longest streak 241 days without 3% correction.\"></a><p class=\"caption\">LPL Research published this chart this week, and I have added text to make it clear. The height of each yellow peak is the number of months since the last 3% correction. The current peak is tied with the 2015 spike for the tallest, with both streaks lasting 12 months, However, the current spike has more days than the 1995 streak, and it is still growing. It is therefore the longest time without a 3% correction since before the 1929 Stock Market Crash. There are many long stretches without yellow peaks. Therefore, there was not even a month between consecutive 3% corrections during those stretches.<p>This daily chart is consistent with the buy climaxes on the weekly and monthly charts. It is a reminder of just how overbought the stock market is. While it can get much more overbought, it is more likely to have at least a 3% correction before going much higher.<h4>Minor seasonal bullish tendency</h4><p>There is a high probability that the close of November 5 is above the close of October 26. Why? I don’t know, but 20 years ago, I used to test lots of seasonal tendencies, and this was one of the better ones. I have not checked it again in many years and it might not be reliable. I mention this only because it is entertaining to watch to see if it happens again. Please note that I never place trades based on small seasonal windows.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noopener\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-10-28"
    }
  ]
}