{
  "3": [
    {
      "data": [
        "<article class=\"post-72987 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Trump rally continuing before tax reform vote and budget resolutionEmini weekend update: December 2, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Trump rally continuing before tax reform vote and budget resolution<br>Emini weekend update: December 2, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-12-03T05:00:57-08:00\">December 3, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Strong bull trend, testing top of bull channel</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/12/m-1.png\"><img loading=\"lazy\" src=\"2017-12-3.png\" alt=\"monthly Emini chart testing top of bull channel in 14 bar bull micro channel before budget reconciliation and tax cut vote\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart had its 3rd consecutive big bull trend bar in November. Furthermore, it has gone 12 months without falling below the low of the prior month. This is therefore a 13 bar bull micro channel. Since it is a sign of very strong bulls, the bulls will buy the 1st 1 – 3 bar pullback. Finally, the rally is just below the top of a 9 year bull channel.<p>The monthly S&amp;P500 Emini futures candlestick chart’s rally is unusually strong and therefore unsustainable and climactic. However, strong bull trends only rarely become bear trends without going sideways for at least a few bars. Therefore the downside risk over the next several months is small. The best the bears can probably get is a pullback for a few months.<p>Since the rally is climactic, there is an increased risk of a reversal after the bull trend resumes up from its 1st pullback. For example, if it forms a micro double top, it could pull back for 6 months or more. Yet, without going sideways for 5 – 10 bars, the odds of a bear trend are small. Consequently, the best the bears can probably get over the nest 6 – 12 months is a trading range. Even if they get a 20% selloff, it will probably only be a bear leg in a trading range.<h4>Top of a 9 year bull channel</h4><p>This rally is testing the top of a 9 year channel. While most channel breakout attempts fail, the momentum up has been exceptional. Consequently, if the bulls fail to break above the top of the channel, the odds are that they will need many bear bars before the bears can get a reversal down. Since this is a monthly chart, the odds are that the best the bears can get over the next 6 months is a fairly tight trading range. There is only a 25% chance that a reversal down in the next several months would begin a bear trend.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Trump rally continuing before tax reform vote and budget resolution</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/12/w.png\"><img loading=\"lazy\" src=\"2017-12-3-1.png\" alt=\"weekly Emini in buy climax before tax reform and budget votes\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart is breaking above a yearlong tight bull channel. However, it has not touched the 20 week exponential moving average in 55 weeks, which is unusual and therefore climactic.<p>The weekly S&amp;P500 Emini futures candlestick chart is continuing in a climactic bull trend. There is no sign of a top. In addition, the yearlong bull channel is tight. That is a sign of very strong bulls. As a result, the bulls will probably buy the 1st reversal down, even if it is more than 5%. Consequently, the risk of a bear trend within the next few months is small. More likely, the best the bears can probably get is a trading range. This means that the 1st reversal will likely be a bull flag lasting a few weeks to a couple months.<h4>No touch of the 20 week exponential moving average in more than a year!</h4><p>The weekly chart has held above its 20 week EMA for 55 weeks. The streak is now more than a year. This has happened only one other time in the history of the S&amp;P500 cash index. That was in 1995 when it stayed above for 62 weeks. The Emini then pulled back 4.6% before the bull trend resumed. The stock market tripled in value over the next 5 years.<p>The current streak is already exceptional. Most streaks end around 20 weeks. However, there is no sign of a top. Furthermore, the 20 week EMA is so far below that any reversal would probably take several weeks to get there. This means that the streak will continue for at least a few more weeks.<p>When the Emini finally reaches it average weekly price, the bulls will be eager to buy. This is because they have been paying an above average price for a year. They will see the average price as a brief discount. When there is a pullback, it may fall 20 or more points below the average before the bull trend resumes. The chance of a reversal into a bear trend on the 1st time down is small.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Sharp pullback on Friday, but became buy signal bar</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/12/d.png\"><img loading=\"lazy\" src=\"2017-12-3-2.png\" alt=\"daily emini testing top of bull channel before budget vote on december 8\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart sold off on Friday, but reversed up strongly. Friday is therefore a High 1 buy signal bar for Monday. Since it is a doji bar, it is a low probability buy signal and the odds favor sideways soon.<p>The daily S&amp;P500 Emini futures candlestick chart has not had a 3% correction in 261 trading days and 395 calendar days. This is the longest streak in the history of the stock market. However, there is no sign that it is about to end. A 3% correction is about 80 points. That would probably require at least 3 days. Consequently, the streak will probably last at least 3 more days. As strong as Friday’s early selloff was, it was only about 2%.<p>Because strong rallies only rarely reverse into strong selloffs, the bears will probably need at least a small trading range before a 3% correction begins. Therefore, the streak will likely last at least another week or two, and possibly many more weeks.<p>The 3 week rally has lacked consecutive big bull trend bars. It is therefore not as strong as the other breakouts since March. However, it is strong enough so that the bears will need at least a micro double top before they can create a strong reversal down. Therefore, the best they probably can get over the next week is a pullback.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-12-3"
    }
  ],
  "9": [
    {
      "data": [
        "<article class=\"post-73193 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Tax cut and budget votes threatening Trump’s stock market rally Emini weekend update: December 9, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Tax cut and budget votes threatening Trump’s stock market rally<br>Emini weekend update: December 9, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-12-09T00:30:30-08:00\">December 9, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Strong bull trend, but unsustainable and therefore a buy climax</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/12/m-3.png\"><img loading=\"lazy\" src=\"2017-12-9.png\" alt=\"Emini monthly chart testing top of bull channel before congress vote on Trump tax cuts.\"></a><p class=\"caption\">After 3 big bull bars, this month so far is a doji bar. Its low is above last month’s low. This is the 14th month without a pullback Additionally, the monthly S&amp;P500 Emini futures candlestick chart is now at the top of a 9 year bull channel.<p>The monthly S&amp;P500 Emini futures candlestick chart has not had a pullback in 14 months. This has never happened in the history of the stock market. That makes this rally extreme and unsustainable. Hence, it is a buy climax. The odds therefore are that this month will fall below last month’s low or next month will fall below this month’s low. If this month remains as a doji bar or becomes a bear bar, the odds of a pullback within the next 1 – 2 months will be 70%.<p>While the 14 bar bull micro channel is a buy climax, it is also a sign of very strong bulls. They are buying at the market and not even waiting for a pullback before buying. Consequently, once they finally an opportunity to buy below the low of the prior month, they will probably eagerly do so. Therefore, the odds are that the 1st pullback to below the low of the prior month will be brief. Hence, it will likely be only a 1 – 3 bar bull flag. The odds of a reversal down into a bear trend when there has not been even a micro double top are only 20%.<h4>Top of 9 year bull channel</h4><p>While 75% of breakout attempts above or below channels fail, this 22 month bull leg in the 9 year bull channel has been in a very tight bull channel. Consequently, a strong reversal down from the top of the 9 year channel is unlikely without the monthly chart forming at least a micro double top. That means that the downside risk is small for at least several months.<p>In addition, when a channel has been as strong as this 22 month leg has been, the Emini usually has to go sideways for 5 – 10 bars before the bears have a reasonable chance of a reversal down to the bottom of the 9 year channel. That means that the downside risk over the next year is also small. It is more likely that the best the bears will get over the next year is a trading range, not a strong reversal down.<h4>1st pullback will be about 100 points</h4><p>Since the monthly bars have been 70 or more points tall, a pullback to below the prior month’s low will be at least 70 points. It probably will fall more than a few ticks below. Therefore, the 1st pullback will likely be about 100 points. While that would be a bear trend on the daily chart, it would only be a bull flag on the monthly chart. A bull flag means that a resumption of the bull trend is more likely than a reversal into a bear trend.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Parabolic buy climax</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/12/w-2.png\"><img loading=\"lazy\" src=\"2017-12-9-1.png\" alt=\"Emini weekly chart in buy climax before government shutdown vote.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart has not touched the 20 week exponential moving average in 56 weeks. This week is a weak follow-through bar after last week’s big bull bar.<p>The weekly S&amp;P500 Emini futures candlestick chart is in a strong bull trend. This week was not a big bull trend bar. Hence, it is bad follow-through after last week’s big bull trend bar. Because last week was the biggest bull bar in more than 20 weeks, it is more likely an exhaustion move than the start of a new, stronger leg up. Yet, a buy climax bar often has one more strong bull bar before the Emini enters a trading range. Therefore, next week might be another big bull trend bar. However, the odds are that the bull breakout would soon fail.<p>An exhausted buy climax usually stops going up, and it sometimes reverses down. However, when the rally is in a tight bull channel like this one, the reversal usually goes mostly sideways to down for 5 – 10 bars. The odds of a strong bull trend immediately reversing into a strong bear trend are small. Consequently, the best the bears can probably get over the next few weeks is a trading range.<h4>Suppose there is a 5% correction?</h4><p>Even if the monthly chart pulls back below the prior month’s low and the selloff is 100 points or about 5%, the bulls who trade the weekly chart will buy it. This is because if the selloff is part of a new trading range, it will lead to a test back up to the top of the range. They therefore will make money if they scale in lower (buy more). If instead it is a small bull flag, the bull trend will resume, and they also will make money.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Tax cut and budget votes threatening Trump’s stock market rally</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/12/d-1.png\"><img loading=\"lazy\" src=\"2017-12-9-2.png\" alt=\"Daily Emini chart has bull flag before congress votes on budget and tax cuts.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart is beginning to go sideways after a buy climax.<p>The daily S&amp;P500 Emini futures candlestick chart has had big moves up and down over the past 2 weeks. This is a sign that the bulls are getting quicker to take profits and the bears are getting more aggressive. However, trends constantly try to reverse, and my 80% rule says that 80% of reversal attempts fail. Consequently even though a 100 point selloff is likely within the next few months, betting that a particular top will be the final top is a losing strategy. Look back over the past 6 months. There have been many reasonable tops and many strong bear reversals. Each was only a pullback and it led to a new high.<p>Since the monthly, weekly, and daily charts have never all been this overbought, the odds of a 5% correction over the next several months are probably 70%. However, until the daily chart has consecutive big bear bars, the odds continue to favor at least slightly higher prices.<h4>Longest streak without 3% correction</h4><p>The daily chart has now not had a 3% correction in 268 trading days and 402 calendar days. This is by far the longest streak in the history of the stock market. There never has to be a 3% correction. However, there will be one. In fact, at some point over the next 20 years, there will be a 50% correction.<p>Because charts are a reflection of rational human behavior, patterns repeat. Consequently, the Emini’s price action will soon have a regression back to its mean behavior. This means it will soon begin to behave as it has always done, and get its 3% correction. Since a pullback below the low of a prior month is likely, the correction will probably be more like 100 points and 5%.<p>Can it be 20%? When a buy climax is as extreme as this one has been, there is always an increased chance of a very big and fast reversal, like in 1987. However, the chance of it is small. If there is some shocking news event, it could happen, but things like that happen only once every 10 years. It’s always easier to make money betting on things that are likely to happen. Betting on a 20% correction at the moment is a low probability bet. Most likely, the Emini will begin to pull back within the next couple of months and the bulls will buy again about 100 points down.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-12-9"
    }
  ],
  "16": [
    {
      "data": [
        "<article class=\"post-73438 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini Trump rally awaiting Christmas tax cut voteEmini weekend update: December 16, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini Trump rally awaiting Christmas tax cut vote<br>Emini weekend update: December 16, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-12-16T00:30:10-08:00\">December 16, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Extremely strong bull trend</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/12/m-4.png\"><img loading=\"lazy\" src=\"2017-12-16.png\" alt=\"Emini Trump rally continuing before Trump tax cuts\"></a><p class=\"caption\">So far, this month’s S&amp;P500 Emini futures candlestick chart has a bull bar. Its low is above last month’s low. It is therefore the 13th consecutive month without a pullback. In addition, it is at the top of a 9 year bull channel.<p>The monthly S&amp;P500 cash index’s candlestick chart currently has its 1st 14 bar bull micro channel since the index was created in 1923. While a chart never has to have a pullback, one always eventually comes. Because this is beyond what the stock market has ever done, there is a 70% chance of a pullback within the next few months.<p>A pullback simply means that a month trades below the low of the prior month. Because the bulls have been so eager to buy that they have not been waiting for a pullback, they will eagerly buy one when they get a chance. Consequently, the odds are that the 1st pullback will only last 1 – 3 months. The bull trend will then resume.<p>Since the bars on the monthly chart are about 70 points tall, the 1st pullback will likely be at least 70 points. It probably will be around 100 points. This would create a 3 – 5% correction.<p>A 14 bar bull micro channel is extreme and therefore climactic and unsustainable. As a result, the trend resumption up from the pullback might only last a few bars before there is another pullback. That means that the odds are that the bull trend will begin to enter a trading range over the next 10 bars. Ten bars is about a year.<h4>Sideways to up in 2018</h4><p>Since the rally is so strong, the odds favor mostly sideways to up next year. However, there probably will be at least 2 – 3 pullbacks that last 1 – 3 months.<p>When a bull trend is this strong, there is only a 20% chance that the 1st pullback grow into a bear trend. The bears will need at least a micro double top or 3 consecutive bear bars before traders begin to believe that the bears are creating a bear trend.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Weak follow-through after November bull breakout</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/12/w-3.png\"><img loading=\"lazy\" src=\"2017-12-16-1.png\" alt=\"Weekly Emini chart in buy climax, but no top, despite Trump tax cut vote and budget votes.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart had a bull trend bar this week after last week’s bear doji. This is follow-through buying after a strong breakout above a tight bull channel 3 weeks ago. It is also the 57th consecutive week without touching the 20 week exponential moving average.<p>The weekly S&amp;P500 Emini futures candlestick chart has not touched its 20 week EMA in 57 weeks. The longest streak in the history of the S&amp;P cash index was 62 weeks, and that was in 1995. The next longest was only about 40 weeks. This rally is therefore extreme. Consequently, the odds are that the Emini will begin to pull back within the next couple of months.<p>The EMA is more than 100 points below. The pullback will probably fall 20 – 50 points below the average. As a result, when the pullback comes, it will probably be more than 100 points from the high. This would be about a 5% correction.<p>The yearlong bull channel is tight. The bull trend is therefore strong. There is only a 20% chance that a strong bull trend will reverse into a bear trend without 1st forming a trading range or a major trend reversal. Therefore, the downside risk over the next several months is small.<h4>What happens if there is a trading range?</h4><p>Even though a trading range is more likely than a bear trend, the trading range can be tall. For example, if the 1st leg down falls below the August high, the selloff could be about 10%. Yet, the odds are that it would be a bear leg in a trading range and not the start of a bear trend. Once there was then a bull leg in the range, the bears would try to form a lower high major trend reversal.<p>A major reversal down needs strong selling pressure. This usually means that the 1st leg down has to last 10 or more bars. In addition, the rally back up is usually about 10 or more bars. This means that the bears will likely need 20 or more bars before they can create a reliable top. Hence, the best they can probably get over the next 6 months is a trading range. Consequently, the bulls will buy selloffs, even if they are strong, and even if one falls about 10%.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Emini Trump rally awaiting Christmas tax cut vote</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/12/d-2.png\"><img loading=\"lazy\" src=\"2017-12-16-2.png\" alt=\"Emini wedge top before trump tax cut vote.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick rallied strongly this week. This is the 3rd push up since the December low so a reversal next week would form a wedge top.<p>The daily S&amp;P500 Emini futures candlestick chart rallied strongly this week. However, it has not had a 3% correction in 275 trading days and 409 calendar days. That is the longest streak by far in the history of the stock market.<p>Charts map out rational human behavior. Consequently, moves that are far beyond past behavior always end before long. This means that the Emini will soon begin a 3% pullback. Because the target for the bears on the weekly chart is more than 100 points down, the odds are that the correction will probably be closer to 5%. While it could be more, the bulls will probably be eager to buy below the prior month’s low and around the 20 week EMA. Therefore, the first leg down will probably be about 5%, and not 10 – 20%.<h4>What will the top look like?</h4><p>The bears have have many credible sell setups this year. If the Emini reverses down next week, it will create a 3 week wedge top. However, my 80% rule says that 80% of trend reversal attempts fail. Therefore, betting that any one top is the final top is a low probability bet. The bulls have bought every reversal all year, and each became a bull flag.<p>Since the Emini has never been this overbought, there is a 70% chance of a 3 – 5% correction starting within the next couple of months. Therefore, one of these tops finally will work. However, until there are at least 2 consecutive big bear bars, traders will assume that any reversal down will be like all of the others. The bulls will buy it and the Emini will probably make a new all-time high.<p>Once there are 2 consecutive big bear bars, traders will begin to believe that a 5% correction has begun. But, 2 big bear bars could easily fall 60 or more points down from the high. This means that by the time traders believe that a correction might be underway, it will probably already be half over.<h4>2018 test of August high</h4><p>The September 25 pullback tested the breakout above the August 8 high. However, September 25 was a small doji that barely overlapped the breakout point. This is a weak foundation for a huge rally. Therefore, the odds are that it will have to get tested over the next 3 – 6 months. The means that the odds are that the Emini will eventually test down to below 2500 at some point in 2018. However, the monthly bull trend is strong. As bearish as a 200 point correction on the daily chart would be, it would still be a bull flag on the monthly chart. The odds are that 2018 will continue up, even if there is a 10% pullback at some point.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-12-16"
    }
  ],
  "23": [
    {
      "data": [
        "<article class=\"post-73616 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Trump Emini rally could end with government shutdown Emini weekend update: December 23, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Trump Emini rally could end with government shutdown<br>Emini weekend update: December 23, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-12-23T00:30:32-08:00\">December 23, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Extremely strong rally, but at top of bull channel</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/12/m-5.png\"><img loading=\"lazy\" src=\"2017-12-23.png\" alt=\"Emini trump rally ahead of government shutdown vote\"></a><p class=\"caption\">Every low for the past 13 months is above the low of the prior month’s low on the monthly S&amp;P500 Emini futures candlestick chart. This means the bull trend is strong, but it is climactic. The rally is testing the top of the 8 year bull channel.<p>The monthly S&amp;P500 Emini futures candlestick chart has never been this overbought in its 18 year history. In fact, the cash index has never been this overbought since it was established in 1923. The longest prior streak without at least a one bar pullback was 13 months.<p>The current streak is 14 months with no sign of a top. Because it is beyond the prior limits of behavior, it is unlikely to continue much longer. There is therefore a 70% chance of a pullback within the next few months.<h4>Pullback means pause, not reversal</h4><p>A pullback simply means that a month trades below the low of the prior month. The bulls have been so eager to buy that they have been buying above the prior month’s low for over a year. Despite the extreme buy climax, they will be happy to finally be able to buy below the prior month’s low. Consequently, the bears will probably be unable to hold the Emini down for more than 2 – 3 months. As a result, any reversal will more likely be a bull flag than a bear trend. This means that the 1st pullback will lead to a test back up to the all-time high.<p>When a bull micro channel lasts 10 or more months and the rally resumes up from the 1st pullback, the Emini usually pulls back again within 5 months. This means that the Emini will probably be more volatile starting in the spring. Less likely, the test of the high will break out into another sustained leg up.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Likely final bars of buy climax</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/12/w-4.png\"><img loading=\"lazy\" src=\"2017-12-23-1.png\" alt=\"Emini weekly buy climax before congress votes on budget resolution.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart is in a strong bull trend. However, this week has bad follow-through buying after last week. This is the same as 2 and 3 weeks ago. Consecutive buy climaxes increase the chance of an evolution into a trading range soon.<p>The weekly S&amp;P500 Emini futures candlestick chart has not touched its 20 week exponential moving average (EMA) in 58 weeks. It got to within 2 ticks in August. The longest streak in the 94 year history of the S&amp;P cash index was 62 weeks in 1995 and 1996. The 1996 pullback began in the 55 week, and it needed 7 weeks to get down to the EMA. If the current streak took 7 weeks to reach the EMA, the streak would end at 65 weeks. That would be the longest in history.<p>Because this rally is so extreme, when the pullback begins, the selloff could be quick. As a result, it still could achieve its goal of touching the EMA in less that 62 weeks. That is not important. What is important is that the current streak represents behavior more extreme than at anytime in history. It therefore will likely end in the next couple of months.<h4>20 Gap Bar Buy Setup</h4><p>There is a gap between this week’s low and the EMA. When 20 or more bars have gaps, it is a sign of strong bulls. As a result, the bulls usually buy once the pullback reaches the average price. The current streak has 57 gap bars, which is far more than 20. Because it is so extreme, the bulls might be exhausted. Consequently, they might not buy right away at the EMA.<p>Exhausted bulls usually wait to buy aggressively until after the pullback has at least 10 bars and two legs. This means that the pullback will probably last 2 – 3 months. In addition, it will probably fall at least 20 – 50 points below the EMA. Since the EMA is more than 100 points below the high, the pullback will probably be at least 100 points and maybe 5 – 10%.<h4>Bull trends usually become trading ranges, not bear trends</h4><p>Bull trends rarely become bear trends without 1st transitioning into a trading range. The bulls want the pullback to last only a month or two and become a bull flag. However, it might be deeper and last longer. If so, instead of a bull flag, the reversal could instead be the start of a trading range.<p>Therefore, even if there is a 200 point selloff, it will more likely just be a bear leg in a trading range than the start of a bear trend. This means that it will lead to a bull leg in the developing trading range. Since a trading range usually needs at least 20 bars create a major trend reversal setup, the risk of a bear trend is small in the 1st half of 2018.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Trump Emini rally could end with government shutdown</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/12/d-4.png\"><img loading=\"lazy\" src=\"2017-12-23-2.png\" alt=\"The daily S&amp;P Emini and cash index has not had a 3% correction in a year.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart had 4 consecutive bear bars this week. However, 2 were dojis and this is a 5 day tight trading range. This is also the 3rd push up from the December 1 low. It is therefore a wedge rally. The Emini has not had a 3% correction in 282 trading days, which is a record.<p>The week between Christmas and New Year’s Day usually has the smallest volume of the year. Most of the days spend most of their time in tight ranges. Therefore, that is what is likely this coming week.<p>The daily S&amp;P500 Emini futures candlestick chart is the most overbought it has ever been. In addition, the cash index has never been this overbought since it began in 1923. There has not been a 3% correction in 282 trading days and 416 calendar days. This is by far the longest streak in the 94 years of the S&amp;P index. Therefore, it is unsustainable and unlikely to continue much longer.<p>December has had big swings up and down. Increased volatility late in a bull trend means bears are becoming stronger. This therefore increases the chance of a pause in the bull trend, or even a reversal on the daily chart. However, there have been many reasonable tops this year, and every one has failed.<p>This is what traders should expect. Markets have inertia and are very resistant to change. Consequently, my 80% rule says that 80% of tops lead to bull flags or trading ranges and not bear trends. The bears need consecutive big bear bars before traders will begin to believe that a correction might be beginning. Until then, the odds favor at least slightly higher prices.<h4>January 19 vote on a government shutdown</h4><p>The vote on the government’s budget is a major financial event. Congress postponed it to January 19. If they cannot pass the bill, the government will shut down, which will likely cause a selloff for a few weeks. Even if they pass the bill and there are no surprises, the bulls might take profits. This means that there could be a selloff after the vote, even if the bill passes and it is a good bill.<p>The rally over the past month has been extreme. The bulls are probably exhausted. They therefore might wait 10 or more bars before buying again. In addition, the Emini might become quiet before the budget vote. Hence, it might enter a tight range going into the mid-January vote.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-12-23"
    }
  ]
}