{
  "6": [
    {
      "data": [
        "<article class=\"post-66624 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Trump rally to new all time high leading to correction: Emini 2% up for 3 weeks, then 5% down for 2 monthsEmini weekend update: May 6, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Trump rally to new all time high leading to correction: Emini 2% up for 3 weeks, then 5% down for 2 months<br>Emini weekend update: May 6, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-05-06T00:30:45-07:00\">May 6, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Trump rally to new all time high leading to correction</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/05/m-1.png\"><img loading=\"lazy\" src=\"2017-5-6.png\" alt=\"Stock market in strong bull trend with bull flag, testing 2400 big round number.\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart had a bull inside bar last month. It is therefore a buy signal bar in a strong bull trend. The bulls triggered the buy signal by breaking above the April high.<p>The monthly S&amp;P500 Emini futures candlestick chart is in a 17 month strong bull trend. Because last month was a bull inside bar, it is a buy signal bar. Since the 17 month rally is in a tight bull channel, it is strong. The bulls triggered the buy signal at the end of Friday by rallying above the April high.<p>But, this High 1 bull flag is at the top of a 6 month buy climax. Furthermore, it is at a measured move up from a 2 year trading range. The breakout above a High 1 bull flag at resistance and after a buy climax usually fails. As a result, there are probably more sellers than buyers above the April high.<p>Consequently, the breakout will probably reverse down into a 2 – 3 month bull flag within a month or two. Because the 17 month bull channel is tight, bulls will buy the 1st reversal down. Hence, a 2 – 3 month selloff will probably become a bull flag and not a bear trend.<p>Yet, after the Emini rallies up from that bull flag, the bears will try to create a micro double top with the top of the current rally. If they succeed, they would have a higher probability of creating a major reversal down at that point.<h4>Final Bull Flag</h4><p>The 2014 – 2015 trading range is late in an 8 year bull trend. Hence, it will probably be the Final Bull Flag. Therefore, the upside from here is probably limited to 100 points or so before the Emini reverses back to the 1,800 bottom of that Final Flag.<p>That major reversal down will probably need at least a micro double top. Since that would take at least a few months to appear, the downside risk over the next several months is probably about 150 points and a few months. Hence, a pullback into a bull flag over the next few months is more likely than a reversal into a bear trend.<p>There is no major top yet. Furthermore, the top might take 10 or more bars to complete. Consequently, the bears might need 2 – 3 years before they can test down to the 1,800 level.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Unusually extreme buy climax, but no top yet</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/05/w-1.png\"><img loading=\"lazy\" src=\"2017-5-6-1.png\" alt=\"emini buy climax in Trump rally so odds favor 5% correction.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart formed a small bull trend&nbsp;bar this week. This is after last week’s gap up. This week was the 25th consecutive week completely above the 20 week exponential moving average (EMA).<p>The weekly S&amp;P500 Emini futures candlestick chart has been above is moving average for 24 weeks. This has happened only twice in the 8 year bull trend. Early in the trend, it stayed above for 27 weeks, and then again for 26 weeks. The reversal down to the moving average began around the 24th week in both cases.<p>Since trends tend to weaken as they age, the current rally will probably not be stronger than the 2 earlier ones. In the 19 year history of the Emini, the weekly chart stayed above its average for more than 27 weeks only once. That was in 2003 when it stayed above for 51 weeks. Yet, it got very close to the average on the 17th and 25th weeks. That relieved the overbought condition and allowed for the trend up to resume.<p>The March and April lows this year did not get close enough to the average price to relieve the overbought situation. Hence, there is a 70% chance that the Emini will begin to reverse down to the weekly moving average within the next few weeks. There is only a 30% chance that the current strong rally will continue for more than a few weeks before pulling back.<h4>Perfect trade</h4><p>Perfect trades cannot exist. A perfect trade has a high probability of a big reward while risking very little. All trades are a combination of probability and risk/reward. If one side gets good probability, the other side gets good risk/reward. For a trade to take place, there has to be a reason for both the buyer and seller to trade. Therefore, a trade that is perfectly good for one side is perfectly bad for the other. No one would take a perfectly bad trade. This is one where there is a low probability of a profit, and the profit is tiny compared to the risk.<p>While perfect trades cannot exist, unusually good ones can. This is the current situation on the weekly chart. There is a 70% chance of a 100 points selloff before the Emini goes 50 points higher. Hence, the probability is high that a trader can make a reward that is at least twice his risk.<h4>Good time to buy puts or put spreads</h4><p>This buy climax is very unusual, and therefore buying June or July puts or put spreads is a good trade. Traders should wait to see if the breakout stalls next week. The risk is the cost of the options, and the reward is at least twice the size of the cost. If a rally lasted more than a few weeks, traders could exit before losing the entire cost of their options. Hence, the actual risk is less that the cost of the puts. Furthermore, if the Emini fell 150 points or more, the reward could be more than 2 times the cost of the options.<h4>Possible island top</h4><p>The Emini closed at its all-time high. Hence, it could gap up again next week. If, however, the Emini gaps down on Monday to below the low of this past week, it would create a gap down on the weekly chart. Since the weekly chart gapped up 2 weeks ago, the gap down would create an island top.<p>While most island tops and bottoms lead to legs in a trading range, they sometimes lead to trends. Because a swing down is likely over the next couple of months, a big gap down on Monday could be the start of the correction. This would be more likely if Monday gapped down and formed a big bear trend bar.<p>Furthermore, the probability would go up if next week gapped down and the week was a big bear bar on the weekly chart. Additionally, the bears would need follow-through selling over the following days to convince traders that a correction was underway.<p>Yet, unless the Emini breaks below the March 27 bottom of the 2 month trading range, traders will assume that any selloff was just another bear leg in the range. Since that low is the neck line of the 2 month double top, a break below could lead to a measured move down. That would therefore result in a test of last year’s close.<h4>Last year’s close</h4><p>The Trump rally began in November. A measured move up from the November low to the December close is 2,396.75. The March 1st all-time high and Friday’s high was 2398.00. It was therefore very close to the target.<p>Whenever a market stops at a target, it is telling traders that the prices that led to the target are important. Consequently, the December close is important. Yet, the Emini never pulled back to test this important price. Therefore, if the Emini pulls back to below the weekly moving average, there is a 50% chance that the selloff will continue down to the December close.<p>Since the monthly chart is in a strong bull trend, the monthly bulls will buy a deep pullback. A test of the December close would be a 50% pullback from the Trump rally and a therefore a logical price for the bulls to buy again.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Breakout above bull flag</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/05/d.png\"><img loading=\"lazy\" src=\"2017-5-6-2.png\" alt=\"Trump rally testing Emini all-time high\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart broke above a High 2 bull flag on Thursday. Friday rallied strongly and reached the all-time high exactly to the tick.<p>The daily S&amp;P500 Emini futures candlestick chart has rallied for several weeks. Yet, because of the unusual buy climax on the weekly chart, the bears will look for a sell setup. The momentum up is strong and there is no top yet. The odds favor higher prices, although the bears hope for a reversal down from the current perfect double top<p>If the Emini reverses down from where it is now, it would be have a perfect double top with the March high. Because the momentum up is strong, the Emini will probably trade above the March high and above 2,400 next week. If so, the bears might create a wedge top, where the April 5 and April 26 highs were the 1st 2 pushes up. A reversal down would then be a wedge higher high major trend reversal.<p>Since most tops fail, picking the exact one is a low probability bet. Yet, the odds are high that the Emini will begin a 100 – 150 correction within a few weeks. Therefore, traders should be prepared for a swing down that could last a couple of months. If one develops, there will be several strong bear trend days. Day traders should therefore be ready to swing trade their shorts during those days.<h4>The bull case</h4><p>The Emini has been in a strong bull trend for 8 years. Yet, the weekly chart has an unusual buy climax. Hence, there is a 70% chance of a correction beginning within a few weeks. However, that means that there is a 30% chance that the current rally could last many more months without a 5% correction. The odds for the bulls reaching 2,500 without the correction will go up if they can get a strong rally from here that lasts more than 3 weeks.<h3>Summary: 2% up over 3 weeks, then 5% down over 2 months</h3><p>The momentum up is strong on all time frames and there is no top yet. Traders will continue to buy. Yet, the weekly buy climax is extreme by historical standards. Therefore, the odds are against the rally lasting more than a few weeks. Since the momentum up is strong, the rally might continue for another 1 – 2% over the next 3 weeks. The pullback on the monthly chart should last 2 – 3 bars, which is 2 – 3 months. The selloff should go below the weekly moving average, which means about 100 – 150 points, and about 5%.<p>Since the weekly and monthly trends are so strong, bulls will buy the pullback. Consequently, the best the bears will likely get over the next 3 – 6 months is a 150 point pullback and then a trading range. Once there is a trading range, they then will have a better chance of a major reversal. But, because most reversals fail, the odds continue to favor the bulls indefinitely until there is a strong reversal down with strong follow-through.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener noreferrer\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noopener noreferrer\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener noreferrer\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noopener noreferrer\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-5-6"
    }
  ],
  "13": [
    {
      "data": [
        "<article class=\"post-66903 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Trump firing of Comey is catalyst for 5 percent correctionEmini weekend update: May 13, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Trump firing of Comey is catalyst for 5 percent correction<br>Emini weekend update: May 13, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-05-13T00:30:12-07:00\">May 13, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Weak entry bar after 1 bar bull flag</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/05/m-4.png\"><img loading=\"lazy\" src=\"2017-5-13.png\" alt=\"Emini bull trend but final flag in stock market after buy climax\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart had a High 1 bull flag in April. May traded above the April high, and therefore triggered the buy signal.<p>The monthly S&amp;P500 Emini futures candlestick chart is a small doji bar so far this month. Because it traded above the April high and April was a one bar High 1 bull flag, it triggered a buy signal. Yet, a High 1 bull flag after a 6 week buy climax and at the resistance of a measured move is a low probability trade. Usually, the Emini rallies for 1 or 2 bars and then pulls back for several bars. Therefore, this breakout will probably reverse down this month or in June.<p>Since the 17 month rally is in a tight bull channel, it is very strong. Therefore bulls will buy the 1st selloff. Hence, it will probably become a 2 – 3 month bull flag instead of the start of a bear trend. However, a 3 month bull flag on the monthly chart could easily fall 150 points from the high. This would therefore be enough for the daily chart to be in a 3 month bear trend.<h4>Final bull flag</h4><p>The Emini is at the measured move up from its 2014 – 2015 trading range. Since that range formed late in an 8 year bull trend, it will probably be the final bull flag. Consequently, the upside over the next year is probably not great. The Emini will probably go mostly sideways for a year or so and begin to form a top.<p>The top might be as high as 2500. Then, the Emini will probably get pulled back into the 2014 – 2015 trading range. This process could take 20 or more bars. Since this is a monthly chart, it might take 2 – 3 years do test back down to the 1800 bottom of that 2 year final bull flag.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Extreme buy climax</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/05/w-3.png\"><img loading=\"lazy\" src=\"2017-5-13-1.png\" alt=\"emini sell signal for failed breakout above March high and 2400. Trump firing of Comey is catalyst for 5 percent correction.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart had a bear trend bar this week. It is therefore a sell signal bar for a small higher high major trend reversal.<p>The weekly S&amp;P500 Emini futures candlestick chart has not touched its 20 week exponential moving average in 26 weeks. When a bar is completely above the moving average, there is a gap between its low and the moving average. I call that a bull gap bar. In the 8 year bull trend, the longest series of bull gap bars was 27 weeks. Furthermore, that was at the start of a bull trend. Since trends often begin with a strong breakout, they are often strongest early on.<p>Yet, this current rally is just as strong. Furthermore, that 27 weeks of gap bars began to turn down at the 23rd week. Since this week had a bear body, it might be the start of the reversal down. Because it is far above the moving average, it might need several weeks to get there. Therefore, this stretch will probably be the longest in the 8 year bull trend.<h4>Longest series of gap bars was after the 2003 bear trend low</h4><p>There has only been one time in the 18 year history of the Emini when the weekly chart stayed above its average for more than 27 weeks. That happened in 2003 after a huge bear trend. The reversal up was very strong and the Emini stayed above the average for about 50 weeks.<p>Yet, there were two pullbacks around 17 and 25 weeks that got very close to the average. Hence, they were probably enough to relieve the buy climax, and this allowed the rally to continue. Furthermore, that was after a strong reversal up from an extreme sell climax, and therefore more likely to be a very strong rally.<p>That is very different from the current situation. Now, the Emini is at the end of an 8 year bull trend, not the beginning. Therefore it is likely to be not as strong as the start of a bull trend. Hence, this 26 week stretch of gap bars is probably an exhaustive move instead of a measuring gap for the start of a new swing up.<h4>Island top?</h4><p>If the Emini gaps down on Monday, it will create a 3 week<a href=\"https://www.brookstradingcourse.com/how-to-trade-manual/trend-reversals/#island-top-and-island-bottom-trend-reversals\" target=\"_blank\">island top</a>. In addition, if next week then becomes a big bear trend bar, the selloff to the weekly moving average will probably have begun. While most island tops and bottoms form in trading ranges and are no more important than any other minor reversal, this one is different. That is because it would be forming in an extremely overbought market. It therefore would have a higher probability of beginning a swing down for about 10 bars.<p>Ten bars on the weekly chart is about 2 months. That is consistent with the monthly chart. The bull trend is so strong on the monthly chart that the bulls will look to buy a 2 – 3 bar (month) pullback.<p>If Monday gaps down, but then rallies to close the gap, there would no longer be an island top. Consequently, the Emini might go sideways to up more before falling to the weekly moving average.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Trump firing of Comey is catalyst for 5 percent correction</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/05/d-2.png\"><img loading=\"lazy\" src=\"2017-5-13-2.png\" alt=\"mini testing 2400 big round number but reversal down likely.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart has been in a tight trading range for 3 weeks. This week made a new all-time high, but pulled back from 2400.00. It is trying to reverse up from the moving average and then break above the 2400 Big Round Number.<p>The daily S&amp;P500 Emini futures candlestick chart has had 2 legs up from the March 27 low. Furthermore, the bull channel has a wedge shape. It is therefore likely to have a 3rd push up, which would complete the wedge. Since the weekly chart is likely to begin a 100 – 150 point correction within the next 3 weeks, a wedge top on the daily chart would be a good sell setup. The bulls need a 1 – 2 week rally to the top of the wedge channel, and then a good sell signal bar. This would create a wedge higher high major trend reversal.<p>Most good looking major trend reversal tops have a 40% chance of a swing down. The probability would be higher here because of the extreme buy climax on the weekly chart. Yet, betting that any one top is the final top is never more than 50% certain. Therefore, major reversals often need 2 – 3 reversal attempts before one finally succeeds.<h4>Rally to 2500?</h4><p>Can the current rally continue up to 2500 without pulling back to the weekly moving average? Even when things are unlikely, they are still at least 30 – 40% likely. The Emini is in a strong bull trend on all time frames. Therefore, despite the extreme buy climax on the weekly chart, there is at least a 30% chance that the Emini will rally 100 points to 2500 before falling 100 points to below the weekly moving average.<p>Let’s say that the probability is 40% that we will see a 100 point rally before a 100 point selloff. Should a trader buy or sell? The risk and reward is 100 points for both the bulls and bears. Yet, the probability is 60% for the bears. That means that the bears have a strong<a href=\"https://www.brookstradingcourse.com/how-to-trade-manual/traders-equation/#traders-equation\" target=\"_blank\">Trader’s Equation</a>. Hence, the math favors the bears. Therefore, if a trader were forced to either buy or sell here, the correct choice would be to sell.<p>Many traders want higher probability. They therefore have to wait for a strong breakout up or down before entering. The price they pay for their higher probability is a worse risk/reward ratio. The stop is further so the risk is greater. In addition, there is less profit remaining in the trade. It is still a logical choice.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-5-13"
    }
  ],
  "20": [
    {
      "data": [
        "<article class=\"post-67110 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Trump, Russia, Comey, Mueller and a Emini buy climaxEmini weekend update: May 20, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Trump, Russia, Comey, Mueller and a Emini buy climax<br>Emini weekend update: May 20, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-05-20T00:30:07-07:00\">May 20, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Trump, Russia, Comey, Mueller and a Emini buy climax</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/05/m-5.png\"><img loading=\"lazy\" src=\"2017-5-20.png\" alt=\"The Emini monthly bar is a doji after Mueller's special counsel appointment.\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has a doji bar so far this month. Last month was a High 1 buy signal bar, and May triggered the buy by going above the April high.<p>The monthly S&amp;P500 Emini futures candlestick chart is in a strong bull trend. In addition, the rally from November was exceptionally strong. Yet, when a bull trend becomes extremely strong late in the trend, that strength is more likely to lead to exhaustion than a new swing up.<p>Furthermore, the 2014 – 2015 bull flag has a measured move up to around 2400. Hence, the monthly chart is at that resistance. When there is a High 1 bull flag after a buy climax and at resistance, the upside is usually small.<p>Typically, the bull breakout lasts for 1 or 2 bars, and then the Emini pulls back for at least a few bars. Hence, the May breakout above the April high might be the end of the rally. In addition, traders will look for a 3 month pullback after this May breakout, or after 1 more month up.<p>Since there is a measured move target on the cash index, based on that 2 year range, that is around 2500, the Emini might rally further before pulling back. Yet, the weekly chart is so overbought that a pullback over the next couple of months is more likely.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Buy climax at resistance</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/05/w-4.png\"><img loading=\"lazy\" src=\"2017-5-20-1.png\" alt=\"The weekly Emini chart had an outside down bear bar this week.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart has not touched the 20 week EMA for 27 weeks. This is a strong bull trend, but climactic. By trading below last week’s low, the bears triggered a sell signal for the failed breakout above the March high. Yet, this week closed far above its low. It is therefore a weak entry bar.<p>The weekly S&amp;P500 Emini futures candlestick chart has been in a bull trend for 8 years. If the low of next week stays above the weekly moving average, it will be the 28th consecutive week completely above the average. That has not happened in the 8 year bull trend. The only time it happened in the 18 year history of the Emini was in 2003. But, even then, the weekly chart pulled back very close to its average at 17 and again 25 weeks. Consequently, this current stretch is the most extreme example in the history of the Emini.<p>While it could continue indefinitely, the Emini is more likely to behave as it has in the past. Therefore, a regression to its mean behavior is more likely. Consequently, the Emini will probably touch its weekly moving average within the next few weeks. Since that average is around 2330, the Emini will probably fall at least 50 points from its current level within a few weeks.<p>It probably will fall below the average to the around the March low at the bottom of the 2 month trading range. That is around 2300, and the pullback would therefore be about 100 points.<h4>Head and Shoulders top?</h4><p>If the Emini falls to the bottom of the March trading range, it will probably bounce. Bears will sell a reversal down from a lower high. That would create a head and shoulders top. Topping patterns are usually in trading ranges. Since most trading range breakouts fail, most good looking reversals fail to lead to opposite trends. Many traders still take the short because the reward is much bigger than the risk. Hence, the great risk/reward offsets the 40% probability of a swing down.<p>Some traders prefer higher probability. They therefore wait for a strong bear breakout and then sell. While the stop is further away, creating more risk, the high probability offsets the reduced risk/reward.<h4>Outside down week</h4><p>This week traded above the high of the prior week and then below its low. Hence, this week was an outside down week. Because its range was big and it closed in its middle third, next week will probably stay within this week’s range. It would therefore be an inside week. This would therefore create an ioi Breakout Mode pattern.<p>If next week is a bull bar, traders will be more willing to buy above its high, despite the buy climax. Furthermore, if the following week trades below that bull bar, there will probably be more buyers than sellers below.<p>In contrast, if next week is a bear inside bar, traders will see it as a weak buy signal bar, and many will sell above its high. In addition, they will see it as a good sell signal bar and sell below its low.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Strong reversal up from sharp selloff</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/05/d-3.png\"><img loading=\"lazy\" src=\"2017-5-20-2.png\" alt=\"The daily Emini chart reversed back up after Trump fired comey and hired mueller over russia.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart sold off strongly on Wednesday, but reversed up strongly on Thursday and Friday.<p>The daily S&amp;P500 Emini futures candlestick chart reversed down from a wedge higher high major trend reversal this week. Yet, the bulls bought the selloff. The bears created a gap down on Wednesday, resulting in both a 2 day and month-long island top.<p>Friday’s strong reversal up could lead to a gap up on Monday. If so, that would create a 3 day island bottom. Since the Emini has been in a trading range for 2 months, island tops and bottoms are not strong predictors of the future direction. Yet, they still are a sign of strength. Traders need follow-through before they believe that the gap is the start of a trend. Without it, the trading range is likely to continue.<p>This week’s Big Down, Big Up created Big Confusion. Therefore, the Emini will probably go sideways next week.<p>This week’s reversal up is similar to that of September 12, 2016. That rally retraced almost to the top of the selloff. Yet, the Emini reversed down from a lower high, and traded sideways to down for the next 2 months.<h4>Buy puts or put spreads on rallies</h4><p>While there is a 30% chance of a relentless rally to 2500, the weekly buy climax will probably control the market. Since a pullback to the weekly moving average is likely over the next few weeks, this rally on the daily chart will probably fail. This is true even if it makes a new high. Rallies therefore offer good opportunities for traders to buy puts or put spreads.<p>The selloff of September 2016 was mostly sideways. If the current selloff is similar, it will be difficult for put buyers to make much money if they buy and hold. When a market is in a tight trading range, even if it is sloped down, expert traders make more money by buying low, selling high, using limited entry orders, and scalping.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-5-20"
    }
  ],
  "27": [
    {
      "data": [
        "<article class=\"post-67298 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Growing Emini buy climax, but no trend reversal yetEmini weekend update: May 27, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Growing Emini buy climax, but no trend reversal yet<br>Emini weekend update: May 27, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-05-27T00:30:01-07:00\">May 27, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Breakout above bull flag</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/05/m-9.png\"><img loading=\"lazy\" src=\"2017-5-27.png\" alt=\"Monthly Emini bull trend at measured move target.\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has 2 trading days left in May. May is a bull entry bar after last month’s High 1 bull flag. Yet, it is around a measured move up from the 2014 – 2015 trading range. Furthermore, it had a 4 month buy climax that began in November. A High 1 bull flag after a buy climax and at a measured move target usually only rallies for only 1 – 2 bars before pulling back.<p>The monthly S&amp;P500 Emini futures candlestick chart has been in a bull trend for 8 years. The bull trend accelerated in November. However, the rally might be a buy vacuum test of the measured move up from the 2014 – 2015 trading range. There is no top yet. Because the past 17 months have been in a tight bull channel, bulls are eager to buy. Consequently they will probably buy the 1st 2 – 3 month selloff. It would therefore become a bull flag. Since the 1st reversal down will probably be minor, the bears will likely need at least a micro double top before they can create a reversal down.<p>Since this 17 month rally is unusually strong and it is late in the 8 year bull trend, it is climactic. Even if it is the final climactic leg in the 8 year rally, the bears will probably need at least a double top. Since that would take at least a couple of months to create, the downside over the next several months is probably just a 2 – 3 bar pullback. That means 2 – 3 months. A 3 month bull flag could easily be 150 points tall. Consequently, it would be a bear trend on the daily chart. Yet, the odds are that the bulls would buy it with a minimum goal of a test of the high.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Unusually protracted buy climax</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/05/w-5.png\"><img loading=\"lazy\" src=\"2017-5-27-1.png\" alt=\"Weekly Emini buy climax after 28 weeks above weekly EMA.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart is in a strong bull trend. This week was a strong bull trend bar. Yet, the Emini has not touched its moving average in 28 weeks. Since this is the longest stretch in 14 years, it is unsustainable and climactic.<p>The weekly S&amp;P500 Emini futures candlestick chart has not touched its 20 week exponential moving average in 28 weeks. This is the longest stretch in the 8 year bull trend. It is a sign of strong buying. Yet, when the bulls are strongest late in a trend, they are usually forming a buy climax.<p>Since most buy climaxes usually lead to a 10 bar, 2 legged sideways to down selloff, that is what’s likely here. However, price is truth, and the buy climax keeps growing. Keynes once said, “Markets cay stay irrational longer than we can stay solvent.”<p>Just because a pullback is likely does not mean it will happen. The odds still are that the Emini will pull back to the weekly moving average before reaching 2500. The touch of the moving average can come from the Emini going sideways or down.<p>In the 18 year history of the Emini, there was one other occasion when the Emini stayed above the weekly moving average longer than now. In 2003, it held above for 50 bars. Yet, that was at the start of a huge bull trend after a 50% correction. A bull trend is likely to be at its strongest in that situation. When a bull trend exhibits unusual strength<em>late</em>in the trend, like now, that rally is more likely to be an exhaustive buy climax. While the odds favor the start of a reversal down within the next few weeks, there is no top yet. However, the more the buy climax extends, the greater the risk of a surprisingly big, fast reversal.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Growing Emini buy climax, but no trend reversal yet</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/05/d-4.png\"><img loading=\"lazy\" src=\"2017-5-27-2.png\" alt=\"Emini daily chart has wedge top and higher high major trend reversal.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart formed 6 consecutive bull bars before Friday’s pause. There is no sign of a top. The bulls want a measured move up from the 80 point tall, 2 month trading range. Yet, the bears want a wedge higher high major trend reversal.<p>The daily S&amp;P500 Emini futures candlestick chart rallied to a new all-time high this week. While it is still in a strong bull trend, the weekly buy climax makes a 100 point pullback likely soon.<p>Despite the strong rally, it is the 3rd push up from the March 27 bottom of the 2 month trading range. Furthermore, a reversal down would trigger a sell signal from a wedge higher high major trend reversal. In addition, it would be around a measured move up from the 2014 – 2015 trading range. That trading range is a likely final bull flag on the monthly chart. Finally, the unusual buy climax on the weekly chart make a 100 point correction likely soon.<h4>Amazon and Alphabet (Google) drawn to the 1,000 magnet</h4><p>AMZN reached 999 and GOOGL hit 996 this week. Additionally, both did so with unusually strong rallies on Thursday. That was probably a buy vacuum test of resistance. Furthermore, both got close enough for traders to believe that the Big Round Number was tested. Hence, bulls are willing to take profits and bear scalpers will begin to sell. Therefore, both could pull back from here.<p>Because the rallies were in tight channels on the daily chart, the bears will probably need at least a micro double top before they can create reversals. Yet, the rallies are parabolic buy climaxes. Hence, the odds favor profit taking soon. Consequently, both will probably pull back soon, whether or not they 1st go $20 – 50 higher.<p>Why is this relevant? Can these 2 stocks lift the stock market? No, but the reason why they are racing up is because the bulls believe the overall market is strong. Hence, they believe the downside is small near-term. They have therefore been willing to buy at the top of a buy climax, confident that both would test 1,000.<p>Thus, they are not pulling the market up. Yet, they are a reflection of how strong traders believe the overall market is. Their strength tells traders that the Emini is strong enough to support rallies in overbought stocks. Since the bulls met their objective of testing 1,000 in both, they might be willing to take profits. Hence, both can pull back at anytime. That would probably come with a pullback in the Emini as well.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-5-27"
    }
  ]
}