{
  "1": [
    {
      "data": [
        "<article class=\"post-82829 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini minor reversal up from October parabolic wedge sell climaxIntraday market update: Thursday November 1, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini minor reversal up from October parabolic wedge sell climax<br>Intraday market update: Thursday November 1, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-11-01T06:20:35-07:00\">November 1, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini minor reversal up from October parabolic wedge sell climax</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini gapped up yesterday, but was unable to create a big bull bar. This week’s rally is due to exhausted bears, as evidenced by the parabolic wedge bottom. While the bulls hope the rally will last for the rest of the year, it more likely will be a leg in a trading range for a couple of weeks. It will then decide between a test of the February low and the all-time high. The best the bulls can probably get over the next 2 weeks is a test of the October 17 major lower high of 2819.25.<p>Although the bears want this rally to quickly fail, most bears are exhausted. They therefore will wait for a couple small legs up to either the 20 day EMA or the September 19 high before selling again.<p>While yesterday is a sell signal bar in a bear trend, it is also in the middle of a 2 week trading range after a sell climax. This generates confusion and makes more trading range price action likely over the next few days.<p>Will the selloff continue down to the February low? At the moment, there is a 50% chance. But, if this week’s reversal up begins to form a series of bull bars, then the Emini will probably go sideways to up for the rest of the year.<p>The daily chart has begun a minor reversal up. That increases the chance of more bull days than bear days for the next few days.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 6 points in the Globex session. It will open near yesterday’s low and yesterday is a sell signal bar on the daily chart.<p>Since the October selloff was strong, the Emini should fall below yesterday’s low and trigger the sell signal today. But, because of the sell climax on the daily chart, there will probably be buyers above this week’s low. Traders will look from a reversal up from support. That support is yesterday’s low, Tuesday’s high at the bottom of the gap, the close of 2017, and a 50% pullback of the 2 day rally.<p>Tomorrow is Friday and the bulls will try to get the week to close above the open of the week. The week then would be a buy signal bar on the weekly chart.<p>There is always a bear case, but the 3 day reversal up has been strong. The odds are that any swing down will only last a day or so before the bulls buy it and create a higher low.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-gap-up-to-wedge-top-for-bear-reversal-day.png\"><img src=\"2018-11-1.png\" alt=\"Emini gap up to wedge top for bear reversal day\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex double bottom and parabolic wedge bottom</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/EURUSD-Forex-double-bottom-and-parabolic-wedge-bottom-2.png\"><img loading=\"lazy\" src=\"2018-11-1-1.png\" alt=\"EURUSD Forex double bottom and parabolic wedge bottom\"></a><p class=\"caption\">The EURUSD daily Forex chart reversed up strongly overnight from a double bottom and a nested wedge bottom.<p><br>During every strong rally and every strong selloff for the 6 months, I have said the same thing. Trading ranges resist breaking out. Any strong move up or down has an 80% chance of reversing.<p>The EURUSD daily Forex chart reversed up strongly overnight from a double bottom with the August 15 low. Furthermore, there is a nested wedge bottom. That increases the chance of a rally over the next 2 weeks.<p>The 1st targets are the 20 day EMA, the October 9 low breakout point, and a 50% retracement of the October 16 selloff. Next, the bulls will try to create a higher low and then test the October 16 major lower high.<p>There is always a bear case, and it always has at least a 40% chance of success, as it does here. The bears hope that the overnight rally will fail around the 1st targets, lead to a bear flag, and reverse strongly below the August low.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart rallied 100 pips overnight. Because that is about the same size as other big days, there probably will not be much higher prices today.<p>This especially true since the rally has had 3 legs up in a tight channel. It is therefore a parabolic wedge buy climax. The bulls typically become exhausted and the rally evolves into a trading range. That is therefore likely today.<p>Since the daily chart has a credible bull trend reversal, day traders know that the probability favors higher prices over the next week. They therefore will be more aggressive in their buying than selling. Consequently, they will focus on finding buy setups and they will be more willing to swing trade.<p>The bears should not sell until the rally begins to go sideways. That should happen over the next 2 hours. In addition, their 1st shorts will be scalps because the strong rally is unlikely to reverse into a strong selloff on the 5 minute chart today.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-bull-trend-reversa-day-after-parabolic-wedge-bottom.png\"><img loading=\"lazy\" src=\"2018-11-1-2.png\" alt=\"Emini bull trend reversa day after parabolic wedge bottom\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>The Emini reversed up from just below yesterday’s low, but was unable to break above yesterday’s high until just before the close. Tomorrow is Friday and the bulls will try to get the week to close near its high. That would create a good buy signal bar on the weekly chart for next week. After the wedge bottom on the daily chart, the odds favor at least slightly higher prices next week. However, because the rally is probably part of a trading range, the bulls have a higher chance of being disappointed by the weekly close.<p>The bears want a gap down tomorrow. That would create a 2 day island top. In addition, they want the week to close below the open of the week and the close of last year.<p>Since island tops are minor reversal patterns, there will probably be buyers not far below yesterday’s low. The bulls should get at least a small 2nd leg up after their wedge bottom.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-11-1"
    }
  ],
  "2": [
    {
      "data": [
        "<article class=\"post-82831 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini daily and weekly buy setups after October sell climaxIntraday market update: Friday November 2, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini daily and weekly buy setups after October sell climax<br>Intraday market update: Friday November 2, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-11-02T06:20:37-07:00\">November 2, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini daily and weekly buy setups after October sell climax</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Yesterday reversed Wednesday’s late selloff, but the rally was weak. The most important concern today is the weekly chart. The bulls want the week to close on its high. That would create a good buy signal bar for next week.<p>But, the bear trend has been strong on the daily chart. Therefore this rally is probably be minor. That typically means it will be part of a trading range. In a trading range, bulls and bears constantly get disappointed. This reduces the chance of the week closing on its high.<p>Since the weekly chart is in a 5 bar bear micro channel, the 1st leg up might stall after a couple of weeks. However, the bulls have a credible bottom on both the daily and weekly charts. Furthermore, the parabolic wedge of the daily chart make 2nd leg up likely. Consequently, the bulls will buy the 1st reversal down.<p>The bears always want the opposite. They want the week to close below its open. The weekly bar would then have a bear body and be a weaker buy signal bar.<p>Since the open of the week is near last year’s close, the bears will try to get today to close below both.<p>If the bears get a gap down today, the daily chart would have a 2 day island top. Island tops are minor reversal patterns. Because there is a wedge bottom, there will probably be buyers not too far below today’s low.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 10 points in the Globex session. It therefore might gap up on today’s open. Since a 10 point gap is small relative to the recent daily ranges, the gap will probably close in the 1st hour.<p>In addition, the open will probably be near the 20 day EMA, which is resistance. It will also be above the October 24 sell climax high, which is also resistance.<p>Finally, since the Emini has been going sideways for 2 weeks, it is in a small trading range. Trading ranges disappoint bulls and bears. The bulls were enthusiastic coming into today. A potential source of disappointment would be a tail on the top of the weekly candlestick. That would come if today reversed down from an early rally. Therefore, day traders should watch for any early rally to reverse and for the day to close near its low.<p>Trading ranges disappoint traders, but trends do not. Consequently, if this reversal up is the start of a trend, today could be a big bull trend day and close at its high and above the 20 day EMA. While possible, this is less likely, especially after yesterday’s repeated reversals. The 5 minute chart appears to be losing momentum. That increases the chance of a reversal down today.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-bull-trend-reversa-day-after-parabolic-wedge-bottom.png\"><img src=\"2018-11-2.png\" alt=\"Emini bull trend reversa day after parabolic wedge bottom\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex bull trend reversal after double bottom and nested wedge bottom</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/EURUSD-Forex-bull-trend-reversal-after-double-bottom-and-nested-wedge-bottom.png\"><img loading=\"lazy\" src=\"2018-11-2-1.png\" alt=\"EURUSD Forex bull trend reversal after double bottom and nested wedge bottom\"></a><p class=\"caption\">The EURUSD daily Forex chart has had follow-through buying today after yesterday’s bull trend reversal. The bulls have a double bottom and a nested wedge bottom.<p><br>Yesterday’s strong bull trend reversal on the EURUSD daily Forex chart continued early today. The 2 day rally is big enough so that at least 2 legs up are likely over the next 2 weeks. Furthermore, this could be the bottom for the next several months.<p>Today’s rally has reached resistance at around a 50% retracement of the October selloff and the 20 day EMA. The October 24 sell climax high is another magnet. The bulls will take partial profits here and bears will start to look to sell for a day or two pullback from the reversal up.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart rallied 150 pips in a tight bull channel since yesterday’s low. Because that is unsustainable, it is a buy climax. The bulls will soon become exhausted and take partial profits. Instead of buying for any reason, they will become selective. They will wait to buy 20 – 50 pip pullbacks to support. As a result, the strong 2 day rally will evolve into a trading range today.<p>The bears know this and they will begin to sell reversals down for 10 – 30 pip scalps.<p>The 2 day rally was strong enough to make both bulls and bears expect a 2nd leg up. Consequently, there will be buyers below, like around Wednesday’s high and a 50% pullback.<p>Wednesday theoretically was a buy signal bar on the daily chart. Since it had a bear body, it was a bad buy signal. Bears would sell above its high and scale in higher. Since that is reasonable, the odds are they will avoid a loss in their 1st entry at Wednesday’s high.<p>This means that there should be a pullback within a few days that dips below Wednesday’s high. The bears will buy back their shorts there and the bulls will buy again. This should create a higher low and lead to another leg up.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-outside-down-day-after-minor-trend-reversal-up-to-20-day-EMA.png\"><img loading=\"lazy\" src=\"2018-11-2-2.png\" alt=\"Emini outside down day after minor trend reversal up to 20 day EMA\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>The Emini reversed down from above yesterday’s high and traded below yesterday’s low. It was therefore an outside down day at the 20 day EMA. A 2nd leg up is likely after the parabolic wedge bottom on the daily chart. Therefore, any selloff next week will probably reverse back up after 2 – 3 days.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-11-2"
    }
  ],
  "3": [
    {
      "data": [
        "<article class=\"post-82835 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Market Overview: October wedge sell climax and bull trend reversal Emini weekend update: November 3, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Market Overview: October wedge sell climax and bull trend reversal<br>Emini weekend update: November 3, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-11-03T00:30:58-07:00\">November 3, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Market overview</h2><p>The October stock market selloff reversed up from the 20 month EMA. The weekly chart had 2 legs down from the September high and formed a strong bull trend reversal bar. In addition, the daily chart reversed up from a wedge bottom (see charts below). This makes a good case for an October bottom, or maybe one more brief new low, and a year-end rally.<p>However, the daily chart has not gone above the October 17 major lower high and it is still below the 20 day EMA. The monthly chart is bullish, the weekly chart is neutral, and the daily chart has been bearish, but is trying to reverse up. Whenever both the bulls and bears have reasonable arguments, the market usually goes sideways. That is what is most likely over the next month or two.<h3>US Dollar forming right shoulder of head and shoulders top</h3><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/US-Dollar-head-and-shoulders-top-and-wedge-top.png\"><img loading=\"lazy\" src=\"2018-11-3.png\" alt=\"US Dollar head and shoulders top and wedge top\"></a></p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/US-Dollar-head-and-shoulders-top-and-wedge-top.png\"><p class=\"caption\">The weekly chart of the US dollar futures contract shows a wedge rally. A reversal down would be from the right shoulder of a head and shoulders top.</p></a><p><p>The 8 year rally in the US dollar has stalled around 100 several times in the past 4 years. The weekly chart has a yearlong wedged shape rally. It will probably be the right shoulder of a head and shoulders top or a double top with the 2017 high. A head and shoulders top is a trading range. There is only a 40% chance of a measured move down below the neck line. However, the weekly chart is high enough up in the 4 year range to make it likely that it will start testing down soon.<h4>EURUSD weekly Forex chart has wedge bull flag at support</h4><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/EURUSD-Forex-wedge-bull-flag-and-breakout-test.png\"><img loading=\"lazy\" src=\"2018-11-3-1.png\" alt=\"EURUSD Forex wedge bull flag and breakout test\"></a></p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/EURUSD-Forex-wedge-bull-flag-and-breakout-test.png\"><p class=\"caption\">The EURUSD weekly Forex chart is forming a wedge bull flag as it tests the top of the 2015 – 2016 trading range.</p></a><p><p>In the Forex markets, the EURUSD daily chart reversed up strongly on Thursday from a perfect double bottom with the August 15 low. If the bulls get follow-through buying next week, there should be a rally to the October 16 high above 1.16.<p>However, the bears still have a 30% chance of a 500 pip measured move down below the double bottom. If they get a break below the August low, it will probably fail within a few days. Trading ranges resist breaking out. Since the market is at the bottom of its 6 month range, a reversal up is more likely than a swing down.<h4>30 year Treasury Bond in early stage of 20 year bear trend</h4><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/30-year-bond-market-has-nested-wedge-and-head-and-shoulders-top.png\"><img loading=\"lazy\" src=\"2018-11-3-2.png\" alt=\"30 year bond market has nested wedge and head and shoulders top\"></a></p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/30-year-bond-market-has-nested-wedge-and-head-and-shoulders-top.png\"><p class=\"caption\">The 30 year US Treasury Bond Futures market has a 3 year wedge top nested within a 10 yer wedge top. The September high is also the right shoulder of a head and shoulders top. While the 4 year trading range can continue for a couple more years, the 2016 high will probably last at least 30 years. This means beyond your trading career.</p></a><p><br>For several years now, I have been writing about the 30 year treasury bond putting in a massive nested wedge top. That top formed in July 2016. While it might trade sideways indefinitely, no one reading this post will ever see a new all-time high. The chart will work lower over the next 20 years. Even if it were to reverse up at that point, it would probably need at least 20 more years to make a new high, if it ever makes a new high.<h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Test of the 20 week EMA</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-monthly-candlestick-chart-has-big-bear-trend-bar-at-20-bar-EMA-support.png\"><img loading=\"lazy\" src=\"2018-11-3-3.png\" alt=\"Emini monthly candlestick chart has big bear trend bar at 20 bar EMA support\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart had a big bear trend bar in October, but there was a tail at the bottom. This was the 1st pullback to the 20 month EMA in more than 20 months and therefore it is a 20 Gap Bar buy signal.<p>The monthly S&amp;P500 Emini futures candlestick chart sold off strongly in October, but there were buyers at the 20 month EMA. For over 20 months, the bulls have been willing to pay an above average price. Last month, they finally got an opportunity to buy at the average price and they took it.<p>However, October had the biggest bear body since the monthly bull trend began 10 years ago. It is therefore significant. This is especially true because it is the 2nd strong reversal down from just below 3,000.<p>Although there are buyers at the 20 month moving average, they might not be strong enough to immediately resume the bull trend. Instead, they might just be able to stop the selling. That means that October might not simply be a bear trap and a sell vacuum test of support. It could be a reminder that the February selloff began a trading range, and that range is still in effect.<h4>Double top, but minor trend reversal</h4><p>Whenever there is a double top, traders wonder if there will be a bear trend reversal. The January/September double top is small compared to the 10 year bull trend. In addition, the bull trend was strong. Therefore, any reversal will probably be minor. That means a trading range is more likely than a bear trend.<p>But, the October selloff might be the 1st of 2 – 3 legs sideways to down. Consequently, the yearlong trading range might last another 10 or more bars (months) before the bulls can resume the trend up. Since this is a monthly chart, that means possibly another year. However, there will probably be a breakout within 6 months.<p>If October is the 1st leg down in a bigger bear leg in the yearlong trading range, the 2nd or 3rd legs down could easily fall below the February low. As a result, if there is a strong break below that low, the selloff would still probably be a bear leg in the trading range.<h4>What is needed for a bear trend?</h4><p>For traders to conclude that the monthly chart is in a bear trend, they would need to see either 2 big bear bars or a series of 3 or more smaller bars closing below the February low. There is currently only a 30% chance of that happening. But, as I said, while a new high is likely within a few months, the bull trend does not have to resume up soon. The trading range could last through all of 2019 before there is a new high.<p>I have written several times over the past 2 years that the monthly chart would probably enter a trading range, have a bull breakout, and then a Final Bull Flag reversal down. In addition, I said that the selloff will be 30 – 50%. That is how markets behave and it is still likely to be the case. That means that there will probably be one more new all-time high before there is a bear trend on the monthly chart. The final top will probably be a year or two from now.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Two legs down and a reversal up</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-weekly-candlestick-chart-has-consecutive-sell-climaxes-testing-close-of-2017.png\"><img loading=\"lazy\" src=\"2018-11-3-4.png\" alt=\"Emini weekly candlestick chart has consecutive sell climaxes testing close of 2017\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart had a bull trend reversal this week. This followed 2 sell climaxes down to support at the bottom of the 2018 range.<p>The weekly S&amp;P500 Emini futures candlestick chart reversed up strongly this week after 2 legs down from the all-time high. Trading ranges often have many 2 legged moves up and down. Therefore, this might be marking the end of the current selling.<p>This is especially true because the reversal up this week was from the 2600 Big Round Number and from just above the May low. Therefore, the bulls will try to form a double bottom higher low with the May low. Since this week was a big bull reversal bar, it is a reasonable buy setup for a year-end rally.<p>However, because of Friday’s selloff, the week had a small bull body. This makes it likely that the Emini will trade mostly sideways for a few weeks. Since the bulls bought strongly below the low of 3 weeks ago, they will probably buy again below this week’s low if they get a chance.<h4>What about the bears?</h4><p>Even though this week is a good buy setup, there has not been a pullback above the high of the prior bar in 5 weeks. That is a sign of strong bears. Consequently, the 1st reversal up will probably only last 2 to 3 weeks before there is a pullback below the prior week’s low. This might take place around the 20 week EMA and a 50% retracement of the October selloff.<p>Once there is a week that trades below the prior week’s low, the bears will hope that it will lead to a resumption of the October selloff. But this week’s strong rally will make the bulls eager to buy the 1st selloff. This is true even if the Emini falls below this week’s low.<p>As a result, rather than resuming the bear trend, that 1st reversal down will probably form a higher low or double bottom with this week’s low and lead to at least one more leg up. Remember, trading ranges often have many 2 legged moves up and down. They also often have 3 legged moves, which are wedges.<p>What happens after a couple legs up to resistance? If this week’s rally stalls, the bears will have a 50% chance of a test below this week’s low. Furthermore, they still have a 40% chance of breaking below the February low. Finally, there is a 30% chance of a 400 point measured move down below the February low.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>October wedge sell climax and bull trend reversal</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-daily-candlestick-chart-has-reversal-up-from-parabolic-wedge-sell-climax-3.png\"><img loading=\"lazy\" src=\"2018-11-3-5.png\" alt=\"Emini daily candlestick chart has reversal up from parabolic wedge sell climax\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart reversed up this week from a parabolic wedge sell climax.<p>I wrote last weekend that the Emini would rally over the next two weeks. I also said that it might have one more brief new low first. That came on Monday, and the Emini reversed up strongly since.<p>The daily S&amp;P500 Emini futures candlestick chart gapped above Tuesday’s ioi buy signal bar after a month-long wedge bottom. The odds favor at least 2 legs sideways to up. Consequently, the bulls will buy the 1st reversal down.<p>However, the daily chart is still below its 20 day EMA and it has not gone above a lower high. Consequently, it is still Always In Short. Therefore, as strong as the rally has been, it is still slightly more likely to fail and test below the October 29 low. Two strong closes above the EMA or a close above the October 17 high would shift the odds in favor of the bulls.<p>With Friday trading above Thursday’s high and then below Thursday’s low, it was on outside down day. Friday is therefore a sell signal bar for Monday. However, this past week’s reversal up was a sign of strong bulls. Consequently, the best the bears will probably get this week is 2 – 3 days down before there is at least a small 2nd leg sideways to up.<h4>Support and resistance in developing trading range</h4><p>The bulls reached their 1st targets this week, which were the 20 day EMA and the October 24 sell climax high. The next target is the October 17 major lower high at 2819.25. That is the top of the parabolic wedge bar channel.<p>Bear channels typically evolve into trading ranges. Therefore, there will probably be a leg down from that high. The bulls hope it will be a brief pullback in their bull trend reversal.<p>However, it could lead to a deep pullback before the bulls can make a new all-time high. For example, the selloff from the test of the October 17 high might fall to the October 11 sell climax low. If the bulls got a reversal up from there, they would have a higher low major trend reversal and a head and shoulders bottom. That would give them a better chance of a new all-time high within the next 3 – 6 months.<h4>The bears want an island top</h4><p>The bears want a gap down next week. This would create an island top with Wednesday’s gap up. However, island tops and bottoms are minor reversals. An island top alone typically only leads to a week or two of selling, not a bear trend.<p>In addition, this week’s reversal up was so strong that it represents aggressive buying. If the Emini were to trade back down to around this week’s low, the bulls who have not yet bought will be eager to buy.<p>Also, the bears who are short are now afraid that the bottom is in. They are hoping for a test back down so that they can exit with a smaller loss. With both the bulls and the bears looking to buy a selloff, the odds favor at least one more leg up.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-11-3"
    }
  ],
  "5": [
    {
      "data": [
        "<article class=\"post-82833 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini October bull trend reversal stalling at EMA Intraday market update: Monday November 5, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini October bull trend reversal stalling at EMA<br>Intraday market update: Monday November 5, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-11-05T06:20:38-08:00\">November 5, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini October bull trend reversal stalling at EMA</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini formed an outside down day on Friday after a rally to the 20 day EMA. Because the rally followed a parabolic wedge sell climax, there will probably be buyers below. Sell climaxes usually lead to at least 2 legs sideways to up, and last week was the 1st leg up.<p>The bears want a resumption of the bear trend. They see last week as a pullback to the moving average in a bear trend. Because Friday was outside down at resistance, it is a sell signal bar for today. But, since there will be buyers below, the bear will likely only get a 2 – 3 day minor reversal down.<p>If today gaps down, it would create a 3 day island top. But, island tops are minor reversals, so there is no special importance to a gap down today. The bears would need 2 – 3 big bear days to make traders believe that the bear trend is resuming. More likely, the 3 week trading range will continue.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 1 point in the Globex session. That huge bull bar late on Friday is more likely the start of at least a small 2 legged rally than a bull trap. Therefore, there is a slightly increased chance of a bull trend today.<p>But, because the Emini was sideways for most of Friday, and tomorrow’s election creates uncertainty, the odds are against a big trend up or down. Therefore, today will probably continue Friday’s trading range price action.<p>The bulls want a rally that breaks above last week’s high, which was Friday’s high. That would trigger a buy signal on the weekly chart. The tail on the top of last week’s candlestick is a sign of a lack of conviction. Consequently, it is a weaker buy signal bar. As a result, there is less chance of a strong rally above Friday’s high this week. More likely, the Emini will continue to only get 2 – 3 days in one direction before reversing, as it has been doing since the October 16 bull trend day.<h2>Friday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-outside-down-day-after-minor-trend-reversal-up-to-20-day-EMA.png\"><img src=\"2018-11-5.png\" alt=\"Emini outside down day after minor trend reversal up to 20 day EMA\"></a><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD weekly Forex chart has double top and double bottom</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/EURUSD-weekly-Forex-chart-has-double-top-and-double-bottom.png\"><img loading=\"lazy\" src=\"2018-11-5-1.png\" alt=\"EURUSD weekly Forex chart has double top and double bottom\"></a><p class=\"caption\">The EURUSD weekly Forex chart has a double bottom after a double top. Since last week was a weak buy signal bar and the 6 week bear channel is tight, the odds favor at least a small bear breakout within a few weeks.<p><br>The EURUSD weekly Forex chart has sold off for 2 months. The 6 weeks down from the September 24 high have been in a tight bear channel. Typically, the bulls will need at least a micro double bottom before they can get a leg up.<p>This is especially true with last week being only a doji bar. That is a weak buy signal bar. It is usually not a strong enough foundation to support a rally after a strong selloff. Consequently, there are probably more sellers than buyers above last week’s high.<p>However, there is both a double bottom and a double top since July. That means that the weekly chart is still in a trading range. It is therefore still in Breakout Mode. Since most trading range breakouts fail, there are probably more buyers than sellers below last week’s low. In addition, if there was a 100 point bear breakout, the bulls would try to create a reversal up from the bottom of a wedge bull flag that began in November, 2017.<p>Unless the bulls get a very strong reversal up over the next few weeks, any rally will probably be minor. At the moment, the odds favor a breakout below the double bottom and then a reversal up.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute chart had a weak 50 pip selloff over night. By falling below Friday’s low, it triggered a sell signal on the daily chart. Because Thursday’s rally was strong, there will probably be buyers below Friday’s low. That is why the overnight selloff has had so many sideways bars with big tails. It is more likely just a test of Friday’s low than the start of a breakout below the 3 month double bottom.<p>Thursday’s rally was strong enough to get a least a small 2nd leg sideways to up. Therefore, the odds are that today or tomorrow will begin a 2 – 3 day rally.<p>Since the momentum down on the weekly chart is strong, the bears will sell the 2 – 3 day rally. Unless there is a very strong rally, there will probably be a break below the October low in November.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-broad-bull-channel-and-daily-ioi-breakout-mode-pattern.png\"><img loading=\"lazy\" src=\"2018-11-5-2.png\" alt=\"Emini broad bull channel and daily ioi breakout mode pattern\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>The Emini was in a broad bull channel today. It was also a bull inside bar on the daily chart. There is now an ioi breakout mode setup in the middle of a month-long trading range. The bull body and last week’s rally give the bulls slightly higher odds. But, with tomorrow night’s election results, Wednesday has a 50% chance of reversing any breakout up or down tomorrow.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-11-5"
    }
  ],
  "6": [
    {
      "data": [
        "<article class=\"post-82999 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini ioi Breakout Mode going into today’s electionIntraday market update: Tuesday November 6, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini ioi Breakout Mode going into today’s election<br>Intraday market update: Tuesday November 6, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-11-06T06:20:38-08:00\">November 6, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini ioi Breakout Mode going into today’s election</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>After the parabolic wedge bottom last week, the Emini retraced 50% of the 3 week selloff. It is at the 20 day EMA and it has been been going sideways for 4 days. With the uncertainty of the election, it will probably have a lot of trading range price action again today.<p>Last week’s rally was strong. Furthermore, yesterday was a bull inside day. These factors increase the probability that today will go above yesterday’s high and trigger a buy signal on the daily chart. But, because of the resistance of the 20 day EMA and the uncertainty of the election, any rally might be small.<p>While yesterday is an ioi Breakout Mode pattern, the close near the high reduces the chance of a big bear day.<p>No one knows how the market will respond to the election results tomorrow. There is a 50% chance that tomorrow will reverse whatever today does.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 5 points in the Globex session. It has been in a tight trading range overnight and within yesterday’s late trading range. Also, the daily chart is in a 4 day tight range in the middle of a month-long trading range. With the uncertainty of today’s election, this trading range price action is likely to continue today.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-broad-bull-channel-and-daily-ioi-breakout-mode-pattern.png\"><img src=\"2018-11-6.png\" alt=\"Emini broad bull channel and daily ioi breakout mode pattern\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD daily Forex chart has nested wedge bottom and a double bottom</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/EURUSD-daily-Forex-chart-has-nested-wedge-bottom-and-a-double-bottom.png\"><img loading=\"lazy\" src=\"2018-11-6-1.png\" alt=\"EURUSD daily Forex chart has nested wedge bottom and a double bottom\"></a><p class=\"caption\">The EURUSD daily Forex chart is reversing up from a double bottom with the August low. There is also a 3 week parabolic wedge bottom that is nested withing a 2 month wedge bottom.<p><br>The EURUSD daily Forex chart is reversing up from a double bottom with the August 15 low. The nested wedge bottom increases the chance of a successful reversal. But, the bear channel down from the October 16 high is tight. A reversal up from a tight bear channel is typically minor. That means that it will probably turn back down within a couple of weeks.<p>If the bulls then get a 2nd reversal up from above the October low, they would have a major trend reversal setup. Even with that, a rally within the 6 month trading range is more likely than the start of a bull trend.<p>The buy signal bar of the weekly chart is only a doji. In addition, the 6 week bear channel on the weekly chart is tight. Therefore, a break above last week’s high is not a strong buy setup. As a result, the rally will probably only last a week or two. The bulls usually need a micro double bottom when a buy setup is weak. That would correspond to a double bottom on the daily chart.<p>Today’s election might be an important financial event. Traders will find out tonight once the polls close. Consequently, if there is going to be a big move, it will probably happen then.<h4>Nested wedge bottom</h4><p>When a market reverses up from a wedge bottom, there is usually a 2 legged rally that lasts about half as many bars as there are in the wedge. There is a small and a large wedge bottom on the daily chart. The smaller wedge lasted 3 weeks. Yesterday began a 2nd leg up. Another day or two up will satisfy the goal of two legs up from the smaller wedge.<p>That week-long rally might then be the 1st leg up from the bigger wedge bottom. After a test down for 3 – 5 days, the bulls would try to create another leg up, expecting it to last a couple of weeks.<p>Consequently, if the wedge bottoms are going to stop the October selloff, there will probably be a trading range for at least 2 more weeks. Then, the bulls will try to form a major trend reversal. The bears will try to create a big bear flag.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart has rallied 40 pips overnight. The bulls want to trigger the buy signal on the weekly chart by trading above last week’s high. That is 30 pips above today’s current high.<p>Traders want to see if the bottom is in on the weekly chart, or if there will be more seller’s than buyers above last week’s high. The bear case is more likely because the weekly and daily buy setups are weak. The bulls will probably need a test of last week’s low before they can begin a swing up.<p>The momentum up on the 5 minute chart is not especially strong. Therefore, the rally might not get above last week’s high in today’s session. Furthermore, the rally is in the 3rd leg up in an expanding triangle that began in Europe. Consequently, a reversal down today or tonight could easily fall below today’s low.<p>Since the rally is in a tight bull channel and last week’s high is a little higher, the odds favor sideways to up today. The bulls will buy the first 30 pip reversal down. As a result, the best the bears can get today is a bear leg in a trading range.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-failed-bear-trend-reversal-became-bull-trend-resumption.png\"><img loading=\"lazy\" src=\"2018-11-6-2.png\" alt=\"Emini failed bear trend reversal became bull trend resumption\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>The early rally triggered a buy signal on the daily chart. The late rally triggered a buy signal on the weekly chart. But, last week had a tail on top and was the 5th bar in a bear micro channel. That is not a strong buy setup. However, every new bull day increases the chances that the Emini has seen the low of the year.<p>There might be a 1 – 3 day reaction to the election, but then the market will go back to the technicals. The Emini should test the October 17 major lower high this month, even if there is a 3 – 5 day selloff 1st.<p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-11-6"
    }
  ],
  "7": [
    {
      "data": [
        "<article class=\"post-83001 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini reaction to election more important than election result Intraday market update: Wednesday November 7, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini reaction to election more important than election result<br>Intraday market update: Wednesday November 7, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-11-07T06:20:46-08:00\">November 7, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini reaction to election more important than election result</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini triggered a buy signal on the daily and weekly charts yesterday. The odds are that the October low will be the low for the rest of the year. Yesterday’s rally and the October bull trend reversal are strong enough to make a test of the October 17 high likely in November.<p>As for whether it would have been better for the market if the Republicans maintained control, that is nonsense. The only thing that matters is what the institutions will do in response to the result. No matter what the election outcome, its effect will probably be brief. Washington is doing very little harm and very little good.<p>The technical picture is more important. The bulls have a strong reversal up from a wedge bottom on the daily chart. Therefore, the odds are that there will be at least 2 legs up. That means that traders will buy the first selloff. Also, they will look to sell near the October 17 high at the start of the parabolic wedge bear channel.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 20 points in the Globex session. There will therefore probably be a big gap up today. Since the open will be far above the EMA, the bulls will probably not be able to get a strong bull trend on the open. Traders hesitate to buy when the price is far above average. Consequently, today will probably have a trading range open for the 1st hour where the Emini trades sideways to down to near the EMA. If today will be a bull trend day, the bulls will try to form a double bottom or wedge bottom near the EMA. The bulls will look for a reversal up.<p>Since the Emini will probably have at least a minor leg down in the 1st hour, the bears are hoping for a strong bear trend day. But, yesterday’s late rally was strong. Consequently, even of the bears get a strong selloff on the open, the odds are that it will be a minor reversal down to around the EMA. A trading range is more likely than a bear trend in the 1st hour. However, if the bears can continue the trading range for 2 hours, they then would be able to create a credible major trend reversal setup for a possible reversal down later in the day.<p>Will the gap up close today? It might, but yesterday’s strong rally and today’s gap up make it likely that the bulls will buy the selloff, even if it falls below yesterday’s high.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-failed-bear-trend-reversal-became-bull-trend-resumption.png\"><img src=\"2018-11-7.png\" alt=\"Emini failed bear trend reversal became bull trend resumption\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD daily Forex chart has strong minor trend reversal</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/EURUSD-daily-Forex-chart-has-strong-minor-trend-reversal.png\"><img loading=\"lazy\" src=\"2018-11-7-1.png\" alt=\"EURUSD daily Forex chart has strong minor trend reversal\"></a><p class=\"caption\">The EURUSD daily Forex chart has rallied for 5 days after a nested wedge bottom. Because the October selloff was in a tight bear channel, this rally is probably a minor bull trend reversal.<p><br>The EURUSD daily Forex chart has a big bull trend day so far today. The bulls want today to close above Friday’s lower high. They then would view today as a measuring gap. The measured move would be around the 1.16 Big Round Number and the October 16 major lower high.<p>The bears always want the opposite. They therefore want today to close below Friday’s high. That would increase the odds of a 2 – 3 day pullback. Because the 5 day rally has been strong, the bulls will probably buy the 1st leg down. Consequently, the bears will probably need at least a micro double top if they are to break below the August/October double bottom.<p>So far, this rally has lacked consecutive big bull bars. If today closes below Friday’s high or if tomorrow has a bear body, there will probably be a 100 pip pullback within a week. Alternatively, if today closes on its high and tomorrow has a bull body, the rally will probably go up to the October 16 high with only 1 – 2 day small pullbacks.<h4>EURUSD Forex daily chart still in 6 month trading range</h4><p>Even though the bulls are reversing up from a 2 month double bottom, the rally is within a 6 month trading range. It is therefore more likely just another leg in the range rather than the start of a bull trend. Consequently, the bulls will probably only be able to maintain control for a few weeks before the bears regain control for 2 – 3 weeks. There is nothing to indicate that this is about to change.<h4>EURUSD Forex weekly chart has minor buy signal</h4><p>By going above Friday’s high, which was last week’s high, the EURUSD weekly chart triggered a buy signal. However, the buy signal bar was just a doji bar and the 6 week selloff was in a tight bear channel. This is a weak buy setup. Consequently, the rally will probably only last 1 – 2 more weeks before the chart begins to go sideways. This is consistent with the daily chart, which will probably pull back for several days within a week.<h3>Overnight EURUSD Forex trading</h3><p><br>After rallying 70 pips overnight, the EURUSD 5 minute Forex chart has been sideways for 4 hours. The key price today and tomorrow is Friday’s high of 1.1458. The chart is now 25 pips above it. The bulls want both days to close above it, and the bears want one or both days to close below it.<p>A close above increases the odds of several more days straight up. Because the daily chart is in a trading range, it is more likely that there will be a close below today or tomorrow. This is because trading ranges repeatedly disappoint bulls and bears who are hoping for strong trends.<p>The rally should continue up to the October 16 major lower high above 1.16 within 3 weeks. But, because the daily chart is in a trading range, the 5 minute chart will spend a lot of time in trading ranges as well. The bulls hope that the 4 hour trading range is a bull flag and that there is a late rally today. More likely, the range will continue, or there will be a minor reversal down to Friday’s high.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-gap-up-and-Small-Pullback-Bull-Trend.png\"><img loading=\"lazy\" src=\"2018-11-7-2.png\" alt=\"Emini gap up and Small Pullback Bull Trend\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>The Emini gapped up, formed a small wedge bull flag, and rallied in a Small Pullback Bull Trend. As strong as the rally was, it could not reach the October 17 major lower high of 2819.25.<p>While the odds favor a test of the October 17 major lower high within a few days, that is major resistance. Consequently, the rally will probably stall there for at least a few days. However, since the rally is exceptionally strong, the bulls have a 30% chance of a strong break above that high this week.<p>The bears want a double top with that high. However, the October low will likely be the low for the rest of the year. Therefore, even of there is a sharp selloff from the double top, the bulls will buy it. A higher low and 2nd leg up are more likely than a break below the October low.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-11-7"
    }
  ],
  "8": [
    {
      "data": [
        "<article class=\"post-83003 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini rally from October parabolic wedge sell climax approaching resistance Intraday market update: Thursday November 8, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini rally from October parabolic wedge sell climax approaching resistance<br>Intraday market update: Thursday November 8, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-11-08T06:20:41-08:00\">November 8, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini rally from October parabolic wedge sell climax approaching resistance</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Two weeks ago, I said that the October extreme sell climax would probably lead to a test of the October 17 major lower high. Yesterday came within 3 points and the bulls will try for a breakout today.<p>The bulls will probably get their breakout and a test of 2850 within a week or two. But, because the rally on the daily chart is extreme, there will probably then be a 1 – 2 week pullback.<p>Since the rally has been strong, the bears will probably need at least a micro double top before they can get a leg back down. However, the 2 week bull channel is tight. In addition, there are many bull bars closing near their highs. Consequently, the bulls will buy the 1st 2 – 3 day selloff.<p>Since yesterday gapped up, the bears will try to get a gap down within the next few days. That would create an island top. Because island reversals are usually minor, it would not change what will happen over the next 2 weeks. The odds are that traders will buy the 1st reversal down, even if it begins with an island top.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 9 points in the Globex session. Since yesterday was a buy climax, there is a 75% chance that today will have at least 2 hours of trading range price action that starts by the end of the 2nd hour. There is only a 25% chance of another big bull trend day after a buy climax that ended at resistance.<p>When there is a strong bull trend, like yesterday, the chart typically has to transition into a trading range for 20 or more bars before it can reverse down into a bear trend. The trading range could last all day. Consequently, the bulls will buy any selloff on the open, even if it is surprisingly deep.<p>Once there is a trading range, the bears will look for a major trend reversal. Even if they create one, there is still only a 30% chance of a strong bear trend today.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-gap-up-and-Small-Pullback-Bull-Trend.png\"><img src=\"2018-11-8.png\" alt=\"Emini gap up and Small Pullback Bull Trend\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD daily Forex wedge bear flag at resistance</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/EURUSD-daily-Forex-chart-rally-from-double-bottom-now-at-resistance-2.png\"><img loading=\"lazy\" src=\"2018-11-8-1.png\" alt=\"EURUSD daily Forex chart rally from double bottom now at resistance\"></a><p class=\"caption\">The EURUSD daily Forex chart rallied exactly 200 pips from a perfect 2 month double bottom and a wedge bottom. It is stalling at the resistance of the EMA, last week’s high, the October 9 low, the 1.15 Big Round Number, and the 50% retracement level.<p><br>I said last week that the weekly chart would rally this week above last week’s high. But, because last week was a weak buy signal bar and there was a 6 week bear micro channel on the weekly chart, I also said that the rally would stall within 1 – 2 weeks.<p>Although this week triggered the weekly buy signal, this week’s candlestick on the weekly chart so far has a big tail on top. Therefore, in addition to the weekly buy setup being bad, the entry bar this week so far is bad as well.<p>If this week closes below its open, it will be a bear bar on the weekly chart. That would make it a sell signal bar for next week. This week would be a Low 1 bear flag. However, because the 6 week selloff had mostly overlapping bars with prominent tails, the bear flag will probably not lead to a break far below the August low. More likely, if the bears get their breakout, it will probably reverse up within 2 – 3 weeks.<p>On the daily chart, the 6 day rally formed a wedge bear flag at the EMA. The bears need today to close near its low to create a decent sell signal bar. Yesterday is a sell signal bar, but because it was a big doji, there will probably be more buyers than sellers below its low.<h4>The importance of this week’s close and last week’s high</h4><p>The fight over the remainder of this week will be over the appearance of the weekly candlestick. The bears want a strong sell signal bar, which means a bear bar closing on its low. The bulls want the opposite. They would love the week to close on its high, but would be satisfied with a bull body and a close above last week’s high. That would increase the odds that the double bottom will have a 2nd leg up after a 2 – 3 day test down to the November 5 low next week.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart ha been sideways in a 40 pip range overnight. In addition, it has been sideways for 4 days. It therefore is in search of information. The most important forces magnets now are last week’s high and this week’s open. The chart will probably stay in a tight range through tomorrow, and then decide whether to close above or below last week’s high and this week’s open. Since tight trading ranges resist breaking out and the daily and weekly charts are also neutral, today and tomorrow will probably be trading range days. Day traders will look to scalp reversals.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-trading-range-day-after-FOMC-report.png\"><img loading=\"lazy\" src=\"2018-11-8-2.png\" alt=\"Emini trading range day after FOMC report\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>Today’s FOMC report created some big bars and a bear channel. However, today was a bull inside day after yesterday’s buy climax. It is therefore a High 1 bull flag.<p>The bears see it as a sell signal bar for a double top with the October 17 high. But, the odds favor a break above the October 17 major lower high within a week. This is true even if the Emini go sideways to down for a few days first.<p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-11-8"
    }
  ],
  "9": [
    {
      "data": [
        "<article class=\"post-83005 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini inside bar after buy climax at October lower high Intraday market update: Friday November 9, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini inside bar after buy climax at October lower high<br>Intraday market update: Friday November 9, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-11-09T06:20:40-08:00\">November 9, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini inside bar after buy climax at October lower high</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>After a big bull day on Wednesday, yesterday was a small, bull inside doji day. It is therefore a buy signal bar on the daily chart. Because the rally was strong and yesterday had a bull body, there are probably more buyers than sellers below yesterday’s low. However, it is a weak sell signal bar for a double top bear flag with the October 17 high.<p>The bears want a reversal down from the double top. But, the reversal up from the October low has been very strong. Therefore, the odds are that the Emini will go at least 10 – 30 points above that high within the next week.<p>The bears will probably need at least a micro double top before they can get a reversal. Even when they do, the bulls will buy the 1st 1 – 3 day selloff.<p>Today is Friday so weekly support and resistance are important, especially in the final hour. The most important prices are the October 17 major lower high, the high of the week, and the 20 week EMA. Last week’s high is far below and unlikely to be important today.<p>Since the weekly chart is in a trading range, there is an increased chance of disappointment for trend traders. For example, the bulls had a strong 2 week rally. A close 50 points below this week’s high would create a big tail on the top of the weekly candlestick and disappoint the bulls.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 16 points in the Globex session. If it gaps down, it would create a 2 day island top. But, small gaps typically close in the 1st hour. In addition, yesterday had a bull body and therefore is a weak sell signal bar. Consequently, the odds are against a big bear day. Any selloff today will probably just add bars to the bull flag on the 60 minute chart and not create a bear trend.<p>The bulls are exhausted from Wednesday’s rally. They might need 2 – 3 days of sideways to down trading before they will again try to break above the October 17 high. This increases the chance of mostly trading range price action today.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-trading-range-day-after-FOMC-report.png\"><img src=\"2018-11-9.png\" alt=\"Emini trading range day after FOMC report\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex testing bottom of trading range after wedge bear flag</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/EURUSD-Forex-testing-bottom-of-trading-range-after-wedge-bear-flag.png\"><img loading=\"lazy\" src=\"2018-11-9-1.png\" alt=\"EURUSD Forex testing bottom of trading range after wedge bear flag\"></a><p class=\"caption\">The EURUSD daily Forex chart has sold off for 3 days from a wedge bear flag at the 20 day EMA. The bulls need a higher low, which would create a double bottom pullback buy setup.<p><br>The EURUSD daily Forex chart has sold off for 3 days from a bear flag at resistance. They want the selloff to break strongly below the August/October double bottom. The August low is also the neckline of the 500 pip tall July/September double top. A measured move down would be 1.08 over the next several months.<p>However, the daily chart has been in a trading range for 6 months. Trading ranges resist breaking out. Consequently, if the bears get their breakout, it will probably fail within a few days. There is support around 1.12. A reversal there would be from a wedge bull flag on the weekly chart, using the November and August lows. But, if the bears get a series of bear bars closing on their lows, the breakout would then likely fall at least 200 more pips. Traders would then start thinking that 1.08 was possible.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart has been in a 30 pip range overnight after yesterday’s selloff. If the bulls can rally today, today would then be a buy signal day for Monday. The pattern would be a double bottom pullback.<p>Alternatively, if the bears can get today to close below last week’s low, this week would be an outside down week. This would create a sell signal bar on the weekly chart. In addition, it would be a break below the August/October double bottom. Even if today closes near its low, it would be a sell signal bar on the daily chart.<h4>Importance of today’s close</h4><p>Since the 5 minute chart has been sideways, day traders are scalping. But, today is unusually important. A rally would create a buy signal bar on the daily chart. But, a close near the low will create a sell signal bar on the weekly chart. A close below last week’s 1.1301 low would create a stronger sell signal bar on the weekly chart. These possibilities could affect the next several weeks. There is therefore an increased chance of a breakout up or down today.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-wedge-bottom-and-bull-trend-reversal.png\"><img loading=\"lazy\" src=\"2018-11-9-2.png\" alt=\"Emini wedge bottom and bull trend reversal\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>The Emini sold off in a bear channel on the open. As was likely, the bulls got a reversal up later in the day. However, they were unable to close the day above the open. Today is therefore a bear day, which is a weak High 1 buy signal for Monday.<p>The bears want a gap down on Monday. That would create a 3 day island top. However, island reversals are minor candlestick patterns. The strong rally this week make it more likely that the 2 day reversal down from the September/November top will be a bull flag.<p>When the bears have a bad sell setup and the bulls have a bad buy setup, the Emini usually has to go sideways for a few days.<p>I will be speaking in Las Vegas on Tuesday, and I will not make a daily post again until Wednesday. However, I will write a weekend update tonight.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-11-9"
    }
  ],
  "10": [
    {
      "data": [
        "<article class=\"post-83009 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini strong late October reversal after parabolic wedge sell climax Emini weekend update: November 10, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini strong late October reversal after parabolic wedge sell climax<br>Emini weekend update: November 10, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-11-10T00:30:40-08:00\">November 10, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Market Overview for the week of November 12, 2018</h2><h3>Stock Market: Strong rally to middle of yearlong trading range</h3><p>The Emini monthly chart is in a bull trend, but the February and October selloffs were unusually strong. Furthermore, they followed the most extreme buy climax in the 100 year history of the stock market. Therefore, the bulls might not yet have recovered from their exhaustion. Consequently, while the odds favor a new high before there is a bear trend, the monthly chart could continue sideways for several more months first. In addition, there is a 40% chance of at least a small 2nd leg sideways to down to below the October low over the next few months before there is a new high.<p>The Emini weekly chart has been in a trading range for a year. While it reversed up sharply over the past 2 weeks, the tails on the tops of the 2 most recent bars make more sideways trading likely for the next several weeks.<p>Finally, the Emini daily chart reverse up sharply after a parabolic wedge sell climax in October. The current rally is stalling at the October 17 major lower high. While the bears want a double top bear flag, it is more likely that the bulls will buy the 1st 1 – 2 week selloff. The downside risk over the next month is small. But, the reversal up after a sell climax created a Big Down, Big Up pattern. That results in Big Confusion, which typically leads to a trading range for 10 – 20 bars (2 – 4 weeks on the daily chart).<h3>EURUSD weekly Forex chart: Likely brief bear breakout</h3><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/EURUSD-weekly-candlestick-chart-likely-bear-breakout-1.png\"><img loading=\"lazy\" src=\"2018-11-10.png\" alt=\"EURUSD weekly candlestick chart likely bear breakout\"></a><p class=\"caption\">The candlestick pattern on the EURUSD weekly Forex chart is a reversal down from a double top bear flag. The momentum is strong enough so that the selloff should fall below the October low.<p>I wrote last week that the buy signal bar from 2 weeks ago was only a doji bar. I further said that it was the 6th bar in a bear channel without any pullbacks. Therefore, it was a weak buy setup. As expected, there were more sellers than buyers above its high.<p>The bulls want the August/October double bottom to lead to a rally. But, the momentum down from the July/September double top bear flag has been strong. Therefore, the selloff will probably break below the double double within the next week or two.<p>However, trading ranges resist successful breakouts. In addition, if there is a 100 pip breakout down to 1.12 and then a reversal, that would be a buy signal. The bulls would have a wedge bull flag based on the November/August lows. In addition, it would be a test of the top of the 2015 – 2016 trading range.<p>Traders will watch for a reversal up from there. If there is no credible bottom, then traders will expect the bear trend to fall for a 500 pip measured move based on the July/September double top bear flag.<p>Currently, the most likely outcome is a failed breakout below the double bottom and a reversal up from around 1.12 based on the yearlong wedge bull flag.<h3>Crude oil futures: Parabolic wedge sell climax at support</h3><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Crude-oil-futures-in-parabolic-wedge-sell-climax-at-support.png\"><img loading=\"lazy\" src=\"2018-11-10-1.png\" alt=\"Crude oil futures in parabolic wedge sell climax at support\"></a><p class=\"caption\">The candlestick pattern on the daily crude oil futures chart is a parabolic wedge sell climax in an area of support.<p>The crude oil daily futures chart has been in a strong bear breakout for 6 weeks. Although there is room to the top of the 2016 – 2017 trading range, the current selloff has had 3 legs down in a tight bear channel. This is a parabolic wedge sell climax. Typically, the selling will stop here or soon. This is especially true because crude oil tends to respect Big Round Numbers. and the selloff tested 60.00 on Friday.<p>Since the wedge bear channel is tight, the 1st reversal up will be minor. That means it will test prior minor lower highs and possibly the 20 day EMA. The most recent minor lower high is the top of the 5 day bear channel on the 240 minute chart, which is around 64.00. A rally there will also be around the 20 day EMA.<h4>What about a continued selloff?</h4><p>Can crude oil continue down to around 57 at the top of the 2016 – 2017 trading range before bouncing? Yes, but the current selloff is extreme. A parabolic wedge is a sell climax. The bears know there is a risk of a sharp reversal up. They don’t want to watch their profits evaporate. Consequently, they will be quick to take profits if the selloff stalls.<p>Since the bulls know this, they will begin to buy new lows, expecting small rallies to above prior lows. As those rallies get bigger, the bulls will hold for bigger profits. In addition, the bears will begin to take profits on their shorts.<p>The result is a rally to resistance, where the bulls will take profits and the bears will sell again. As a minimum goal, traders look for at least a couple legs up to resistance, like a minor lower high or the EMA.<p>There is no bottom yet, but traders will look to buy once there is a bull bar closing near its high. They will be more aggressive if there is a micro double bottom.<h3>Gold futures: Low 2 bear flag at 20 week EMA after parabolic wedge sell climax<a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Gold-futures-bear-flag-at-EMA-after-parabolic-wedge-sell-climax.png\"><img loading=\"lazy\" src=\"2018-11-10-2.png\" alt=\"Gold futures bear flag at EMA after parabolic wedge sell climax\"></a></h3><p class=\"caption\">The candlestick pattern on the daily gold futures chart is a low 2 bear flag at the 20 week EMA. This followed a parabolic wedge sell climax.<p>The Gold futures weekly chart had a parabolic wedge sell climax and then a 2 legged rally to the 20 day EMA. This is what is likely on the daily crude oil chart. As is typical, the bears sold the Low 2 bear flag at the EMA. Since the reversal up was relatively strong, the selloff will probably stall in the August/September trading range. As a result, traders will be looking for quick profits over the next month, expecting reversals up and down every few days.<h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Strong bounce off the EMA after big down month in October</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-monthly-candlestick-chart-has-bull-inside-bar-after-huge-bear-bar-1.png\"><img loading=\"lazy\" src=\"2018-11-10-3.png\" alt=\"Emini monthly candlestick chart has bull inside bar after huge bear bar\"></a><p class=\"caption\">The candlestick pattern on the monthly S&amp;P500 Emini futures candlestick chart is a bull inside bar so far in November. This follows the big bear bar in October. The monthly chart has been in a trading range for 10 months.<p>The monthly S&amp;P500 Emini futures candlestick chart is rallying from the 1st pullback to its 20 month EMA in over 20 months. This is a 20 Gap Bar buy signal. There has been a gap between the low of every bar and the EMA for a long time. This is a result of eager bulls who were happy to pay an above average price. At the end of October, they finally got a discount down to the average price, and they bought aggressively.<p>But, the October candlestick had the biggest bear body of any bar in 10 years. Furthermore, February was also a big bear bar. With two big bear bars, the odds are against a strong resumption of the 10 year bull trend without the bulls creating some bull bars.<p>While the late November rally might quickly lead to a new all-time high, that high will probably not last more than a few months. This is because the strong selling pressure in February and October is telling us that the bears are willing to sell. Consequently, they will sell above the yearlong trading range if they get the opportunity.<h4>Big Down, Big Up creates Big Confusion and a Trading Range</h4><p>More likely, instead of racing up to a new high, the Emini will likely have to go sideways for several months. The bulls will probably need a foundation of a few bull bars before traders will trust their ability to hold the market up. As a result, the bulls will probably buy pullbacks, but they will also likely take profits around the trading range high.<p>In addition, the bears see how dramatically the bulls gave up around 3,000 twice this year. This will give them confidence to sell aggressively again around that number.<p>The bears also saw how strongly the bulls bought between 2,600 and 2,700 twice this year. They will therefore take profits on their shorts near the bottom of the range.<p>With bulls and bears both buying low, selling high, and taking quick profits, the yearlong trading range will probably continue for at least a few more months. This is true even if there is a brief new high within a few months.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Triggered a buy signal by going above last week’s high</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-weekly-candlestick-chart-has-weak-reversal-up-after-sell-climaxes.png\"><img loading=\"lazy\" src=\"2018-11-10-4.png\" alt=\"Emini weekly candlestick chart has weak reversal up after sell climaxes\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart continued last week’s strong reversal up. The rally retraced about half of October’s selloff.<p>The weekly S&amp;P500 Emini futures candlestick chart formed a big bull trend bar this week after last week’s bull trend reversal. Last week was a buy signal bar. However, the tail on top was a sign that the bulls were not buying into the end of the week. This makes the buy signal not as convincing.<p>In addition, every high for the past 5 weeks was below the high of the prior week. This is a 5 bar bear micro channel, and it is a sign of strong bears. Typically, the 1st reversal up from a bear micro channel stalls within a week or two.<p>This makes the coming week important. If it is a bear bar or a small bull bar, it would represent a lack of follow-through buying. That would increase the chance of a pullback within a few weeks and a continuation of the yearlong trading range.<p>However, if next week is a big bull bar closing on its high, that would erase the problems of the bear micro channel and the tail atop last week’s candlestick. The rally would then probably reach the measured move targets around 3,100 and 3,200 within the next few months.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Emini strong late October reversal after parabolic wedge sell climax</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-daily-candlestick-chart-pulling-back-from-possible-double-top-bear-flag-1.png\"><img loading=\"lazy\" src=\"2018-11-10-5.png\" alt=\"Emini daily candlestick chart pulling back from possible double top bear flag\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart has rallied strongly for 2 weeks. It is now testing the October 17 major lower high.<p>The daily S&amp;P500 Emini futures candlestick chart raced up to the October 17 major lower high over the past 2 weeks. I wrote on October 26 that the parabolic wedge selloff to the bottom of the year long trading range would lead to a strong reversal up to the October lower high just above 2,800.<p>While the rally has been very strong, it is unsustainable and therefore climactic. The bulls probably will get a brief 10 – 30 point break above the high. Then, they will likely take profits. This will result in a 1 – 2 week selloff. The bulls will buy it, betting on a 2nd leg up.<p>A reversal up from around 2700 would create a higher low major trend reversal and a head and shoulders bottom. This would increase the chance of a new all-time high within the next few months.<h4>Can the bears get a double top with the October 17 major lower high?</h4><p>When there is a strong sell-off like in October, traders have to be thinking that it could be the start of a bear trend.<p>A trend will often have a strong reversal up that tests a prior major lower high, like the October 17 high. Then, the rally stalls and there is a pullback. But, instead of the pullback quickly having a bull breakout and leading to a resumption of the bull trend, it keeps growing. This type of endless pullback typically has a 40% chance of breaking below the neck line of the October double top and selling off for a measured move down. That neckline is the October low.<p>This rally is different. It is unusually strong. Consequently, there is only a 30% chance of a strong break below the October low at this point. More likely, bulls will buy the 1st 1 – 2 week selloff to around a 50% retracement and 2700, and form the higher low major trend reversal that I mentioned above.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-11-10"
    }
  ],
  "14": [
    {
      "data": [
        "<article class=\"post-83007 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini selloff testing 2017 close and October 11 low Intraday market update: Wednesday November 14, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini selloff testing 2017 close and October 11 low<br>Intraday market update: Wednesday November 14, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-11-14T06:20:36-08:00\">November 14, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini selloff testing 2017 close and October 11 low</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Since late October, I have been saying that the Emini would test the October 17 major lower high and stall. In addition, I mentioned that it might pull back 50% to the October 11 low and the close of last year. This week’s selloff achieved those objectives. Finally, I said that if the bulls could get a reversal up from around 2700, they would have a head and shoulders bottom. That would increase their chance of a breakout above the October 17 high.<p>I have been writing that the bears see November 7 as a double top bear flag with the October 17 high. Even at the close of the November 7 big bull day, I said that the Emini had a 40% chance of reversing down from a double top bear flag with the October 17 high, breaking below the October 29 neck line, and falling for a 200 point measured move down. Nothing has changed. Despite Monday’s strong selloff, a break above the November 7 high is still more likely than a move below the October 29 low.<h4>Weak sell signal on weekly chart</h4><p>Look at the weekly chart. The past 2 weeks had decent bull bodies after a 2 legged sell climax. Typically, there are more buyers than sellers below the 2nd bull bar.<p>Today broke below last week’s low. The next few days are important. This week is the entry bar for the reversal down on the weekly chart. Because last week had a big bull body, it is a weak sell signal bar. When the bears have a bad sell signal bar, they need a strong entry bar if they are going to be successful. If the bears fail to create a big bear bar this week, it would make it even more likely that the sell signal will fail. Traders will buy a reversal up.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 12 points in the Globex session. Furthermore, it is 30 points above the Globex low. But, after 3 big bear days, there are probably more sellers than buyers above yesterday’s high. Traders will therefore sell a rally to that level today.<p>Yesterday was a doji bar on the daily chart. That is a 1 day trading range. Also, I wrote that the Emini would retrace about 50% of the early November rally, and test the 2700 Big Round Number and the close of last year. It is in that buy zone now. As a result, traders will buy selloffs.<p>With traders selling rallies and buying selloffs, the Emini will probably be sideways for several days. In addition, it will probably have increasing trading range price action on the 5 minute chart.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-wedge-bottom-and-wedge-top-in-trading-range-day-1.png\"><img src=\"2018-11-14.png\" alt=\"Emini wedge bottom and wedge top in trading range day\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex bear flag more likely than wedge bottom</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/EURUSD-Forex-bear-flag-more-likely-than-wedge-bottom.png\"><img loading=\"lazy\" src=\"2018-11-14-1.png\" alt=\"EURUSD Forex bear flag more likely than wedge bottom\"></a><p class=\"caption\">The EURUSD daily Forex chart broke below the August/October double bottom. Because 4 big bear days represents strong selling, at least a small 2nd leg down is likely. The bulls want the breakout to fail and they have a wedge bottom. But, after 3 big bear days, they will need at least a micro double bottom.<p><br>Over the weekend, I said that the EURUSD Forex market would fall below the August/October double bottom and test the 1.1200 Big Round Number. That is also the bottom of a channel on the weekly chart (not shown) drawn from the November 7, 2107 low and the August 15 low. Furthermore, the selloff is still a test of the top of the 2015 -2016 trading range. Consequently, if the bulls can get a reversal up within the next couple of weeks, the rally would have a 50% chance of reaching the July/September double top at around 1.18 over the next few months.<p>Since the 8 week bear channel is tight, the bulls will probably have to stop the selling for 2 – 3 weeks before there is a 300 pip rally. Next, they will need a micro double bottom. If they can create a good buy signal bar, traders will buy. This would be a reversal up from a yearlong wedge bull flag on the weekly chart and a month-long wedge bottom on the daily chart.<h4>Momentum down favors at least slightly lower prices</h4><p>Traders need to remember that the momentum down over the past 2 months has been strong on the weekly chart (not shown). In addition, there is no credible bottom yet on that chart. Even though the bears have failed to get 2 big bear bars closing on their lows, the momentum continues to favor at least slightly lower prices. They still have a 40% chance of a 500 pip measured move down to 1.08 from the 6 month double top. Consequently, the bears will to sell rallies.<p>However, if the daily chart stops going down, the bulls will probably get at least a 200 pip rally over the next few weeks. If they do, they will hope that it is the start of a 1 – 2 month, 600 pip swing up to the October high.<p>But, there is resistance at the November 7 and October 16 major lower highs. Therefore, if the bulls get their reversal, the 1st rally will likely lead to a 1 – 2 month trading range. Then, several weeks from now, they could create a credible major trend reversal.<p>The bears will sell at both of those lower highs and again at the 20 day EMA. They will continue to sell until the bulls get a sustained strong reversal up. There is no sign of that yet.<p>While the bears have broken below the range, most breakouts fail. Therefore, even though they have been in control for 2 month, the bulls will probably regain control for a 200 – 300 pip leg up within a few weeks.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart continued yesterday’s rally overnight. Since there is a wedge bottom on the daily chart, the bulls want a 300 pip rally to the November 7 lower high. However, the 3 day selloff has been strong. Typically the 1st reversal up only lasts 1 – 3 days before there is a test back down. Consequently, the bears will look to sell today or tomorrow, expecting at least a 50% retracement of the 2 day bounce.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-bear-trend-from-the-open-testing-2017-close-3.png\"><img loading=\"lazy\" src=\"2018-11-14-2.png\" alt=\"Emini bear trend from the open testing 2017 close\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>The Emini gapped above yesterday’s bear channel, but reversed down from the 60 minute EMA. It was a Bear Trend From The Open. It reversed up strongly to last week’s low after consecutive sell climaxes to below last year’s 2689.75 close. It also closed a gap on the daily chart. However, it sold off again into the close.<p>Today was a reversal day, but the rally retraced half of the selloff and then failed. The Big Down, Big Up, Big Down creates Big Confusion. Therefore, tomorrow will probably have a lot of trading range price action.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-11-14"
    }
  ],
  "15": [
    {
      "data": [
        "<article class=\"post-83218 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini bad sell signal bar on weekly chart Intraday market update: Thursday November 15, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini bad sell signal bar on weekly chart<br>Intraday market update: Thursday November 15, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-11-15T06:20:48-08:00\">November 15, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini bad sell signal bar on weekly chart</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini yesterday broke above Monday’s bear channel on the open, but sold off in a bear trend from the open. After closing a gap on the daily chart and reversing up from below last year’s close, it sold off late. Because of the multiple reversals over the past 2 days, today will also likely have a lot of trading range price action.<p>By falling below last week’s low, the Emini triggered a weekly sell signal. But, last week was a bull bar on the weekly chart and therefore a bad sell signal bar. Consequently, there will probably be more buyers than sellers below last week’s low.<p>Since last week is a weekly sell signal bar, this week’s close will be important. The bears will want the week to close below last week’s 2717.00 low. The bulls always want the opposite and will buy into the end of the week.<p>Even though yesterday was a bear trend day, there is support around the 2700 Big Round Number and the 2689.75 close of last year. In addition, there is a magnet above at the 2717.00 low of last week.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 1 point in the Globex session after trading sideways overnight. Yesterday’s late strong rally will make the bulls buy a test of yesterday’s low. They will try to create a major trend reversal up and a bull trend day.<p>The bears hope that the late selloff was from a double top bear flag with the 9:25 a.m. PST high. They then want a break below yesterday’s low, which is the neck line. Finally, they want a 30 point measured move down.<p>But, the daily chart is at support in the middle of a 2 month trading range. In a trading range, the bulls and bears typically are disappointed by a lack of follow-through. Consequently, the odds are against another big bear trend day today. More likely, there will be buyers around yesterday’s low and today will either be a trading range day or a weak bull trend day.<p>Since today will open around yesterday’s low, day traders will look for a swing up that begins within the 1st 90 minutes. However, if the day sells off strongly, they will not fight the bears trend. They will sell.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-bear-trend-from-the-open-testing-2017-close-3.png\"><img src=\"2018-11-15.png\" alt=\"Emini bear trend from the open testing 2017 close\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex weak bear flag so more sideways price action</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/EURUSD-Forex-weak-bear-flag-so-more-sideways-price-action.png\"><img loading=\"lazy\" src=\"2018-11-15-1.png\" alt=\"EURUSD Forex weak bear flag so more sideways price action\"></a><p class=\"caption\">After breaking strongly below a 3 month double bottom, the EURUSD daily Forex chart reversed up. The 3 day rally is a bear flag. Because it currently has a 2nd consecutive doji bar, it is a weak sell setup.<p><br>The EURUSD daily Forex chart had a big bear bar on Monday that closed far below the August/October double bottom. But, Tuesday reversed up strongly. In addition, there is a wedge bottom on both the daily and weekly charts.<p>While the bulls want a reversal up, the 2 month bear channel on the weekly chart is tight. In addition, the 3 day selloff was strong. Consequently, the bulls will need to go sideways for at least a few weeks before they can create a major reversal setup on the daily chart.<p>Furthermore, the 3 big bear days will require a micro double bottom before they can get even a minor reversal up. Therefore, the upside over the next couple of weeks is probably just 200 pips in what will probably be mostly a trading range.<p>The 3 day rally is a bear flag. But, yesterday was a bull doji bar. So far, today is a doji bar as well. That represents a small tight trading range, which is a limit order market. As a result, if today remains a doji bar, there probably will be more buyers than sellers below its low. This means that the daily chart will probably be sideways for at least a couple more days.<p>The bulls want the week to close above the 1.1323 open of the week. They would then have a bull reversal bar on the weekly chart. But, since the 8 week selloff has only had one small bull bar, a reversal up next week would probably stall after 1 – 2 weeks.<p>In any case, the week’s open will be an important price for today and tomorrow. Therefore, the next 2 days will probably be mostly sideways around the week’s open.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute chart rallied above yesterday’s high and the open of the week over night. It sold off 80 pips and then reversed up 50 pips. This is trading range price action around the key price of the 1.1323 open of the week. Traders will probably buy reversals up from 30 – 50 pips below and sell reversals down from 30 – 50 pips above until tomorrow’s close. This will create a scalper’s market.<p>Less likely, there will be a strong trend up or down and the week will close near its high or low. Unless there is a series of strong trend bars, day traders will be scalping.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-broad-bull-channel-and-buy-signal-bar.png\"><img loading=\"lazy\" src=\"2018-11-15-2.png\" alt=\"Emini broad bull channel and buy signal bar\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>The Emini had a reversal up from below yesterday’s low, as I said was likely. The bulls later got a higher low major trend reversal and a test of the 60 minute EMA.<p>Finally, the rally tested back above last week’s low. That low will be important tomorrow. This week triggered a sell signal by trading below last week’s low. But, last week was a bull bar and therefore a bad sell signal bar. The bulls will try to get this week to close above last week’s low.<p>Today is a buy signal bar for tomorrow. Because of the higher low major trend reversal and head and shoulders bottom, the bulls want a strong rally tomorrow. If they get it, the rally could be the start of a yearend rally. Without it, the bulls will probably try for a micro double bottom next week.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-11-15"
    }
  ],
  "16": [
    {
      "data": [
        "<article class=\"post-83220 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini buy signal bar for November head and shoulders bottomIntraday market update: Friday November 16, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini buy signal bar for November head and shoulders bottom<br>Intraday market update: Friday November 16, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-11-16T06:20:59-08:00\">November 16, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini buy signal bar for November head and shoulders bottom</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>As I said before yesterday’s open, yesterday was likely to form an early low of the day. The day closed on its high and it is a buy signal bar for a head and shoulders bottom on the daily and 60 minute charts. That is also a higher low major trend reversal buy setup.<p>The bulls want today to go above yesterday’s high. That would trigger the buy signal. Since the bears always want the opposite, they will try to form an inside day today.<p>Last week was a sell signal bar on the weekly chart. Since last week’s candle had a bull body, it was a weak sell signal bar. I said last weekend that the sell signal would trigger, but there would probably be buyers below. Furthermore, I have been saying for several weeks that the Emini would test the October 17 lower high, selloff to around last year’s close, and try to reverse up from a higher low major trend reversal. So far, everything is following the likely path.<p>But, yesterday is the 7th bar in a bear micro channel. That increases the chance that the 1st reversal up will stall within 2 – 3 days. Even if it does, the odds still favor another test of the October 17 lower high. In addition, a break above that high is more likely than a break below the February low.<p>Today is Friday and last week’s 2717.00 low is the most important price. The bulls want today to close above that low. Closing above the low of a weekly sell signal bar is a sign of weak bears and strong bulls. The overall chart favors the bulls and therefore a close above last week’s low.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 24 points in the Globex market. The day session yesterday was in a bull channel, which is always a bear flag. Today’s open will probably break below yesterday’s bull trend line.<p>This will create a big gap down and an open in the middle of yesterday’s range. Because yesterday had a big range and today is opening in its middle, there is an increased chance of an inside day. When that is the case, day traders will look for reversals. They will sell rallies to around yesterday’s high and buy selloffs to near yesterday’s low. This typically results in a trading range.<p>Today will open near last week’s low. If there is a trading range today, the Emini might oscillate around 2717 all day. In addition, if the Emini is within 10 points of last week’s low in the final 2 hours, it will probably get drawn to it to test it one last time.<h4>60 minute chart head and shoulders bottom</h4><p>Although yesterday was a strong bull trend day, the 60 minute chart has been in a tight bear channel for 7 days. The 1st reversal up is usually minor. That means that the bulls will probably need a test down before they can create a sustained rally.<p>Today’s gap down on the 5 minute chart will give the bulls the opportunity to form a higher low. That would increase their chance of a successful reversal up from the month-long head and shoulders bottom on the 60 minute chart (also present on the daily chart).<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-broad-bull-channel-and-buy-signal-bar.png\"><img src=\"2018-11-16.png\" alt=\"Emini broad bull channel and buy signal bar\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex chart weekly buy signal bar for wedge bottom</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/EURUSD-Forex-chart-weekly-buy-signal-bar-for-wedge-bottom.png\"><img loading=\"lazy\" src=\"2018-11-16-1.png\" alt=\"\"></a><p class=\"caption\">After a strong breakout below the August/October double bottom, the EURUSD daily Forex chart has reversed up for 4 days. There is also a wedge bottom.<p><br>The EURUSD daily Forex chart is reversing up from a wedge bottom and a failed breakout below a 2 month double bottom. In addition, the rally has had 4 consecutive bull trend bars. However, it follows an even stronger leg down. Consequently, the bulls will probably need a small double bottom if they are to create a successful reversal.<p>The bears see the 4 day rally as a bear flag. They know that it is weak compared to the 3 big bear bars that broke below the double bottom. But, they also know that it is difficult to resume a bear trend immediately after 4 bull bars.<p>If today trades below yesterday’s low, it will trigger a sell signal. Since the sell setup has 4 bull bars, it is a low probability pattern. That means that there will be more buyers than sellers below yesterday’s low. The bulls will likely get at least a small 2nd leg up. This would form a small double bottom. It therefore would increase the chances of the bulls getting a swing up to the October 16 major lower high over the next 2 months.<p>However, if there is a micro double bottom and the reversal up is weak, the bears will again try to resume the bear trend. This would then be a Low 2 sell signal and it would have a better chance of success.<h4>Weekly chart has buy signal</h4><p>The weekly chart has a yearlong wedge bull flag. The bulls want a strong buy signal bar this week. That means that they want the week to close on its high. At a minimum, they want a buy body, which means a close above the 1.1326 open of the week. The EURUSD is currently only a few pips above that price. That will be the key price all day.<p>Even if the bulls get a strong buy signal bar, the 8 week bear channel on the weekly chart is tight. Therefore, the 1st reversal up will probably be minor. Consequently, any rally would probably stall after a couple of weeks. A weak buy setup typically leads to a trading range for at least a few weeks.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart has tested the open of the week repeatedly over the past 4 hours and keeps reversing up. This is a sign that traders believe that the weekly chart is important today.<p>While the bulls would like a big bull body on the weekly chart, that would require a 50 pip rally today. So far, the range is small, and the bars are small and sideways with prominent tails. Traders are more concerned about simply getting a bull body on this week’s candlestick than creating a strong buy signal bar.<p>However, because of the importance of this week’s close, there is an increased chance of a bull trend day today. Traders will probably buy dips all day.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-broad-bull-channel-and-trading-range-day.png\"><img loading=\"lazy\" src=\"2018-11-16-2.png\" alt=\"Emini broad bull channel and trading range day\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>Today triggered the buy signal for the head and shoulders bottom on the daily chart. But, there is a 7 day bear micro channel. That will probably limit the rally over the next few days. The result will likely be a continuation of the 4 day trading range for at least a couple more days. Many bulls will want a 2nd buy signal before buying.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-11-16"
    }
  ],
  "17": [
    {
      "data": [
        "<article class=\"post-83224 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini indecision with double top and head and shoulders bottom Emini weekend update: November 17, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini indecision with double top and head and shoulders bottom<br>Emini weekend update: November 17, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-11-17T00:30:40-08:00\">November 17, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Market Overview:</h2><p>The<strong>stock market</strong>is in the middle of a 2 month trading range. That range is in the middle of a yearlong trading range. While the bulls are hoping for a yearend rally to a new all-time high, the October selloff was strong. The range will probably continue for at least a few more weeks.<p><strong>Crude oil futures</strong>had an exhaustive sell climax this week. It has a 75% chance of leading to a trading range that is at least $5 tall. That is an unusually high probability.<p>The<strong>EURUSD Forex market</strong>broke below the neck line of a 2 month double top. However, there is a nested wedge bottom and a test of monthly support. Bulls will buy the 1st 1 – 5 day pullback. The market will probably goes sideways in a 300 pip range for a couple of weeks.<h2>Crude oil futures: Exhaustive sell climax</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Crude-oil-futures-daily-candlestick-chart-has-parabolic-wedge-sell-climax.png\"><img loading=\"lazy\" src=\"2018-11-17.png\" alt=\"Crude oil futures daily candlestick chart has parabolic wedge sell climax\"></a><p class=\"caption\">The crude oil futures daily chart broke strongly below a tight bear channel this week. It stopped exactly at a measured move down. This will probably be an exhaustive sell climax and the start of a trading range.<p>The crude oil futures market has sold off for 2 months. There have been 6 consecutive bear bars on the weekly chart (not shown). The daily chart had a huge bear bar on Tuesday. It was the biggest bear bar in a bear trend that has lasted more than 20 bars. When that is the case, there is a 60% chance that it is either the end of the selloff or there will be a brief 2nd leg down that will end the selloff. After an exhaustive sell climax, a market usually enters a trading range for at least 10 bars. This means at least 2 weeks on the daily chart.<p>Tuesday also broke below a tight bear channel. A bear breakout below a bear channel reverses up 75% of the time within 5 bars. That is another reason why traders will look for a rally over the next couple of weeks. This is an unusually high level of certainty.<p>The 1st target for the rally is always the top of the most recent sell climax. That is Tuesday’s high of 59.54. I consider the space between Tuesday’s close and Tuesday’s high to be a gap. That gap will probably close within 2 weeks, making Tuesday an exhaustion gap bar.<p>The 20 day EMA is another target. The rally will then be the start of a $5 tall trading range, whether or not there is one more brief sell climax first.<h4>Can Tuesday be the start of a crude oil crash?</h4><p>Can Tuesday be a measuring gap and the start of an even stronger selloff instead of an exhaustion gap? Given what I wrote above, there is only a 25% chance of a big move down from here without at least a couple legs up over the next 2 weeks.<p>While the weak rally from Wednesday is a bear flag, the bulls will buy a new low. Consequently, the best the bears can probably get over the next week is a 1 – 2 day bear breakout. If they get it, it will probably fail. The odds favor at least a couple weeks of sideways to up trading.<h2>EURUSD nested wedge bottom</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/EURUSD-weekly-candlestick-chart-has-wedge-bull-flag-2.png\"><img loading=\"lazy\" src=\"2018-11-17-1.png\" alt=\"EURUSD weekly candlestick chart has wedge bull flag\"></a><p class=\"caption\">The EURUSD weekly Forex chart is reversing up from a wedge bull flag. The yearlong selloff is a test of the top of the 2015 – 2016 trading range. This week formed a strong buy signal bar for next week.<p>&nbsp;<p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/EURUSD-daily-candlestick-chart-reversing-up-from-wedge-bottom-1.png\"><img loading=\"lazy\" src=\"2018-11-17-2.png\" alt=\"EURUSD daily candlestick chart reversing up from wedge bottom\"></a><p class=\"caption\">The EURUSD daily Forex chart reversed up from a wedge bottom. This is a failed breakout below the August 15 low. The odds favor at least a small 2nd leg up.<p>The EURUSD weekly chart reversed up this week after breaking below the August low. The bulls now have an 11 week parabolic wedge bottom on the daily chart nested within a yearlong wedge bull flag on the weekly chart.<p>However, the past 8 weeks have been in a tight bear channel on the weekly chart. This week’s buy signal bar is not enough buying pressure to overcome the tight bear channel. This is true despite the nested wedge bottom.<p>Therefore, if there is a reversal up, it will probably stall after a week or two. But, because of the wedge bottoms, the bulls will buy a resumption back down. That would create a micro double bottom. If the bulls then get a 2nd buy signal, they would have a better chance of a swing up to the 1.1622 October 16 major lower high.<h4>What about the July/September double top?</h4><p>Whenever there is a double top bear flag and a reversal down, there is typically a 40% chance of a break below the neck line and a measured move down. This week broke below the August low, which is the neck line of the July/September double top. The double top is 500 pips tall, and therefore the target for the bears is 1.08.<p>Is there a 40% chance of reaching 1.08 in<em>this</em>case? No. That is because there are other important factors in play here. In addition to the nested wedge bottoms, which are bullish, the yearlong selloff is testing the top of the 2015-2016 trading range. It is therefore a bull Breakout Test, which is a pullback to support.<p>Furthermore, look at the monthly chart (not shown). Four of the past 5 candlesticks were dojis. This is not how strong bear trends typically look. Therefore, the odds of the measured move down are less than 40%.<h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Weak rally from 20 month EMA</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-monthly-candlestick-chart-has-bull-doji-inside-bar-after-October-sell-climax.png\"><img loading=\"lazy\" src=\"2018-11-17-3.png\" alt=\"Emini monthly candlestick chart has bull doji inside bar after October sell climax\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick pattern so far is a doji bar within October’s range.<p>The monthly S&amp;P500 Emini futures candlestick chart currently has a doji bar for November. This represents indecision and it increases the chance of more sideways trading for at least a couple months.<p>There are still 2 weeks left to the month. The bears hope for a late, strong selloff. They would then have consecutive big bear bars. While unlikely, it would increase the chance of at least several more months of sideways to down trading.<p>It is important to remember that the 10 year bull trend on the monthly chart has been strong. The 2018 double top is probably too small to reverse such a strong bull trend into a bear trend. Consequently, the past year is likely due to an absence of buying because the bulls were exhausted by the extreme buy climax in 2017.<h4>Yearlong pullback from exhaustive buy climax</h4><p>The 2016 – 2018 bull micro channel had 15 bars. This was the most extreme buy climax in the 100 year history of the stock market. Many bulls used the surprisingly strong rally as an opportunity to take windfall profits in January. They are waiting to see how low the Emini will fall before they will buy again.<p>Typically, exhausted bulls wait for at least 10 bars, but sometimes much longer. While the monthly chart has gone sideways all year, the October bear bar had the biggest bear body in the 10 year bull trend. In addition, the February bear bar was big as well. This strong selling pressure will make the bulls want to see a few bull bars before they buy again and hold for a swing up. As a result, the monthly chart will probably not be able to go up much for at least 2 – 3 months.<p>Can it go down? Yes, but probably not very far. The 1st reversal down in a strong bull trend tends to be minor. That means it forms a trading range or bull flag. Consequently, even if the Emini breaks below the February low, it will probably not enter a bear trend. A trading range and then a new high would still be more likely than a bear trend with a test of the 2015 – 2016 trading range below 2,000. However, the Emini will probably test that level within the next 2 – 5 years.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Weak buy and sell setups so sideways likely</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-weekly-candlestick-chart-has-micro-double-bottom-after-sell-climax.png\"><img loading=\"lazy\" src=\"2018-11-17-4.png\" alt=\"Emini weekly candlestick chart has micro double bottom after sell climax\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart triggered a Low 1 sell signal this week by trading below last week’s low. But, last week had a big bull body and the Emini reversed up 2 weeks earlier. Therefore, as was likely, there were more buyers than sellers below last week’s low. This week closed above that low.<p>The weekly S&amp;P500 Emini futures candlestick chart had a buy signal last week and a sell signal this week. When there are conflicting signals and neither one is strong, there is confusion. Confusion is a hallmark of a trading range. Traders do not believe that the legs up and down will go far. They therefore take quick profits. In addition, whenever there is a strong leg up or down, they bet on a reversal instead of on a breakout.<p>The result is that traders are buying low, selling high, and scalping. This is how a trading range forms, and the 5 week trading range is likely to continue for at least a few more weeks.<br><h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Emini indecision with double top and head and shoulders bottom</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-daily-candle-stick-chart-has-a-head-and-shoulders-bottom-and-a-double-top-bear-flag.png\"><img loading=\"lazy\" src=\"2018-11-17-5.png\" alt=\"Emini daily candle stick chart has a head and shoulders bottom and a double top bear flag\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart turned down last week from a 2 month double top bear flag. However, Thursday was a strong buy signal bar for a head and shoulders bottom. Friday triggered the buy signal by trading above Thursday’s high.<p>The daily S&amp;P500 Emini futures candlestick chart is in the middle of a 2 month trading range. In addition, that trading range is in the middle of yearlong trading range.<p>Trading ranges always have reasonable buy and sell setups. The bears have an October/November double top bear flag. But, the bulls have a 2 month head and shoulders bottom. Thursday was a strong buy signal bar, and the buy tirggered on Friday.<p>While both the bulls and bears want a trend, trading ranges resist breaking out. Consequently, traders will look for reversals instead of trends. They will take quick profits after every 5 – 10 bar move, and then look for an opposite move.<h4>Breakout Mode</h4><p>Which is more likely, a new all-time high or a break below the February low? Because there was a 10 year bull trend leading up to the yearlong trading range, a bull breakout has a higher probability. But every bar that gets added to the range makes the probability closer to 50% for the bulls and the bears.<p>The bulls hope that this week’s reversal up races to above the October/November double top. The bears, however, see the 4 day rally as a pullback in their reversal down from the double top. Both are valid patterns. The next few days will tell traders which is more likely. Many bulls would like to see a test of this week’s low and then a 2nd reversal up. That would have a higher probability of success.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-11-17"
    }
  ],
  "19": [
    {
      "data": [
        "<article class=\"post-83222 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini head and shoulders bottom but bear micro channel Intraday market update: Monday November 19, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini head and shoulders bottom but bear micro channel<br>Intraday market update: Monday November 19, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-11-19T06:20:09-08:00\">November 19, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini head and shoulders bottom but bear micro channel</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>By going above Thursday’s high, Friday triggered a buy signal on the daily chart. However, there is a 7 bar bear micro channel and Friday was the 1st pullback. Typically, the rally will pull back within 3 days. Therefore, the odds are against a strong move up this week.<p>The Emini has been sideways for 4 days, despite the big bars. The tight trading range will probably continue today and tomorrow, even if the market rallies for another day or two. Although there is a head and shoulders bottom on the daily chart, the 7 bar bear micro channel will make many bulls wait for a 2nd entry buy signal.<p>While Thursday was a buy signal bar, it was huge. The stop for the bulls is therefore far below. Many bulls do not want risk that much. As a result, many will wait to buy a pullback and did not buy on Thursday. Furthermore, Thursday’s high was at the 20 day EMA, which is resistance. Consequently, the odds favor at least a small pullback or sideways move this week.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 11 points in the Globex session. While Friday closed near its high, the day had several swings up and down. In addition the 2 day rally is a the top of a 4 day trading range and at the 20 day EMA. Therefore, more sideways trading is likely today.<h2>Friday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-broad-bull-channel-and-trading-range-day.png\"><img src=\"2018-11-19.png\" alt=\"Emini broad bull channel and trading range day\"></a><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD daily Forex chart has buy climax in bear channel</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/EURUSD-daily-Forex-chart-has-buy-climax-in-bear-channel.png\"><img loading=\"lazy\" src=\"2018-11-19-1.png\" alt=\"EURUSD daily Forex chart has buy climax in bear channel\"></a><p class=\"caption\">Today so far is the 5th consecutive bull trend day in a bull trend reversal up from a wedge bottom. However, it is still below the November 7 lower high and therefore in a bear channel.<p><br>Over the past year, every 5 – 6 day trend up or down pulled back for 1 – 3 days. Therefore, the current 5 day rally will probably pull back this week. However, even though it is a small buy climax, it is also a sign of strong bulls. Consequently, the bulls will buy the 1st 1 – 3 day pullback.<p>The bulls need to get above the November 7 lower high to make traders believe that the bear trend has ended. If the EURUSD then sells off again, they will need a higher low at around the October 31 low for a major trend reversal buy setup. At that point, the bear trend would have evolved into a trading range.<p>The bulls need a strong break above the October 16 major lower high before traders will begin to believe that the rally will continue up to the February high. Even if that will happen, the 2 month bear trend will probably convert into a trading range for many months first. The bulls have to stop the bears before they can begin a bull trend. A bear trend typically has to transition into a trading range before it will evolve into a bull trend. That is what is likely over the next several months.<h4>Weekly buy signal</h4><p>I said on Friday and wrote over the weekend that last week was a big bull trend reversal bar on the weekly chart. The weekly chart has a wedge bull flag. However, I mentioned 2 problems. First, the selloff from the September 24 high is in a tight bear channel. Typically, the 1st leg up will have a pullback within the 1st few bars. Therefore, there will probably be sellers around the November 7 lower high on the daily chart. That is also around the 20 week EMA.<p>The 2nd problem with last week’s buy signal bar is that it is too big. A big buy signal bar means the stop is far below and the risk is therefore big. Many bulls will not take the buy signal. Instead, they will wait to buy a pullback that would allow them to use a tighter stop. This lack of bulls willing to buy around last week’s high makes a pullback likely this week.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart rallied 45 pips overnight. However, the bars were small, had prominent tails, and mostly overlapped one another. This is a weak rally and it will therefore probably lead to a trading range today. This is particularly true after an unusually protracted 5 day rally.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-bear-trend-from-the-open.png\"><img loading=\"lazy\" src=\"2018-11-19-2.png\" alt=\"Emini bear trend from the open\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>Today triggered a Low 1 sell signal by trading below Friday’s low. Since Friday was a bull trend bar on the daily chart, it was a weak sell signal bar. However, today was a strong entry bar for the bears. If they get strong follow-through selling tomorrow, they will probably get a test of the October low. More likely, there will be buyers around today’s low and last year’s close.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-11-19"
    }
  ],
  "20": [
    {
      "data": [
        "<article class=\"post-83498 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini weak sell signal testing October sell climax low Intraday market update: Tuesday November 20, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weak sell signal testing October sell climax low<br>Intraday market update: Tuesday November 20, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-11-20T06:20:30-08:00\">November 20, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini weak sell signal testing October sell climax low</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>By falling below Friday’s low, the Emini triggered a sell signal on the daily chart. But, Thursday and Friday were big bull days. Therefore, Friday is a low probability sell signal bar. Consequently, a continuation of the 5 day tight trading range is more likely than a bear trend. However, if today is also a big bear day closing far below last week’s low, the odds will shift in favor of a test of the October low.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 33 points in the Globex session. It will therefore have a big gap down. But, when there is a big gap down, there is an 80% chance of at least one reversal in the 1st 90 minutes. The bears do not want to sell far below the average price (the EMA). In addition, many bulls will see the selling as overdone. They will be willing to buy for scalps.<p>Typically, the bulls will look to buy either a wedge or double bottom for a possible early low of the day. Also, the bears will look to sell a wedge or double top near the EMA for a possible early high of the day.<p>There is only a 20% chance of a trend from the open up or down after a big gap opening. When the big gap is down, like today, if there is going to be a trend day, down is more likely.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-bear-trend-from-the-open.png\"><img src=\"2018-11-20.png\" alt=\"Emini bear trend from the open\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD daily Forex chart beginning 1 – 3 day pullback after buy climax</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/EURUSD-daily-Forex-chart-beginning-1-3-day-pullback-after-buy-climax.png\"><img loading=\"lazy\" src=\"2018-11-20-1.png\" alt=\"EURUSD daily Forex chart beginning 1 - 3 day pullback after buy climax\"></a><p class=\"caption\">The EURUSD daily Forex chart has a bear trend bar and a lower high so far today. This is after 5 consecutive bull trend bars, which is a buy climax.<p><br>The EURUSD daily Forex chart rallied strongly for 5 days. Since every trend up or down over the past 6 month pulled back by the 5th or 6th day, this week was likely to have a pullback. Today might be the start.<p>Since 5 bull days represents strong buying, the bulls will be eager to buy again. That means the pullback will probably last only 2 – 3 days. However, it might last a little longer and reach the October 31 low.<p>The bears have another lower high in the bear channel that began on October 16. But, after 5 bull days, they will probably need a micro double top before they can test down to the November 12 low. Consequently, they will take profits between 100 – 150 pips down from today’s high.<p>I said over the weekend that last week was a buy signal bar on the weekly chart, but with problems. The 8 week tight bear channel made a big rally this week unlikely. Also, because last week’s range was big, many bulls did not want to buy above its high. The risk would be too big. Instead, they would look to buy a 50% pullback. That is currently around 1.1350.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart reversed down 60 pips so far overnight. This is probably the start of a 1 – 3 day pullback to around 1.1350. Consequently, the bears will sell rallies. Since the chart has been in a 30 pip tight range for the past 5 hours, the bears are mostly scalping. But, some will hold for around a 100 – 150 pip pullback over the next 2 – 3 days.<p>In addition, after a 5 day rally, the bulls will buy reversals up. However, since the bulls are exhausted, they will only scalp for the next couple of days.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-gap-down-and-parabolic-wedge-bottom-and-wedge-top.png\"><img loading=\"lazy\" src=\"2018-11-20-2.png\" alt=\"Emini gap down and parabolic wedge bottom and wedge top\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>The Emini had a big gap down today. After a rally from a parabolic wedge bottom, it sold off from a wedge top. It then remained in a trading range, but closed below and near the open.<p>A gap up within the next few days would create an island bottom. That is a minor reversal pattern. In general, a big gap is exhaustive and the market usually has to go sideways for a few days. That is what is likely here. This is especially true since tomorrow and Friday will have less trading because of Thanksgiving.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-11-20"
    }
  ],
  "21": [
    {
      "data": [
        "<article class=\"post-83500 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini adage says Thanksgiving belongs to the bearsIntraday market update: Wednesday November 21, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini adage says Thanksgiving belongs to the bears<br>Intraday market update: Wednesday November 21, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-11-21T06:20:47-08:00\">November 21, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini adage says Thanksgiving belongs to the bears</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>There is an old-timer’s stock market and therefore Emini adage that says Thanksgiving belongs to the bears and Christmas belongs to the bulls. I bring it up because it is part of stock market tradition. However, it is a calendar trade, and calendar trades are useless. Never place a trade based on seasonal tendencies because you will lose money over time.<p>The Emini had a big gap down yesterday, but it was a trading range day. The bulls want a gap up today or soon to create an island bottom. But, an island bottom is a minor reversal pattern and therefore not particularly helpful.<p>The bears still have their October/November double top. The October 29 low of 2603.00 is the neck line. A measured move down would to below 2400. It is still more likely that there will be buyers around the current level or down around the February low.<p>When there is a big gap, like yesterday, the Emini often goes sideways for a few days. It then decides whether there will be follow-through or a reversal. With tomorrow being a holiday and many traders not trading on Friday, there is an increased chance of quiet and therefore sideways trading.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 19 points in the Globex session. Yesterday’s selloff was in a bear channel, and 75% off bear channels have bull breakouts. Today will gap above the channel.<p>Since channels typically evolve into trading ranges, that is what is likely today. This is especially true because of tomorrow is a holiday and markets are usually quiet the day before. However, yesterday ended with a lower low major trend reversal. Consequently, there is a 40% chance of a strong bull trend day today.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-gap-down-and-parabolic-wedge-bottom-and-wedge-top.png\"><img src=\"2018-11-21.png\" alt=\"Emini gap down and parabolic wedge bottom and wedge top\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD High 1 bull flag after buy climax rally following wedge bottom</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/EURUSD-High-1-bull-flag-after-buy-climax-rally-from-wedge-bottom.png\"><img loading=\"lazy\" src=\"2018-11-21-1.png\" alt=\"EURUSD High 1 bull flag after buy climax rally from wedge bottom\"></a><p class=\"caption\">On the EURUSD daily Forex chart, today so far is a bull inside day after yesterday’s big outside down day. Today will be a buy signal bar for a High 1 bull flag.<p><br>The EURUSD daily chart had a big outside down day yesterday. After a 5 day rally, the bears will probably need a micro double top if they will be able to continue the bear channel.<p>If today remains a bull inside day and tomorrow trades above today’s high, but then reverses down from Monday’s high, the bears will have a micro double top. They hope that it would lead to a break below the November 12 wedge bottom and continue the 2 month selloff. Their goal is a 600 pip measured move down from the 6 month trading range. They have a 40% chance of success.<p>Since the 5 day rally was strong, the bulls will buy the 1st selloff, even if it is deep. For example, it might retest the October 31 low. There would then probably be a rally back up to at least this week’s high. Because the weekly chart has a wedge bull flag and the daily chart has a wedge bottom, the daily chart will probably trade sideways to up for at least a couple more weeks. In addition, the rally will probably test lower highs, like the November 7 high.<p>The daily chart will probably test the October 16 major lower high within a couple of months. This is because that was the start of the channel that followed the late September spike down. Typically, a Spike and Channel bear trend breaks above the bear channel, rallies to the beginning of the channel, and evolves into a trading range.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart rallied 60 pips overnight from above yesterday’s low. Since the bulls have done enough to create a good buy signal bar, there is no incentive to rally much more today. Therefore today will probably enter a trading range for the rest of the day.<p>The bears want a reversal down from the overnight wedge rally. But, the best they probably can achieve is a transition into a 40 pip trading range. Day traders have been scalping overnight and they probably will continue today.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-gap-up-and-breakout-mode-and-trend-resumption-down.png\"><img loading=\"lazy\" src=\"2018-11-21-2.png\" alt=\"Emini gap up and breakout mode and trend resumption down\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>The Emini gapped above yesterday’s bear channel. It then had a weak rally to above yesterday’s high. It spent most of the day in a tight range, then reversed down late. On the daily chart, today is a Low 1 bear flag sell signal bar for tomorrow.<p>Yesterday gapped down. A gap up at any point over the next several days will create an island bottom.<p>The market is closed tomorrow and I will be away on Friday. The bears want the week to close below last week’s low as a sign of strength. The bulls always want the opposite.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-11-21"
    }
  ],
  "24": [
    {
      "data": [
        "<article class=\"post-83504 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini strong Christmas rally unlikely in 2018Weekend Market Update: November 24, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini strong Christmas rally unlikely in 2018</strong><br>Weekend Market Update: November 24, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-11-24T00:30:51-08:00\">November 24, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2><strong>Market Overview</strong></h2><p>The<strong>Emini</strong>has sold off over the past 2 weeks from a double top bear flag on the daily chart. It is now near the October 29 neck line of the double top. After falling a little more to support, it will probably reverse up for a few weeks from there or around the February low. There is a 30% chance that the selloff will continue down the 10 year bull trend line at around 2350.<p>The<strong>crude oil futures market</strong>is in a strong bear trend. There were extreme sell climaxes last week and the week before, and the selloff is testing the $50 Big Round Number. The bulls have a 60% chance of a reversal up to the top of the most recent sell climax high, which is Friday’s high, within a couple of weeks. The market will then probably enter a $5 – 10 dollar trading range over the following month.<p>The<strong>EURUSD Forex market</strong>is trying to reverse up from a wedge bottom on the daily chart and a wedge bull flag on the weekly chart. But, the 9 week bear channel on the weekly chart is tight. Therefore, the bulls will probably need a micro double bottom within 2 weeks before they can get a swing up to the October 16 high. Otherwise, the next support is 1.10.<h2><strong>Crude oil Futures market:</strong><br>Crashing in a series of sell climaxes, which should soon lead to exhausted bears</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Crude-oil-futures-daily-candlestick-chart-crashing-but-possible-wedge-bottom.png\"><img loading=\"lazy\" src=\"2018-11-24.png\" alt=\"Crude oil futures daily candlestick chart crashing but possible wedge bottom\"></a><p class=\"caption\">The daily crude oil futures candlestick chart has had three unusually big bear bars over the past 2 weeks. These are sell climax bars and they are forming late in a bear trend. Exhaustive sell climaxes typically lead to a trading range.<p>I wrote last week that the November 13 big bear trend bar had a 60% chance of either being the low of the sell climax or that there would be one more sell climax, and then a reversal. Tuesday last week was another big bear bar and therefore a 2nd consecutive sell climax. Friday was a third.<p>Nothing has changed other than the bottom now will probably be a wedge. There is a 60% chance that Friday will be a temporary end of the selling, whether or not there is a small dip below its low this coming week. Since the high of the final sell climax is the 1st target and Friday’s range was about $4, traders will look for the 1st reversal up to be at least $4.<p>A reversal up from a wedge bottom will typically reach the top of the wedge. That is the November 16 high just above $58. The chart then evolves into a trading range. Here, it will probably be about $8 – 10 tall.<h4>$50 Big Round Number is a magnet</h4><p>The bears are trying to drive the market down to the $50 Big Round Number. They got to within 15 cents on Friday and they will probably try again early this week.<p>However, the extreme sell climaxes and wedge bottom make a reversal up from around that level likely. Once the bears decide they cannot push the price down any further, they will buy back their very profitable shorts in a panic. They understand the risk of a sharp short covering rally and do not want to give back their windfall profits. The bulls will see the short covering rally and they will buy as well. This results in the sharp reversals that come from sell climaxes.<h4>Sell climax usually evolves into trading range</h4><p>After a sell climax, the rally usually also gets to the 20 day EMA. Sell climaxes lead to profit taking by the bears who now have surprisingly big profits. They know that there will be a reversal up that will last longer and go higher than what might seem likely.<p>Once the bears take profits, they will not look to sell again within a few days. They typically wait for 10 or more days and at least 2 legs sideways to up. They want to be certain that there will not be a major reversal up to around the 50% retracement level. That is currently $65.<p>The rally will probably stall at around the EMA and the wedge high at $68. At that point, the bears will sell again. However they probably will switch to taking quick profits. The result will be a bounce from the bottom half of the developing trading range. At that point, the trading range will be clear.<p>The bulls are looking to buy for a $4 bounce to Friday’s high and then an $8 – 10 rally to the top of the wedge. With both the bulls and bears buying low, selling high, and taking quick profits, the strong bear trend will probably begin to evolve into a trading range this week. It will likely last for at least the next several weeks.<h2><strong>EURUSD Forex weekly candlestick chart:</strong><br>Tight bear channel after double top bear flag</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/EURUSD-Forex-weekly-candlestick-chart-in-bear-channel.png\"><img loading=\"lazy\" src=\"2018-11-24-1.png\" alt=\"EURUSD Forex weekly candlestick chart in bear channel\"></a><p class=\"caption\">There is a 9 week tight bear channel nested within a 6 month bear channel. The bulls need a strong bull bar next week for a reversal up from a yearlong wedge bull flag.<p>The EURUSD weekly Forex chart reversed up 2 weeks ago from a yearlong wedge bull flag. It was also a test of the top of the 2015 – 2016 trading range (not shown). I said last week that there were 2 problems with the reversal. First, while the buy signal bar was good, it was big. That means that traders had to risk more than they would like. Many instead would wait to buy a pullback so that they could use a tighter stop.<p>Second, the 8 week selloff was in a tight bear channel. The first reversal up from a tight bear channel is typically minor. Consequently, there is usually a pullback within the 1st few weeks.<p>Since this past week had a bear body on the weekly chart, it is a sell signal bar for next week. This week will probably trade below last week’s low and trigger the sell signal. If the bears begin to get a series of bear bars, traders will suspect that the selloff might continue down to the 1.10 Big Round Number. A measured move down from the July/September double top is around 1.08.<p>The bulls hoping for a wedge bottom reversal need a micro double bottom with the low of 2 weeks ago. With this past week closing on its low and the 9 week bear channel as tight as it is, the bulls will probably 1st have to stop the selling before they can get a rally. That means they will need more strong bull bars before traders will buy.<h4>EURUSD daily Forex chart pulling back from 1st leg up after wedge bottom</h4><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/EURUSD-Forex-daily-candlestick-chart-head-and-shoulders-bottom.png\"><img loading=\"lazy\" src=\"2018-11-24-2.png\" alt=\"EURUSD Forex head and shoulders bottom and double top bear flag\"></a><p class=\"caption\">The EURUSD daily Forex chart is turning down from a 3 week double top bear flag. The bulls want a higher low after their wedge bottom. That would be a head and shoulders bottom.<p>The daily chart reversed up for 5 days from a wedge bottom. But, last week’s high was a lower high. In addition, it formed a double top bear flag with the November 7 high. As long as the daily chart continues to make lower highs, it is still in a bear channel. Since the reversal up was strong, the odds are that there will be at least a small 2nd leg up in the coming week. If the chart forms a higher low this week, there will be a head and shoulders bottom.<p>However, if the bears get 3 or more consecutive bear days this week, they will probably get a test the November 12 low. That would be more bearish and increase the chance of a successful breakout to a a new low and another leg down.<p>The bulls need to begin to break above lower highs to end the 2 month bear trend. Next, they need to begin to form a series of higher lows. That would signal the start of a bull trend.<p>Even if the bulls are successful, the bear channel that began with the October 16 lower high will probably convert into a trading range before the bulls can form a bull trend and test the 1.18 top of the 6 month trading range.<p>The bears hope that the 2 week reversal up is just a pullback from the breakout below the November 1 low. However, they should not have allowed the strong 5 day rally. Consequently, they will probably need at least a micro double top with last week’s high before they can break below the November low.<br><h2><strong>Monthly S&amp;P500 Emini futures candlestick chart:</strong><br>Emini strong Christmas rally unlikely in 2018</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-monthly-candlestick-chart-in-early-bear-trend-reversal.png\"><img loading=\"lazy\" src=\"2018-11-24-3.png\" alt=\"Emini monthly candlestick chart in early bear trend reversal\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart pulled back to the 20 month EMA in October after more than 20 months above it. However, October had the biggest bear body in the entire 10 year bull trend. In addition, November so far is another big bear bar.<p>The monthly S&amp;P500 Emini futures candlestick chart has pulled back to the 20 month EMA for the first time in 2 years. Traders have been happy to pay an above average price for a long time. Typically, they are eager to buy at the average price once they get an opportunity.<p>They had their chance in late October and bought aggressively. However, while the rally was big, it did not last. That means that the traders who bought were expecting a bounce, but not a resumption of the bull trend. There were no buyers at the top of the rally. The bulls therefore are buying selloffs and not breakouts. This is a characteristic of trading ranges and bear trends, not bull trends.<p>If November is a bear bar on the monthly chart, the odds will favor more sideways to down trading. If it closes on its low and below the 20 month EMA, December will probably trade below November’s low.<p>The next major support is the 10 year bull trend line. It is currently around 2350. At the moment, the bears have a 30% chance of reaching that target.<h4>Year-end rally to a new high is unlikely</h4><p>There is always a bull case. If November closes around the open of the month, it would form a doji bar on the monthly chart. It would represent a lack of sustained selling and therefore increase the chance of a new high within a 3 – 6 months.<p>There is a 30% chance that November will close on the high of the month. If so, it would be a good buy signal bar for December. The bulls would probably get a new high within a few months.<h4>Double top, but minor reversal on monthly chart</h4><p>The bears hope that the January/September double top is the start of a bear trend. But, those tops are only 10 bars apart. That is usually not a big enough topping pattern to lead to an opposite trend. Consequently, the 2 month selloff is more likely a bear leg in a trading range.<p>How long can it last and how far can it fall without triggering a bear trend? Further than the bulls would like. If the bears get 3 consecutive bear bars, the odds will shift in favor of a 2nd leg down after the 1st 1 – 3 month bounce. With only a week left in November, November will probably be the 2nd consecutive bear bar on the monthly chart.<p>That means that December will be important. If the bears can create a 3rd consecutive bear bar, the bulls will probably need a micro double bottom before they will get a new high.<p>For a micro double bottom to form, the bulls would need a bar to go above the high of the prior month. Sometimes the bounce lasts 2 bars. They would then need another 1 – 2 bar selloff. If that selloff reverses up, it would create a micro double bottom, which would be a higher probability buy setup.<h4>What do the bears need for a bear trend?</h4><p>Since there is always a chance of a bear trend, how likely is it? At the moment, the bears have a 30% chance of the current selloff leading to a bear trend on the monthly chart. That would mean a major trend reversal instead of a minor trend reversal. Therefore, there is a 70% chance of a trading range or a bull flag.<h4>What is the definition of a bear trend?</h4><p>In recent years, institutions have defined a bear trend as a 20% selloff. That is convenient because it allows for a quick categorization of selloffs. But, that is rigid and it often does not reflect what the price action is saying. A bear trend on the daily chart is often a bull flag on the monthly chart.<p>For example, in 1987, the S&amp;P500 fell more than 30% in one month. Was that a bear trend on the monthly chart? The market rallied since then and never fell below the October 1987 low. On the monthly chart, I would could it a sharp, brief pullback to the 20 month EMA and not a bear trend. It did not “trend” down. Therefore, while the news will call a 20% selloff a bear trend, I use the layman’s definition of a trend. That requires a sustained change in direction. I would like to see many bars in one direction before I would say something is sustainable and therefore trending.<p>For the monthly chart to be in a bear trend, there would have to be about 10 or more bars down from the high. In addition, there would have to be at least one lower low and one lower high. Consequently, the monthly chart is far from being in a bear trend. Even if it fell more than 30% like in 1987, without lower highs and lows, the selloff would still be a pullback in a bull trend.<h2><strong>Weekly S&amp;P500 Emini futures candlestick chart:</strong><br>Second leg down from lower high</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-weekly-candlestick-chart-in-sell-vacuum-test-of-trading-range-low.png\"><img loading=\"lazy\" src=\"2018-11-24-4.png\" alt=\"Emini weekly candlestick chart in sell vacuum test of trading range low\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart formed a big bear bar this past week.<br>This is a resumption of the October selloff, and a test of the bottom of the 2018 trading range.<p>The weekly S&amp;P500 Emini futures candlestick chart sold off strongly this past week. It is near the bottom of the yearlong trading range. Trading ranges resist breaking out. Consequently, the odds are that the Emini will reverse up from around the bottom of the trading range. However, it might have to break below the February low before the reversal takes place.<p>This past week was a big bear bar in a strong selloff from the October high. In addition, there is room to the February 2544.00 low at the bottom of the trading range. As a result, the Emini will probably fall at least a little more over the next few weeks. Support is at the October 2603.00 low and the February 2544.00 low.<h4>What if there is a breakout below the February low?</h4><br>The bears want consecutive big bear bars closing on their lows and below the February low. If they get them, there will be a 50% chance of some kind of measured move down. Targets would be a 200 point selloff based on the height of the October rally or a 400 point selloff based on the height of the yearlong trading range.<p>Why only 50% chance? Whenever there is a strong breakout below obvious support, there is a 50% chance that the breakout will lead to a swing down and a 50% chance that it will fail and the Emini will reverse up. Until there is a strong buy signal bar, the odds favor sideways to down trading.<h2><strong>Daily S&amp;P500 Emini futures candlestick chart:</strong><br>Strong selloff from double top bear flag to test October low</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-daily-candlestick-chart-testing-October-and-February-lows.png\"><img loading=\"lazy\" src=\"2018-11-24-5.png\" alt=\"Emini daily candlestick chart testing October and February lows\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart turned down from a double top bear flag 2 weeks ago. It has 5 consecutive bear bars and it is testing the October low.<p>The daily S&amp;P500 Emini futures candlestick chart turned down from a double top bear flag 2 weeks ago. The two tops were the highs of October 17 and November 7. A double top bear flag has a 40% chance of breaking below the neck line and falling for about a measured move down. The October 29 low is the neck line. Since the double top is 200 points tall, a measured move down is around 2400.<p>It is important to realize that there is a 60% chance this will not happen. Consequently, the bulls will look for a reversal up from around the obvious support of the October 29 low of 2603.00 and the February 9 low of 2544.00.<h4>Possible triangle</h4><p>The November 7 high is just below the October 17 high, and it is therefore a lower high. Last week’s low was just above the October low. A market that forms a lower high and a higher low is trying to form a triangle.<p>A reversal up on Monday would create a micro double bottom with last Tuesday’s low. Furthermore, the bulls have a wedge bottom with the November 2, 15, and 20 lows. But neither the micro double bottom nor the wedge bottom is strong. The bulls will need several consecutive bull bars to convince traders that they will be able to create a swing up. It is more likely that this selloff will test the October low and maybe the February low.<h4>Confusion creates trading ranges</h4><p>There is no sign of a persuasive bottom yet. Traders should expect at least slightly lower prices. However, if there are consecutive big bear bars closing below the February low, the odds will shift in favor of a swing down to around 2400.<p>The entire year has been in a trading range. Trading ranges resist breaking out. It is therefore more likely that the Emini will reverse up within a couple of weeks than break strongly below the February low.<p>Since the Emini has been in a trading range for almost a year, if the bulls get a rally, it will probably stall below the November 7 high. Instead of a bull trend, there will be a 200 point trading range within the 2018 trading range. The 2018 trading range will have a double top and a double bottom. At that point, the Emini will be balanced and in breakout mode. This is the most likely outcome, and the bull leg in the trading range should begin in December.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-11-24"
    }
  ],
  "26": [
    {
      "data": [
        "<article class=\"post-83502 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini bear flag but higher low and possible triangleIntraday market update: Monday November 26, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini bear flag but higher low and possible triangle</strong><br>Intraday market update: Monday November 26, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-11-26T06:20:53-08:00\">November 26, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini bear flag but higher low and possible triangle</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini reversed up slightly on Friday at the end of a strong down week. The bulls hope that last Tuesday and Thursday formed a successful micro double bottom, and that the Emini is reversing up from the bottom of its yearlong trading range. After the November 7 lower high, the bulls are trying to form a higher low. The result could be a triangle over then next month or two.<p>The Emini had 4 consecutive bear bars on the daily chart. Since this is unusual, today or tomorrow will probably close above the open of the day.<p>There is a tendency to rally into the end of the year. This is especially true when the market is oversold, like it is now. But, the October 29 low is still a strong magnet below. Therefore, the bulls will need a series of bull days this week to escape that magnetic pull. Without that, the odds are that the Emini will fall at least a little further over the next two weeks.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 28 points in the Globex session. There will be a big gap up above Friday’s close on the open. If today gaps above Friday’s high, there will also be a gap up on the daily chart. Since there was a gap down 4 days ago, this will form a 4 day island bottom. While this is a minor buy signal, the context is good for the bulls. It therefore has an increased chance of creating the bottom for the next couple of months.<p>If there is a gap, but it is less than 5 points, it will probably close in the 1st hour. If the bulls can keep the gap open and create a bull trend day, the odds will favor higher prices this week.<p>When there is a big gap, there is only a 20% chance of a trend from the open that lasts all day. There is an 80% chance of at least one reversal in the 1st 90 minutes. The bulls will try to create a double bottom or wedge bottom near the EMA.<p>However, the bears want a double top or a wedge top, and then an early high of the day. The context on the daily chart gives the bulls a slight advantage over the bears. If there is going to be a trend day, up is more likely. Because of the sell climax over the past month, there is an increased chance of a big bull trend day and a series of bull trend days.<p>The bears always have an argument. They want a strong break below the February low. If the bears are strong, they can create a huge bear day at any time. For today at least, the odds favor the bulls.<h2>EURUSD daily Forex chart high 2 bull flag but in bear channel</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/EURUSD-daily-Forex-chart-high-2-bull-flag-but-in-bear-channel.png\"><img src=\"2018-11-26.png\" alt=\"EURUSD daily Forex chart high 2 bull flag but in bear channel\"></a><p class=\"caption\">The EURUSD daily chart pulled back for 2 legs after a strong 5 day rally. The odds are that this High 2 bull flag will lead to a breakout above the November 20 lower high.<p><br>The EURUSD weekly Forex chart (not shown) triggered a sell signal overnight by trading below last week’s low. As I wrote over the weekend, even though last week was a strong sell signal bar on the weekly chart, there might be more buyers than sellers below. Last night traded only 1 pip below last week’s low and reversed up. This is a sign that the bulls might be more aggressive at this level than the bears.<p>On the daily chart above, the past 5 days formed a 2 legged pullback from a 5 day rally. Since the November selloff was a wedge, the odds are that there will be a 2nd leg up. Moreover, the bulls will probably be able to break above at least one minor lower high in the bear channel. Consequently, the EURUSD daily chart should get above the November 20 high this week.<p>If so, the bar on the weekly chart would be an outside up bar after a strong sell signal bar. Thar would create trapped bears. This week would then be a buy signal bar on the weekly chart for next week. At the moment, the chart will probably go above the October 16 high before it falls below the November 12 low.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart rallied 60 pips overnight after reversing up from below last week’s low. While the rally has not been especially strong, the context is good for the bulls on the daily and weekly charts. Consequently, traders will look to buy pullbacks and strong breakouts, hoping for a continued rally this week.<p>Because the rally so far has not been strong, day traders will also be willing to sell reversals down for a scalp. Unless there is a strong break below the overnight low, most bears will not swing trade.<p>However, if they break below the overnight low, they will trigger the weekly sell signal again. The bulls will give up their hope of an outside up week. That would increase the odds of a failed High 2 bull flag on the daily chart. Traders would then look for a break below the November 12 low.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-island-bottom-and-trading-range-day-closing-near-its-high.png\"><img loading=\"lazy\" src=\"2018-11-26-1.png\" alt=\"Emini island bottom and trading range day closing near its high\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>By gapping up, the Emini formed a 2 day island bottom nested within a 4 day island bottom. Since the Emini is near the bottom of a yearlong trading range, the location is good for the bulls. However, today was the 1st bull day in 5 days. And, it was not a big bull bar closing on its high. Therefore, the bulls need several other bull bars this week before traders will believe that the rally will test back up to the November high over the next few weeks. Without that, the odds still favor a test of the October low and possibly February low.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-11-26"
    }
  ],
  "27": [
    {
      "data": [
        "<article class=\"post-83692 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini 3 day island bottom but weak trend reversal up  Intraday market update: Tuesday November 27, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini 3 day island bottom but weak trend reversal up</strong><br>Intraday market update: Tuesday November 27, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-11-27T06:20:29-08:00\">November 27, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini 3 day island bottom but weak trend reversal up</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini gapped up yesterday. Since it gapped down 3 days earlier, the gap up created a 3 day island bottom. In addition, it gapped down on Friday. It therefore has a 1 day island bottom nested within a 3 day island bottom.<p>While island tops and bottoms are not major reversal setups, this one is after a sell climax. In addition, it is at support at the bottom of a yearlong trading range. Consequently, it has a better chance of being a major bottom.<p>But, the bulls need several strong bull bars before traders will believe that this is the low for the next several months. Without that, the odds are that the reversal up will fail this week and the Emini will fall below last week’s low.<p>Yesterday did not have a big bull body and it did not close on its high. If today is also not a strong bull day, the 3 week selloff will probably continue down to the October or February lows.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 12 points in the Globex session. Yesterday was a Low 2 sell signal bar for a micro double top with Wednesday’s high. Since yesterday had a bull body, the setup is weak. That reduces the chance of a big bear day today.<p>Because yesterday’s rally was not strong, there is not much momentum up. Therefore, the odds are against a big bull day.<p>Finally, the Emini has been in a small trading range for 4 days. Since a big day up or down is unlikely, today will probably be another trading range day in the developing tight range.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-island-bottom-and-trading-range-day-closing-near-its-high.png\"><img src=\"2018-11-27.png\" alt=\"Emini island bottom and trading range day closing near its high\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex chart has head and shoulders bottom in bear trend channel</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/EURUSD-Forex-chart-has-head-and-shoulders-bottom-in-bear-trend-channel.png\"><img loading=\"lazy\" src=\"2018-11-27-1.png\" alt=\"EURUSD Forex chart has head and shoulders bottom in bear trend channel\"></a><p class=\"caption\">The EURUSD daily Forex chart pulled back in 3 legs over the past week. This is a micro wedge. A reversal up from here would be a higher low major trend reversal and a head and shoulders bottom.<p><br>The EURUSD daily Forex chart has been forming lower highs and lows since September 24. It is therefore in a bear channel. If today closes near its high, it would be a buy signal bar for tomorrow. The 5 day selloff would then be a micro wedge bull flag after the 2 week rally. Furthermore, a rally from here would be a higher low major trend reversal. In addition, that would create a head and shoulders bottom.<p>The weekly chart is at support and has a yearlong wedge bull flag. Therefore, the context is good for the 2 month bear trend to end around the current level. Also, the daily chart is at the bottom of a 6 month trading range. Most trading range breakouts fail. Consequently, the odds favor a reversal up for several weeks, whether or not there is a small break below the November 12 low first.<p>The bears want to keep making lower highs and lows. That would continue the 2 month bear trend channel. In addition, the current selloff is from a double top bear flag with the July and September highs. There is therefore a 40% chance of a 500 pip measured move down to 1.08 over the next few months. But, that means there is a 60% chance of a reversal up before then.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart reversed up 30 pips overnight from just above the November 1 low. That is a small reversal. In addition, the rally had mostly overlapping bars with small bodies and prominent tails. This is not what the bulls need when they are trying to create a bottom. Consequently, today so far is not a credible bottom. There has not been strong buying at this price. If it does not materialize today or tomorrow, the 6 day selloff will continue to below 1.300.<p>Because the overnight price action has been quiet, the odds are that today will be a small trading range day. At a minimum, the bulls want the day to close near its high. Today would then be a good buy signal bar for tomorrow. As long as the bears do not get a strong downside breakout, the bulls will buy selloffs all day.<p>Since the bears want the day to end with a close below the open, they will sell rallies. With traders buying low and selling high, today will probably remain in a trading range.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-broad-bull-channel-and-double-bottom-pullback.png\"><img loading=\"lazy\" src=\"2018-11-27-2.png\" alt=\"Emini broad bull channel and double bottom pullback\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>The Emini had an early rally, but then entered a trading range. After a midday double bottom, the Emini had a weak rally and it closed on its high. This was the 2nd consecutive bull bar on the daily chart, and the bulls still have their island bottom. They need more and bigger bull bars on the daily chart before traders will believe that the 3 day island bottom will lead to a reversal.<p>While the bears have a Low 2 sell signal for tomorrow, today had a bull body and it closed on its high. This is a low probability sell signal bar. This is a low probability sell signal. Since the daily chart sold off in a climactic way in November, there is an increased chance of a sharp reversal up.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-11-27"
    }
  ],
  "28": [
    {
      "data": [
        "<article class=\"post-83694 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini 3 day island bottom might become 5 day island bottomIntraday market update: Wednesday November 28, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini 3 day island bottom might become 5 day island bottom</strong><br>Intraday market update: Wednesday November 28, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-11-28T06:20:47-08:00\">November 28, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini 3 day island bottom might become 5 day island bottom</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Yesterday was a broad bull channel day and it closed on its high. Also, if tomorrow gaps up, there will be a 5 day island bottom in addition to the current 1 and 3 day island bottoms. Since this is buying pressure, it would increase the chance of a test of the EMA and the November 16 minor lower high.<p>The bears want the 2 day rally fail around the 20 day EMA. However, after 2 bull bars closing near their highs, the bears will probably need a micro double top before they can resume their bear trend. Consequently, the Emini will probably be sideways to up this week.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 11 points in the Globex session. It will probably gap up, which will create a 5 day island bottom. The bears will try to close the gap. They often try on the open. If there is a selloff, traders will pay careful attention to what happens near yesterday’s high. The bulls will try to create a reversal up. However, the bears want to close the gap. In addition, they want today to close below yesterday’s high and on the low of the day.<p>Because of the 2 bull days and the island bottom, the odds favor another bull trend day today. If the bears conclude that the bulls are in control, they will give up. This could create a big bull trend day today or soon.<p>After 2 bull days closing near their highs, the bears will probably need a micro double top before they can resume the bear trend. Therefore, traders will buy the 1st reversal down. This will limit the downside for the rest of the week.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-broad-bull-channel-and-double-bottom-pullback.png\"><img src=\"2018-11-28.png\" alt=\"Emini broad bull channel and double bottom pullback\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex bear channel forming head and shoulders bottom</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/EURUSD-Forex-bear-channel-forming-head-and-shoulders-bottom.png\"><img loading=\"lazy\" src=\"2018-11-28-1.png\" alt=\"EURUSD Forex bear channel forming head and shoulders bottom\"></a><p class=\"caption\">The EURUSD daily chart has been in a bear channel since the October 16 lower high. It has been sideways since November 1. The bears want the channel to break to a new low, but the bulls want a reversal up. A reversal up from here would be a higher low major trend reversal and a head and shoulders bottom.<p><br>The EURUSD daily Forex chart hast soled off 600 pips since September. But, it has been sideways for a month. The bears want the bear trend to resume. They need a strong break below the November 12 low. Yet, the 7 day selloff has lacked consecutive big bear bars. It therefore looks more like a bear leg in the month-long trading range than a resumption of the bear trend.<p>If the bulls can get a reversal up this week, they will have a higher low major trend reversal. It would also be a head and shoulders bottom. In general, a major bottom has a 40% chance of leading to an opposite trend. More often, it leads to a swing up in a trading range. It sometimes simply quickly fails and the bear trend resumes.<p>Trading ranges resist breaking out. Therefore, a break below the November low will probably reverse up. However, a break above the November high and 1.1500 will probably stall around the October 16 lower high.<p>The lack of momentum over the past week makes another trading range day likely today. Since the bulls need a good buy signal bar, they will try to get the day to close near its high. The bears always want the opposite and will try to get the day to close near its low.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 20 pip range for the past 5 hours. This makes it difficult even for scalpers to make money.<p>The location is good for the bulls. In addition, the micro wedge down over the past 7 days is likely to reverse up. But, until there is a bull breakout above the micro wedge, the 7 day bear channel is still intact.<p>Because the micro wedge selloff follows a strong rally up to November 20, the odds favor at least a couple days up this week. However, if there is a strong bear breakout, traders will sell.<br><br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-strong-bull-breakout-on-Powells-fed-rate-hike-comment.png\"><img loading=\"lazy\" src=\"2018-11-28-2.png\" alt=\"Emini strong bull breakout on Powell's fed rate hike comment\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>The Emini tested yesterday’s high, but the bulls kept the gap open. The huge mid-day bull breakout was big enough to make higher prices likely for at least another day or two, even if there is a deep pullback 1st.<p>The Emini should test the November 16 lower high within a few days. By going above last week’s high, this week totally reversed last week’s selloff on the weekly chart.<p>On the monthly chart, at a minimum, the bulls want November to close above its open. It would therefore be a buy signal bar for December.<p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-11-28"
    }
  ],
  "29": [
    {
      "data": [
        "<article class=\"post-83696 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini bulls want November buy signal bar on monthly chart Intraday market update: Thursday November 29, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini bulls want November buy signal bar on monthly chart</strong><br>Intraday market update: Thursday November 29, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-11-29T06:20:54-08:00\">November 29, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini bulls want November buy signal bar on monthly chart</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini had a strong bull breakout in the middle of the day yesterday. It was big enough to have follow-through buying over the next week. This is true even if there is a deep pullback for a few days. There is only a 30% chance of a bull trap and reversal down when the breakout is this big. The bears typically need at least a micro double top before they can regain control.<p>The key prices this week are the 2720.25 open of the month, last week’s 2734.75 high, and the November 16 2748.75 lower high. November closes on Friday and the bulls want a bull body on the monthly chart. The bears always want the opposite, but the best they probably can get is a small bear doji.<p>If the month closes near its high, it will be a decent buy signal bar for December. The monthly chart has a 20 Gap Bar buy setup and November is the buy signal bar. The big bear bar on the monthly chart in October reduces the chances of a big rally from here without more sideways months.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 6 points in the Globex session. Since yesterday’s buying was climactic, there is a 75% chance of at least a couple hours of sideways to down trading today that starts by the end of the 2nd hour.<p>For the past week, I have said that the November 16 minor lower high was a magnet. Yesterday reached that target and therefore some bulls will take profits.<p>The open and high of the month and last week’s high are all nearby. All are important when the month and week close on Friday. That makes it likely that the Emini will probably be mostly sideways today and tomorrow, and decide in the final hour where the week and month will close.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-strong-bull-breakout-on-Powells-fed-rate-hike-comment.png\"><img src=\"2018-11-29.png\" alt=\"Emini strong bull breakout on Powell's fed rate hike comment\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex head and shoulders bottom trend reversal attempt</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/EURUSD-Forex-head-and-shoulders-bottom-trend-reversal-attempt.png\"><img loading=\"lazy\" src=\"2018-11-29-1.png\" alt=\"EURUSD Forex head and shoulders bottom trend reversal attempt\"></a><p class=\"caption\">Yesterday reversed up in a big outside up bar. But it had a prominent tail, which represents hesitation. The bulls want the head and shoulders bottom to break strongly above the November 20 high.<p><br>The EURUSD daily Forex chart reversed up from a head and shoulders bottom yesterday. Yesterday was a big outside up day and it closed above Tuesday’s high. Yet, it had a prominent tail and closed back below the 20 day EMA. Therefore, there is some hesitation and confusion. Since a head and shoulders bottom is a trading range, there is typically confusion and disappointment until there is either a strong rally or a strong resumption of the bear trend.<p>If the bulls can get a close above the November 20 lower high, they will probably continue the rally to at least the October 16 start of the bear channel.<p>Wednesday’s low is the bottom of the right shoulder of the head and shoulders bottom. A close below means that the bull trend reversal has failed. That would increase the chance of a break below the November 12 low.<p>It is important to remember that a major trend reversal pattern like this only has a 40% chance of actually leading to a major trend reversal. There is a 60% chance that the month-long trading range continues or the bear trend resumes. Traders will find out over the next 2 weeks.<h4>Weekly buy signal bar</h4><p>Last week was a sell signal bar on the weekly chart. The prior week was a buy signal bar. The bulls are hoping for a 2nd buy signal bar this week. They therefore will try to get the week to close on its high.<p>If they are successful, they will have consecutive strong buy signal bars and a micro double bottom on the weekly chart. Since the weekly chart has a yearlong wedge bull flag and is at support, that would create a good buy setup for next week.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart sold off and reversed back up overnight. The obvious 1st target for the bulls is the November 20 1.1474 lower high. Furthermore, the bulls want the week to close near its high. They therefore will continue to buy pullbacks today and tomorrow.<p>Since the bears always want the opposite and the chart has been sideways overnight, they will sell rallies. The would like the week to close below its 1.1347 open. The weekly candlestick would then have a bear body and be a weaker buy signal bar for next week.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/11/Emini-bull-reversal-and-then-bear-reversal-forming-doji-day.png\"><img loading=\"lazy\" src=\"2018-11-29-2.png\" alt=\"Emini bull reversal and then bear reversal forming doji day\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>I will be away tomorrow.<p>Today sold off on the open, but reversed up to above yesterday’s high and the November 16 high. The bulls took profits at the end of the day. The big, late selloff turned the day into a doji bar on the daily chart. That is common after a big bull day like yesterday.<p>The bulls want the month to close on its high tomorrow. However, the November high is probably too far up for the bulls to reach it tomorrow. Consequently, the bulls will try for a lesser goal. At a minimum, they want the month to have a bull body. Therefore, they want the month to close above its 2720.25 open. In addition, they want the week to close above last week’s high.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-11-29"
    }
  ]
}