{
  "3": [
    {
      "data": [
        "<article class=\"post-75041 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Trump rally beginning 5% correction over Fed fears Emini weekend update: February 3, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Trump rally beginning 5% correction over Fed fears<br>Emini weekend update: February 3, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-02-03T00:30:39-08:00\">February 3, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Pullback from buy climax</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/02/m.png\"><img loading=\"lazy\" src=\"2018-2-3.png\" alt=\"Emini monthly chart reversing down from extreme buy climax.\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart had an exceptionally big bull bar last month. Since it is late in a strong bull trend, it is a buy climax. The odds favor a 1 – 3 month pullback (bull flag). This month so far is a bear inside bar.<p>The monthly S&amp;P500 Emini futures candlestick chart has never had a trend this strong in the century-long history of the Dow and S&amp;P. The measure I am using is the number of months without a pullback. February is now the 15th consecutive month with a low above the prior month’s low. This is a 16 bar bull micro channel. The next longest streak was 13 months and that was in 1995.<p>Markets reflect rational human behavior. Consequently, they usually can not continue to do something much longer than they have done in the past. While this buy climax might continue indefinitely, the odds are 70% that it will end within a couple of months.<h4>Huge bar late in trend usually means exhaustive buy climax</h4><p>Since January was a huge bar, the current strong reversal might not trade below its low. However, since January is probably an exhaustion bar, February will probably disappoint the bulls. This means it will probably not be another big bull bar. Additionally, it might have a bear body. If so, it will close below the open. No matter what it looks like on March 1, the odds are that March will trade below February’s low, if February did not already trade below January’s low.<p>That would be the 1st pullback in a very strong bull trend. There is an 70% chance that the bulls will buy it and the selloff will last only 1 – 3 months. Since it will be a bull flag, the odds are that the bull trend will resume up to a new high within a couple of months once the pullback ends.<h4>Risk of bear trend is small</h4><p>When a bull trend is exceptionally strong like this one, there is only a 20% chance that the 1st reversal down will result in a bear trend. Therefore, the best the bears will probably get over the next 6 months is a trading range. If the Emini enters a trading range, it then will create a credible sell setup. However, most reversals fail. Hence, the risk of a bear trend over the next 6 months is small.<p>I said that there is a 20% chance of a bear trend. I was trading during the 1987 Crash. It came in the absence of any news. It just happened. I mention this because there is no significant news now. This reversal is simply due to an extreme buy climax and it is therefore technical. Yet, the rally was so extreme that the reversal down could be extreme as well. That is why I think that traders have to be aware that the reversal down has a 20% chance of being much greater than what anyone on TV is saying.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Bear reversal after buy climax</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/02/w.png\"><img loading=\"lazy\" src=\"2018-2-3-1.png\" alt=\"Weekly Emini chart falling to 20 week EMA and 5% correction\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart had a huge bear body this week after last week’s big bull bar. It closed far below last week’s low and should finally fall to the 20 week exponential moving average.<p>The weekly S&amp;P500 Emini futures candlestick chart is in a strong bull trend. Like the monthly chart, it is the most overbought it has ever been since the start of the Dow in 1896 and the start of the S&amp;P in 1923. The measure I am using here is the number of weeks without touching the 20 week exponential moving average (EMA). This is now the 65th week. The longest prior streak was 62 weeks during that 1995 strong rally when the bulls had their 13 month bull micro channel.<p>Just like the streak on the monthly chart, this one never has to end. Since all streaks end, this one will as well. This week’s reversal is probably the start of a selloff to the 20 week EMA. The odds are increased because of the consecutive buy climaxes over the past 5 weeks. The bulls had 2 very big bars 4 and 5 weeks ago. There was a pause, and then another exceptionally big bar last week. When there are consecutive exceptionally big buy climaxes late in a bull trend, there is a 60% chance of at least a couple legs down.<h4>20 Gap Bar buy setup</h4><p>The selloff this week is probably the start of a couple of legs down to the 20 week EMA. The bulls have been so eager to buy that they have been happy to buy above the average price for more than a year. Once they get a chance to buy at the average price, they will take it. If there is a pullback after 20 weeks above the EMA, it is a 20 Gap Bar buy setup. The odds are that the bulls can buy profitably.<p>That will be the case here as well. However, this buy climax is so extreme that the selloff might go 50 points below the moving average before the exhausted bulls buy again. Consequently, the pullback could last a couple of months.<p>Since the 20 week moving average is at 2665, that is the current target. It is also around the bottom of the buy climax that began 5 weeks ago. Because a buy climax low is a magnet, that is another reason for the Emini to pull back to that level. However, the EMA is rising quickly. Therefore, if the pullback takes a few weeks to get there, the average might be around 2700 – 2730. In any case, a pullback to that area would be about 5%.<h4>Trump rally beginning 5% correction over Fed fears</h4><p>The correction is beginning in the absence of significant news. Yet, the pundits on TV will ignorantly decide on a reason. An obvious one is a fear of the Fed raising rates further or faster than anticipated. While that is real, the bulls are still going to buy the selloff and there will be another new high within a few months. Consequently, that reason is foolish.<p>TV experts believe that everything is caused by news. If they do not understand why something is happening, they will still confidently point to a news event, like a series of economic reports. They simply cannot accept that things happen that are not news related.<p>The unfolding selloff is happening independent of the news. It is because the market is too stretched and it will regress back to more typical behavior. This means that it is simply technical. The rally went too far, too fast. The bulls see the recent rally as a great opportunity to take windfall profits, and they will look to buy again lower. Aggressive bears are confident of a pullback and they will sell for a trade. Once the market is no longer overbought, the bulls will buy again and there will be a new high within a few months. Technical, not news.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Bull flag more likely than bear trend</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/02/d.png\"><img loading=\"lazy\" src=\"2018-2-3-2.png\" alt=\"Emini daily chart has 3% correction and will reach 5% correction next week.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart had a huge bear trend day on Friday. It closed far below the 20 day exponential moving average. The breakout is strong enough to make at least a small 2nd leg down likely.<p>The daily S&amp;P500 Emini futures candlestick chart sold off strongly this week, especially on Friday. In addition, the selloff was strong enough to make a 2nd leg down likely. This is especially true since the daily chart has never been this overbought. The measure I am using is the number of days since the last small correction. The last 5% correction was 406 trading days ago. Until Friday, there had not been a 3% correction in 458 calendar days and 309 trading days. Friday’s low was far below 2799, which means that the Emini finally had a 3% correction. The odds still favor at least a 5% correction before there is a new all-time high.<p>These streaks, including the weekly and monthly streaks, are likely to end soon. A 5% correction from the current high would be 2731.50. The 20 week exponential average is the minimum target for this selloff. It is now at 2665, but rising rapidly. If the selloff takes a few weeks to get there, it will be around 2700. A selloff to that level would be a little more than a 50% pullback from the January rally.<h4>Late Momentum buyers so 5% correction could be fast</h4><p>No one knows how far down a correction will go, but 5% is a reasonable minimum target. It is possible that a selloff could give back all of January’s gains. If so, the correction would be closer to 10%. That is unlikely, given how strong the bull trends are on the weekly and monthly charts.<p>Many of the traders who bought over the past month were afraid of missing out of a huge bull trend. These are weak bulls who bought because the momentum up is strong, not because the market is cheap. They bought to make a quick profit. Therefore, they are unwilling to risk much to make a small profit. Hence, they will be quick to get out if a correction is underway. This is because they are unrealistically terrified of a possible crash and losing everything.<p>Consequently, their panic selling could result in a very big, fast move down. For example, the Emini could fall 150 points in just a few days. Yet, the selloff will still be a pullback in a bull trend. Therefore, strong traders will buy it. They know the math. The odds are high that any selloff, even if it is scary, will lead to another new high within a couple of months.<h4>The bears need follow-thourgh selling</h4><p>Monday is important. If the bears get another big bear trend day, that would represent follow-through selling. It would therefore increase the odds of a deeper, more protracted selloff. Look at all of the other big bear bars over the past year. All lacked follow-through selling. Each soon led to a resumption of the bull trend.<p>If Monday is not a big bear day, the odds of this selloff lasting only a few days go up. If Monday is a big bull day, the bulls would have a 50% chance of getting a new high before the correction reaches the 20 week moving average. At the moment, the bears have at least a 60% chance of reaching the 20 week EMA before there is another new high.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noopener\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-2-3"
    }
  ],
  "10": [
    {
      "data": [
        "<article class=\"post-75224 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini tradable bottom in developing 2 to 3 month trading rangeEmini weekend update: February 10, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini tradable bottom in developing 2 to 3 month trading range<br>Emini weekend update: February 10, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-02-10T00:30:49-08:00\">February 10, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Big, but brief reversal</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/02/m-1.png\"><img loading=\"lazy\" src=\"2018-2-10.png\" alt=\"Emini monthly chart forming bull flag after buy climax\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart this month traded below last month’s low. This is the 1st pullback in 16 months. The bar is currently a big bear bar, but there are 3 weeks left to the month. Hence, it could look different on February 28.<p>Prior to this week, the monthly S&amp;P500 Emini futures candlestick chart had been in a 16 month bull micro channel. This means that every month had a low above the low of the previous month. This has never happened in the 122 year history of the Dow Jones Industrial Average or the 96 year history of the S&amp;P index. It was unsustainable and therefore climactic.<p>Yet, it is a sign of a very strong bull trend. The bulls have been so aggressive and confident that they were buying above the low of the prior month for more than a year. Once they believe that the bears will be unable to reverse the trend, they will become eager to finally be able to buy this pullback. The 1st reversal down in a bull micro channel usually lasts 1 – 3 bars (here, months). Then, the bull trend resumes. However, when a micro channel lasts more than 10 bars, it is extreme. There is an increased risk that the pullback could be deep and last longer than expected. For example, it might retrace more than 50% of the height of the micro channel and last 5 or more bars (months).<h4>Buy The Close Bull Trend</h4><p>In addition to the rally being a 16 month bull micro channel, it was reasonable for the bulls to buy the close of every big bull trend bar. This is therefore a Buy The Close Bull Trend. Since January was huge, it was climactic. Buying its close was reasonable only if a trader was willing to use a wide stop and scale in lower. For example, if the selloff lasts 6 months, a Buy The Close bull might buy more above a strong bull bar. There would be an 80% chance of a test back up to the highest close (the January close). This would allow the trader to exit breakeven on his final Buy The Close entry and with a profit on his lower entry.<p>Once there is a rally, the bears will try to form a double top with the January high. They know that the bulls are disappointed by the strength of the selloff. They expect the bulls to take profits at the old high instead of buying high and expecting a breakout. This month’s strong selloff results in a trading range mentality for at least 5 – 10 bars. Therefore, a break to a new all-time high will probably test back down within a few months instead of continuing the bull trend.<h4>Only 20% chance of bear trend without at least a micro double top</h4><p>Traders should know that there is only a 20% chance of a strong bull trend reversing into a bear trend without at least first forming a micro double top. This means that the bears will need at least a test of the old high before they have more than a 20% chance of taking control.<p>I am talking about the monthly chart. They clearly are in control on the daily chart. But since the monthly chart should resume up within 1 – 3 months, the sharp selloff on the daily chart will be brief. I have said many times that the correction would be at least 5% and probably closer to 10%. It hit 10% this week. I also said that it could be 20%, but that the bull trend is so strong that the bulls will buy even a 20% selloff.<h4>The selloff is technical, due to going too far, too fast</h4><p>I always enjoy it when the market confirms that its past behavior predicts its future behavior. Since market movement (price action) is a reflection of rational human behavior, tendencies repeat. It is genetically based, and it is the foundation of technical analysis.<p>I wrote repeatedly in January that the stock market had never been this overbought on the daily, weekly, and monthly charts in its 100 year history. The January 27th title of the section on the monthly chart was,<a href=\"https://www.brookstradingcourse.com/analysis/emini-parabolic-wedge-buy-climax-trumps-mueller-testimony/\" target=\"_blank\" rel=\"noopener\">“Blow-off top.”</a>In that report, I wrote, “In addition, since it is much longer than any prior streak, the odds are that the weekly chart will begin to turn down within the next few weeks.” It began during the following week.<p>The title of my January 20th weekend update was,<a href=\"https://www.brookstradingcourse.com/analysis/emini-forming-blow-off-top-leading-giving-back-2018-gains/\" target=\"_blank\" rel=\"noopener\">“Emini forming blow-off top leading to giving back 2018 gains.”</a>In that report, I said that the Emini would probably pull back 5 – 10%. In addition, I said that it would probably erase all of January’s gains. It did over the past week.<p>In my February 3 report, I had a section called,<a href=\"https://www.brookstradingcourse.com/analysis/trump-rally-beginning-5-correction-fed-fears/\" target=\"_blank\" rel=\"noopener\">“Trump rally beginning 5% correction over Fed fears.”</a>This was based on the big January bull bar on the monthly chart and the consecutive buy climaxes over the prior 4 weeks on the weekly chart. I wrote this based on over 30 years of studying charts for 10 or more hours a day and 10,000 hours of back-testing. I was confident of the math.<p>In that same report, I had a section titled, “Late Momentum buyers so 5% correction could be fast.” I wrote, “Consequently, their panic selling could result in a very big, fast move down. For example, the Emini could fall 150 points in just a few days.” It fell 200 points on last Friday and this Monday, and the 2 week selloff so far has been more than 300 points.<h4>Bear trend or bear trap?</h4><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/02/Crash.png\"><img loading=\"lazy\" src=\"2018-2-10-1.png\" alt=\"Comparison of 1929 and 1987 stock market crashes.\"></a><p class=\"caption\">The monthly chart of the Dow Jones Industrial Average in 1929 shows a selloff that led to a huge bear trend. However, as severe as the 1987 Crash was, it was a bear trap. The market had an endless pullback that led to a bull trend.<p>Compare the DJIA monthly charts of 1929 and 1987 Crashes. They show extremely opposite outcomes. The 1929 Crash formed a double bottom that failed. It was a Spike and Channel bear trend that erased almost 90% of the market’s value. The 1987 Crash formed a micro double bottom that led to a tight bull channel. The bears were trapped into shorts in a selloff that had reversed into a bull trend.<p>The current selloff is small compared to the initial drop in 1929 and in 1987. However, the shape is similar. Will it be a spike that leads to a bear channel, or will it be a bear trap in a bull trend? Since the monthly chart was in a micro channel for 16 months, the odds of a bear trend without at least a lower high or a double top are only 20%. However, it is too early to know the path back up to the high. The Emini could easily fall another 5- 10% before the bull trend resumes. Yet, the odds are high that this selloff will end up as a pullback in a bull trend on the monthly chart.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Sharp selloff to the 20 week EMA</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/02/w-2.png\"><img loading=\"lazy\" src=\"2018-2-10-2.png\" alt=\"&quot;Weekly Emini candlestick chart has strong bear reversal in trading range\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart finally sold off to the 20 week exponential moving average (EMA) after not touching it for 65 weeks. The two big bear bars created a Big Up, Big Down pattern with the January rally. That creates confusion and usually leads to a trading range.<p>The weekly S&amp;P500 Emini futures candlestick chart relieved its extreme buy climax with a strong selloff to the 20 week EMA. Each of the past 65 weeks has a gap between its low and the 20 week EMA. August got to within 2 ticks, but did not touch. This is the longest streak without touching the 20 week EMA in the 100 year history of the stock market.<p>The consecutive buy climaxes over the past 4 weeks made a correction likely last week. A reasonable minimum goal is TBTL (ten bars, two legs). Hence, traders should expect a trading range lasting 2 – 3 months. This is especially true after the unusually big and fast 2 week selloff.<p>While the selloff is just a bull flag on the monthly chart, it will probably form a trading range on the weekly chart. A bull flag on the monthly chart means that the trading range on the weekly chart will probably have an upside breakout.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Tradable bottom in 1 – 3 month developing trading range</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/02/d-1.png\"><img loading=\"lazy\" src=\"2018-2-10-3.png\" alt=\"Emini daily chart in bear trend after 10% correction\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart had 2 huge legs down in a strong bull trend. The size of Tuesday’s and Friday’s rallies reduce the chances of a protracted and deep bear trend.<p>The daily S&amp;P500 Emini futures candlestick chart fell 10% in two weeks and is Always In Short. This is a bear trend on the daily chart, even though the media generally refers to a 10% selloff as a correction. They reserve the term “bear trend” for a selloff of at least 20%. The selloff will probably lead to be a trading range on the weekly chart and a bull flag on the monthly chart. It ended the longest streak in the history of the stock market without either a 3% or a 5% correction.<p>There have been two huge legs down, and each had no immediate follow-through selling. These are consecutive sell climaxes. Consecutive sell climaxes typically evolve into a trading range. Once in a trading range, the bulls will create a major trend reversal. Alternatively, there will be a third brief leg down, which would create a wedge bottom.<p>The Tuesday and Friday bull reversals were extremely strong. In addition, the monthly chart is very bullish. Consequently, there is a 50% chance that Friday will remain the low.<p>Finally, there is currently a 30% chance that the bull trend will resume next week without first entering a trading range. If so, the reversal up will probably be an Endless Pullback from the 2 week selloff. That means it would be a tight bull channel that looks like a bear flag. Yet, every bear breakout fails within a day or two bars (days). The pullback keeps growing higher. After about 20 bars, there is a 50% chance of a bull break and a measured move up. That would probably result in a new all time high.<h4>Emini tradable bottom in developing 2 to 3 month trading range</h4><p>Tuesday’s and Friday’s reversals were very strong after big sell climaxes. The monthly chart is in a bull trend. A trading range is likely for 1 – 2 months. Since the odds are against the bull trend resuming and against much lower prices, that leaves traders with a trading range. Friday was a High 2 buy signal (Tuesday was the High 1). It is a reasonable candidate for the end of the 1st leg down.<p>A trading range has legs up and down. The odds are that next week will be sideways to up and begin a bull leg in the trading range. The 1st target is Wednesday’s high and a 50% retracement, which is about 100 points up. The bears will try for a double top.<p>The rally will probably go above Wednesday’s high. Yet, this is a trading range. That means that the rally will lead to another leg down. It is too early to know how many legs up and down will form. At a minimum, there will probably be both a double top and a double bottom within a month. That is what typically happens after a strong selloff. Confusion. Which means a trading range with both some kind of double bottom and double top.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noopener\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-2-10"
    }
  ],
  "17": [
    {
      "data": [
        "<article class=\"post-75736 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini sell climax ended at 10% correctionEmini weekend update: February 17, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini sell climax ended at 10% correction<br>Emini weekend update: February 17, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-02-17T00:30:39-08:00\">February 17, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>1st pullback after 16 bar bull micro channel</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/02/m-2.png\"><img loading=\"lazy\" src=\"2018-2-17.png\" alt=\"Emini monthly chart has pullback in bull trend\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart had its 1st pullback in 16 bars. The bulls bought below January’s low. The month so far has a big tail below, which indicates strong buying.<p>The monthly S&amp;P500 Emini futures candlestick chart finally had a pullback after a 16 bar bull micro channel. This means that every low was above the low of the prior month. The bulls were so aggressive that they were not waiting for pullbacks to buy. They were buying at the market. The odds were high that they would be happy to finally get a chance to buy below the prior month’s low. The got their chance over the past 2 weeks.<p>I have been writing for several months that the 1st pullback would probably last 1 – 3 months. That is still true. Hence, the Emini could go sideways for a few months before making a new all-time high.<p>It is important to realize that the odds of a bear trend at this point are only 20%. The bears usually need at least a micro double top. This means that they need at least a test of the all-time high before they will have more than a 20% chance of a bear trend.<p>Even if they get a micro double top, the odds might then only be 30%. Traders will continue to look to buy until there is a strong reversal down on the monthly chart. That means that the downside risk over the next several months is small.<h4>Outside up month?</h4><p>February reversed up strongly from below January’s low. In addition, the bull trend on the monthly chart is exceptionally strong. While the January high is still far above the current price, there are two weeks left in the month. There is a 30% chance that the strong trend resumption will continue for the remainder of the month to above January’s high. February would then be an outside up month in a strong bull trend. This would simply be another sign of how strong the trend is.<p>Yet, an outside month is often followed by an inside month. Consequently, in early March, traders might sell just below February’s high. While this would be a pause in the bull trend, it would not be particularly significant. The bull trend on the monthly chart is strong.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>20 Gap Bar Buy Setup in strong bull trend</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/02/w-3.png\"><img loading=\"lazy\" src=\"2018-2-17-1.png\" alt=\"Emini weekly chart has 20 Gap Bar Buy Setup\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart was above its 20 week exponential moving average (EMA) for 65 weeks. Its sold off strongly to the average last week and the bulls bought aggressively this week. This week is a bull inside bar and therefore a buy signal bar for next week.<p>The weekly S&amp;P500 Emini futures candlestick chart had not touched its 20 week EMA in 65 weeks. The bulls were so aggressive that they kept buying above the average price for over a year. This was an extreme buy climax, and it led to an extreme reversal. Yet, the bull trend is still intact. The bulls strongly bought the selloff this week.<p>Because the 2 week selloff was strong, there might be a 2nd leg sideways to down over the next few weeks. Yet, this week’s reversal up erased much of the damage cause by the selloff. Therefore, the best the bears can probably get is a 1 – 3 month trading range. The odds are that last week’s low will be the bottom. If the bears break below, the bear breakout will probably fail. This would then create a 2 legged pullback in a strong bull trend. Traders would look to buy a reversal up, which would be a High 2 bull flag.<h4>Buy signal on the weekly chart</h4><p>Whenever a market stays above its average price for 20 or more weeks, there is a gap between the low of every bar and the moving average. Since the bulls are able to put all of those bars above the average price, the bull trend is strong. Traders therefore are eager to buy a pullback to the average price.<p>A test of the average is a 20 Gap Bar buy setup. This week closed on its high and was a big bull inside bar. In addition, it reversed up strongly from below the 20 week EMA. The buy setup is strong and this week is a strong buy signal bar. The odds are that next week will trade above this week’s high. That would trigger the buy signal.<p>There are several reasonable outcomes. The bulls might be so strong that the rally will race up to a new all-time high. February could even become an outside up month. Alternatively, the buy signal does not trigger and the week becomes a 2nd consecutive inside week. Even worse for the bulls is the small chance that the Emini simply collapses below this week’s low.<p>The most likely outcome is that next week triggers the buy, but next week is a disappointing entry bar. For example, it could have a big tail on top, or a small bull body, or even a bear body. Since the 2 week selloff was extreme, the Emini will probably go sideways around the middle of the selloff. Therefore a trading range for a week or two is likely.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Emini sell climax ended at 10% correction</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/02/d-2.png\"><img loading=\"lazy\" src=\"2018-2-17-2.png\" alt=\"daily emini candle stick chart has strong reversal up after 10% correction\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart had 2 huge sell climaxes and 2 very strong reversals up. This week rallied strongly up to above last week’s lower high.<p>The daily S&amp;P500 Emini futures candlestick chart had a 2 week sell climax and a 10% correction. The 2 reversals up were exceptionally strong. The odds are that the bull trend is resuming. Yet, it is now in a resistance area. Last week’s lower high and the 20 day EMA are resistance.<p>January’s midpoint around 2780 is also resistance. January was a strong bull trend, and therefore it was reasonable for traders to buy. However, it was not prudent, given how I said that<a href=\"https://www.brookstradingcourse.com/analysis/emini-forming-blow-off-top-leading-giving-back-2018-gains/\" target=\"_blank\" rel=\"noopener\">a 5 – 10% correction was likely to begin within a few weeks.</a>When there is a reasonable buy, traders are usually able to avoid a loss. Experienced traders often scale in during a selloff and can make a profit on a pullback back up. The average trader simply buys and holds.<p>Once he sees a huge selloff, he decides that he probably bought too high. He is therefore hopeful for a rally that will allow him to exit without a loss. Since the average trader who bought in January theoretically bought at the average price in January, that trader will look to sell part or all of his position on a rally to that price. The rally will have made him whole, and he will be relieved to step aside and wait to see what the market does next.<h4>Big Up, Big Down, Big Up creates Big Confusion</h4><p>The January rally was strong, as were the February collapse and this week’s reversal back up. Multiple big reversals indicate that traders are unwilling to hold positions for an extended time. This therefore is a sign of a developing trading range.<p>While the reversal up is probably the end of the bear trend, that does not mean that it is the start of a bull trend. What about a trading range? The odds are that the correction is over and that the bull trend will see a new high within 1 – 3 months. However, the big reversals increase the odds or more sideways trading 1st. The Emini is now in an area that the bears thought was a great price to sell aggressively. They might sell again in the 2750 area.<p>Yet, the reversal up from 2 legs down make it likely that the Emini will work its way up to a new high. If the bears do get a strong selloff within the next month, they will likely be overwhelmed by buyers around or above last week’s low. Therefore, the best the bears will probably get on the daily chart is a 2 – 3 month trading range. If they succeed, the odds are that the bulls will create a major trend reversal that will then lead to a new high.<h4>Double top bear flag</h4><p>The bears want a double top with last week’s lower high at around 2726. They then want a break below last week’s low, which is the neck line of the double top. In general, the bears would have a 40% chance of a measured move down when they have a double top bear flag in a bear trend. Here, the probability on the daily chart is 30% (and only 20% on the monthly chart). This is because the reversal up was so strong and the weekly and monthly charts are in strong bull trends. Consequently, if the bears get a strong selloff next week, it will more likely be a buying opportunity.<p>The rally this week was strong enough so that at least one more leg up is likely after the 1st reversal down. However, if there is a strong selloff in the next couple of weeks, and then a rally above this week’s high, the bears would try to create a wedge lower high major trend reversal. As with all major trend reversals, there would then be a 40% chance of a swing down to below the February low. Moreover, the selloff could easily continue down to 20%. There are several conditions in this paragraph. That means the probability of all of them is happening is small. Yet, it goes up after each one materializes.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noopener\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-2-17"
    }
  ],
  "24": [
    {
      "data": [
        "<article class=\"post-75909 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini has ii Breakout Mode pattern on weekly chart after FOMCEmini weekend update: February 24, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini has ii Breakout Mode pattern on weekly chart after FOMC<br>Emini weekend update: February 24, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-02-24T00:30:35-08:00\">February 24, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>February is huge bear doji candle stick</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/02/m-3.png\"><img loading=\"lazy\" src=\"2018-2-24.png\" alt=\"Emini monthly chart has 1st pullback in 15 bar bull micro channel\"></a><p class=\"caption\">February on the monthly S&amp;P500 Emini futures candlestick chart is an huge bear doji in a strong bull trend.<p>The monthly S&amp;P500 Emini futures candlestick chart traded from just below January’s high to far below its low. It then reversed up strongly, but is currently still below the open of the month. February is therefore a big bear doji month. The Emini is currently trading in the top half of February’s range. There are still 3 trading days left, and the candle stick pattern could be very different once the bar closes at the end of the month on Wednesday.<p>Since February is a huge bar and the Emini is in the middle with only 3 days left, the odds are against the month closing above January’s high or on its low on Wednesday. More likely, it will close somewhere in the upper half. The exact middle is 2702.25. This is very close to the 2700 Big Round Number, which is also a magnet. However, both are about 50 points below Friday’s close and Friday broke above a 3 day bull flag. The momentum favors higher prices next week.<p>Another magnet is January’s low of 2681.75, but that target is probably too far below Friday’s close. January’s low is important because every low for the past 14 months has been above the low of the prior month. January’s low is the 1st to be violated. February is therefore a break below the 15 month bull micro channel. The bears want a close below the breakout point, which is January’s low. Traders would see this as a sign of strength on the part of the bears. The bulls always want the opposite. They want the bear breakout to fail and for the bull trend to resume quickly. They are currently winning.<h4>15 bar bull micro channel represents relentless buying by strong bulls</h4><p>Most traders will not attach to much meaning to a close a little or above last month’s low. Other factors are more important. The single most important is that a 15 bar bull micro channel means that the bulls have been aggressively buying for over a year. As strong as the February selloff was, the rally back up represents very confident bulls. They bought a collapse on the daily chart.<p>This is because they understand the math. There is only a 20% chance of a strong bull trend reversing into a bear trend without first forming at least a micro double top. Consequently, the probability is that the bulls who took the opportunity to buy the brief discount will make money.<h4>15 bar bull micro channel is also a buy climax</h4><p>The monthly charts of the S&amp;P and Dow have never had a 15 bar bull micro channel in their 100 year histories. The micro channel was therefore unsustainable and climactic. A buy climax does not typically reverse into a bear trend. It usually leads to a pullback. This is a bull flag, which means a pause in the trend. The odds are that the bull trend will soon begin again.<p>When a micro channel lasts more than 5 – 10 bars, the odds are that the 1st pullback will last only 1 – 3 bars. Then, the rally usually resumes and tests the old high. This is what is likely here. That means that the monthly chart will probably go sideways for 1 – 3 months and then test the old high. At that point, if the bears get another reversal down, there would be a micro double top. If that 2nd reversal is strong, the bears could have up to a 50% chance of a 5 – 10 bar (month) two legged sideways to down pullback. At the moment, this is unlikely.<h4>Inside bars often follow huge bars, creating Hig 1 bull flag</h4><p>February traded from near January’s high to far below January’s low. It then reversed up strongly to near the open of the month. If it closes in its middle 3rd, there is a 50% chance that March will not go above February’s high or below its low. March would then be an inside month. It would then be a High 1 buy signal bar. This means it is the 1st pullback in the current leg up in a bull trend. Bulls will buy above its high.<p>If March is an inside bar closing on its high, it would be a reasonable buy signal bar. In addition, there probably would be buyers below March’s low.<p>If it closes on its low, it would be a sell signal bar. There would probably be sellers above its high. However, since the bull trend is so strong, the downside is small without the monthly chart first going sideways for at least several months.<p>The huge down move in February generated a lot of confusion. Confusion creates uncertainty. When traders are uncertain, they tend to buy low, sell high, and take quick profits. The result is that a breakout above or below March might not go far.<h4>Outside up month?</h4><p>There are 3 days left to the month. January’s high is 130 points above Friday’s close. Since the reversal up has been strong, there is a 20% chance that February might trade back above January’s high. It would then be an outside up month. At a minimum, the bulls would like the month to close above its open so that it would have a bull body. That is still 80 points above Friday’s close and it is probably too far to reach in 3 days.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Emini has ii Breakout Mode pattern on weekly chart after FOMC</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/02/w-4.png\"><img loading=\"lazy\" src=\"2018-2-24-1.png\" alt=\"weekly emini chart has 20 gap bar buy setup and ii buy signal\"></a><p class=\"caption\">This week on the weekly S&amp;P500 Emini futures candlestick chart has a high below last week’s high and a low above last week’s low. It is therefore an inside bar. Furthermore, last week was also an inside bar. Consecutive inside bars is an ii Breakout Mode setup.<p>The weekly S&amp;P500 Emini futures candlestick chart has an ii Breakout Mode setup. The bar two weeks ago closed on its high and had a big bull body. It was a buy signal bar for the 1st pullback to the 20 week EMA in over a year. It is therefore a 20 Gap Bar buy setup. The bulls failed to trigger the buy this week.<p>This week was another inside bar closing on it high. This is a buy signal for next week. The odds are that Monday will trade above this week’s high and trigger the buy signal.<p>Since the ii is a Breakout Mode pattern, it is also a sell setup. However the 2 bull bodies closing on their highs and the strong bull trend make a big bear breakout unlikely.<h4>Two or more big reversals make a trading range likely</h4><p>Finally, the Big Up in January and the Big Down in February create Big Confusion. That usually leads to a trading range. A trading range is more of a limit order market. Rather than buying on a stop above the high of the previous bar, there might be many traders looking to sell above with limit orders and scale in higher. In addition, there are certainly more traders looking to buy below this week’s low than there are traders looking to sell with a stop below the low.<p>Any pause in a strong bull trend is a bull flag. Therefore, the odds favor a bull breakout above the ii pattern. Yet, the Big Up, Big Down pattern is important. Consequently, there is a 50% chance that a rally above the ii will not break strongly above the January all-time high without first going sideways for a few weeks.<p>However, the odds favor at least slightly higher prices next week. Furthermore, March and April are the most bullish consecutive months of the year. Therefore, there is a seasonal upside bias.<h4>Will there be a strong breakout up or down within a few weeks?</h4><p>The bull trend is strong. Therefore, a downside breakout below the ii pattern would probably not get far. Since the odds are against a big move up above the old high or a big move down, then a trading range is likely. If the bears get a strong reversal down from above the ii, then the trading range could last at least a month.<p>However, this is not likely. More likely, the weekly chart will trade up for at least a week. The rally might get back to the old high within a few weeks. But, it will probably stall there for at least a few weeks because the February selloff was so strong.<p>What happens if instead there is a strong bull breakout? The odds are that traders will sell around the January high. What if there is a strong bear breakout? Most trading range breakouts fail, no matter how strong they are. Consequently, the odds of a sustained breakout up or down within the next few weeks are small.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Bull flag is more likely than bear trend resumption</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/02/d-3.png\"><img loading=\"lazy\" src=\"2018-2-24-2.png\" alt=\"daily emini has strong double bottom reversal, but possible wedge lower high major trend reversal.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart reversed up sharply after 2 strong legs down. Friday was a breakout about a week long High 2 bull flag.<p>The daily S&amp;P500 Emini futures candlestick chart had a big bull trend day on Friday. It was therefore a breakout above a 3 day ioi pattern after a 6 day bull trend. The bulls need follow-through buying next week to confirm that the 5 day tight trading range is ending and the bull trend is resuming.<p>The bears failed to create a double top bear flag with the February 7 lower high. Since the odds favor a rally next week to above last week’s high, the bears will try to make the breakout fail. If they are successful, they will have a wedge lower high major trend reversal sell setup. However, the rally has been so strong that the bears would have only a 30% chance of a selloff down to the February low from that setup. More likely, if they get a selloff, it will lead to a continuation of the February trading range and not a bear trend.<h4>Bull flag, but within a trading range</h4><p>This week was a bull flag. A bull flag means that the odds favor a bull breakout. However, the huge reversal down in February makes a trading range over the next month more likely that an uninterrupted rally far above the old high.<p>A bull breakout above the week-long bull flag will be the third rally since the February 6 low. If the bears can reverse the Emini down after a brief leg up over the next 2 weeks, they will have a wedge lower high major trend reversal. More likely, the rally will have at least a couple more small legs up.<p>A major trend reversal only has a 40% chance of actually leading to an opposite trend. Therefore a reversal down from the wedge rally will probably have a couple legs, last a couple of weeks, and form a higher low. It would be a bear leg in a developing trading range.<h4>Signs of a trend</h4><p>Beginning traders tend to look at only the most recent leg. The bars to the left of the current leg are also important. As strong as the reversal up over the past 2 weeks has been, it is still a bull leg in a trading range. As long as any selloff reverses up from around the February low or reverses down from around the January high, the trading range is still intact. Traders need to see a series of strong trend bars up or down before they believe a trend is underway. Furthermore, they need a strong breakout up or down with good follow-through. This will eventually happen.<p>However, after a huge Up/Down move, the odds favor a sideways market for at least another month. Traders will probably buy around the February low and sell around the January high. They are not confident that a breakout will be successful, and therefore most will buy low, sell high, and take quick profits.<p>This is what typically happens when there are sharp reversals down and up. After 20 or more bars of not seeing a huge move against what they think is the correct direction, they will begin to swing trade again. Traders need more time, and therefore the trading range that began in early February might last at least a few more weeks.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-2-24"
    }
  ]
}