{
  "5": [
    {
      "data": [
        "<article class=\"post-79081 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini 60 minute head and shoulders bottom despite China trade war Intraday market update: July 5, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini 60 minute head and shoulders bottom despite China trade war<br>Intraday market update: July 5, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-07-05T06:20:28-07:00\">July 5, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini 60 minute head and shoulders bottom despite China trade war</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini has been sideways for 2 weeks. But, it is forming another higher low. On the 60 minute chart, Monday was a higher low major trend reversal after Thursday’s lower low major trend reversal. Therefore, this is a 2 week long head and shoulders bottom in an oversold market.<p>Tuesday was a short day and an inside day. It is therefore both a buy and sell signal bar for today. Since its range was small, there is an increased chance that today will trade above its high and below its low. Either breakout can come 1st. This would create an outside day. Therefore, traders will look to sell a reversal down from above Tuesday’s high and buy a reversal up from below its low. But, since the week of the 4th of July is typically the 2nd quietest of the year, there is a smaller chance of a big trend day today.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 21 points in the Globex session. It will therefore probably gap above Tuesday’s high, which would trigger a minor buy signal.<p>When there is a big gap, there is an increased chance of a trend day. The trend is more likely to be in the direction of the gap (here, up). However, a big gap up means that the 5 minute chart will be far above its 20 bar EMA. Most traders do not want to buy far above the average price. Consequently, the odds are that any rally on the open will likely stall within an hour or so. If so, the bulls will want the market to go sideways to down until it gets closer to the average price. Then, they will look to buy a reversal up.<p>If the bears can create 2 – 3 big bear bars on the open, day traders will look for a Trend From The Open bear trend day. They have a 20% chance of getting this. Since big gaps up usually lead to a trading range for the 1st hour or so, the bears will look for some type of a double top for an early high of the day.<p>Because most big gap up days usually become either bull trend days or trading range days, that is what is most likely today.<h2>Yesterday’s setups</h2><p class=\"caption\">I did not trade earlier this week, so no setups chart posted.<h2>EURUSD Forex market reversing up from Triangle Bottom to test sell climax high</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/EURUSD-Forex-market-reversing-up-from-Triangle-Bottom-to-test-sell-climax-high.png\"><img src=\"2018-7-5.png\" alt=\"EURUSD Forex market reversing up from Triangle Bottom to test sell climax high\"></a><p class=\"caption\">The EURUSD daily Forex chart is reversing up from a triangle bottom. This bottom is also a double bottom with the November 7 major higher low. The odds are that the rally will continue at least up to the June 14 sell climax high.<p><br>The EURUSD daily Forex chart sold of in a series of sell climaxes in May. But, the selling stopped at the November 7 low, which is major support. After several attempts to break below, the bears are giving up. The odds are that the 3 week rally will continue up to the June 14 sell climax high at around 1.1850.<p>That is also the neck line of the May 29 and June 21 double bottom. The bulls then want a 300 pip measured move up to above the March 1 low. That is the breakout point of the May sell climax.<p>There is currently a 30% chance of this happening. However, the bulls have a 60% chance of getting to the June 14 high before the bears get a breakout below the May 29 low.<p>A triangle is a trading range, and my 80% rule says that trading ranges resist breaking out. Consequently, the rally will probably stall above 1.1800 for at least a week or two. The market will then decide between breaking to the upside to test the May 14 high at around 1.20, and reversing down to below the triangle. At the moment, it is slightly more likely that the daily chart will test 1.2000 within a couple months.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart rallied 70 pips overnight. It is now testing the June 26 high of 1.1721. While the rally might stall here fore a few days, there is a 60% chance that the bull channel on the 60 minute chart will continue up to the June 14 high of 1.1851. Therefore, day traders will buy pullbacks for swing trades and scalps. When the 5 minute chart enters trading ranges, the bears will sell reversals down for 10 pip scalps.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/Emini-bull-trend-reversal.jpg\"><img loading=\"lazy\" src=\"2018-7-5-1.jpg\" alt=\"Emini bull trend reversal\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>The Emini gapped up and sold off to just above yesterday’s low. It then, however, reversed up to above yesterday’s high, and closed at the high.<p>After a month of lower highs on the 60 minute chart, the bulls finally got above the most recent 60 minute lower high. But, that high was relatively minor. Since the momentum up is good, the odds favor a rally to above the June 27 major lower high within a few days.<p>Tomorrow is Friday and therefore weekly support and resistance can be important at the end of the day. The most important weekly price is the high of the week. The bulls want the week to close on its high. It would therefore be a buy signal bar on the weekly chart for next week.<p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-7-5"
    }
  ],
  "6": [
    {
      "data": [
        "<article class=\"post-79690 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini small summer rally likely despite China trade warEmini weekend update: July 7, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini small summer rally likely despite China trade war<br>Emini weekend update: July 7, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-07-06T11:00:47-07:00\">July 6, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Weak rally after buy climax</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/Emini-monthly-chart-6-month-bull-flag.png\"><img loading=\"lazy\" src=\"2018-7-6.png\" alt=\"Emini monthly chart 6 month bull flag\"></a><p class=\"caption\">July so far on the monthly S&amp;P500 Emini futures candlestick chart is a small bull bar. The 3 month rally has been weak and more sideways trading is likely.<p>The monthly S&amp;P500 Emini futures candlestick chart has been sideways for 6 months. This follows the most extreme buy climax in the 100 year history of the stock market.<p>Since last month closed near its low, it is a sell signal bar for this month. However, it is a doji in a 6 month tight range. Therefore, there are probably more buyers than sellers below last month’s low. Furthermore, the 4 month rally has been weak. Consequently, the monthly chart is likely to go sideways for at least another month.<p>Because last year’s bull trend was so strong, the odds favor a test of last year’s high. But, buy climaxes usually have at least 2 legs sideways to down. Therefore, June might be a pullback (bounce) from the 1st leg down. There is currently a 40% chance of a 2nd leg down that falls below the 20 month EMA before there is a new high.<br><h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Bull channel in 6 month trading range</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/Emini-weekly-candlestick-chart-has-bull-trend-bar-in-tight-trading-range.png\"><img loading=\"lazy\" src=\"2018-7-6-1.png\" alt=\"Emini weekly candlestick chart has bull trend bar in tight trading range\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart had a bull trend bar this week in a 14 week tight bull channel. It is therefore a buy signal bar for next week. However, as long as this rally stays below the March high, it is only a bull leg in a 6 month trading range.<p>The weekly S&amp;P500 Emini futures candlestick chart turned down a month ago from a double top lower high with the March high. The 3 month rally was also a wedge. However, this week rallied after a 3 week selloff. In addition, it was a bull trend bar and therefore a buy signal bar for next week.<p>But, the 3 week selloff followed a 3 month rally that had 3 legs up. That rally is therefore a wedge top. A reversal down from a wedge usually has at least 2 legs. So, even if next week goes above this week’s high, the rally might only last a week or two. The bears will try for a 2nd leg sideways to down.<p>There is currently a 40% chance of a test of the February low before a break above the March high. In addition, there is a 30% chance of a strong break below the February low. That would be a 2nd leg down after the strong 1st leg down in February.<h4>Trading ranges always look like they are about to break out</h4><p>The past 8 weeks have been in a tight range, and trading ranges resist breaking out. Furthermore, this tight range is in the middle of the 6 month trading range. Therefore, the odds are that the Emini will continue mostly sideways for at least another week or two, even if next week continues this week’s rally.<p>When a market is in a trading range, each leg up and down always looks like the start of a trend. However, 80% of them fail and lead to opposite legs. Until there is a breakout, there is no breakout. The odds continue to favor reversals every few weeks.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Turning up from higher low</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/Emini-daily-candlestick-chart-rallying-from-higher-low-in-6-month-trading-range.png\"><img loading=\"lazy\" src=\"2018-7-6-2.png\" alt=\"Emini daily candlestick chart rallying from higher low in 6 month trading range\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart sold off for the past month after a wedge rally. The odds favor higher prices next week. But, a wedge top usually has a 2nd leg down.<p>The daily S&amp;P500 Emini futures candlestick chart reversed up this week. Since it formed a higher low compared to the May 29 low, it is still in the bull trend that began with May 3 low.<p>However, the month-long bear channel was tight. In addition, a wedge top usually has a 2nd leg down. Therefore, the odds are that any rally will stall within a couple of weeks.<p>The bears want a lower high major trend reversal after the 3 month bull trend. That lower high would be after a wedge top. Hence, it would also form a right shoulder of a head and shoulders top.<p>Most tops lead to trading ranges and not opposite trends. So, a selloff from a lower high would probably be just a 2nd leg down from the May high. The 6 month trading range would then likely continue. Until there is a strong breakout up or down, traders will continue to take profits after a few days and up to a few weeks.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-7-6"
    },
    {
      "data": [
        "<article class=\"post-79686 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini 60 minute head and shoulders bottom for minor summer rally Intraday market update: July 6, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini 60 minute head and shoulders bottom for minor summer rally<br>Intraday market update: July 6, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-07-06T06:20:57-07:00\">July 6, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini 60 minute head and shoulders bottom for minor summer rally</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini reversed up yesterday on the 5 minute chart. Today was the 1st breakout above a lower high on the 60 minute chart in a month. It has been forming higher lows over the past week. This is a sign that the bear trend is losing momentum.<p>If the rally goes above the June 27 major lower high, the bear trend on the 60 minute chart will have evolved into either a trading range or a bull swing. The odds are that this will happen today or tomorrow.<p>Today is Friday so weekly support and resistance can be important, especially late in the day. The most important price is the high of the week. If the week closes near its high, this week will be a decent buy signal bar for next week on the weekly chart.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 2 points in the Globex market. But, it is within 10 points of the top of a month-long trading range. It is therefore at resistance and there is an increased chance of a smaller trading range here for a few days. If so, the 5 minute chart will also begin to have more trading range trading.<p>Whenever the Emini is testing resistance, there is always an increased chance of a big trend day up or down. However, it more likely will get confused and balanced for at least a couple of days 1st.<p>Yesterday’s 2nd rally had many small, overlapping bars with prominent tails. The rally therefore looks more like a bull leg in a trading range than a bull trend. Consequently, the odds are that today will begin to enter a trading range within the 1st 2 hours.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/Emini-bull-trend-reversal.jpg\"><img src=\"2018-7-6.jpg\" alt=\"Emini bull trend reversal\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/EURUSD-Forex-double-bottom-ahead-of-China-trade-war-2.png\"><img loading=\"lazy\" src=\"2018-7-6-1.png\" alt=\"EURUSD Forex double bottom ahead of China trade war\"></a><p class=\"caption\">The EURUSD weekly Forex chart is turning up from a double bottom with the November 7 low. It has rallied for 3 weeks from a micro double bottom with the June 9 low. But, it has been in a tight trading range just below the 20 week EMA. This is therefore still a bear flag.<p><br>The EURUSD weekly Forex chart has rallied for 3 weeks from a double bottom and a micro double bottom. The odds are that the rally will continue to the resistance of the 20 week EMA and the June 26 high.<p>That high is the neck line of the double bottom. The bulls want a strong breakout above and then a 300 pip measured move up. However, the bears will try to form a double top bear flag with the June 26 high. They then want a break below the June 21 low and at least a 300 pip measured move down.<p>Since there are now 3 consecutive bull bars, the odds are that the weekly chart will continue up for at least another week or two. It should test resistance above. The bears need a bear bar for a sell signal bar. If they get is, they will have a credible Low 2 (micro double top) bear flag at the EMA.<p>If there are 3 – 5 bull bars before there is a bear bar, the bears will probably need at least a micro double top in addition to the double top before they can get a swing down. The odds favor another 100 pips up to test the resistance above.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart has rallied 60 pips overnight. June 14 was a big sell climax day on the daily chart. Its high is therefore a strong magnet above. The 3 week rally will probably continue at least up to that high over the next week or so. Therefore, the bulls will continue to buy selloffs for 30 – 50 pip legs up.<p>When there are trading ranges on the 5 minute chart, the bears will sell for scalps. Until there is a credible top, the bears will only scalp.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/Emini-breakout-above-head-and-shoulders-bottom-and-small-pullback-bull-trend.jpg\"><img loading=\"lazy\" src=\"2018-7-6-2.jpg\" alt=\"Emini breakout above head and shoulders bottom and small pullback bull trend\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>The Emini had a Small Pullback Bull Trend day today. Since it broke strongly above the 2 week trading range, it triggered the 60 minute head and shoulders bottom buy signal. There will likely be at least some follow-through buying early next week. However, if the bears can prevent a move above the May high, they will create a head and shoulders top on the daily chart.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-7-6- 1"
    }
  ],
  "9": [
    {
      "data": [
        "<article class=\"post-79688 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini brief July rally from head and shoulders bottom Intraday market update: July 9, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini brief July rally from head and shoulders bottom<br>Intraday market update: July 9, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-07-09T06:20:47-07:00\">July 9, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini brief July rally from head and shoulders bottom</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini broke above the neck line of a head and shoulders bottom on the 60 minute chart. Since the breakout went far above, the odds are that there will be at least a small 2nd leg up today or tomorrow. Therefore, traders will look to buy the 1st pullback to around the 2750 neck line this week.<p>Because Friday’s rally was extreme, the bulls are exhausted. Today therefore might have more trading range trading. However, the odds favor at least some follow-through buying today or tomorrow.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 10 points in the Globex session. But, it has been in a tight trading range for 10 hours. That might therefore continue on the open.<p>Today will probably open with a big gap up. The Emini will therefore be far above the average price. Consequently, many bulls will wait for it to get closer to the EMA before buying. This increases the odds of an hour or so of sideways trading on the open.<p>A big gap up has an increased chance of leading to a trend day. If there is a trend, a bull trend is slightly more likely.<p>As strong as Friday was, the Emini is getting close to the top of its 6 month range. Therefore, day traders will look for either a wedge top or a major trend reversal for a swing trade down. With Friday’s 4 hour tight trading range and the overnight 10 hour tight trading range, today will probably spend a lot of time going sideways.<h2>Friday’s setups</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/Emini-breakout-above-head-and-shoulders-bottom-and-small-pullback-bull-trend.jpg\"><img src=\"2018-7-9.jpg\" alt=\"Emini breakout above head and shoulders bottom and small pullback bull trend\"></a><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex strong bear rally</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/EURUSD-Forex-strong-bear-rally.png\"><img loading=\"lazy\" src=\"2018-7-9-1.png\" alt=\"EURUSD Forex strong bear rally\"></a><p class=\"caption\">Today is the 5th consecutive bull trend day on the EURUSD daily Forex chart. This rally will probably not break strongly above June 14 high. It is therefore likely just a strong rally in a 2 month trading range.<p><br>The EURUSD is getting drawn up to the June 14 sell climax high. It will probably break a little above that resistance before traders will sell. The bulls will take profits and the bears will short. Both will correctly bet that this strong rally is a bull leg in a trading range.<p>If there is a strong breakout above, the next targets are the May 14 lower high and 50% retracement, which is slightly higher. Less likely, the rally will reach the March 1 low. That low is the breakout point below a 4 month trading range.<p>Since the 2 month selloff was extremely strong, there is only a 40% chance that the current rally will continue up to the February high. Even with the double bottom, the rally will find sellers above. At a minimum, if the rally reaches the May 14 high or March 1 low, there will then be at least a 50% pullback over the next couple of months. Therefore, even at their best, the bulls will still only get a bull leg in a trading range. Traders are now simply looking for the top of that range.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart rallied 40 pips in the European session. While the odds are that the rally will continue up another 60 pips to the June 14 high, there will probably be a pullback today or tomorrow. Remember, the daily chart is now near the top of a 2 month trading range. The bears will begin to short and the bulls will start to take profits.<p>Since there is a 70% chance of a test of the June 14 high within a couple of weeks, the bulls will buy 50 – 100 pip pullbacks. In addition, the bears will look for the rally to stall. They then will sell for 30 – 50 pip reversals down.<p>Day trading bears will scalp for 10 pips on reversals down from new highs in the 5 day bull channel. The bulls will look to buy 20 – 30 pip pullbacks for a test back up to the top of the channel.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/Emini-gap-up-and-bull-trend-day-for-test-2800-big-round-number-and-March-high.png\"><img loading=\"lazy\" src=\"2018-7-9-2.png\" alt=\"Emini gap up and bull trend day for test 2800 big round number and March high\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>The Emini had a weak bull trend day. However, it was good follow-through buying after Friday’s big rally. In addition, the magnets of the March lower high and the 2800 Big Round Number are just above. The momentum up is strong enough so that the Emini will likely get closer to the magnets this week.<p>If the Emini breaks strongly above the March high, it will probably continue up to a new high within a month or so. The bears need a strong reversal down this week, but the odds favor the bulls.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-7-9"
    }
  ],
  "10": [
    {
      "data": [
        "<article class=\"post-79849 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini testing 2800 top of 6 month trading range Intraday market update: July 10, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini testing 2800 top of 6 month trading range<br>Intraday market update: July 10, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-07-10T06:20:49-07:00\">July 10, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini testing 2800 top of 6 month trading range</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Yesterday was a small bull day. It therefore was follow-through buying after Friday’s breakout above June’s bear channel. This increases the chance of a test of the June 13 high of 2796.00 and the March 11 major lower high of 2811.00.<p>However, without a strong breakout above that March high, this rally is just another leg in a 6 month trading range. Because the 5 day rally is strong, the bears will need a micro double top before they can create a bear leg. Consequently, the bulls will buy the 1st reversal down.<p>Less likely, today will be a bear day and then tomorrow will gap down. That would create a 2 day island top. But, after 3 strong bull days, the reversal will probably not fall far before the bulls buy again.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 3 points in the Globex session. If today gaps up, the gap will be small. Small gaps usually close in the 1st hour.<p>Yesterday was a gap up, but the daily chart has been in a trading range for 6 months. Therefore, there is an increased chance of today reversing yesterday’s bull trend. If so, then there would a 2 bar reversal on the daily chart. Traders would then look for a gap down tomorrow. That would form a 2 day island top.<p>As strong as the 3 day rally has been, it is still within a 6 month trading range. Trading ranges repeatedly disappoint bulls and bears. A bear trend day would disappoint the bulls. Consequently, there is an increased chance of a bear trend day today.<p>Since the 3 day bull trend is strong, it will likely have to go sideways before it can go down. That makes a trading range day more likely than a bear trend day.<p>The bulls want a 4th consecutive bull trend day. However, the rally is now near the top of the 6 month range. It will likely stall today or tomorrow. This means that the 3 day bull trend will probably enter a trading range day today.<p>All trading ranges eventually end. Most attempts fail. However, if the next few days are bull days and the rally breaks above the March high, this rally could continue to form many bull days and continue up to a new all-time high within a couple months.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/Emini-gap-up-and-bull-trend-day-for-test-2800-big-round-number-and-March-high.png\"><img src=\"2018-7-10.png\" alt=\"Emini gap up and bull trend day for test 2800 big round number and March high\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex pullback in bear rally</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/EURUSD-Forex-pullback-in-bear-rally.png\"><img loading=\"lazy\" src=\"2018-7-10-1.png\" alt=\"EURUSD Forex pullback in bear rally\"></a><p class=\"caption\">After 5 consecutive bull bars on the EURUSD daily Forex chart, today will likely be a bear bar. However, it is only the 2nd bear bar in 8 days. Furthermore, bear rallies usually reach the most recent sell climax high. Therefore, today is probably the start of a 3 – 5 day pullback in the bear rally.<p><br>The EURUSD daily Forex chart is pulling back after 5 consecutive bull trend day. The pullback will probably fall below 1.1700 over the next few days because that is the most recent major higher low on the 4 hour chart.<p>Whether or not it does, the bear rally will probably reach the June 14 high within a few weeks. That is because June 14 was a big sell climax late in a bear trend. Bear rallies usually reach the high of the most recent sell climax. This is especially true after an extreme sell climax at major support. In addition, there was then a reversal up from a double bottom.<p>The bear trend in May was exceptionally strong. It therefore can resume at any time. Breakout of trading ranges usually fall for a measured move. Consequently, the minimum goal for the bears is a 300 pip measured move down below the 2 month Low 2 bear flag. June 14 was the 1st high of the double top.<p>While yesterday might be the resumption of the bear trend, the bears will need 3 or more consecutive bear trend days before they will have a 50% chance of success. It is currently more likely that this selloff will last a few days and form a higher low. Then, the bear rally will continue up to the June 14 high.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart sold off 90 pips from yesterday’s high. It is strong enough to create a Big Up, Big Down pattern with last week’s rally. Therefore, a trading range is likely over the next several days. Traders will probe for a bottom to the range. That bottom will probably be around 1.1700. This is because there are higher lows around there on the 240 minute chart. In addition, it is around a 50% pullback. Finally, the 5 day rally is a small buy climax. When there is a pullback, the bottom of the buy climax is a magnet.<p>Since a trading range is likely for a few days, day traders expect a lot of small legs up and down. They therefore will be scalping for 10 – 20 pips. If there is a strong breakout up or down, they will try for a 30 – 50 pip swing trade. However, a big trend on the 5 minute chart is unlikely for at least a couple days.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/Emini-gap-up-and-bear-reversal-day-and-bull-reversal-day-after-bear-surprise-bar.png\"><img loading=\"lazy\" src=\"2018-7-10-2.png\" alt=\"Emini gap up and bear reversal day and bull reversal day after bear surprise bar.png\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>The March high is only 13 points above today’s high. Hence, the rally might have to get there before there is any selling.<p>Today was the 6th day in a bull micro channel on the daily chart. Therefore, there will probably be buyers below, even if the Emini gaps down tomorrow and forms a 1 day island top. Any pullback will probably last only 1 – 3 days.<p>Since the 60 minute chart has a parabolic wedge rally, the odds favor sideways to down prices for at least a couple of days. This should be begin tomorrow or Thursday. Less likely, the rally will continue up far above the March high before there is a pullback.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-7-10"
    }
  ],
  "11": [
    {
      "data": [
        "<article class=\"post-79851 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini 60 minute parabolic wedge buy climax below March high Intraday market update: July 11, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini 60 minute parabolic wedge buy climax below March high<br>Intraday market update: July 11, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-07-11T06:20:01-07:00\">July 11, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini 60 minute parabolic wedge buy climax below March high</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Yesterday had a small range and was sideways. The 3 day rally is losing momentum now that it is near the top of the 6 month range. This reduces the chance of a big bull trend day today. In addition, there is a parabolic wedge top on the 60 minute chart. The odds favor a 1 – 3 day pullback this week. Since there is a 6 bar bull micro channel, there will probably be buyers not far below yesterday’s low. The selloff might be a test of the neck line of the head and shoulders bottom on the 60 minute chart. That is just below 2750.<p>A gap down today will create a 1 day island top. But, island tops and bottoms are fairly common in trading ranges. They are not major reversal patterns. However, if there is a gap down, there would be an increased chance of a few days down to test the breakout above the 60 minute head and shoulders bottom. Therefore, there would be an increased chance of a bear trend day.<h3>Overnight Emini Globex trading</h3><p><br>The Emini sold off about 30 points overnight, but is currently down only 14 points. After shrinking bull bodies for 3 days on the daily chart, the Emini was likely to pull back today. It will probably gap below yesterday’s low, creating a one day island top.<p>After 4 consecutive bull trend days on the daily chart, the bears will have a hard time getting a strong reversal down. They will probably need at least a micro double top. Therefore, despite the big overnight selloff, today will probably not be a big bear trend day. The pullback will probably be 2 – 3 days of sideways to down trading. But, then the bulls will likely buy again for at least a test of yesterday’s high.<p>Today’s open will be important late in the day. If there is a bear trend today, the bulls will try to create a reversal back up to above the open. They want the bull trend to resume. Therefore, they would like today to be a bull reversal day on the daily chart.<p>The bears hope that the gap down will be the start of a Trend From The Open Bear Trend Day. If they get it, the selloff will probably only be a breakout test of the 2740 neck line of the 2 week head and shoulders bottom. There will be buyers there.<h2>Yesterday’s setups</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/Emini-gap-up-and-bear-reversal-day-and-bull-reversal-day-after-bear-surprise-bar.png\"><img src=\"2018-7-11.png\" alt=\"Emini gap up and bear reversal day and bull reversal day after bear surprise bar.png\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex bull flag in bear rally</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/EURUSD-Forex-bull-flag-in-bear-rally.png\"><img loading=\"lazy\" src=\"2018-7-11-1.png\" alt=\"EURUSD Forex bull flag in bear rally\"></a><p class=\"caption\">The EURUSD daily Forex chart pullback over the past 2 days after 5 bull bars. This is a bull flag in a bear rally. The rally should test the June 14 sell climax high.<p><br>The EURUSD daily Forex chart pulled back over the past 2 days after 5 consecutive bull trend bars. That represents good momentum up. In addition, the June 14 sell climax high of 1.1851 is a strong magnet. Consequently, the rally will likely continue this week and reach the target next week.<p>Once there, the bulls will take at least partial profits. Also, the bears will sell, hoping for a double top with that June 14 high.<p>One more push up from this 2 day bull flag would be the 3rd push up from the June 28 low. That would be a wedge channel after the 3 day spike up that began June 21. Since that would create a Spike and Channel bull trend, and the channel would be a wedge, traders would expect a couple legs sideways to down for a week or two.<p>Therefore, the June 14 high is a good candidate for an initial top to the 2 month trading range. After a pullback from that level, the bulls will try for a breakout above. They then want a test of the May 14 high and 1.2000, which is likely within a couple of months. However, the bears want the bear trend to resume from a double top with the June 14 high.<p>At the moment, it is more likely that the low for the next couple of months is in and that the trading range will last for at least another month. Its top will probably be above the June 14 high.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute chart has been in a 50 pip range overnight. It is forming a double bottom with yesterday’s low. However, the repeated up and down legs mean that the 60 minute chart is in a trading range.<p>There is no sign yet that the 2 day trading range is about to end. But, if today closes near its high, there would be a 2 day micro double bottom on the daily chart. Since a 3rd leg up from the June 28 low is likely, the rally will then probably resume up to 1.1850 at the June 14 high.<p>The bulls will buy pullbacks to today to try to create a credible bull flag on the daily chart. The bears will look for 10 pip scalps. They know that the odds of a swing down are small until after the 4 week rally reaches 1.1850.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/Emini-island-top-and-braod-bear-channel.png\"><img loading=\"lazy\" src=\"2018-7-11-2.png\" alt=\"Emini island top and broad bear channel\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>The Emini gapped down and formed a 1 day island to on the daily chart. It sold off in a broad bear channel, but spent most of the day around the open. Since there is a parabolic wedge top on the 60 minute chart, there will probably be at least a small 2nd leg down this week.<p>Today is the 1st pullback in a 6 day bull micro channel. It is therefore a High 1 bull flag. But, since lower prices are likely because of the wedge top on the 60 minute chart, the daily buy signal is weak. This week’s gap up will probably close tomorrow.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-7-11"
    }
  ],
  "12": [
    {
      "data": [
        "<article class=\"post-79859 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini island top and weekly gap below Intraday market update: July 12, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini island top and weekly gap below<br>Intraday market update: July 12, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-07-12T06:20:54-07:00\">July 12, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini island top and weekly gap below</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Because the Emini gapped down yesterday after Tuesday’s gap up, it formed a one day island top. If it were to gap down again today, it would form a 3 day island top. This is not likely because of the Globex rally. In any event, since the Emini is in 6 month trading range, island reversals are usually minor.<p>Yesterday was the 1st pullback in a 6 bar bull micro channel on the daily chart. It is therefore a High 1 bull flag. But, it has a bear body and there are targets below. This is a weak buy setup.<p>There is a parabolic wedge top on the 60 minute chart and yesterday was the 1st leg down. Therefore, the Emini will probably pull back more for a day or two. It might test the neck line of the head and shoulders bottom on the 60 minute chart within a week. That target is below 2750.<p>This week gapped up on the weekly chart. Since at least slightly lower prices are likely after the wedge top on the 60 minute chart, the weekly gap will probably close within 2 weeks.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 15 points in the Globex session. It might therefore gap up today. However, yesterday was a bear day and a weak High 1 buy signal bar. In addition, if today gaps up, the gap will be small. Small gaps usually close in the 1st hour or two. Finally, the wedge top on the 60 minute chart is likely to have a 2nd leg down from a lower high. Therefore, the odds are against a big bull trend today.<p>Yesterday’s bear trend was weak. While at least a small 2nd leg down is likely on the 60 minute chart, the odds are against a big bear trend today. More likely, yesterday was a Big Down move on the 60 minute chart after a Big Up move. That creates confusion and usually results in a trading range. Therefore, today will probably be another sideways day on the 60 minute chart. This makes a big trend up or down less likely on the 5 minute chart.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/Emini-island-top-and-braod-bear-channel.png\"><img src=\"2018-7-12.png\" alt=\"Emini island top and broad bear channel\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex pullback in bear rally</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/EURUSD-Forex-pullback-in-bear-rally-1.png\"><img loading=\"lazy\" src=\"2018-7-12-1.png\" alt=\"EURUSD Forex pullback in bear rally\"></a><p class=\"caption\">The EURUSD daily Forex chart has sold off for 3 days after a lower high double top with the June 14 high.<p><br>The EURUSD daily Forex chart sold off for 3 days from around the EMA and the June 14 high. But, the selloff so far lacks consecutive big bear bars. In addition, it is around a 50% pullback from the June 9 rally. Finally, the June 14 sell climax high is a strong magnet. Therefore, the selloff will more likely stall and become a higher low in the 2 month trading range.<p>The bulls will buy a micro double bottom between 1.1600 and 1.650 over the next week. They will look for a test of the June 14 high at around 1.1850. The odds are that the bear rally will continue up to the May 14 high and 1.2000 over the next couple of months.<p>The bears will probably need to get to the June 14 sell climax high before they can resume the bear trend. However, if they get 2 closes below the June 21 low, then traders will expect a 300 pip measured down below the 3 month range.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart was in a 20 pip range during the Asia session. The range expanded to 30 pips in Europe. This represents weak follow-through selling after Wednesday’s bear trend.<p>Because the daily chart is now around a 50% retracement of the 4 week rally, bulls are beginning to buy. This is the buy zone. There is therefore an increased chance of a bull trend day today or tomorrow. More likely, yesterday’s selloff created a Big Up, Big Down pattern on the daily chart. That usually results in at least a few sideways days.<p>It is unlikely that the bear trend is resuming on the daily chart. But, if the bears get 2 – 3 consecutive big bear days, the 2 month trading might be ending. Traders will swing sell in the unlikely event of a big bear trend day today.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/Emini-tests-of-2800-Big-Round-Number.png\"><img loading=\"lazy\" src=\"2018-7-12-2.png\" alt=\"Emini tests of 2800 Big Round Number\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>After a brief sharp selloff, the Emini rallied in a bull channel to above the 2800 Big Round Number. It then entered a tight trading range. A more important target is the March 13 high of 2811.00. That is the top of the 6 month trading range. If the bulls can rally 10 – 20 points above it, the rally will likely make a new all-time high.<p>The bears will try to continue the 6 month range. Even if there is a small breakout above the March 13 high, the bears will sell. Therefore, traders are looking for either a reversal down from this level or a strong breakout above. Either will likely continue for at least a month.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-7-12"
    }
  ],
  "13": [
    {
      "data": [
        "<article class=\"post-79853 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini testing key resistance at 2800 Big Round NumberIntraday market update: July 13, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini testing key resistance at 2800 Big Round Number<br>Intraday market update: July 13, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-07-13T06:20:10-07:00\">July 13, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini testing key resistance at 2800 Big Round Number</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini broke above the 2800 Big Round Number for the 1st time since March. However, the March 13 high of 2811.00 is much more important. It is the top of the 6 month trading range. If the bulls can break 10 – 20 points above it, the rally will probably continue up to a new high.<p>The Emini has reversed down from 2800 several times since the January high. It is therefore major resistance. The bears want a micro double top with Tuesday’s high and a double top with the March high. However, they need a good sell signal bar or several consecutive bear bars on the daily chart. Either would represent the bulls giving up. But, the bears have neither. Until they get the reversal, traders will keep buying small pullbacks, hoping for a successful breakout above the March high.<p>Today is Friday and therefore weekly support and resistance are important. The most important prices are the 2800 Big Round Number, the June high, and the March high.<h3>Overnight Emini Globex trading</h3><p><br>The Emini traded up to 2807.75 overnight, but then sold off. That is just 4.25 points below the resistance of the March 13 major lower high. This is a reminder of how important that resistance is. The bears want a double top lower high major trend reversal. Since the February selloff was strong, the bears have a 40% chance of a 2nd leg down over the next couple of months. If they succeed, the selloff will begin with a series of bear trend days.<p>The bulls want the 4 month rally to break strongly above the March high. This would require a series of bull trend days.<p>The past several days have been mostly sideways. Markets tend to continue to do what they have been doing. Therefore, the odds favor another trading range day.<p>However, since the daily chart is now at major resistance, there is an increased chance of a series of trend days up or down. Day traders will look for 2 – 5 consecutive strong trend bars up or down on the 5 minute chart as a sign that a trend is underway. If they get a strong move up or down, there will probably be follow-through for at least a few days.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/Emini-tests-of-2800-Big-Round-Number.png\"><img src=\"2018-7-13.png\" alt=\"Emini tests of 2800 Big Round Number\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex 4 day bear leg in 2 month trading range</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/EURUSD-Forex-pullback-to-middle-of-2-month-trading-range.png\"><img loading=\"lazy\" src=\"2018-7-13-1.png\" alt=\"EURUSD Forex pullback to middle of 2 month trading range\"></a><p class=\"caption\">The EURUSD daily Forex chart is now testing the bottom of the 3 day tight trading range from 2 weeks ago. The selloff lacks consecutive big bear bars. It is therefore more likely a leg in the 2 month range than a resumption of the May bear trend.<p><br>The EURUSD daily Forex chart is turning down from below the June 14 sell climax high. However, after the extreme parabolic wedge sell climaxes in May, the odds are that the 2 month trading range will continue. The minimum goal is the test of the June 14 sell climax high.<p>While the daily chart has sold off for 4 days, it is in the middle of the 2 month range. There is additional support at the bottom of the 3 day tight trading range from 2 weeks ago. The odds are that the chart will begin to go sideways here and then have another leg up.<p>Less likely, this 4 day selloff is a resumption of the May bear trend. But, the bears will need to get consecutive big bear bars to convince traders that the trend is resuming. In addition, they will need consecutive closes below the June low.<p>Even if they get a breakout below and a 300 pip measured move down, a trading range late in a bear trend is usually the final bear flag. Therefore, traders will expect a reversal back up into this trading range within a couple of months.<p>Moreover, a reversal up on the monthly chart would be from a parabolic wedge bull flag that began with the February high. The odds would favor at least a couple legs up and last about a year.<h4>Low 2 bear flag on the weekly chart</h4><p>Today is Friday and the candle stick on the weekly chart will be a bear trend bar in a bear trend. It will be a sell signal bar next week for a Low 2 bear flag. However, it followed 3 bull bars and it is still holding the support of the November 7 low. There are therefore probably more buyers than sellers below this week’s low. Consequently, the 7 week trading range is more likely to continue than be a successful bear flag.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart sold off 60 pips overnight down to support on the daily chart. It has been sideways for the past 5 hours. The bulls will try to form a base for a test back up to at least 1.1750 next week. But, the 4 day selloff was in a tight bear channel. Therefore, the 1st reversal up will probably only last a couple of days. Traders should expect the chart to go sideways in a 100 pip range for at least the next few days.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/Emini-close-above-2800-after-sell-climax-and-opening-reversal-up.png\"><img loading=\"lazy\" src=\"2018-7-13-2.png\" alt=\"Emini close above 2800 after sell climax and opening reversal up\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>The Emini spent most of the day above 2800. However, it failed to break about the March 13 major lower high of 2811.00. The bulls will probably get their breakout next week. Since the daily chart is in a trading range, the breakout will probably disappoint the bulls. Most likely, the Emini will go sideways around 2811.00 for a couple of weeks.<p>The bears want a reversal down from here. That would create a double top on the daily chart. The bears would then expect a test of the middle of the 6 month range at around 2700. However, the odds are that there would then be another attempt to break above the March 13 lower high.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-7-13"
    }
  ],
  "14": [
    {
      "data": [
        "<article class=\"post-79857 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini 2800 double top or breakout to new all-time high?Emini weekend update: July 14, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini 2800 double top or breakout to new all-time high?<br>Emini weekend update: July 14, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-07-14T00:30:04-07:00\">July 14, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Testing buy climax high</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/Emini-monthly-candle-stick-chart-4-month-rally-from-High-1-bull-flag.png\"><img loading=\"lazy\" src=\"2018-7-14.png\" alt=\"Emini monthly candle stick chart 4 month rally from High 1 bull flag\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has a big bull trend bar this month. The bulls need consecutive strong bull bars before traders will believe that the bull trend is resuming.<p>The monthly S&amp;P500 Emini futures candlestick chart has had a 4 month rally after a 3 month reversal from a buy climax. Since the rally lacks consecutive strong bull trend bars, there is still a 50% chance that it will fail around the all-time high. The bulls want the month to close on its high and above 2800. Furthermore, they want August to also be a bull bar closing on its high. If so, the rally will probably continue to between 3,000 – 3,200 by the end of the year.<h4>Possible double top, but it would only lead to a minor reversal</h4><p>If the bulls fail to get consecutive strong bull bars, then the rally will probably fail around the January high. If it forms a double top with the January high, the pattern would only have about 10 bars. That is usually too small for a major reversal. Therefore, if the Emini sells off within the next few months, the selloff will probably be minor.<p>This means that it would be a 2nd leg down after the February selloff. Sometimes a 2nd leg down can be strong. This is because the bears see it as a break below the neck line of a double top.<p>However, the bear breakout would likely fail within a couple of months. The monthly chart would then either continue in its 7 month trading range, or rally from a High 2 bull flag to a new high.<p>Therefore, even if there is a 20% correction in the next 6 months, it would probably simply be a bull flag on the monthly chart. The small double top would only have a 30% chance of leading to a bear trend on the monthly chart.<p>It is important to note that a 20% pullback on the monthly chart would be a bear trend on the daily chart. But, that would likely be a good buying opportunity. The bull trend on the monthly chart is so strong that a move above 3,000 is likely in 6 – 12 months, even if there is a selloff to 2,300 1st.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Small Pullback Bull Trend</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/Emini-weekly-candle-stick-chart-testing-March-13-major-lower-high-above-2800.png\"><img loading=\"lazy\" src=\"2018-7-14-1.png\" alt=\"Emini weekly candle stick chart testing March 13 major lower high above 2800\"></a><p class=\"caption\">The 4 month rally on the weekly S&amp;P500 Emini futures candlestick chart is gaining strength. However, the bulls need 2 closes above the March high before traders will conclude that last year’s bull trend is resuming.<p>The weekly S&amp;P500 Emini futures candlestick chart has consecutive bull bars closing near their highs. This is a sign of strong bulls. However, the bears hope that it is simply a buy vacuum test of the March lower high of 2811.00. Traders will find out over the next few weeks.<p>If the bears get a strong bear bar, traders will sell below its low. They would see it as a sell signal bar for a double top with the March high. The bears want a break below the April low neck line of the double top. Then, they would hope for a 250 point measured move down. However, it is more likely that the selloff would not break below the April low. Instead, it would simply be just a 1 – 2 month bear leg in the 6 month trading range.<p>Alternatively, if the bulls get consecutive closes above that March high, traders will look for a 250 point measured move up over the next 6 months. The monthly chart was strongly bullish for 3 years. In addition, the momentum is increasing as the rally continues. Therefore, it is more likely that the bulls will reach 3,100 before the bears get 2,300.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Emini 2800 double top or breakout to new all-time high?</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/Emini-daily-candle-stick-chart-in-4-month-broad-bull-channel-and-now-possible-double-top-with-March-high.png\"><img loading=\"lazy\" src=\"2018-7-14-2.png\" alt=\"Emini daily candle stick chart in 4 month broad bull channel and now possible double top with March high\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart is testing the March 13 major lower high of 2811.00.<p>The daily S&amp;P500 Emini futures candlestick chart rallied strongly for 2 weeks. Furthermore, the swing up from the May 3 low is strong enough to be a resumption of last year’s bull trend. However, the bulls need at least a 20 point break above the March 13 high. In addition, they need consecutive big bull bars in that breakout. Finally, they want at least 2 consecutive closes 10 – 20 points above that high. If the rally is a resumption of the bull trend, the bulls will accomplish most of this.<p>On the other hand, if they fail, then the bears will get at least a 2 legged swing down over the next few months. That selloff would still probably only be a bear leg in the 6 month trading range. It would likely stay above the February low. But, there is a 30% chance that it would break strongly below that February low.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-7-14"
    }
  ],
  "16": [
    {
      "data": [
        "<article class=\"post-79855 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini in Breakout Mode at 2800 and March major lower highIntraday market update: July 16, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini in Breakout Mode at 2800 and March major lower high<br>Intraday market update: July 16, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-07-16T06:20:16-07:00\">July 16, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini in Breakout Mode at 2800 and March major lower high</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini has rallied up to just below the March 13 major lower high of 2811.00. However, until there is a breakout, there is no breakout. The bears are selling up here. They want a double top and a reversal down to the middle or bottom of the 6 month trading range.<p>If the bulls fail to break strongly above 2811.00 within the next 2 weeks, the bears will being a month-long leg down in the 6 month trading range. Last Wednesday’s selloff might be the Final Bull Flag in the July rally on the 60 minute chart.<p>Day traders will begin to look for either a strong break above 2811.00 or a strong reversal down. Since the past 4 days have been sideways, the odds are that today will be mostly sideways again. But, since the daily chart is at unusually important resistance, a breakout up or down within the next couple of weeks will probably lead to a trend of about 100 points over the following month.<p>Neither side is strong enough yet to take control. Therefore, day traders will expect mostly sideways trading until there is a strong breakout up or down.<h3>Overnight Emini Globex trading</h3><p><br>Overnight, the Globex market rallied to within 2 points of the March 13 major lower high of 2811.00 on the daily chart, but again reversed down. The selloff lacked energy, just as the past 4 days on the have failed to have strong trends. The odds are that trading range trading will again be dominant today.<p>But, day traders know that a 100 point trend up or down will probably begin within a couple of weeks. They therefore should be ready to switch from trading range trading to trend trading at any moment.<h2>Friday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/Emini-close-above-2800-after-sell-climax-and-opening-reversal-up-1.png\"><img src=\"2018-7-16.png\" alt=\"Emini close above 2800 after sell climax and opening reversal up\"></a><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex double bottom bull flag and head and shoulders top bear flag</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/EURUSD-Forex-double-bottom-bull-flag-and-head-and-shoulders-top-bear-flag.png\"><img loading=\"lazy\" src=\"2018-7-16-1.png\" alt=\"EURUSD Forex double bottom bull flag and head and shoulders top bear flag\"></a><p class=\"caption\">The EURUSD daily Forex chart has been in a trading range for 2 months. Every trading range has both a bull and a bear setup. Because this trading range followed an extreme sell climax, the odds are that there will be a test of the top of the range. That is the June 14 high.<p><br>Friday was a bull reversal bar on the EURUSD daily Forex chart. It was also a double bottom bull flag with the bear bar from 2 weeks ago. The bulls want a rally up from here.<p>Because the June 14 sell climax was extreme, its high is a strong magnet. This is especially true since the May selloff followed consecutive parabolic wedge sell climaxes on daily chart down to major support on the weekly chart. Therefore, the odds favor a rally to 1.1850 before a break to a new low.<p>Furthermore, the May 14 bear flag rallied to within 2 pips of the 1.20 Big Round Number. In addition, it was not tested. An untested important price usually gets tested. As a result, there is at least a 50% chance of the bear rally continuing up to 1.20 over the next 2 months.<p>If the bears begin to get consecutive big bear bars and a strong break below 1.15, then this 2 month bear flag will have ended. They will then try for a 300 pip measured move down to 1.12 over the next few months. However, the odds favor at least another 1 – 2 months of sideways to up trading before the probability will begin to shift again in favor of the bears.<h3>Overnight EURUSD Forex trading</h3><p><br>After Friday’s bull reversal bar on the daily chart, the EURUSD 5 minute Forex chart rallied 50 pips overnight. However, this rally is small and it lacked consecutive big bull trend bars on the 5 minute chart.<p>Day traders have been scalping, and today so far is a weak entry bar on the daily chart for the bulls. If today remains small, which is likely, the 2 week tight trading range will continue. Day traders will keep scalping longs and shorts until there is a series of big trend bars up or down on the 5 minute chart. This is true despite Friday being a good bull reversal bar at support on the daily chart.<p>Trading ranges have inertia. That means that there is a strong tendency to continue doing what they have been doing. The 200 pip tight trading range that began with the July 2 low will probably continue for at least a few more days. Therefore, the 100 point rally over the past 2 days will probably begin a 50 pip pullback today or tomorrow.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/Emini-trading-range-day-and-limit-order-market-at-2800-and-March-major-lower-high.png\"><img loading=\"lazy\" src=\"2018-7-16-2.png\" alt=\"Emini trading range day and limit order market at 2800 and March major lower high\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>The Emini had its 5th consecutive mostly sideways day today. The bulls want a strong breakout above the March high. But, today is a sell signal bar on the daily chart and the bears want a strong reversal down. Day traders are waiting for a strong trend up or down. Until then, they are mostly scalping.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-7-16"
    }
  ],
  "17": [
    {
      "data": [
        "<article class=\"post-80015 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini bull channel but double top bear flag with March high Intraday market update: Tuesday July 17, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini bull channel but double top bear flag with March high<br>Intraday market update: Tuesday July 17, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-07-17T06:20:04-07:00\">July 17, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini bull channel but double top bear flag with March high</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini could not sustain a weak bull reversal day yesterday. It was the 5th consecutive small trading range day. Traders want to know if there will be a breakout far above the March high or a reversal down. There is no sign of either yet. Day traders will continue to mostly scalp until there is a series of strong bull trend bars up or down on the 5 minute chart. However, a month-long swing up or down will probably begin within the next 2 weeks.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 5 points in the Globex market. Today therefore might gap down. Traders are deciding if yesterday’s pullback will lead to one more leg up to the March high this week or continue down to the July 11 pullback low. Because the past 5 days have been mostly sideways on the 5 minute chart, that is likely again today. But, since the daily chart is at important resistance, a strong trend up or down can begin at any time.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/Emini-trading-range-day-and-limit-order-market-at-2800-and-March-major-lower-high.png\"><img src=\"2018-7-17.png\" alt=\"Emini trading range day and limit order market at 2800 and March major lower high\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/EURUSD-Forex-Triangle-after-parabolic-wedge-sell-climaxes-2.png\"><img loading=\"lazy\" src=\"2018-7-17-1.png\" alt=\"EURUSD Forex Triangle after parabolic wedge sell climaxes\"></a><p class=\"caption\">With the overnight reversal down, the trading range on the EURUSD daily Forex chart now has 5 legs. It is therefore a triangle. But, the parabolic wedge sell climaxes in May were extreme, as was the June 14 sell climax. Therefore, the chart is slightly more likely to test the June 14 high before breaking below the June 21 low.<p><br>The EURUSD daily Forex chart has been in a trading range for 2 months. It is therefore in Breakout Mode. Traders expect a 300 pip measured move up or down. But, the parabolic wedge sell climaxes in May were exceptionally strong. In addition, they stopped at support on the weekly chart. Finally, there was another extreme sell climax on June 14. These factors make a test of the June 14 high more likely than a breakout below the June 21 low.<p>However, even if the daily chart gets a 50% pullback to around 1.20, the bear trend is so strong that the rally will probably be a pullback in a bear trend and not a new bull trend. Consequently, the odds favor a break below the June 21 low after any rally over the next couple of months.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart rallied above yesterday’s high, but reversed back down. Since the 50 pip selloff is in a tight bear channel, the odds are against a strong rally today. Because the selloff is now back to the apex of the 2 month triangle, it will probably not continue much lower today. Therefore, today will probably begin to go sideways and day traders will scalp. The bottom of the range will likely be around where the market now is and yesterday’s low. That is about 25 pips lower.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/Emini-Small-Pullback-Bull-Trend-and-close-above-March-13-major-lower-high.png\"><img loading=\"lazy\" src=\"2018-7-17-2.png\" alt=\"Emini Small Pullback Bull Trend and close above March 13 major lower high\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>The Emini finally broke above the March major lower high. As strong as the rally was, it could not get far above that resistance. It closed only 1 tick above.<p>The bulls need follow-through buying over the next several days to convince traders that the breakout will be successful.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-7-17"
    }
  ],
  "18": [
    {
      "data": [
        "<article class=\"post-80018 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini breakout above March major lower high needs follow-throughIntraday market update: Wednesday July 18, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini breakout above March major lower high needs follow-through<br>Intraday market update: Wednesday July 18, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-07-18T06:20:28-07:00\">July 18, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini breakout above March major lower high needs follow-through</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Yesterday was a strong bull trend day. Furthermore, the Emini finally broke above the March 13 major lower high, which I said was likely. However, it only closed only 1 tick above. The bulls need follow-through buying over the next several days to make traders believe that the breakout will be successful. In addition, they need to get 20 or more points above the high.<p>The bears will try to make the breakout fail. They need to get a strong reversal down for several days before the bulls will give up.<p>Since the Emini is still in the 6 month trading range, the odds are that the bulls will be disappointed over the next couple of weeks. Instead of a series of big bull bars, a tight trading range is more likely. For example, the Emini might oscillate around the March high for 2 – 3 weeks. Then, it would decide between trend resumption up to a new all-time high or trend reversal down.<p>Because yesterday was a buy climax, there is a 75% chance of at least a couple hours of sideways to down trading today that begins by the end of the 2nd hour. Although there is a 50% chance of follow-through buying on the open, there is only a 25% chance of another strong bull day.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 2 points in the Globex session. If the day session opens here, it will continue yesterday’s 4 hour trading range. As strong as yesterday’s rally was, it stalled at major resistance.<p>While the odds favor a new all-time high before a break below the February low, trading ranges resist converting into trends. Therefore, the odds are that any strong rally or selloff will reverse rather than successfully breakout. That is true with the current rally as well. Therefore, the bears will sell any strong rally over the next week. They will try to create a sell signal bar on the daily chart, and then begin a reversal down. This means there is an increased risk of a series of bear days beginning within a couple of weeks.<p>Since yesterday was a buy climax, the odds are against a strong bull trend day today. More likely, yesterday’s 6 point trading range will continue. However, it will likely expand by a at least a measured move up or down today.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/Emini-Small-Pullback-Bull-Trend-and-close-above-March-13-major-lower-high.png\"><img src=\"2018-7-18.png\" alt=\"Emini Small Pullback Bull Trend and close above March 13 major lower high\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex breakout below head and shoulders top bear flag, but probably just bear leg in trading range</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/EURUSD-Forex-head-and-shoulders-top-bear-flag-is-probably-just-bear-leg-in-trading-range.png\"><img loading=\"lazy\" src=\"2018-7-18-1.png\" alt=\"EURUSD Forex head and shoulders top bear flag is probably just bear leg in trading range\"></a><p class=\"caption\">The EURUSD daily Forex chart has consecutive big bear bars and a head and shoulders top bear flag. However, the May and June sell climaxes were extreme and now the chart is in a trading range at support. There should be buyers around the July 2 low and below the June 21 bottom of the trading range.<p><br>The EURUSD daily Forex chart is selling off from a small head and shoulders top bear flag. But, it is in a 2 month trading range and at major support on the weekly chart. Furthermore, the consecutive parabolic wedge sell climaxes and the June 14 sell climax were extreme. Finally, trading ranges resist converting into trends. Therefore, it is likely that the trading range will continue.<p>Since it would take about a month to test the June 14 sell climax high, the trading range has more to go. Traders are looking for a bottom. The bulls hope that this week will form a higher low and a double bottom with the July 2 low. If this selloff continues down to below the June 21 low, the bulls will buy the breakout. They will try to create a wedge bottom with the May 29 and June 21 lows.<p>The bears need a strong breakout below the June 21 low. That will require a big bear bar closing below that low, and then a follow-through bear bar. The odds are slightly better for a test of the June 14 high.<h3>Overnight EURUSD Forex trading</h3><p><br>Yesterday’s selloff continued overnight. But, it is now near the July 2 low of 1.1591, which is support. Therefore, the selling will probably end today around the overnight low, which is near the July 2 low. Because the 2 day bear channel is tight, the bulls will probably have to stop the selling and form a trading range before they can get a reversal up.<p>If this selloff is a resumption of the bear trend on the daily chart, it should not stop at the July 2 low. It should continue relentlessly far below the June 21 bottom of the trading range. Since that is unlikely, the odds are that the selling will stop today. The 5 minute chart should then reverse up at least 50 pips today or tomorrow if the bears are going to fail.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/Emini-follow-through-buying-after-breakout-above-March-major-lower-high.png\"><img loading=\"lazy\" src=\"2018-7-18-2.png\" alt=\"Emini follow-through buying after breakout above March major lower high\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>Today reversed up from an early brief selloff. It again closed above the March high. Because it had a bull body on the daily chart, is confirmed yesterday’s breakout. Yet, neither yesterday not today closed far above the March resistance. Therefore, there is still a 50% chance that the breakout will reverse down within a week or so. But, if it does, the odds are that the selloff will only be minor, and the bull trend will break to a new all-time high before yearend.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-7-18"
    }
  ],
  "23": [
    {
      "data": [
        "<article class=\"post-80020 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Weak Emini weekly sell signal for double top above 2800Intraday market update: Monday July 23, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Weak Emini weekly sell signal for double top above 2800<br>Intraday market update: Monday July 23, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-07-23T06:20:06-07:00\">July 23, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Weak Emini weekly sell signal for double top above 2800</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>After breaking almost 20 points above the 2800 Big Round Number last week, the Emini pulled back to test 2800 on Friday. The bulls want a resumption of the July rally and a breakout to a new all-time high.<p>However, the daily chart has been in a trading range for 6 months. Trading ranges resist converting into a trend. Consequently, it is more likely that the trading range will continue than become a bull trend. Therefore, the bulls will take profits above 2800 and the bears will sell. The odds are that the Emini will go sideways to down for the next several weeks, even it it breaks slightly above last week’s high first.<p>Last week was a bear bar on the weekly chart. It is therefore a sell signal bar for this week for a failed breakout above the March high. But, it was only a doji and it followed a big bull bar. This is a weak sell setup. Therefore, there will likely be more buyers than sellers below last week’s low.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 1 point in the Globex market after dipping below the 2800 Big Round Number. After last Tuesday’s strong rally, the Emini has been consolidating. The past 2 days are forming a wedge bull flag. Therefore, the bulls will probably get a test back up to last week’s high within a few days.<p>The bears want a strong break below last Tuesday’s low of 2790.75. This would increase the chance of a swing down for a few weeks. The bears do not mind a rally back up to last week’s high. They would then try to create a double top and begin a swing down on the daily chart.<p>After 3 small days, today will probably again be mostly sideways. If there is a rally to last week’s high, it will probably fail within a few days. Alternatively, if there is a break below last week’s low, it, too, will likely not fall far. The odds are for more sideways trading for at least another week.<h2>Friday’s setups</h2><p class=\"caption\">No chart for last Friday. I was speaking about Advanced Emini Scalping at the Chicago Mercantile Exchange in Chicago and I was not trading.<h2>EURUSD Forex triangle so breakout mode</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/EURUSD-Forex-triangle-so-breakout-mode.png\"><img src=\"2018-7-23.png\" alt=\"EURUSD Forex triangle so breakout mode\"></a><p class=\"caption\">The EURUSD daily Forex chart has lower highs and a higher low in its 2 month trading range. This is therefore a Triangle, but there is no sign of a breakout.<p><br>The EURUSD daily Forex chart has been in a Triangle for a couple of months. It is therefore in Breakout Mode. In general, a Triangle has a 50% chance of a successful bull breakout and a 50% chance of a successful bear breakout. Furthermore, there is a 50% chance that the 1st breakout will fail.<p>I adjust these numbers based on context. This Triangle followed a series of sell climaxes and is at major weekly support. In addition, the May 14 lower high missed the 1.20 Big Round Number by only 2 pips. That is therefore a magnet above.<p>The odds are that there will be a rally to the June 14 sell climax high and then to 1.20. This is true even if there is a break below the June 21 low and 1.15 1st. If the bears get their breakout, the Triangle will probably be the Final Bear Flag in the May bear trend. The breakout would likely fail within 200 pips and then the bulls would get their rally to 1.20.<p>If the rally to 1.20 comes before the bear breakout, it will probably form a lower high. The bears would then get a 2nd leg down to below 1.15. That would probably fail somewhere above 1.12 and form a large wedge bull flag on the weekly chart.<p>As you can see, the odds favor continued trading range trading for many months. The market should rally to 1.20 and fall to around 1.13. Traders are now deciding which will happen 1st.<h3>Overnight EURUSD Forex trading</h3><p><br>Since the EURUSD daily Forex chart is at the apex of a triangle, traders expect reversals every 2 – 3 days. The past 3 days were up, but there is room to the June 9 lower high just below 1.18. Therefore, the odds are that today will stall and enter a trading range on the 5 minute chart. The 3 day rally was in a tight bull channel. This makes a strong bear day unlikely.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/Emini-lower-low-major-trend-reversal-and-outside-up-day-1.png\"><img loading=\"lazy\" src=\"2018-7-23-1.png\" alt=\"Emini lower low major trend reversal and outside up day\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>The Emini reversed up from below Friday’s low and from above last Tuesday’s low. A brief rally a the end of the day went above Friday’s high. Therefore, today was an outside up day, and a sign of strong bulls.<p>However, last week is a sell signal bar on the weekly chart. In addition, last week formed a double top with the March high. This conflicts with the daily chart and it increases the chance of more sideways trading likely.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-7-23"
    }
  ],
  "24": [
    {
      "data": [
        "<article class=\"post-80120 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini daily buy signal bar and weekly sell signal bar at March highIntraday market update: Tuesday July 24, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini daily buy signal bar and weekly sell signal bar at March high<br>Intraday market update: Tuesday July 24, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-07-24T06:20:21-07:00\">July 24, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini daily buy signal bar and weekly sell signal bar at March high</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Yesterday, the Emini reversed up from below Friday’s low and the 2800 Big Round Number. It rallied to above Friday’s high and formed an outside up day. This is a sign of strong bulls.<p>The bulls need to continue to get bull bars if this rally is going to make a new all-time high. There is no top yet so at least slightly higher prices are likely.<p>But, there is a potential higher high double top with the March high. If the bears can get a reversal down from between here and 2850, they will try to test down to the middle of the 6 month trading range.<p>The chart is still in the resistance zone around the March high. The further above it this rally goes, the more likely the March high will become support and the rally will continue up to 3,000 – 3,200. The bears need to get a reversal soon because the bulls are taking control.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 10 points in the Globex market. It will therefore likely gap up on the open. A big gap means an increased chance of a trend day, especially in the direction of the gap.<p>However, a big gap up means that the Emini will be far above the 20 bar EMA. Most traders are hesitant to buy too far above the average price unless there is an early rally that is much stronger than average. As a result, most big gap opens go mostly sideways for the 1st hour until the price gets closer to the average. At that point, the bulls will look for a double bottom or a wedge bottom. They will then try to create a bull trend day.<p>The best case for the bears is a series of 3 – 4 big bear trend bars on the open. If they get that, they would have a 50% chance of a bear trend day. Alternatively, if there is an early trading range, they will try to create a major trend reversal. If there is an early strong rally, they will look for a parabolic wedge top.<p>Since the majority of the bars during the past 10 days were mostly sideways, that is likely again today.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/Emini-lower-low-major-trend-reversal-and-outside-up-day-1.png\"><img src=\"2018-7-24.png\" alt=\"Emini lower low major trend reversal and outside up day\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex Triangle at support after parabolic wedge sell climaxes</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/EURUSD-Forex-Triangle-at-support-after-parabolic-wedge-sell-climaxes.png\"><img loading=\"lazy\" src=\"2018-7-24-1.png\" alt=\"EURUSD Forex Triangle at support after parabolic wedge sell climaxes\"></a><p class=\"caption\">The EURUSD daily Forex chart is at the apex of a triangle. Since the June 14 sell climax high has not been tested yet, the odds slightly favor higher prices over the next few weeks.<p><br>The EURUSD daily Forex chart has been forming higher lows and lower highs for a couple of months. This is triangle and therefore a breakout mode pattern. But, because the June 14 sell climax high is a high probability magnet, the odds slightly favor the bulls. Furthermore, May 14 came within 2 pips of the 1.20 Big Round Number, which was not tested again. That is also a magnet.<p>Because the May collapse stopped at support on the weekly chart, it was a sell vacuum test of support. When that happens, there is usually a bounce that lasts a lot of bars and retraces about half of the selloff. Consequently, the odds favor a test of 1.20 within a few months. However, there might be a brief breakout below the triangle first.<p>The daily chart pulled back 100 pips from a 2 day rally. If the bulls can close today above the open, today will be a buy signal bar for tomorrow. Because the chart is at the apex of the triangle, the legs up and down are lasting only a few days. This usually is a sign that a breakout will come withing a couple of weeks.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart bounced 60 pips overnight. This is a 2 day pullback from last week’s rally. But, the 2 day selloff was sharp, creating a Big Up, Big Down pattern. This creates confusion, which usually means a trading range. Therefore, the rest of today will probably stay within a 50 pip range.<p>The key price is 1.1692. That is the open. The bulls want today to close above the open, which would create a bull bar on the daily chart. Today would then be a buy signal bar for tomorrow. They therefore will buy selloffs below that price today.<p>Since the bears always want the opposite, they will sell 10 – 20 pips above that price.<p>The price will probably be a magnet today, and today might oscillate around it. Then, in the final hour, traders will decide if today will close a little above it or below it.<p>Any day can be a trend day. But, the odds favor a trading range day and a close around the open.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/Emini-small-wedge-top-and-then-bear-trend.png\"><img loading=\"lazy\" src=\"2018-7-24-2.png\" alt=\"Emini small wedge top and then bear trend\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>After gapping up, the Emini sold off today and closed the gap. It is a sell signal bar for tomorrow. Because it has a big tail below, it is a weak sell signal bar. In addition, since the 4 week rally is in a tight bull channel, the reversal down could be minor.<p>The location on the daily chart is good for the bears. They want a failed breakout of the March high and a test down to the June higher low below 2700. But, they need follow-through selling over the next few days. Otherwise, the Emini will stay sideways around 2800 .<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-7-24"
    }
  ],
  "25": [
    {
      "data": [
        "<article class=\"post-80122 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini breakout above the March high and 2800 might fail Intraday market update: Wednesday July 25, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini breakout above the March high and 2800 might fail<br>Intraday market update: Wednesday July 25, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-07-25T06:20:49-07:00\">July 25, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini breakout above the March high and 2800 might fail</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini gapped up yesterday, but then sold off and closed the gap. Because yesterday closed below the open, the bar on the daily chart had a bear body. It is a sell signal bar for today for a failed breakout above the March high.<p>Since it had a prominent tail below and the past several weeks have been in a tight bull channel, it is not a strong sell setup. A minor reversal is more likely than a bear trend. However, the location is good for the bears. Therefore, there is an increased chance of a big bear trend day today.<p>The bulls hope that yesterday’s selloff was just a pullback from the gap up. But, the selling on the 5 minute chart was strong enough to make a big bull trend day unlikely today.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 5 points in the Globex market. Since the past 10 days have been small, the breakout attempt above the March high so far is weak. That increases the chances of a test down for 2 – 3 weeks. If the daily chart pulls back, there will be more swings down on the 5 minute chart.<p>While the Emini has rallied for 2 weeks, the 60 minute chart is in a channel with very few consecutive big bull bars. This makes the rally more likely a bull leg in a trading range than in a bull trend. It therefore increases the chance of a bear leg that would test the bottom of the channel at around 2770.<p>Therefore, there is an increased chance of swings down on the 5 minute chart for the next week or two. Less likely, the chart will break strongly above the 2 week channel on the 60 minute chart without the pullback.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/Emini-small-wedge-top-and-then-bear-trend.png\"><img src=\"2018-7-25.png\" alt=\"Emini small wedge top and then bear trend\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex apex of triangle after May sell climax down to support</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/EURUSD-Forex-apex-of-triangle-after-parabolic-sell-climaxes-in-trump-tariff-trade-war.png\"><img loading=\"lazy\" src=\"2018-7-25-1.png\" alt=\"EURUSD Forex apex of triangle after parabolic sell climaxes in trump tariff trade war\"></a><p class=\"caption\">The EURUSD daily Forex chart is at the apex of a month-long triangle in a 2 month trading range. It is deciding on the direction of the breakout.<p><br>Nothing changed overnight on the EURUSD daily Forex chart. It is still at the apex of a month-long triangle that is part of a 2 month trading range. In general a triangle has an equal chance of breaking out up or down. In addition, there is a 50% chance that the 1st breakout fails within a few bars.<p>This triangle is at support on the weekly chart. Furthermore, it is following a series of sell climaxes down to that support. These factors make a successful bull breakout slightly more likely. But, that breakout will probably form a lower high around 1.20 that would then lead to a move down to around 1.20 within the next 6 months.<p>Since the legs in the triangle are now lasting only a few days, traders on the daily charts are taking quick profits. They want to see a strong breakout up or down before they will hold onto positions.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart has been in a 30 pip trading range since yesterday’s close. That makes it difficult for day traders to make money even when they are scalping. Most day traders should wait for today’s range to expand. A big trend day is unlikely. Therefore, day traders will trade reversals for 10 pip scalps.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/Emini-Small-Pullback-Bull-Trend-with-Late-Buy-The-Close-Rally-then-profit-taking.png\"><img loading=\"lazy\" src=\"2018-7-25-2.png\" alt=\"Emini Small Pullback Bull Trend with Late Buy The Close Rally, then profit taking\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>The Emini rallied in a broad bull channel and continued its breakout above the March high. There was an extremely strong breakout in the final 30 minutes. If institutions are buying late like this, they believe they might not be able to buy at this price tomorrow. This increases the chance that the bull trend is resuming on the daily chart.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-7-25"
    }
  ],
  "26": [
    {
      "data": [
        "<article class=\"post-80124 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini breakout but 50 point pullback likely within 2 weeksIntraday market update: Thursday July 26, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini breakout but 50 point pullback likely within 2 weeks<br>Intraday market update: Thursday July 26, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-07-26T06:20:59-07:00\">July 26, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini breakout but 50 point pullback likely within 2 weeks</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini rallied yesterday in a small pullback bull trend. It continued its breakout above the March high. There was an unusually strong late bull breakout. While the bulls want a measured move up, the bears want it to be an exhaustive end of the July rally. When a breakout is especially big like this, the odds favor at least slightly higher prices over the next few days.<p>But, the rally on the 60 minute chart is extreme. Therefore, there is a 50% chance of a pullback of a 50 – 70 point pullback within the next few weeks. The next few days will be important. Traders will watch to see if there is strong follow-through buying. More likely, today will be a pause day as exhausted bulls wait to see if the bears can create a reversal. If the bears fail, the bulls will buy again for another leg up.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 4 points in the Globex market. It has been in a very tight trading range overnight. While yesterday had a huge late bull breakout, it also had a big reversal down into the close. This is a Big Up, Big Down pattern, which creates Big Confusion. That is a hallmark of a trading range. Therefore, there is an increased chance that the overnight trading range will last all day.<p>Because yesterday’s closing rally was so unusual, there is an increased chance of a big day up or down today. However, the odds favor at least an early trading range.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/Emini-Small-Pullback-Bull-Trend-with-Late-Buy-The-Close-Rally-then-profit-taking.png\"><img src=\"2018-7-26.png\" alt=\"Emini Small Pullback Bull Trend with Late Buy The Close Rally, then profit taking\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD daily Forex chart at apex of triangle at support on weekly chart</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/EURUSD-daily-Forex-chart-at-apex-of-triangle-at-support-on-weekly-chart.png\"><img loading=\"lazy\" src=\"2018-7-26-1.png\" alt=\"EURUSD daily Forex chart at apex of triangle at support on weekly chart\"></a><p class=\"caption\">The EURUSD daily Forex chart’s legs up and down are now lasting only a couple of days. The odds are that it will break out of the triangle within a week.<p><br>The EURUSD daily Forex chart is at the apex of a month-long triangle that is within a 2 month trading range. Since the legs up and down are now lasting only a couple days, the odds favor a breakout within a week. The 1st breakout of a triangle fails and reverses 50% of the time within a few bars. Also, there is about a 50% chance that the successful breakout will be up and 50% chance it will be down.<p>Here, the probability is slightly higher for the bulls. This is because the selloff before the triangle was climactic and the triangle is at support on the weekly chart. In addition, there are high probability magnets above. These are the June 19 sell climax high and the May 14 test of the 1.20 Big Round Number.<p>Even if the bears win, a triangle late in a bear trend is usually the Final Bear Flag. That means that the selloff is likely to reverse back up within a month and come back into the triangle. More likely, that rally would continue up to the targets above.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart has been in a 40 pip range since yesterday’s close. Since the daily chart is at the apex of a triangle, day traders are scalping reversals for 10 pips. But, they know that a big breakout up or down can come at any time. If there is a big breakout on the 5 minute chart, the day traders will switch to swing trading. That breakout will probably come within a week.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/Emini-trading-range-day-pullback-from-yesterdays-bull-breakout.png\"><img loading=\"lazy\" src=\"2018-7-26-2.png\" alt=\"Emini trading range day pullback from yesterday's bull breakout\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>The Emini formed a small bull inside day today. In addition, the bodies stayed above yesterday’s breakout point and the low stayed above Tuesday’s high. All of this increases the odds of higher prices over the next few days. However, the bears will try to create a micro double top with Wednesday’s high within the next few days. They will need a bear body to make traders willing to sell.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-7-26"
    }
  ],
  "27": [
    {
      "data": [
        "<article class=\"post-80126 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini pullback from Wednesday’s bull breakout Intraday market update: Friday July 27, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini pullback from Wednesday’s bull breakout<br>Intraday market update: Friday July 27, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-07-27T06:20:08-07:00\">July 27, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini pullback from Wednesday’s bull breakout</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini formed a small inside bull day yesterday after Wednesday’s late, strong rally. Yesterday is therefore a Breakout Mode bar on the daily chart. The bulls see it as a 1 day bull flag. However, the bears see it as a sign that Wednesday’s breakout is failing. They, therefore, see it as a sell signal bar. Since it had a bull body and its low was above Tuesday’s high, the odds are better for the bulls.<p>Wednesday’s rally was strong and it went far above the March high. Furthermore, yesterday was a bull follow-through day. The odds are that today or Monday will trade above Wednesday’s high.<p>But, the chart is still in a 6 month trading range. Therefore, there is about a 50% chance that the upcoming rally will fail within a few days and begin a 2 – 3 week reversal. However, the breakout was far enough above the March high to make a reversal be a pullback in a bull trend and not a bear trend. The odds favor a new all-time high within a couple months.<h3>Overnight Emini Globex trading</h3><p><br>The Emini was in a small trading range yesterday. Since yesterday had a bull body on the daily chart, it is a High 1 bull flag. The odds are that today will trade above yesterday’s high. That will trigger a buy signal on the daily chart. Since the odds are that there will be at least one more leg up on the daily chart, there is an increased chance of a bull trend day today.<p>Even though Wednesday’s breakout might soon fail, yesterday’s bull body makes a big bear day unlikely today. Today should be either a 2nd trading range day or a bull trend day.<p>Today is Friday so weekly support and resistance can be important. There are no nearby significant targets. The bulls simply will try to make the week close near its high, and the bears will try to put a tail on the top of this week’s candle stick.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/Emini-trading-range-day-pullback-from-yesterdays-bull-breakout.png\"><img src=\"2018-7-27.png\" alt=\"Emini trading range day pullback from yesterday's bull breakout\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex outside down day but still in triangle</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/EURUSD-Forex-outside-down-day-but-still-in-triangle.png\"><img loading=\"lazy\" src=\"2018-7-27-1.png\" alt=\"EURUSD Forex outside down day but still in triangle\"></a><p class=\"caption\">The EURUSD daily Forex chart had an outside down day yesterday, but it is still in a month-long triangle. It therefore has no predictive value. The chart remains in breakout mode.<p><br>Not only is the EURUSD daily Forex chart in a triangle, there are important targets 300 pips above and below. The chart will probably test both 1.20 and 1.12 over the next year. It is now deciding which it will test 1st. It is perfectly balanced and the odds for the next move are 50% for up and for down.<p>Because the chart is at the apex of the triangle, the legs up and down are lasting only 2 – 3 days. Traders will continue to bet on reversals until there is a strong breakout above 1.18 or below 1.15.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute chart sold off yesterday. However, it is now in the bottom half of the month-long triangle. Therefore, traders will look for the selloff to stall today and reverse up tomorrow.<p>Everyone knows that a breakout attempt is likely within a couple of weeks. However, just look at the chart over the past month. Every leg up and down reversed within 3 days. Day traders will bet that this pattern will continue until it clearly has changed.<p>There have been many 50 pip breakouts up and down over the past month. Yet, because of the lack of follow-through, day traders have rarely been able to make more than 30 pips on a trade. They will continue to expect to scalp again today. Despite the 120 pip selloff from yesterday’s high, they will both buy and sell today.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/Emini-sell-vacuum-test-of-last-weeks-high.png\"><img loading=\"lazy\" src=\"2018-7-27-2.png\" alt=\"Emini sell vacuum test of last week's high\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>The Emini today reversed Wednesday’s buy climax. I have been writing for the past week that the Emini would probably pull back 50 – 100 points over the next few weeks. This is likely the start of that process. Since today was a sell climax, Monday will probably have at least a couple of hours of sideways to up trading that begins by the end of the 2nd hour.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-7-27"
    }
  ],
  "28": [
    {
      "data": [
        "<article class=\"post-80130 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini 100 point minor reversal down from buy climax Emini weekend update: July 28, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini 100 point minor reversal down from buy climax<br>Emini weekend update: July 28, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-07-28T00:30:45-07:00\">July 28, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Strong bull bar, testing the all-time high</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/Emini-monthly-chart-has-strong-bull-bar-that-is-testing-January-all-time-high.png\"><img loading=\"lazy\" src=\"2018-7-28.png\" alt=\"Emini monthly chart has strong bull bar that is testing January all time high\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has a strong bull bar so far in July. Since there are only 2 trading days left to the month, the bar will probably remain strongly bullish.<p>The monthly S&amp;P500 Emini futures candlestick chart is in a strong bull trend. January’s buy climax was the most extreme in the 100 year history of the stock market. The 4 month rally is now testing the January all-time high. This was the minimum objective for the bulls.<p>Since the month has a bull body, it is a weak sell signal bar for the bears who want a double top with the January high. However, if August is a bear bar, that would be a more reliable sell signal.<p>But, the 2017 rally was so strong that any reversal down will be minor until after at least a 1 – 3 month breakout above the January buy climax high. That is what typically happens after strong buy climaxes. Therefore, the odds are that the Emini will reach 3000 – 3200 later this year.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Sell signal bar for failed breakout above 6 month trading range.</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/Emini-weekly-chart-has-minor-reversal-after-breakout-above-March-high-and-2800.png\"><img loading=\"lazy\" src=\"2018-7-28-1.png\" alt=\"Emini weekly chart has minor reversal after breakout above March high and 2800\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart closed below its midpoint this week after breaking above the 6 month trading range. It is therefore a sell signal bar for next week.<p>The bears want this week’s reversal to be the end of a 2 legged rally up from the February low. In addition, they see this week as a sell signal bar for a lower high major trend reversal. However, the bull body lowers the probability of a major reversal down.<p>More likely, the bears will only be able to get a few weeks of selling before the bulls buy again. The break above the March high was far enough above to make higher prices likely, even if there is a 2 – 3 week selloff first.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Emini 100 point minor reversal down from buy climax</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/Emini-daily-candlestick-chart-has-failed-breakout-at-top-of-broad-bull-channel-2.png\"><img loading=\"lazy\" src=\"2018-7-28-2.png\" alt=\"Emini daily candlestick chart has failed breakout at top of broad bull channel\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart reversed down strongly on Friday after Wednesday’s buy climax.<p>The daily S&amp;P500 Emini futures candlestick chart has been in a bull trend since the May low. But, Friday’s reversal was strong. In addition, it reversed Wednesday’s strong breakout above the 6 month trading range. Finally, the daily chart has been in a tight channel in July, and that is unsustainable. Therefore, the odds are that the Emini will go sideways to down for 2 – 3 weeks.<p>Targets for the bears are the minor higher lows in the 3 week tight bull channel. The channel began with the July 11 low, which was just above 2770. If the selloff reaches that low, it would be about 80 points. I have been writing all week that the Emini would probably pull back for 50 – 100 points over the next 2 weeks. Friday was the likely start of the pullback.<p>Can this be the start of a big 2nd leg down, where February was the 1st leg? The bears at this point have a 30% chance. They would need 2 – 3 consecutive big bear bars closing near their lows before traders will believe that the bears were back in control.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-7-28"
    }
  ],
  "30": [
    {
      "data": [
        "<article class=\"post-80128 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini minor reversal down to below 2800 and the March highIntraday market update: Monday July 30, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini minor reversal down to below 2800 and the March high<br>Intraday market update: Monday July 30, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-07-30T06:20:09-07:00\">July 30, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini minor reversal down to below 2800 and the March high</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini sold off from above the 2 week bull channel on the 60 minute chart to below the bottom of the channel on Friday. The selling was strong enough to make follow-through selling likely. Over the past week, I have said many times that the odds favor a 50 – 100 point correction within the next 2 weeks. It is probably underway.<p>Less likely, this reversal down is a failed breakout above the March high and the start of a move down to the bottom of the 6 month trading range. But, the odds favor buyers coming back below 2800 and down to the beginning of the bull channel at around 2770.<p>Because Friday was a sell climax, today will probably have at least a couple hours of sideways to up trading starting by the end of the 2nd hour. However, the odds favor a move below 2800 this week. The bears will sell 20 – 30 point rallies.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is unchanged in the Globex session. Because Friday was a sell climax in a bull trend, day traders expect a lot of trading range trading today. Friday’s selloff was strong enough Surprise Bar to make a 2nd leg down likely within a couple of weeks. However, this week could retrace half or more of Friday’s selloff before the 2nd leg down begins.<p>Whenever there is a big day like Friday, there is an increased chance of more big days. But, because of the sell climax on Friday after Wednesday’s buy climax, there is confusion. The odds are that the next few days will be smaller and confused. That means that there will be trading range trading before there is a breakout up or down. At the moment, the breakout will more likely be down after a week or two of sideways trading. Yet, the odds are that the bulls will buy the 2nd leg down and the bull trend will continue up to a new high.<h2>Friday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/Emini-sell-vacuum-test-of-last-weeks-high.png\"><img src=\"2018-7-30.png\" alt=\"Emini sell vacuum test of last week's high\"></a><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex higher low in triangle</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/EURUSD-Forex-higher-low-in-triangle.png\"><img loading=\"lazy\" src=\"2018-7-30-1.png\" alt=\"EURUSD Forex higher low in triangle\"></a><p class=\"caption\">The EURUSD daily Forex chart had a small reversal up on Friday from a 2 legged pullback. Since the chart is at the apex of a 2 month triangle, a breakout attempt is likely within a couple of weeks.<p><br>The EURUSD daily Forex chart formed a higher low on Friday after the 3 day July 19 rally. Since the chart is at the apex of a triangle, the legs up and down are lasting only a few days before reversing.<p>When that happens, there is usually an attempt to break out of the triangle within about 10 bars. On the daily chart, that is 2 weeks. The 1st breakout has a 50% chance of reversing. In addition, when there finally is a successful breakout, there is a 50% chance it will be up or down. Also, traders will look for a measured move based on the 300 pip tall height of the triangle.<p>Because the triangle is late in a bear trend on the daily chart, if there is a bear breakout, the odds are that triangle will be the final bear flag. Consequently, if the selloff reaches to around the 1.12 measured move target, there would then probably be a reversal back into the triangle within several months. This would then create a larger trading range.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart has rallied 70 pips since Friday’s low. That is a small rally and therefore day traders are continuing to mostly scalp. The rally retraced about half of last week’s selloff. There will therefore be sellers here and just above at the 1.1700 Big Round Number. In addition, there will be buyers around the overnight higher low around 1.1650.<p>Since the daily chart is at the apex of a 2 month triangle, the odds are that there will soon be a breakout attempt. Consequently, while day traders are scalping, they expect a series of trend days soon. Once they begin, the day traders will resume swing trading.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/Emini-sell-climax-and-strong-minor-reversal-up.png\"><img loading=\"lazy\" src=\"2018-7-30-2.png\" alt=\"Emini sell climax and strong minor reversal up\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>The bears had another Small Pullback Bear Trend today. But, the bulls got a reversal up from the 2800 Big Round Number and the 20 day EMA. The odds favor sideways to up for 2 – 3 days. However, the 2 day selloff was a Surprise reversal. Therefore, the bears will probably get at least a small 2nd leg sideways to down over the next week or two.<p>Tomorrow is the last day of the month. The major monthly support is the March high and the June high. Both are around 2800.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-7-30"
    }
  ],
  "31": [
    {
      "data": [
        "<article class=\"post-80280 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini follow-through selling in sell climax down to 2800Intraday market update: Tuesday July 31, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini follow-through selling in sell climax down to 2800<br>Intraday market update: Tuesday July 31, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-07-31T06:20:20-07:00\">July 31, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini follow-through selling in sell climax down to 2800</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The bears got follow-through selling yesterday. However, the bulls rallied off the 20 day EMA, the 2800 Big Round Number, and the March high. After 2 days of climactic selling down to support, the Emini will probably go sideways to up for a couple of days. The bears will likely then get a 2nd leg down. I have been saying that the bears would get a 50 – 100 point selloff over the next 2 weeks. They now have 50 points, and a 2nd leg down is likely after a bounce.<p>Today is the last day of the month. Therefore, monthly support and resistance can be important. The targets are the June high of 2796.00 and the March high of 2811.00. If the Emini is within 5 points of either in the final hour or two, it will probably get drawn to the magnet for a test.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 7 points in the Globex session. It will therefore be an attempt at a major trend reversal up after yesterday’s late higher low. Major trend reversals have a 40% chance of leading to an opposite trend. More often, they lead to a trading range.<p>The 2 day selloff on the 60 minute chart was in a tight bear channel. But, it so far has formed a higher low. The bulls will try to retrace about half of the selloff today and tomorrow. However, since the 60 minute bear channel was tight, the odds are that the 1st reversal up will fail and lead to at least a test back down. Day traders expect a weak 1 – 3 day rally and then a test back down to yesterday’s low.<p>If the 2 day selloff turns out to be a resumption of the February bear trend, the selling can be relentless over the next week. This is unlikely. More likely, the Emini went up big last week and then down big for 2 days. This creates confusion, which usually means the Emini will be sideways for a few days. Tomorrow’s FOMC announcement is another reason for the Emini to begin to get neutral today.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/Emini-sell-climax-and-strong-minor-reversal-up.png\"><img src=\"2018-7-31.png\" alt=\"Emini sell climax and strong minor reversal up\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex bull breakout above triangle ahead of FOMC meeting</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/EURUSD-Forex-bull-breakout-above-triangle-ahead-of-FOMC-meeting-1.png\"><img loading=\"lazy\" src=\"2018-7-31-1.png\" alt=\"EURUSD Forex bull breakout above triangle ahead of FOMC meeting\"></a><p class=\"caption\">The EURUSD daily Forex chart is breaking above the bear trend line at the top of the 2 month triangle. Most breakout attempts fail, and there is other resistance above at the July 9 and June 14 highs.<p><br>Today so far is the 3rd consecutive bull trend day on the EURUSD daily Forex chart. If today closes near its high, it will be a breakout above the 2 month bear trend line. However, the chart is still in a trading range. The bulls need consecutive closes above the June 14 high before traders will conclude that a bull trend is underway.<p>Look back at all of the many legs up and down over the past 2 months. Each has failed, no matter how strong the bars were. My 80% rule says that 80% of trading range breakout attempts fail. All trading ranges eventually break into trends. However, most attempts fail. Consequently, while the past 3 days are good for the bulls, the rally is still more likely just a bull leg in the trading range than the start of a bull trend.<p>Because the chart has been at the apex of the triangle for the past week, a breakout attempt has been likely. Consequently, the bulls have a higher probability of success here. But, until there is a strong breakout above the June 14 high, the odds are that this 3 day rally will fail either around the July 9 high or the June 14 high.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart has rallied 130 pips in a bull channel for 3 days. However, that is not especially strong. Furthermore, it is now at the top of a 3 week tight trading range. In addition, the uncertainty over tomorrow’s FOMC announcement will likely lead to hesitation today. Therefore, the 3 day rally will probably stall here and today will likely enter a trading range.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/Emini-bull-trending-trading-range-day-ahead-of-FOMC-meeting.png\"><img loading=\"lazy\" src=\"2018-7-31-2.png\" alt=\"Emini bull trending trading range day ahead of FOMC meeting\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>The Emini rallied from a wedge bull flag on the open. However, yesterday was a strong bear day on the daily chart. As was likely, there were sellers above yesterday’s high. The Emini spent the 2nd half of the day in a weak bear channel.. After testing the open and the top of the lower trading range, it reversed up to test the high at the close. It is in the middle of the 2 day selloff. That makes it neutral ahead of Wednesday’s FOMC announcement.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-7-31"
    }
  ]
}