{
  "3": [
    {
      "data": [
        "<article class=\"post-76088 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Fed rate hike plan caused wedge lower high major trend reversalEmini weekend update: March 3, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Fed rate hike plan caused wedge lower high major trend reversal<br>Emini weekend update: March 3, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-03-03T00:30:02-08:00\">March 3, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>March will probably be an inside bar on the monthly chart</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/03/m-1.png\"><img loading=\"lazy\" src=\"2018-3-3.png\" alt=\"The monthly Emini chart has a bear inside bar after a a buy climax.\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart opened in the middle of February’s range. Since February was huge, the odds are that March will form an inside bar.<p>The monthly S&amp;P500 Emini futures candlestick chart had a huge bar in February. In addition, February closed in its middle third. That means that February’s high is far above and its low is far below. Consequently, March will have a difficult time reaching either. As a result, March will probably form an inside bar on the monthly chart.<p>February was the 1st pullback in a 15 month bull micro channel. That is an extreme buy climax. Yet, buy climaxes usually lead to pause in the trend and not a reversal. Consequently, the downside risk over the next few months is not great. There is only a 20% chance of a major reversal without the bears first getting at least a micro double top.<p>Furthermore, once there is a pullback in a bull micro channel, the odds are that the bull trend will resume at least a little within 3 bars. This means that the bulls will probably get a test of the January all-time high within a few months.<h4>Will 2018 be a down year?</h4><p>Because the 15 bar micro channel is the most extreme in the 100 year history of the stock market, the Emini might go sideways all year before the bulls recover from their exhaustion. If the Emini is sideways all year, there will be 50% chance that 2018 will be a down year. This is because, if it is sideways, the December 2017 close will probably be in the middle of the range. Since a sideways market is neutral, there would be about a 50% chance that the year would close above its middle and a 50% chance it would close below.<p>This hinges on 2018 being sideways all year. At the moment, the odds still favor at least one more new all-time high. But, the February selloff was extreme enough to tell us that the bears are strong. Consequently, the bulls will be less willing to buy at a new high.<p>This will probably limit how high any rally will go this year. Instead, that strong selling increases the chances of a lot of confusion about whether the bulls are still in control. As a result, the odds favor a lot of trading range trading for many months and possibly all year.<br><h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Failed ii bull flag</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/03/w-1.png\"><img loading=\"lazy\" src=\"2018-3-3-1.png\" alt=\"The weekly Emini chart is still on its buy signal from the ii bull flag.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart broke above consecutive bull inside bars this week. Yet, it sold off to below last week’s low, forming an outside down bar on the weekly chart. However, the tail on the bottom of the bar weakens the bear case.<p>The weekly S&amp;P500 Emini futures candlestick chart traded above last week’s high and then below its low. Hence, this was an outside down week. That is a sign of strong bears. However, on Friday, the bulls got back up to last week’s low. This significantly weakens the outside down bar.<p>After 65 consecutive weeks without touching the 20 week EMA, the bulls had a 20 Gap Bar buy setup. However, the 65 week streak was the longest streak in the history of the stock market. Consequently, the bulls are exhausted. They therefore are less willing to buy, even with a good buy signal.<h4>ii bull flag</h4><p>The past 2 weeks formed an ii (consecutive inside bars) breakout mode pattern, and both bars closed on their highs. Last week was therefore a good buy signal bar. Yet, there were more sellers than buyers above last week’s high. This week’s outside down bar was a terrible entry bar for the bulls who bought above last week’s high.<p>Technically, this week was not enough for the bulls to exit their buy above the ii. The stop for those bulls is below the low of both ii bars. This week only traded below the 2nd, but not the 1st. It is therefore reasonable for the bulls who bought above last week’s high to continue to hold long.<p>If the coming week is a bull inside bar, it would become a 2nd buy signal bar. That would increase the probability of a rally back up to the old high.<h4>Outside bar often leads to an inside bar</h4><p>An outside bar is a relatively big bar. There is therefore an increased chance of a smaller bar next week. Furthermore, because the past 4 weeks have been sideways, the weekly chart is in a tight trading range. All markets resist change. This, therefore, increases the chances of next week continuing the tight range.<p>Since tight trading ranges are likely to keep adding bars, it is more likely that next week will continue the tight trading range. In addition, outside bars in tight trading ranges often lead to inside bars. There is therefore an increased chance that next week will not break below this week’s low or above its high.<p>If the bulls can prevent the bear breakout, the weekly chart would have a breakout mode setup for the following week. If next week is a bull bar, that would be another buy signal bar on the weekly chart. The odds still favor a test of the all-time high rather than a break below the February low.<h4>Will this be a Spike and Channel Bear Trend?</h4><p>The bears want the 2 week collapse in early February to be a spike that leads to a channel down for the next several months. This week in consistent with that, but the bears need strong follow-through selling next week before traders will conclude that the weekly chart is in a bear trend. More likely, it is in a trading range. However, the odds are that it will trade sideways for a few more weeks before it resumes back up to the all-time high.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Fed rate hike plan caused wedge lower high major trend reversal</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/03/d.png\"><img loading=\"lazy\" src=\"2018-3-3-2.png\" alt=\"The daily Emini chart will probably have a 2nd leg down before resuming up to a new all-time high.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart sold off this week from a wedge lower high major trend reversal. However, it rallied strongly on Friday back up to last week’s low. The reversal will probably be minor.<p>The daily S&amp;P500 Emini futures candlestick chart sold off strongly this week from a wedge rally. A wedge reversal typically has at least a 2nd leg down. Therefore, the bears will sell any 2 – 3 day rally next week, knowing that it will probably reverse back down for a 2nd or 3rd leg.<h4>Bounce, then one more leg down before bull resumes</h4><p>While this is a major trend reversal setup, 60% of major trend reversals evolve into trading ranges. That is what is likely here. The bull trend should resume within a month or so. The Emini will probably make a new high within a couple of months. However, this selling has been severe, and it will might limit the extent of any rally for the remainder of the year.<p>Friday is a buy signal bar for next week. Yet, it followed 3 strong bear bars. Therefore, it is a weak buy setup. This is true even though the odds favor a new all-time high within 2 months. The bulls will probably need a micro double bottom before the bull trend resumes up to the old high. In addition, the wedge lower high will probably have a 2nd led sideways to down after any reversal up next week.<p>The monthly chart is in a strong bull trend. It is unlikely to sell off for more than 3 months before testing the all-time high. Consequently, the selloff on the daily chart will probably last another month or two. Is it in a bear trend on the daily chart? No. It is in a trading range where the legs up and down are huge. The odds favor a new all-time high within a month or two.<h4>Test of the February low?</h4><p>The odds are that any remaining correction will stay above the February low. But, even if the bears get a break below that low, the bear breakout will likely fail. This is because the bull trend on the monthly chart is strong, and there has been no credible top on that chart.<p>Furthermore, the two reversals up this month were exceptionally strong. They therefore constitute a small double bottom in a 10% correction.<a href=\"https://www.brookstradingcourse.com/analysis/emini-has-ii-breakout-mode-pattern-on-weekly-chart-after-fomc/?doing_wp_cron=1519950033.8443470001220703125000\" rel=\"noopener\" target=\"_blank\">In last week’s report,</a>I said that as strong as the 3 week rally was, it was likely to form a wedge lower high. I showed that on the figure of the daily chart.<h4>The importance of a double bottom</h4><p>When there is a strong selloff, the bulls usually want to see a test of the low before they will buy and hold for a new high. They want to see the bears make two strong attempts to create a bear trend and fail twice. This week’s reversal down created a lower high. The bulls want the selloff to reverse up either now or within 2 – 3 weeks from a lower test of the February low.<p>The odds are that this week’s selloff will be the 1st leg down in a 2 legged sideways to down pullback from the 3 week rally. The Emini will probably bounce next week for a few days and then have a 2nd leg down. There might be a third leg, which would form a wedge bottom.<p>In either case, the odds are that it will form a higher low compared to the February low. The bulls would see a reversal up at that point as a double bottom and a successful test. If the bears fail twice, the odds of the bull trend resuming are greater. The bulls would be more confident that they can beat the bears. The Emini would then have a better chance of rallying up to the all-time high over the next couple of months.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-3-3"
    }
  ],
  "10": [
    {
      "data": [
        "<article class=\"post-76324 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini has an ioi High 2 bull flag on the weekly chart Emini weekend update: March 10, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini has an ioi High 2 bull flag on the weekly chart<br>Emini weekend update: March 10, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-03-10T00:30:00-08:00\">March 10, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Bull inside bar in strong bull trend</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/03/m-2.png\"><img loading=\"lazy\" src=\"2018-3-10.png\" alt=\"Emini monthly chart is bull flag after unemployment report.\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has traded sideways for 2 months after 15 months where every low was above the low of the prior month. This month so far is a bull inside bar closing on its high. However, this 2 month pullback might last at another month or two before there is a test of the high.<p>The monthly S&amp;P500 Emini futures candlestick chart is inside of February’s range, which was huge. The odds are that March will remain an inside bar. If so, it will be a buy signal bar for April. The probability of a rally in April will be greater if March closes on its high.<p>While an inside bar after a big bear bar is also a sell signal bar, the odds are against a bear trend. Typically, the 1st pullback in a bull micro channel lasts only 1 – 3 bars. Then, the bulls create a rally that tests the old high.<p>Therefore, if April triggers the sell signal by falling below March’s low, the sell signal will likely fail. The odds are that there will be more buyers than sellers below March’s low. This is because April would be the 3rd month in the pullback from January’s high.<p>Remember, the 1st pullback from a micro channel typically lasts 1 – 3 months. Therefore, the odds are against a 4 – 6 month correction. In addition, there is only a 20% chance of a bear trend on the monthly chart without at least a micro double top. That would require a test of the January high, which would probably take at least another 1 – 3 months.<br><h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Emini has an ioi High 2 bull flag on the weekly chart</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/03/w-2.png\"><img loading=\"lazy\" src=\"2018-3-10-1.png\" alt=\"Weekly Emini chart has an ioi bull flag and an ii bull flag and a 20 gap bar buy setup.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart formed an inside bar after last week’s outside bar. This is an ioi (inside-outside-inside) pattern. Since it is the 1st pullback to the 20 week exponential moving average in over a year, the odds favor a bull breakout.<p>The weekly S&amp;P500 Emini futures candlestick chart sold off sharply in February. The selloff fell below the 20 week EMA for the 1st time in over a year. Hence, the bulls were willing to buy above the average price for a long time. They are now getting an opportunity to buy down at the average price.<p>However, the 2 week selloff was extreme. Consequently, the bulls are uncertain about whether there might be a 2nd or 3rd leg down. If they can prevent another strong selloff, the bears will buy back shorts. Furthermore, the bulls will begin to buy. This will lead to a rally back up to the January high.<h4>ioi Breakout Mode pattern after an ii bull flag 2 weeks ago</h4><p>Last week traded above and below the prior week’s range. That prior week was therefore inside of last week, and last week was outside of it. Consequently, last week was an outside week.<p>This week is within last week’s range. Hence, it is an inside week after an outside week. This is therefore an ioi pattern, which is a Breakout Mode setup. Because it closed on its high, it is a higher probability buy signal bar than sell signal bar for next week.<p>The bull trend is strong. This is the 1st pullback to the 20 week EMA in over a year. The ioi is just above the 20 week EMA, and it is therefore a bull flag. In addition, this week has a bull body. Furthermore, the ii from 2 weeks ago had 2 good bull bodies. All of this increases the odds of a bull breakout.<p>Last week was a bear bar, but it was also the entry bar for the breakout above the 2 week bull ii pattern of the 2 prior weeks. The stop for the bulls is below the 1st of the 2 inside bars. Since last week only traded below the 2nd bar and not the 1st, the weekly chart is still on that buy signal.<p>If next week goes above this week’s high, it would be an entry bar for a 2nd buy signal. It would therefore be a breakout of a High 2 bull flag in a bull trend. That is a reliable buy setup.<h4>Tight trading range so lower probability for stop orders</h4><p>This week was a very big bar. This means that bulls will be buying next week above the top of a 5 bar tight trading range. The bars are big so the risk is big. Therefore, the risk/reward is less.<p>Also, a tight trading range is a limit order market. This means that in general, it is easier to make money buying below bars and selling above than entering with stops. Hence, buying with a stop above is lower probability. Consequently, while the buy sign is still good, it is less desirable than if this week was smaller.<h4>Will a rally reach a new high?</h4><p>Because the weekly chart is in a pullback in a strong bull trend, a test of the high is more likely than a bear trend. However, the early February selloff was unusually strong. After a Big Up January and a Big Down February, there is Big Confusion. Traders are uncertain if the Emini is about to resume up or sell off further.<p>When there is confusion, the Emini usually tests up and down. This is an attempt to determine if the bulls or bears are stronger. After such a strong selloff, many traders do not feel confident that the bulls have back taken control. That means that the trading range will probably continue for a few more weeks.<h4>What about the High 2 bull flag?</h4><p>It could easily trigger next week and lead to a 50 point rally, but then stall below the old high. A reversal down at that point could last several more weeks. The bears might drive the Emini down to around 2600. Yet, the odds still favor a new high before a break below the February low.<p>If there was a strong selloff to around the February low, the odds are that traders would buy it. They will buy it even if it breaks below the February low. This is because the monthly chart is in a strong bull trend. Consequently, the correction will probably not get much more than 10%.<p>Yet, it could grow in terms of time. A chart is made of price and time, and a pullback is a combination of both. The odds still favor a test of the old high within a couple of months. There is only a 30% chance of a bear trend on the weekly chart without first a test of the high.<h4>Island bottom?</h4><p>The Emini gapped down on the weekly chart 5 weeks ago. While the gap closed that week, the bodies of the gap down bar did not overlap the body of the week before. That is a type of negative gap, and it is still a sign of strong bears. If next week gaps up, that would create a variation of an island bottom. That is a sign of strong bulls. However, it is not especially significant.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Wedge top, but may get one more leg up</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/03/d-1.png\"><img loading=\"lazy\" src=\"2018-3-10-2.png\" alt=\"The daily Emini chart is forming a double top at a wedge top , but the odds favor a new all-time high.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart turned down from a wedge top last week. However, the 6 day rally has been strong. Therefore, last week’s selloff might be a pullback from a 2nd leg up in a bigger wedge. If so, the current rally will go above last week’s high before turning down from a bigger wedge.<p>The daily S&amp;P500 Emini futures candlestick chart has a wedge top. However, the 6 day rally has been strong. Therefore, rather than last week being the 1st of 2 legs down from a wedge top, it might be a pullback from the 2nd leg up in a bigger wedge.<p>This is especially true because the weekly chart has a buy setup going into next week. If that buy signal triggers next week, which is likely, the Emini will probably rally for 1 – 3 weeks. In addition, it will then go above last week’s high. If it turned down at that point, it would create a larger wedge lower high on the daily chart.<h4>Wedge tops usually lead to 2 legs sideways to down</h4><p>A correction down from a wedge rally typically has at least 2 legs down. In addition, the correction usually has about half as many bars as there were in the wedge. The current correction from the February wedge has fewer bars than what was likely, given the number of bars in the wedge. Also, the 6 day reversal up was stronger than the usual bounce up after a 1st leg down.<p>Given the buy signal on the weekly chart, it is now more likely that the 2 week rally is the 3rd leg up in a bigger wedge than a bounce from the 1st of 2 legs down from last week’s wedge top. This means that the rally will probably continue up to above last week’s high. It will probably test the February 27 high of 2794.75. This is the top of the wedge on the daily chart. If the bears can reverse the Emini at that point, there will be a 60% chance of a two legged pullback lasting 2 – 4 weeks.<h4>March 2 major higher low</h4><p>The March rally has been strong. The March 2 higher low of 2652.00 is therefore a major higher low. If there is a selloff from around the February 27 high, it will probably form a double bottom with the March 2 low.<p>The bulls would see this as a double bottom higher low. The 2 reversals up in February were exceptionally strong. In addition, the monthly chart is in a strong bull trend. These factors make it more likely that the bull trend would resume up at that point to the all-time high than sell off to below the February low.<p>In conclusion, while the February selloff was strong, it probably has ended. If there is a strong leg down, it will probably form a double bottom with the March 2 low. Then, there will probably be a rally up to the all-time high.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-3-10"
    }
  ],
  "17": [
    {
      "data": [
        "<article class=\"post-76458 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini double top pullback after tariff threats and Congressional defeatEmini weekend update: March 17, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini double top pullback after tariff threats and Congressional defeat<br>Emini weekend update: March 17, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-03-17T00:30:25-07:00\">March 17, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Inside bar after sharp pullback</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/03/m-3.png\"><img loading=\"lazy\" src=\"2018-3-17.png\" alt=\"Monthly Emini chart in pullback before FOMC meeting.\"></a><p class=\"caption\">The March bar on the monthly S&amp;P500 Emini futures candlestick chart has a high below the February high and a low above the February low. It is therefore so far a small inside bar.<p>The monthly S&amp;P500 Emini futures candlestick chart has an inside bar so far for March. It is far from last month’s high and low. Therefore, it will probably end the month as an inside bar. The open of the month is in the middle of the range, and in the middle of February’s range. After last month’s big selloff and January’s big rally, traders are uncertain. Uncertainty usually leads to a trading range.<p>The Emini might end the month as neutral as possible. If it closes at the open, it will be a doji inside bar in the middle of February’s range. That would be the maximally neutral appearance for the month.<h4>An inside bar is both a buy signal and a sell signal</h4><p>The bulls would like the month to close near its high. An inside bar in a bull trend is a buy signal bar. It will have a higher probability of leading to a rally if it closes near its high.<p>The bears want the month to close near its low. It would therefore be a bear inside bar. Even though February was a climactic reversal down, it was a minor reversal. Therefore, even if March closes on its low, it would be a minor sell signal. After 15 months without a pullback, this 2 month pullback will probably last 3 – 4 months. The bull trend should then test the January high.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Low 2 bear flag.</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/03/w-3.png\"><img loading=\"lazy\" src=\"2018-3-17-1.png\" alt=\"Weekly Emini has Low 2 lower high.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart had a bull inside bar last week, which was a buy signal. Three weeks earlier, there were consecutive bull inside bars, which was also a buy signal. Both buy signals triggered, but the Emini immediately reversed down after breaking above the bull inside bars.<p>While the bulls are still long from both buy signals, the signals are likely to fail. Most bulls will exit next week below this week’s low or below the low of the ii from 3 and 4 weeks ago. This is because when the Emini tries to do something twice and fails, it usually then tries to do the opposite. Consequently, if next week trades below this week’s low or below the ii, it would trigger a sell signal.<p>Since the weekly chart is still in a bull trend, any sell signal is minor. This makes a bear trend unlikely. However, it could lead to a test of the low of the ii from 4 weeks ago. Less likely, the selloff could test the February low. Any reversal down next week would extend the trading range for several more weeks.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Emini double top pullback after tariff threats and Congressional defeat</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/03/d-2.png\"><img loading=\"lazy\" src=\"2018-3-17-2.png\" alt=\"Daily Emini chart has double top bear flag\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart broke above the February 27 major lower high, but immediately reversed down. Traders are deciding if the reversal will lead to a test of the March 2 low or if it is just a pullback that will lead to a new all-time high.<p>The daily S&amp;P500 Emini futures candlestick chart is reversing down from above the February 27 high. This is in part due to Trump’s tariff threats and this week’s loss of a republican congressional seat. The bears see this week’s high as forming a double top with the February 27 high.<p>Since the double top is following a strong reversal down in early February, it is a double top major trend reversal. A strong major trend reversal has only a 40% chance of leading to a reversal into a bear trend. Because the 2 reversals up in February were extremely strong, this major trend reversal has only a 30% chance of being the start of a bear trend.<p>More likely, it is a minor reversal in a 2 month trading range. While the trading range can continue indefinitely, it will probably end with a bull breakout within a couple of months. This is because the monthly bull trend is so strong.<h4>Bear trend unlikely</h4><p>The bears want this week’s selloff to be the start of a move down to the March 2 low and then the February low. There is only a 30% chance of a strong break below the February low. However, there is a 50% chance of a test down to the March 2 low before a test of the all-time high.<p>If the bears succeed in testing the March 2 major higher low, the odds are that the bulls will get a reversal back up from there. That would be a double bottom bull flag. If the rally is strong, the odds would favor a test of the January all-time high.<h4>Wednesday’s FOMC announcement</h4><p>The Emini will probably be sideways going into Wednesday’s 11 a.m. FOMC announcement. There will probably not be a surprise. However, an FOMC meeting always has an increased chance leading to a big move up or down. Furthermore, the breakout can be strong enough to have follow-through for a couple of weeks.<h4>March and April are seasonally bullish</h4><p>Calendar tendencies are always minor. Traders should never place trades based on them because it is a losing strategy. However, March and April are the 2 consecutive months with the highest average return. Therefore, there is a slight bullish bias through April.<p>Far more important is the 15 bar bull micro channel on the monthly chart. The odds are that the 1st pullback will last only 1 – 3 months. March is the 2nd month. Consequently, no matter what happens after the FOMC announcement, the odds are that the Emini will test its old high by the end of April.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noopener\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-3-17"
    }
  ],
  "24": [
    {
      "data": [
        "<article class=\"post-76584 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Trump’s China tariffs causing Emini selloff to test February lowEmini weekend update: March 24, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Trump’s China tariffs causing Emini selloff to test February low<br>Emini weekend update: March 24, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-03-24T00:30:11-07:00\">March 24, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Bear inside bar, but minor reversal down</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/03/m-4.png\"><img loading=\"lazy\" src=\"2018-3-24.png\" alt=\"Emini monthly chart has strong reversal down after buy climax and Trump's tariff trade war with China\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart on the right has a bear inside bar so far this month. Since the bull trend is strong, the selloff will more likely form a bull flag than a bear trend. However, compare it to the 1987 chart of the S&amp;P500 cash index during the 1987 Crash. Both charts had strong bull trends. Bulls were buying for any reason, including buying closes. The bulls who bought the highest close were disappointed by the bear bar that followed. They decided to exit on the next bar. You can see that the bar reversed down once it got near the highest close. The bulls were so desperate to get out that they were willing to sell with a loss to avoid a bigger loss. Those who did not take the opportunity to exit sold out this week, creating a big bear bar.<p>The monthly S&amp;P500 Emini futures candlestick chart is still in a bull trend, despite the 3 month pullback. Since the selling has been extreme, the bulls may need several more months before they can regain control. After 15 months without a pullback, the odds are this 3 month selloff is just a bull flag. The bears only have a 20% chance of a bear trend when a bull trend is strong and there is no credible top. At a minimum, they usually need at least a micro double top. Consequently, the downside risk is small, although the selloff still might test the February low, and it might last a few more months.<h4>Comparison with 1987 Crash</h4><p>In the figure above, you can see some similarities between the monthly chart of today and that of the 1987 Crash. Can the stock market crash again without a strong reason? Well, that is what happened in 1987, so why not? There was no good reason, yet the stock market fell almost 25% in one day. There was also a Flash Crash in 2010 when the market lost 6% in 35 minutes. Black Swans are real, and they will happen several times in your trading career. No one knows what he does not know. Yet, everyone needs to know that there are things that are impossible to know, and they are extreme.<p>The market never needs a reason to crash or to do anything. This is because most of the movement, even on the monthly chart, is controlled by computer algorithms. Most are trading technically, and not trading based on fundamentals.<h4>What happened in 1987?</h4><p>There are some important differences between now and 1987. Back then, I was trading back, unlike most of the experts on TV. I didn’t have to read about it to understand what took place. I was there, trading that day.<p>On the Monday morning of the crash, I shorted heavily just after the open. However, the stock market rallied early and I had a full surgery schedule. I closed out my shorts for a small loss.<p>As I drove to work, the Crash began. During my 40 minute drive, CBS News radio in Los Angeles said that the stock market was falling so fast that no one knew how far it had fallen. Furthermore, no one knew the current price of any major average. The computers could not keep up. It was not until the market closed that the exchanges were able to determine the final numbers. The markets lost from 20 – 25%.<h4>The 1987 Crash felt different</h4><p>Something strange happened back then, and I doubt that I can adequately describe it. It is like trying to describe a smell. On the Friday before the Crash, I had a eerie felling that something terrible was going on. I felt that no one was in control of the markets and that no one understood what was happening.<p>Today, everyone has a reasonable level of confidence that the Fed, the exchanges, and the major financial institutions are in control. In addition, there is much more confidence in the computer engineers who designed and maintain the economy’s hardware and software.<p>That was not the case in 1987. It felt like no one was in control on the Friday before the Monday Crash. Moreover, I felt like the market was going to fall sharply. There was no sense that someone was aware of it and that they had a plan. There was no plan.<h4>Where do huge selloffs end?</h4><p>I want to make one final point about all huge selloffs. They all stop at monthly support. Look at the monthly charts of 1987 and 2008. The institutions bought heavily at the monthly bull trend lines.<p>Where is the major support now? It is at the bottom of the 2014 and 2015 trading range at 1800. I believe the market will get there at some point in the next 5 – 10 years. There is only about a 10% chance of it getting there now without at least one new all-time high first. Even then, the odds are that it will not happen this year<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Strong sell entry bar</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/03/w-4.png\"><img loading=\"lazy\" src=\"2018-3-24-1.png\" alt=\"Weekly Emini chart has strong breakout below Low 2 bear flag after Trump hired Bolton and after FOMC.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart had a Low 2 sell signal last week. This week gapped down to trigger the sell. Furthermore, it was a big bear bar. It will probably test the February low within a week or two.<p>The weekly S&amp;P500 Emini futures candlestick chart formed a strong entry bar this week, triggering a Low 2 sell signal. The bears want a strong 2nd leg down from the 2 week selloff in early February.<p>On the other hand, the bulls know that the odds are against a bear trend since the yearlong bull trend was so strong. However, they twice triggered buy signals over the past month. Both failed. When the market tries something 2 or more times and fails, it usually tries the opposite direction.<p>That explains the past 2 weeks. What traders do not yet is whether this 2 week selloff is the start of a bear trend or simply a leg in the trading range. Because the 2017 bull trend was strong and there was no clear top, the weekly chart is probably forming a lengthy bull flag. The damage this week is significant. Yet, the odds are that there will be a rally to a new high by this summer. The bears need a strong break below the February low before traders will conclude that the weekly chart is in a bear trend.<h4>A 2nd leg down can be a big, fast 2nd Leg Trap</h4><p>More likely, a break below the February low will not last more than a few weeks. A second leg down is often very big and fast. The bears hope that it is a breakout into a new bear trend. There is a small chance that the Emini might fall far below the February low.<p>Yet, if it did, the breakout would probably fail. Furthermore, once the bears realized that they were trapped, the rally up could be violent. This type of a failed bear breakout where the 2nd leg strongly breaks below support, but then reverses sharply, is a 2nd Leg Trap.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Trump’s China tariffs causing Emini selloff to test February low</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/03/d-3.png\"><img loading=\"lazy\" src=\"2018-3-24-2.png\" alt=\"Emini daily chart has strong breakout and follow-through below neck line of double top lower high major trend reversal, and might test the February 9 bear trend low.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart broke strongly below the neck line of a double top on Thursday. The strong follow-through selling on Friday makes lower prices likely. If there is a reversal up next week, it would form an expanding triangle that began with the February 16 high.<p>Despite the strong 2 week selloff, the daily S&amp;P500 Emini futures candlestick chart is still in a 2 month trading range. The past 2 days were big bear trend bars closing on their lows. This is now a confirmed break below the March 2 low. That increases the chance of at least slightly lower prices next week. The selling was so strong this week that it will probably result in lower prices for several weeks. There is now a 60% chance that the Emini will fall below the February low. However, there is only a 30% chance of a 20% correction. The odds are that the Emini will reverse up from around the February low within a couple of months.<p>Because at least 1 more leg down is likely, traders will sell the first reversal attempt. Therefore, there will probably be at least a small 2nd leg down.<p>Since the selloff has been strong, the Emini will probably have to transition into a 1 – 2 week trading range or double bottom before the bulls can regain control. This will probably take at least several weeks.<p>However, there is a 30% chance that the correction will end within a week or two. A successful reversal up would be from an Expanding Triangle that began with the February 16 high, and from a double bottom with the February low.<h4>Sell vacuum test of support, or actual bear breakout?</h4><p>There are 2 possible reasons why this week sold off strongly. The obvious one is that the Emini might be entering a bear trend. The more likely reason is that traders now believe that the Emini will test the February low. If you are a bull, why buy now if you think the Emini will fall another hundred points? The absence of buyers at the current price causes the market to get vacuumed down to support, where there are probably many buyers.<p>If you are a trader who is bearish, you don’t care if this is the start of a bear trend. All you need to know is that the Emini is falling quickly toward support. You therefore sell because the Emini will likely get closer to support, allowing you to make money.<p>You know there are no buyers here, but there might be many down at and below the February low. That means the market is getting vacuumed down to support where the next group of big buyers will buy. Because a sell vacuum is a quick test of support, once the Emini reaches that support, many bears buy back their shorts.<p>If there are many institutions waiting to buy lower, down at support, they, too, will buy. The result of the bears buying back their shorts and the bulls buying aggressively, believing the market is now cheap, is often a very sharp rally. The bear breakout fails and last year’s bull trend resumes strongly.<p>More likely, after this much selling, the bulls will probably need several small reversals up before traders think that the selling has ended. Consequently, it will probably take 1 – 2 months before there is a credible bottom.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-3-24"
    }
  ],
  "31": [
    {
      "data": [
        "<article class=\"post-76715 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini monthly chart should reverse up in April from February lowEmini weekend update: March 31, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini monthly chart should reverse up in April from February low<br>Emini weekend update: March 31, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-03-31T00:30:16-07:00\">March 31, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Emini monthly chart should reverse up in April from February low</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/03/m-5.png\"><img loading=\"lazy\" src=\"2018-3-31.png\" alt=\"Emini 2 month pullback at 2600 in strong bull trend\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart had a bear inside bar in March after February’s big bear bar. Both bars have big tails below, which is a sign that the selling is not as strong as it could be. This is a 2 bar pullback in a strong bull trend.<p>Because the monthly S&amp;P500 Emini futures candlestick chart had a Big Up move last year and a 2 month Big Down move this year, there is now Big Confusion. There is only a 30% chance of a 20% correction at this point. However, traders do not know if the current correction has reached its bottom. There is no sign yet on the monthly chart. Confusion is a hallmark of a trading range. Consequently, there is a 50% chance that the monthly chart will continue sideways for 6 months or more.<p>While the monthly chart is in a strong bull trend, the past 2 months have had big bear bars. Since February and March have big tails below and both are in a strong bull trend, March is a weak sell setup. Yet, the 2 big bear bars make it likely that traders need to find out if the bears can get another leg down.<p>There is therefore at least a 50% chance that April will trade below March’s low. If it does, April will probably reverse up from around the February low. Less likely, it will test below the 20 month EMA to around 2400.<h4>Possible ii bull flag</h4><p>Alternatively, April will not fall below March’s low. If that is the case, April will probably be a bull bar. If so, it would likely be inside of March, which is inside of February. Hence, April would then be an ii bull flag (consecutive inside bars). May would then probably trade above April’s high, triggering the buy signal. That would probably lead to a new all-time high in May or June.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>No follow-through selling, but 50% chance of test of February low</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/03/w-6.png\"><img loading=\"lazy\" src=\"2018-3-31-1.png\" alt=\"Emini weekly chart has bad follow-through selling after Low 2 bear flag\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart has been sideways for 2 months. There is both a lower high double top and a higher low double bottom. Consequently, it might be forming a triangle.<p>The weekly S&amp;P500 Emini futures candlestick chart formed a bull doji this week after last week’s big bear bar. This is a lack of follow-through selling and it reduces the chances of much lower prices. However, the odds favor at least a small 2nd leg down after the big selloff 2 weeks ago. Because there is no strong top and the chart has been in a strong bull trend, the 2 month trading will probably have a bull breakout.<p>A trading range always has both a buy and a sell setup. The bears have a lower high major trend reversal. That is a type of double top. The bulls, however, see a double bottom bull flag. Since the legs up and down have been strong, there is an increased chance of additional legs. If there is a rally to a lower high, the trading range will be a triangle.<h4>Small chance of bear trend</h4><p>Changing the name of the trading range to a triangle does not change the probabilities. The odds still favor a resumption of the bull trend instead of a reversal into a bear trend. Yet, the February selloff was exceptionally strong. There is therefore a 50% chance of the current 2nd leg down falling below the February low. If it does, the odds are that the bear breakout will fail and the bull trend will then resume.<p>There is a 30% chance of a big breakout below that February low. A Leg 1 = Leg 2 measured move would be to around 2450. There is a 20% chance of a measured move down based on the 300 point height of the February selloff. That would test the top of the 2014 – 2016 trading range, just below 2200.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Bear flag at 200 day moving average support</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/03/d1-2.png\"><img loading=\"lazy\" src=\"2018-3-31-2.png\" alt=\"Daily Emini is testing 200 day moving average and has bear flag and micro double bottom.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart is in a 5 bar tight trading range, which always has both a buy setup and a sell setup. Thursday’s reversal up was a small bull bar with a tail on top. This is weak buying, and it followed a bear bar. That is a weak buy setup, and it therefore makes a bear breakout more likely. The bulls want a reversal up from an expanding triangle above the 200 day moving average.<hr><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/03/d2-1.png\"><img loading=\"lazy\" src=\"2018-3-31-3.png\" alt=\"Emini forming wedge bottom and measured move down\"></a><p class=\"caption\">This is the same daily chart, but it shows measured move targets. If the Emini breaks below the small bear flag, it will probably fall for a measured move down. A reversal up from a move based on the height of the 5 day small trading range would create a lower low (green line) double bottom with the February low. In addition, that would be a wedge reversal (pink lines). There is a 30% chance of a 300 point measured move down to around 2350 (gold line).<p>The daily S&amp;P500 Emini futures candlestick chart reversed up strongly from the 200 day moving average in February. While it is testing it again, the bulls have been unable to create a strong reversal up this time. This means that the bulls are not strong, and the chart looks “heavy.” Therefore, the 5 day tight trading range is more likely a bear flag than a micro double bottom.<p>Since the monthly chart is in a bull trend, any selloff on the daily chart will probably end within a month. The odds are that there will be a reversal up to a new high within a few months. However, the bulls do no yet have a high probability bottom. Furthermore, the momentum down favors a test of the February low within a week or so. If the bulls fail to get a credible bottom at that point, the next target is below 2400.<p>Even without a strong buy signal bar, the bulls can begin a trend up to a new all-time high at any time. They would need at least 2 consecutive big bull days before traders would conclude that the reversal up has begun.<h4>Measured move targets for the bears</h4><p>Unless the daily chart reverses up strongly next week, the odds are that it will break below the 200 day moving average. If so, traders will look for a measured move down.<p>The first target would be an 80 point selloff based on the height of the 5 day tight trading range. That would result in a test of the February low. A reversal up from there would be a double bottom with the February low. Furthermore, it would be a wedge bottom with the March 2 and March 23 lows.<p>If the selloff breaks far below the February low, the next measured move target is around 2500. That is a measured move based on the February 27 and March 13 double top.<p>The final measured move target from a strong breakout below the 5 day range is from the March 13 high to the March 23 low. That is around 2350.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-3-31"
    }
  ]
}