{
  "1": [
    {
      "data": [
        "<article class=\"post-86244 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini breakout above December sell climax highIntraday market update: Friday February 1, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini breakout above December sell climax high</strong><br>Intraday market update: Friday February 1, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-02-01T06:20:50-08:00\">February 1, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini breakout above December sell climax high</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini yesterday broke above several important resistance levels yesterday. The first was the December 12 high. That was the top of the December stock market crash. It also broke above the 2017 close, which was the most important magnet in 2018. The Emini oscillated around it all year. Finally, it broke above the 2,700 Big Round Number.<p>It pulled back in the middle of the day, but closed on the high. Traders are deciding if the rally will continue up to the November high around 2,800, or begin a 50% pullback. The pullback is more likely, but there is no credible top yet.<p>The Emini is in the sell zone on the daily chart. The bulls will begin to take profits and look to buy again low. In addition, the bears will begin to sell here and higher.<p>Today is Friday so weekly support and resistance are important. The most important magnets are the ones that I mentioned above.<p>The week will probably be a big bull bar on the weekly chart. We will find out if it will close on its high. If so, next week will probably trade at least a little higher.<h3>Buy signal bar on monthly chart</h3><p>January is a buy signal bar on the monthly chart and it closed near its high. The bulls will try to trigger the buy today by going above yesterday’s high.<p>However, because of the possible topping pattern on the 5 minute chart, there might be more sellers than buyers above the January high. In addition, whenever a signal triggers on a higher time frame, there is typically a pullback soon afterwards on the 5 minute chart. Consequently, traders should not necessarily expect a big bull trend on the 5 minute chart if the monthly buy signal triggers.<p>Also, the buying has been climactic on the 5 minute and daily charts. Finally, the daily chart is in the Sell Zone at the December 12 high. These factors make a 2 – 3 week pullback likely to begin within a couple weeks.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 1 point in the Globex session. Yesterday ended with a parabolic wedge rally and a break above a 4 hour trading range. This is a potential higher high major trend reversal sell setup.<p>But, the bears need a reversal down today. Because yesterday’s rally was exceptionally strong, if there is a reversal down today, it will probably be minor. That means a trading range is more likely than a bear trend.<p>Since the buying has been climactic on the daily and 5 minute charts, and yesterday was mostly sideways, today will probably not be a strong bull trend day. The bulls have already accomplished a lot. They will try to keep this week’s close above the December high and the close of 2017. Both will be magnets today, especially in the final hour.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-bull-trend-from-the-open.png\"><img src=\"2019-2-1.png\" alt=\"Emini bull trend from the open\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex has increasing buying pressure in 4 month trading range</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/image.png\"><img loading=\"lazy\" src=\"2019-2-1-1.png\" alt=\"EURUSD Forex has increasing buying pressure in 4 month trading range\"></a></figure><p>The EURUSD daily Forex chart rallied for 5 days to back above the top of the 4 month trading range. Yesterday was a bear reversal day. However, so far, there were more buyers than sellers below its low.<p>I have been saying this week that the bulls would buy the 1st reversal down. That is what has been taking place overnight.<p>In addition, I wrote that the bears would need a micro double top if they were to get a leg down. The overnight rally is creating a potential micro double top. If the EURUSD reverses down today or tomorrow, there would be a micro double top. This would increase the chance of a test down to 1.1350 – 1.14.<p>But, the buying pressure is increasing. This rally is the 2nd break above the 4 month trading range in 4 weeks. Furthermore, as strong as the January selloff was, it reversed back up from a higher low. Also, that followed higher lows in November and December.<p>This is increasing buying pressure, which often develops before a bull breakout. Consequently, the odds of a bull breakout are increasing.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart reversed up overnight from below yesterday’s low. Since the daily chart is at the top of the 4 month trading range, there will probably be a pullback starting today or Monday. A reversal down would create a micro double top. This would make a pullback to around 1.1350 likely within 2 weeks.<p>The 5 minute chart began to reverse down a few minutes ago, but reversed back up to a new high. If today closes above its open, it will be a buy signal bar for Monday. The buy signal will be stronger if today closes on its high.<p>However, if it has a big tail on top, it would be a weak buy signal bar. There would probably be sellers above on Monday, which could create a micro double top with yesterday’s high.<h3>Today could be either a buy or sell signal bar on the daily chart</h3><p>Today’s close is important. Therefore, the bulls will buy 20 pip selloffs and try to get the day to close near its high. This would create a good buy signal bar on the daily chart. That would increase the chance of a successful break above the 4 month range within a couple weeks.<p>The bears will sell rallies. They want today to close near its low. Today would then be a micro double top with yesterday, and a sell signal bar for Monday.<p>Because the overnight range has been small, today will probably remain in a trading range. Traders will mostly scalp.<p>However, 4 months in a trading range is unusual. Therefore there will probably be a breakout in February. In addition, the increasing buying pressure makes a bull breakout slightly more likely.<p>Despite all of the small trading range days, traders will quickly switch to swing trading once the breakout begins.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Emini-doji-day-in-buy-climax.png\"><img loading=\"lazy\" src=\"2019-2-1-2.png\" alt=\"Emini doji day in buy climax\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>After a brief rally on the open, today became a trading range day. It reversed up from a new low and a test of 2,700 and closed near the open. Since it is a doji day, it is a weak sell signal bar for Monday.<p>However, the Emini is in the Sell Zone above the December 12 crash high. In addition, the rally is climactic. Therefore, a 2 – 3 week pullback will probably begin within the next couple weeks.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-2-1"
    }
  ],
  "2": [
    {
      "data": [
        "<article class=\"post-86249 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Weekly Emini January parabolic wedge buy climax testing crash highWeekend market update: February 2, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Weekly Emini January parabolic wedge buy climax testing crash high</strong><br>Weekend market update: February 2, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-02-02T00:30:29-08:00\">February 2, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2><strong>Market Overview</strong></h2><p>The<strong>Emini</strong>reversed up sharply in January. It is now back in the middle of the 2018 trading range. While it will probably go a little higher, traders will look for a test down to 2,500 – 2,600 beginning in February. They will buy the selloff, expecting a 2nd leg up.<p>The<strong>crude oil futures market</strong>rallied strongly for 6 weeks after a sell climax. As strong as the rally has been, crude oil is now in a resistance zone. It will therefore likely begin to trade down to below $50 over then next few weeks before bulls will buy again.<p>The<strong>EURUSD monthly chart</strong>has a wedge bull flag and a 50% correction. a bull breakout is more likely than a bear breakout. But, there is no bottom and no breakout yet.<h2><strong>Crude oil Futures market:</strong><br>Buy climax near resistance</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Crude-futures-weekly-chart-in-strong-bear-rally.png\"><img loading=\"lazy\" src=\"2019-2-2.png\" alt=\"Crude futures weekly chart in strong bear rally\"></a></figure><p>The crude oil futures have rallied for 6 weeks. I have been writing since early December that the 3 week December trading range would probably be the Final Bear Flag. I then wrote during the strong selloff in December that the daily chart would rally about $10 to the top of the December trading range.<p>It reached the target 3 weeks ago. This week traded below last week’s low and then closed above last week’s high. This week is therefore an outside up week.<p>By closing above last week’s high and at this week’s high, the odds are that the rally will continue up to the next resistance. That is the 20 week EMA and the February 2018 low. Both are around $57. Above that is the 50% retracement, which is around $60.<h3>Can crude oil continue much higher without 1st testing down?</h3><p>Because crude oil is near a cluster of resistance points, it can pull back at any time. It will likely pull back for several weeks soon after it reaches the 20 week EMA.<p>When it does, it will probably retrace about half of the rally. But, when a bull trend reversal is strong, there will typically be buyers below, expecting a 2nd leg up. Consequently, the bulls will probably be eager to buy below $50.<h2><strong>EURUSD monthly Forex chart:</strong><br>Wedge bull flag at a 50% pullback</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/EURUSD-monthly-Forex-chart-is-forming-wedge-bull-flag-and-higher-low.png\"><img loading=\"lazy\" src=\"2019-2-2-1.png\" alt=\"EURUSD monthly Forex chart is forming wedge bull flag and higher low\"></a></figure><p>The EURUSD monthly Forex chart sold off over the past year after testing the bottom of a 14 year trading range. The rally was also a test near the top of its bear channel.<p>In 2018, it retraced about half of the 2017 – 2018 rally. In addition, it is testing the support of the 2015 – 2016 trading range high. Furthermore, 7 of the 8 past months have been small bars and doji bars. This represents a lack of momentum down. Traders are less willing to sell at this point. The market will probably have to go higher to find a price where bears will be willing to sell.<p>Finally, the bulls see the selloff as a wedge bull flag after a strong bull trend. They know that the odds favor a 2nd leg up after such a strong rally. However, there is no clear buy signal bar. Also, the yearlong bear channel is tight. Consequently, the bear channel might have to continue a little lower as it searches for buyers.<h3>Bear trend or bull flag?</h3><p>Despite the yearlong selloff, it is more likely a bull flag on the monthly chart than a resumption of the bear trend. Traders are waiting for either a strong buy signal bar or a strong breakout. They know the odds favor a bull breakout and a test of the 2018 high around 1.25.<p>But, there is always a 40% chance of a bear break below a bull flag and then a measured move down. The result would be a test of the 2017 low, just above 1.03.<h3>Brexit could be the catalyst</h3><p>Brexit might be near its resolution. The past 7 months of quiet trading is due to the uncertainty over the result. The monthly chart is telling traders that whatever the result, traders believe it will probably be good for the EURUSD.<p>But, until there is a breakout, there is no breakout. Traders have been trading. By that, I mean they are taking profits every few days or weeks and then trading in the opposite direction. There is no sign yet that this is about to change.<h2><strong>Monthly S&amp;P500 Emini futures chart:</strong><br>Weak buy signal in trading range</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Emini-monthly-chart-tirggered-weak-buy-signal-in-middle-of-yearlong-trading-range.png\"><img loading=\"lazy\" src=\"2019-2-2-2.png\" alt=\"Emini monthly chart tirggered weak buy signal in middle of yearlong trading range\"></a></figure><p>The monthly S&amp;P500 Emini futures chart&nbsp;formed a big bull inside bar in January. It closed on its high and above the 20 month EMA. Furthermore, it retraced most of the December selloff. There are now 2 legs down from the all-time high. Two legs down in a bull trend is a bull flag.<p>Because the monthly chart is still in a bull trend, January is a buy signal bar. Friday was the 1st day of February. By trading above the January high, it triggered the monthly buy signal.<p>However, the Emini is now only back to the middle of its yearlong trading range. While the momentum in January was good, the October and December selloffs were also very strong.<p>February is the 1st pullback in the bear swing in 5 months. The 1st bounce typically does not get far before the market goes sideways for at least another month. Consequently, the upside over the next few months might be disappointing.<h3>Yearlong trading range likely to continue</h3><p>A Big Up move following a Big Down move creates Big Confusion. When traders are confused, they are confident of only one thing. They doubt either side is strong enough to start a trend. Therefore, they expect every strong move up and down to reverse instead of leading to a trend.<p>They therefore sell rallies and many scale in higher. Also, they buy selloffs and many scale in lower. Finally, because they do not believe that a trend is underway, they take quick profits.<p>When traders are buying low, selling high, and taking quick profits, the result is a trading range. Traders should expect a continuation of the 2018 trading range for at least several more months, and possibly all year.<h2><strong>Weekly S&amp;P500 Emini futures chart:</strong><br>Strong entry bar after 1 bar bull flag</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Emini-weekly-chart-has-buy-climax-testing-close-of-2017.png\"><img loading=\"lazy\" src=\"2019-2-2-3.png\" alt=\"\"></a></figure><p>The weekly S&amp;P500 Emini futures chart has been rallying strongly for 6 weeks. This is after a collapse down to the 8 year bull trend line and a 20% correction.<p>Last week was a doji inside bar. That is a weak buy signal. Typically, the rally from a weak buy signal lasts only a week or two before pulling back.<p>Next week is therefore important. If next week is also a big bull trend bar, the odds will favor a test of 2,800 and the November high before there is a pullback.<p>But, it is now equally likely that next week will either be a reversal bar or a bear trend bar. If so, then the odds will favor at least a couple weeks of sideways to down trading.<h2><strong>Daily S&amp;P500 Emini futures chart:</strong><br>Parabolic wedge buy climax</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Emini-daily-chart-has-parabolic-wedge-buy-climax-at-resistance.png\"><img loading=\"lazy\" src=\"2019-2-2-4.png\" alt=\"\"></a></figure><p>The daily S&amp;P500 Emini futures chart broke above a parabolic wedge buy climax this week. But, 50% of the time, when a market breaks above a wedge, it reverses down again. In addition, the rally remains in a tight bull channel, and there are still 3 or 4 legs up. Therefore, it is forming another parabolic wedge.<p>But, there is no strong sell signal bar yet. Furthermore, since there were consecutive strong bull bars on Wednesday and Thursday, there will probably be at least one more 1 – 2 day rally before the bears can create a strong sell signal bar. In addition, they will probably need at least a micro double top before a swing down begins.<p>Friday was a bear doji. While that is a sell signal bar, it is weak. There will therefore probably be more buyers than sellers below its low. If so and the bull trend resumes, but reverses down a few days later, the bears would have their micro double top.<p>The 1st leg up from the crash low could therefore end within a week. However, the Emini could go sideways for 1 – 3 weeks before turning down.<h3>A buy climax exhausts the bulls</h3><p>A parabolic wedge is a buy climax. Climaxes result in exhausted bulls. In addition, the protective stop is now far below. Therefore, institutional risk managers will become increasing concerned about giving back too much profit if there is a pullback. As a result, they will begin to tell traders to start taking profits. That results in a pullback.<p>When profit taking is severe or protracted, the bulls will wait until the selling stops before buying again. A reasonable goal is 2 legs and about 10 bars sideways to down. If the bears are unable to create a bear trend by then, the bulls will begin to buy again.<h3>2nd leg up likely</h3><p>The rally is exceptionally strong. When a reversal up is strong, it typically has at least 2 legs up. There is no top yet, but the Emini is in a resistance zone. It will probably begin to turn back down in February.<p>The pattern is similar to the buy climax on the weekly chart in January, 2018. After the consecutive big bull bars, I wrote that the Emini was likely to begin a 5 – 10% correction within weeks. It sold off 10% in February last year.<p>The current buy climax is on the daily chart. In addition, it is in a yearlong trading range. Consequently, traders will look for a leg down in the range for a few weeks, but not a resumption of the bear trend. Traders will be eager to buy above the December low.<h3>Trading range often has 2 legged patterns</h3><p>As strong as the rally has been, it is still within a yearlong trading range. Legs in trading ranges usually have 2 or 3 legs. When the 1st leg is protracted, like this one is, traders will look for a 2 – 3 legged pullback over the course of several weeks, and then a higher low.<p>The 2nd leg is often about as big as the 1st. That will probably not be the case here. This is because the current rally has already gone 400 points. If the October, November, December triple top around 2,800 is the target for the 2nd leg, a 400 point rally would require the selloff from the current level to fall to 2,400. That is much more than 50% and it is unlikely, given how strong the January rally has been.<hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-2-2"
    }
  ],
  "4": [
    {
      "data": [
        "<article class=\"post-86246 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini buy climax in sell zone above December crash highIntraday market update: Monday February 4, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini buy climax in sell zone above December crash high</strong><br>Intraday market update: Monday February 4, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-02-04T06:20:01-08:00\">February 4, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini buy climax in sell zone above December crash high</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Most of the trading over the past 2 days has been sideways. Furthermore, traders are deciding if there will be one more small leg up after the strong bull trend days on Wednesday and Thursday. This uncertainty makes a trading range day likely today, especially after a 2 day buy climax.<p>Friday was a doji day after the 2 day buy climax. Because the Emini is in the Sell Zone above the December 12 crash high, any reversal down can be the start of a 50% correction. Therefore, there is an increased chance of a bear trend day today. In addition, a 2 – 3 week reversal down will probably begin this month.<p>After 2 big bull bars, most bears want a micro double top on the daily chart. Therefore, there might be more buyers than sellers below Friday’s low, especially since Friday is a weak sell signal bar.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 2 points in the Globex session. Since Friday is a sell signal bar on the daily chart in a buy climax, traders are expecting a transition into at least a small trading range.<p>A trading range has legs up and down. Therefore, the Emini will probably trade below Friday’s low, or tomorrow will likely trade below today’s low. That pullback would trigger a sell signal on the daily chart. But, the bull trend has been strong and Friday is a weak sell signal bar. Consequently, day traders will look for a reversal up from around Friday’s low. The Emini might go sideways for several days before it begins its 2 – 3 week pullback.<br><p>The daily chart is in a buy climax and in the sell zone above the December 12 high. As a result, day traders will be selling reversals down from around Friday’s high. Because of the buy climax, traders expect a 2 – 3 week pullback. That increases the chance of some bear trend days starting this week.<h2>Friday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Emini-doji-day-in-buy-climax.png\"><img src=\"2019-2-4.png\" alt=\"Emini doji day in buy climax\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/EURUSD-Forex-bull-flag-but-at-top-of-trading-range.png\"><img loading=\"lazy\" src=\"2019-2-4-1.png\" alt=\"EURUSD Forex bull flag but at top of trading range\"></a></figure><p>The EURUSD daily Forex chart pulled back for 3 days from another breakout above the top of the 4 month trading range. This is a bull flag, but the location is bad. Most trading range breakout attempts fail. Consequently, there are probably more sellers than buyers above Friday’s high.<p>However, this trading range has lasted for 4 months. Every trading range over the past several years has broken out after 2 – 4 months. Therefore, this range will probably convert into a trend up or down this month.<p>The bulls have been getting higher lows for 2 month. In addition, on the monthly chart, the 2018 bear trend is a wedge bull flag and a 50% pullback. These factors make a bull breakout slightly more likely than a bear breakout.<p>But, it is important to realize that the probability is only slightly better. If the odds strongly favored the bulls, the trend would already be underway. Since it is not, the bulls and bears are still about equally strong.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has continued its 2 day tight trading range overnight. The range has been only 15 pips over the past 5 hours. That makes it difficult to make even a small scalp. However, day traders will look for scalps until there is a strong breakout up or down. There will probably be at least a small breakout today or tomorrow.<p>The past 3 days have been sideways and the range has been shrinking. Therefore, the 5 minute chart is in Breakout Mode, just as the daily chart’s 4 month trading range is a Breakout Mode pattern.<p>On the 5 minute chart, traders will pay attention to the highs and lows of the past 2 days. The bears will sell near the top and above, betting that the 4 month range will continue. The bulls will buy near the bottom and below, betting that any reversal down will form a higher low after the 2 week rally.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Emini-Small-Pullback-Bull-Trend.png\"><img loading=\"lazy\" src=\"2019-2-4-2.png\" alt=\"Emini Small Pullback Bull Trend\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>After an early expanding triangle, the Emini formed a Small Pullback Bull Trend. It stalled after breaking slightly above Friday’s high. Since it rallies in the final minutes, there is an increased chance of a gap up tomorrow.<p>There is no top yet on the daily chart. But, the January parabolic wedge buy climax will probably end this week. A reasonable 1st target for a 2 – 3 week pullback is the trading range from 2 weeks ago. That is just above 2,600. If the selling continues, the next target is the February 2018 low and 2,500.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-2-4"
    }
  ],
  "5": [
    {
      "data": [
        "<article class=\"post-86561 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini January parabolic wedge buy climax should end this weekIntraday market update: Tuesday February 5, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini January parabolic wedge buy climax should end this week</strong><br>Intraday market update: Tuesday February 5, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-02-05T06:20:37-08:00\">February 5, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini January parabolic wedge buy climax should end this week</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>After an early trading range, yesterday entered a Small Pullback Bull Trend. Furthermore, Friday was a pause after a 2 day breakout. The odds favor at least a 1 – 2 day rally from there.<p>But, the daily chart is in a buy climax. In addition, the Emini is above the December 12 crash high. This is therefore the sell zone. Consequently, the Emini’s month-long rally will probably end this week.<p>Since the rally was strong, the bulls will probably buy a 2 – 3 week, 50% selloff. There is support around the February 2018 low and 2,500. The odds favor the pullback starting either this week or next. The first target is the 2,600 – 2,650 trading range from 2 weeks ago.<p>Less likely, this rally will continue up to the October – December triple top without much of a pullback.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 6 points in the Globex session. If there is a small gap up, it will probably close in the 1st hour. The huge bull bar at the end of the day was climactic. That increases the odds of a trading range forming early today.<p>After any relentless trend, like yesterday, there is a 75% chance of a 2 hour trading range that starts by the end of the 2nd hour. But, there is a 50% chance of follow-through buying in the 1st 2 hours. Even if the bulls buy early, there is only a 25% chance of a 2nd big bull day.<p>Last week was the 6th consecutive bull bar on the weekly chart. That is unusual. Therefore, it would be even more unusual for this week to be a 7th bull bar. Consequently, despite yesterday’s rally, there is at least a 50% chance that Friday will close below yesterday’s open. That would create a bear body on the weekly chart.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Emini-Small-Pullback-Bull-Trend.png\"><img src=\"2019-2-5.png\" alt=\"Emini Small Pullback Bull Trend\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/EURUSD-Forex-pullback-back-to-middle-of-4-month-trading-range.png\"><img loading=\"lazy\" src=\"2019-2-5-1.png\" alt=\"EURUSD Forex pullback back to middle of 4 month trading range\"></a></figure><p>The EURUSD daily Forex chart is in its 4th day of a pullback from a test of the top of the trading range. It is now testing its 20 day EMA and almost the 50% retracement level. Since January 25 broke above a big bear bar, the high of that January 24 bear bar is a breakout point.<p>A breakout point is a magnet. This one is only 30 pips lower. Therefore, the pullback might fall below 1.14 before the bulls will buy again.<p>Has the selloff fallen far enough to make traders belief that it is now going to test the bottom of the 4 month range? No, it is still more likely a pullback from the top. Consequently, the bulls are still looking for a reversal up from around the current level.<h3>Overnight EURUSD Forex trading</h3><p>The selloff has been in a bear channel on the 60 minute chart for 3 days. A bear channel is a bull flag. This is a Spike and Channel Bear Trend, with January 31 being the bear spike. A bear channel is a bull flag. Therefore, the odds are that there will be a break above the 3 day bear channel this week.<p>The first target is the top of the channel. That is the February 1 high of 1.1489. Then, the chart will probably go sideways for a few days. At that point, the bears will have a double top and the bulls will have a bull flag. The 60 minute chart would be in breakout mode.<p>The 5 minute chart has been in a 30 pip range overnight. There is no sign of a reversal yet. Furthermore, that January 25 high is a magnet below. Many bulls are waiting to see if the pullback will reach that support before they will buy. Alternatively, they will buy if there is a surprisingly strong bull breakout today or tomorrow. The odds favor a test of 1.1490 within a week.<p>Since the past several days have been small. Daytraders have been scalping. However, the selloff is near support. That increases the chance of a swing up this week. Less likely, the bears will get a strong break below support and then a test of the bottom of the 4 month range.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Emini-trading-range-day-in-buy-climax.png\"><img loading=\"lazy\" src=\"2019-2-5-2.png\" alt=\"Emini trading range day in buy climax\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini broke above, below, and back above the range of the 1st 18 bars. That is unusual. The day was a trading range day, and weak follow-through after yesterday’s buy climax.<p>The daily chart is still in a parabolic wedge buy climax. In addition, it is in the sell zone, which is above the December 12 stock market crash high. Consequently, the bulls will begin to take profits. This should result in a 2 – 3 week pullback beginning this week.<br><br>This week so far is a bull bar on the weekly chart. But it is the 7th consecutive bull bar, which is rare. It is therefore a buy climax. Unless tomorrow is a strong bull bar, the Emini will probably reverse down into the end of the week and close below the open of the week.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-2-5"
    }
  ],
  "6": [
    {
      "data": [
        "<article class=\"post-86565 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini parabolic wedge buy climax ending in sell zoneIntraday market update: Wednesday February 6, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini parabolic wedge buy climax ending in sell zone</strong><br>Intraday market update: Wednesday February 6, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-02-06T06:20:41-08:00\">February 6, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini parabolic wedge buy climax ending in sell zone</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>After Monday’s bull trend, yesterday was a trading range day. The Emini is<br>just above the December 12 crash high. This in the sell zone on the daily chart.<p>Since yesterday was a bull doji, it is a low probability sell signal bar. The bears will probably need a micro double top before they can get a selloff lasting more than a couple days.<p>The weekly chart now has 7 consecutive bull bars. That is rare. Consequently, unless today is a big bull day, Friday will probably close below Monday’s open. That would create a bear bar for this week.<p>After a strong 7 week rally, the bulls will soon take some profits. They want to buy again, but don’t yet know how strong the bears are. The bulls typically give the bears about 10 bars to try to create a bear trend. If the bears are unsuccessful, the bulls will buy again.<p>Therefore, if this week is the top of the buy climax, the Emini will probably pull back for 2 – 3 weeks. A reasonable target for the bears is the trading range from 3 weeks ago, between 2,600 and 2,650.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 1 point in the Globex market. Day traders know that the daily chart is in a buy climax. Furthermore, there is a wedge top on the 60 minute chart. However, that chart might get 1 more brief leg up before beginning to pullback.<p>The nearest major support is the 2 week trading range from late January. It is between 2,600 and 2,650. Therefore, the bears expect about a 100 point selloff to begin within a week. As a result, day traders will begin to look for sell signals on the 5 minute chart. Traders know that there is an increased chance of bear days over the next couple of weeks.<p>Less likely, the buy climax will continue up to the triple top on the daily chart at around 2,800 without pulling back 1st.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Emini-trading-range-day-in-buy-climax.png\"><img src=\"2019-2-6.png\" alt=\"Emini trading range day in buy climax\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex 50% pullback to middle of 4 month trading range</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/EURUSD-Forex-50-pullback-to-middle-of-4-month-trading-range.png\"><img loading=\"lazy\" src=\"2019-2-6-1.png\" alt=\"EURUSD Forex 50% pullback to middle of 4 month trading range\"></a></figure><p>The EURUSD daily Forex chart sold off for 5 days. It has retraced 50% of the 2 week rally.<p>Furthermore, it fell below last week’s low. However, last week was the 2nd consecutive bull bar on the weekly chart. It is therefore a weak sell signal bar. Consequently, there are probably more buyers than sellers below last week’s low. As a result, the 5 day selloff will probably end today.<p>Because the selloff is in a tight bear channel, the bulls might need a micro double bottom before they can rally back to the top of the 4 month trading range. Typically, they 1st have to stop the selling for 2 – 3 days before they can start a rally. Therefore, the daily chart will likely go sideways today and maybe tomorrow.<p>The bears need a strong break below the December low. Without that, traders will assume that the 5 day selloff is just another bear leg in a trading range. They expect that it will soon lead to a bull leg.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 60 minute chart has been in a Spike and Channel Bear Trend for 5 days. The bear channel has lasted for 3 days. A bear channel is a bull flag. There is a 75% chance of a bull breakout.<p>The channel is also present on the 5 minute chart. Channels on the 5 minute chart typically end by the 3rd day. Therefore, day traders will expect the 5 minute chart to begin to go sideways today, and rally at least 50 pips by the end of tomorrow.<p>Because the moves up and down have been small for over a week, day traders are continuing to scalp. They expect the bear channel to convert into a trading range today. As a result, they will become as willing to buy as sell. This is unlike the past 5 days when they were mostly looking to sell.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Emini-trading-range-day.png\"><img loading=\"lazy\" src=\"2019-2-6-2.png\" alt=\"Emini trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>Today was a trading range day. It was an inside day and the 2nd consecutive doji day on the daily chart. Because of the buy climax and the bear body, it is a sell signal bar for tomorrow. Since the 7 week bull channel is tight, this is a minor sell signal. The best the bears will probably get is a a couple weeks down. Furthermore, the Emini might have to go sideways for 5 – 10 days before the profit taking begins.<p>On the 5 minute chart, the bears are still on yesterday’s higher high major trend reversal. Today, they had a double top lower high major trend reversal. But, the chart is sill in its 2 day trading range. While a 50 – 100 point reversal down is likely to begin this week or next, the bears do not yet have a breakout below the 2 day trading range. The odds therefore favor more sideways trading or a little more up.<p>The Emini has been above the 20 bar EMA on the 60 minute chart for more than 40 bars. That is extreme. Therefore, the Emini will likely pull back to the EMA tomorrow.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-2-6"
    }
  ],
  "11": [
    {
      "data": [
        "<article class=\"post-86576 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini daily bull flag but in weekly buy climaxIntraday market update: Monday February 11, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini daily bull flag but in weekly buy climax</strong><br>Intraday market update: Monday February 11, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-02-11T06:20:15-08:00\">February 11, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini daily bull flag but in weekly buy climax</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>I was in Orlando on Thursday and Friday last week and therefore do not have Friday’s chart in today’s update.<p>Friday was a bull reversal bar after a 3 day pullback. It is therefore a High 1 buy signal bar for today. If today gaps up, the daily chart will have a 2 day island bottom. But, island tops and bottoms are minor patterns. They therefore have little predictive value.<p>There is a problem with this High 1 bull flag. The daily and weekly charts have buy climaxes. Consequently, there will probably be sellers above Friday’s high and above last week’s high.<h3>Weekly chart has a weak sell signal bar</h3><p>I said last week that the week would probably close below the open of the week. This would create a bear body on the weekly chart.<p>Instead, there was a buy climax at the end of the day and the week closed just above the open. This is important because now the weekly chart has 8 consecutive weeks with bull bodies. That is extremely rare. Just look back over the past 20 years to see what I mean. I did a quick check and did not see any prior examples. Consequently, this is unsustainable and climactic.<p>The doji close makes last week a weak sell signal bar for this week. But, the 8 week bull channel has been tight. Therefore, the reversal down will probably be minor.<h3>Daily chart had 10 consecutive bear days in December so sell climax</h3><p>The current weekly buy climax is similar to December sell climax on the daily chart. I discussed that selloff many times in late December. December 24 was the 10th consecutive bear day. I said that the stock market never had 10 consecutive bear days, and that therefore the selloff was an extreme sell climax.<p>Early the next day, I said in the chat room that I bought calls. I wrote that the reversal up from an extreme climax would likely be strong enough to make traders believe the bull trend had resumed. That has been the case over the past 7 weeks.<h3>Weekly chart has 7 consecutive bull bodies so buy climax</h3><p>The current situation in similar to that daily sell climax, but now there is a buy climax and it is on the weekly chart. Last week in the chat room, I said that I bought puts, expecting at least a 2- 3 week selloff.<p>While the momentum up over the past 7 weeks is enough to continue up to the October – December triple top around 2,800, the weekly buy climax is telling us that there is a 60% chance of at least a 2 – 3 week pullback first. The selloff could last longer. An obvious magnet is the close of 2017, which has been an important price since then. The Emini continues to oscillate around it, and it has been unable to break free of that magnet.<h3>What’s coming over next few months?</h3><p>Of all of the things that can happen over the next few months, the most likely is a continuation of the yearlong trading range. Trading ranges commonly have legs up and down that subdivide into 2 – 3 smaller legs.<p>The 7 week rally is probably the end or near the end of the 1st leg up. Traders should expect at least a few weeks sideways to down beginning within the next few weeks. The selloff could last a couple of months and test 2,500, although that is currently unlikely.<p>Since the 7 week rally has been exceptionally strong, there will be many bulls looking to buy a pullback. They hope that the selloff retraces above half of the rally. But, with the rally as strong as it has been, the selloff will probably hold above a 50% pullback.<p>Finally, there will probably be a rally up to the 2,800 triple top in March, April, or May. At that point, traders will find out if the bull trend has resumed or the trading range will continue. The bulls need a strong break above 2,800. Without that, the yearlong trading range will continue. Since trading ranges resist breaking out, a continuation of the range for many more months is most likely.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 9 points in the Globex session. If it gaps up today, it will form a 2 day island bottom. However, because the daily chart is in a parabolic wedge bull channel, it will likely begin to enter a trading range. Therefore, there will probably be sellers somewhere above Friday’s high and last week’s high.<p>This reduces the chances of a big bull trend day today, despite a gap up. Consequently, the gap up might lead to a trading range or even a selloff today.<p>The weekly chart will probably have a bear body this week. As a result, traders will sell any rally into the middle of the week, expecting Friday to close below today’s open.<p>The selloff could begin with a failed gap up today. Even if it does, the odds are against a strong bear trend this week. After 7 consecutive bull bars on the weekly chart, the Emini will probably have to go sideways for a week or more before the bears can create a strong leg down. This uncertainty increases the chance of trading range price action early this week.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/EURUSD-Forex-bear-leg-in-4-month-trading-range.png\"><img src=\"2019-2-11.png\" alt=\"EURUSD Forex bear leg in 4 month trading range\"></a></figure><p>The EURUSD daily Forex chart has had many strong legs up and down in its 4 month trading range. Today is the 8th day in a selloff . When there is a bear micro channel lasting 6 or more days, the bulls typically need a micro double bottom before they can create a bull leg. Consequently, there will be sellers above the prior day’s high.<p>This is because a micro double bottom needs a 2nd bottom. Therefore, even though this selloff is strong, it is no different from any of the many other strong legs up or down over the past 4 months. When there has been a micro channel, the market needed a test before a reversal.<h3>Protracted trading range means bigger breakout</h3><p>Every trading range for the past several years has broken out after about 2 months. This one has lasted longer. When a trading range lasts a long time, the breakout typically goes for more than a measured move. Depending on how a trader views this trading range, its height is around 200 – 300 pips. As a result, a successful breakout will probably run at least 300 pips.<br><p>However, until there is a breakout, there is no breakout. Consequently, the odds are that this selloff will reverse up over the next week. But, with a breakout likely imminent, traders need to be ready for a relentless trend beginning soon.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 60 minute chart has sold off in a tight bear channel for 6 days. The 1st reversal up is usually minor. However, because the chart is now at the bottom of a 4 month trading range, the bears will probably take some profits. If they do, the tight bear channel will convert into a trading range for at least a couple days.<p>That is likely here. Therefore, day traders will look for reversals on the 5 minute chart. Since the overnight range has only been 30 pips, day traders are scalping for 10 pips. Because the upcoming 2 day trading range will be at least 50 pips tall, the bulls will look for a bottom on the 5 minute chart, hoping for a 30 – 50 pip rally.<p>But, the bears will sell above yesterday’s high. They have been so eager to sell for 8 days that they have been selling below the prior day’s high. They will most likely be very happy to have the opportunity to sell above a prior day’s high.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Emini-tight-trading-range-and-Limit-Order-Market.png\"><img loading=\"lazy\" src=\"2019-2-11-1.png\" alt=\"Emini tight trading range and Limit Order Market\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>After closing the gap above Friday’s high, the Emini entered a tight trading range today. Day traders mostly scalped with limit orders. That increases the chance of another trading range day tomorrow.<p>The odds favor 2 – 3 weeks of sideways to down trading starting this week. This week will probably close below today’s open to create a bear bar on the weekly chart.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-2-11"
    }
  ],
  "12": [
    {
      "data": [
        "<article class=\"post-86756 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini pulling back from January parabolic wedge exhaustive buy climaxIntraday market update: Tuesday February 12, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini pulling back from January parabolic wedge exhaustive buy climax</strong><br>Intraday market update: Tuesday February 12, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-02-12T06:20:58-08:00\">February 12, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini pulling back from January parabolic wedge exhaustive buy climax</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday triggered a buy signal on the daily chart by trading above Friday’s high. However, yesterday was a trading range day and it had a bear body on the daily chart. This is therefore a weak entry for the bulls.<p>That makes sense because after 7 consecutive bull bars on the weekly chart, this week will probably close below the open. Consequently, traders will look to sell rallies this week.<p>After a 7 week bull micro channel, there will probably be buyers not far below last week’s low. If the bears get a reversal down this week, it will probably only last 2 – 3 weeks.<p>With limited near-term upside and downside, the Emini will probably begin to form a trading range for the next 2 – 3 weeks. Since the daily and weekly charts are in buy climaxes, there is an increased chance of a surprise bar down on the daily chart this week.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 19 points in the Globex session. It will therefore gap up. This will create a 3 day island bottom.<p>When there is a gap up, there is an increased chance of a trend. A gap up makes a bull trend slightly more likely than a bear trend. However, the weekly chart will probably have a bear body this week. Therefore, the odds are against a strong trend up from here that lasts more than a couple days.<p>A big gap up only has a 20% chance of leading to a strong trend from the open. Most of the time, there is at least one reversal in the 1st hour. The bulls will look for a wedge bull flag or a double bottom around the EMA.<p>The bears want a wedge top or a double top. Therefore, there will probably be a trading range for the for hour or so, even if there is a strong initial move up or down.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Emini-tight-trading-range-and-Limit-Order-Market.png\"><img src=\"2019-2-12.png\" alt=\"Emini tight trading range and Limit Order Market\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/EURUSD-Forex-weak-breakout-below-4-month-trading-range.png\"><img loading=\"lazy\" src=\"2019-2-12-1.png\" alt=\"EURUSD Forex weak breakout below 4 month trading range\"></a></figure><p>The EURUSD has fallen from above to below the 4 month trading range over the past 2 weeks. Just like the bulls needed additional bars at the top to confirm the bull breakout, the bears need to do more at the bottom.<p>Typically, traders want to see consecutive closes to confirm a breakout. But that is the minimum. The bears want consecutive big bear bars closing far below the range. If they get that, traders will conclude that the trading range has converted into a bear trend. Without that, this 2 week selloff will probably be just another strong leg in the trading range.<h3>Bear leg in trading range or bear breakout?</h3><p>What happens over the next few days is important. Yesterday had a big range and it therefore was a sell climax. With today so far being a bull reversal day, yesterday might be simply a sell vacuum test of the bottom of the range.<p>While it is possible for the 2 week bear trend to continue today, the sell climax and bull bar today make a pullback likely. The bears want the reversal up to fail.<h3>Overnight EURUSD Forex trading</h3><p>After breaking below the December 14 bottom of the trading range yesterday, the EURUSD 5 minute chart reversed up overnight. The reversal has only been 50 pips. This is small compared to the 250 pip selloff over the past 2 weeks. However, the bears are taking profits and the bulls are starting to buy. This will probably stop the selling for a few days.<p>There will probably be a 100 pip rally to above yesterday’s sell climax high. That will also be a test of the 20 day EMA. Consequently, the strong bear trend will likely convert into a small trading range today.<p>The bulls are buying for a 2 – 3 day short covering rally. Traders expect a trading range for a few days. Consequently, day traders will be looking for 10 – 30 pip scalps up and down for the rest of the week. Once the rally reaches the 20 day EMA, the bears will sell again.<h3>Bulls need micro double bottom, bears need micro double top</h3><p>If the bulls get a couple small pushes up, but the rally stalls around the 20 day EMA, the bears will see a Low 2 bear flag. They will sell below a bear bar after the micro double top and again try to break far below the 4 month range.<p>After a 9 day bear micro channel, the bulls will probably need a micro double bottom before they can create a swing up to the middle of the 4 month range. That means that even the bulls expect that the 1st rally will only last 1 – 3 days. They usually need 2 tests of the support (here, the bottom of the 4 month range) before they can create a swing up.<p>If they get that, then this selloff will just be another leg in the trading range. Trading ranges are filled with 2 legged moves. This would just be 2 legs down from the January 10 high.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Emini-bull-trend-from-the-open-and-then-nested-wedge-top.png\"><img loading=\"lazy\" src=\"2019-2-12-2.png\" alt=\"Emini bull trend from the open and then nested wedge top\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini rallied strongly to above last week’s high. There was a wedge top and a parabolic wedge top, and they led to an end of the day tight trading range.<p>This week is the 8th consecutive bull bar on the weekly chart. That may never have happened in the 100 year history of the S&amp;P. It has probably never happened in the Emini. It is therefore unsustainable and climactic. Consequently, either this week or next week will probably be a bear bar on the weekly chart. But, after 8 bars up on the weekly chart, the bulls will buy the 1st 1 – 3 week pullback.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-2-12"
    }
  ],
  "13": [
    {
      "data": [
        "<article class=\"post-86760 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Eight consecutive bull bars on Emini weekly chart so climaxIntraday market update: Wednesday February 13, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Eight consecutive bull bars on Emini weekly chart so climax</strong><br>Intraday market update: Wednesday February 13, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-02-13T06:20:43-08:00\">February 13, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Eight consecutive bull bars on Emini weekly chart so climax</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday rallied strongly and broke above last week’s high. The Emini is now testing the 200 day moving average, which has been resistance for several months.<p>The bulls want the rally to break above the October-December triple top. While it might, there will probably be at least a 2 – 3 week pullback 1st.<p>This is now the 8th consecutive week with a bull body on the weekly chart. This is the 1st it has happened in 6 years. Since it is extremely rare, the odds are that this week or next week will have a bear body. A reversal down from here would form an expanding triangle top on the 60 minute chart.<p>After an 8 bar bull micro channel, the bulls will be eager to buy the 1st 1 – 3 week pullback. Consequently, the downside risk is small in February.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 6 points in the Globex session. It is at the resistance of the 200 day EMA. In addition, this is the 3rd bull bar in 5 weeks on the weekly chart. Therefore, this rally is a small parabolic wedge buy climax at resistance. The odds favor at least a 1 – 3 week pullback beginning within a week. Consequently, there is an increased chance of bear trend days for a couple weeks.<p>Yesterday ended with a trading range in a bull trend on the 5 minute chart. Since there is a possible wedge top and expanding triangle top on the 60 minute chart, yesterday’s trading range might be the final bull flag. As a result, traders will look for a reversal down today.<p>Can today be another big bull trend day? Not likely. There is a parabolic wedge buy climax and an unsustainable streak of 8 bull bars on the weekly chart. Also, it is at the resistance of the 200 day moving average. Finally, the 60 minute chart might form a top today or tomorrow. These factors reduce the chance of a big bull day today.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Emini-bull-trend-from-the-open-and-then-nested-wedge-top.png\"><img src=\"2019-2-13.png\" alt=\"\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/EURUSD-Forex-pullback-from-breakout-below-4-month-trading-range.png\"><img loading=\"lazy\" src=\"2019-2-13-1.png\" alt=\"EURUSD Forex pullback from breakout below 4 month trading range\"></a></figure><p class=\"caption\">After Friday broke below the December low, yesterday was a big outside up day. Since there was an 8 day bear micro channel, bears were eager to sell. As expected, they sold above Friday’s high. Today so far is a bear day. If today closes below its midpoint, it would be a credible sell signal bar for tomorrow. Today would be a Low 1 bear flag and a pullback from Friday’s bear breakout.<p>Because yesterday was a big outside up day, there are still strong bulls at the bottom of the range. Consequently, they will probably buy again around the December low. The result would be a micro double bottom.<p>However, the bears will probably sell again around Friday’s high and the 20 day EMA. That would create a Low 2 bear flag at the EMA. Strong bulls and bears usually lead to a small trading range.<h3>Probably forming small trading range</h3><p>That is what is likely over the next few days. The bulls will have a micro double bottom and the bears will have a micro double top. This would be a Breakout Mode pattern.<p>The momentum down favors the bears and the support at the bottom of the range favors the bulls. If one side had a significant advantage, the breakout would be clear. It is not, and therefore traders will take quick profits over the next few days until there is either a strong bear breakout or bull reversal.<h3>Overnight EURUSD Forex trading</h3><p>Yesterday was an outside up day after a sell climax. It is therefore a buy signal bar. But, the EURUSD 5 minute chart sold off 50 pips overnight from the breakout above yesterday’s high.<p>This is disappointing for the bulls, just as the big outside up day yesterday disappointed the bears. Disappointment is a hallmark of a trading range, which is probably beginning to form.<p>While it is possible that today will go below yesterday’s low and form a 2nd consecutive outside day, that is unlikely. If it did, today would be a good sell signal bar for tomorrow. Consecutive outside days form a reliable pattern.<p>More likely, there will be buyers around the current price, which is slightly more than a 50% pullback from the rally up from yesterday’s low. Alternating big moves up and down is a sign of confusion, which typically leads to a trading range. That is what is likely today.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Emini-trend-resumption-down-at-200-day-moving-average.png\"><img loading=\"lazy\" src=\"2019-2-13-2.png\" alt=\"Emini trend resumption down at 200 day moving average\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>After gapping up, the Emini sold off in a Bear Trending Trading Range Day. After a midday rally, it sold off and closed near the low. Today is therefore a sell signal bar for tomorrow. This is taking place at the 200 day moving after and after a wedge rally on the daily chart. The odds favor a 2 – 3 week selloff starting within a week. Today might be the start.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-2-13"
    }
  ],
  "14": [
    {
      "data": [
        "<article class=\"post-86764 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini parabolic wedge buy climax at 200 day moving averageIntraday market update: Thursday February 14, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini parabolic wedge buy climax at 200 day moving average</strong><br>Intraday market update: Thursday February 14, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-02-14T06:20:01-08:00\">February 14, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini parabolic wedge buy climax at 200 day moving average</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The daily chart is testing the 200 day moving average. That chart also now has a parabolic wedge bull channel over the past 5 weeks.<p>Furthermore, the 8 consecutive bull bars on the weekly chart is unusual and therefore unsustainable. That makes it a buy climax. Consequently, the odds favor a pullback lasting at least 2 – 3 weeks. Yesterday might be the start, but the momentum up is strong enough for the Emini to go higher for several more days.<p>The Emini formed a bear trend reversal bar yesterday on the daily chart. It is a sell signal bar for today. But, it is only a doji and therefore a low probability top. If the bears begin to form bear trend days over the next few days, the odds will be that a 100 – 200 point correction has begun.<p>Since yesterday was a pause in the bull trend, it is a High 1 bull flag. However, a bear bar at the resistance of the 200 day moving average and in the 3rd leg up in a wedge is a weak buy setup. Consequently, the odds are against a big bull day.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 1 point in the Globex session. Rather than triggering a sell signal by going below yesterday’s low, today might go above yesterday’s high. If today does go above yesterday’s high, there will probably be sellers not far above.<p>When there is a weak sell signal bar, there is often a 2nd sell signal bar within a day or two. Therefore, there is an increased chance that any rally today will reverse back down and form another bear day today (close below the open). That would be a micro double top on the daily chart.<p>Most of the trading over the past 2 days has been within trading ranges. Given that a big trend up or down is unlikely, today will probably also be mostly a trading range day. Because of yesterday being a sell signal bar in a buy climax, there is an increased chance of a bear trend day today.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Emini-trend-resumption-down-at-200-day-moving-average.png\"><img src=\"2019-2-14.png\" alt=\"Emini trend resumption down at 200 day moving average\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/EURUSD-Forex-weak-breakout-below-4-month-trading-range-1.png\"><img loading=\"lazy\" src=\"2019-2-14-1.png\" alt=\"EURUSD Forex weak breakout below 4 month trading range\"></a></figure><p>The EURUSD daily Forex chart yesterday formed a big bear trend day closing near its low. It was a Low 1 bear flag. The bears see is as a pullback from the breakout below the 4 month trading range. Today therefore is the entry bar for the bears.<p>But, the breakout is not yet far below the 4 month range. In addition, there have not been consecutive bear days closing below the range. Therefore, the probability of a successful breakout is only slightly better than 50%. If the bears can get the day to close near its low, the odds of a successful breakout will go up. They therefore will sell rallies today.<p>The bulls see the selloff from the January high as 2 legs down in a trading range. Because the 2 week selloff has been strong, they need a micro double bottom to get a reversal up. Consequently, today is a potential buy signal bar for tomorrow.<p>The bulls need a strong buy signal bar to make traders willing to buy. They therefore want today to close near its high. Day traders should therefore look for buy setups and a close near today’s high.<h3>Overnight EURUSD Forex trading</h3><p>So far today, the bulls have been winning. The day is currently a bull trend bar on the daily chart. There has been a 40 pip rally over the past 10 minutes on the 5 minute chart.<p>If the bulls can maintain the rally, the odds will favor higher prices over the next few days. They need to buy any 20 pip selloff and keep the day near its high.<p>But, if the bears can reverse this rally back down to below the midpoint of the day’s range, the bears will probably of a successful breakout below the 4 month range will increase.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Emini-trading-range-day-1.png\"><img loading=\"lazy\" src=\"2019-2-14-2.png\" alt=\"Emini trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>After a big gap down, the Emini rallied. Because it formed a bull trend bar on the daily chart, today is a High 1 bull flag. It is a buy signal bar for tomorrow. But, it was a doji day and therefore a weak buy signal bar. Also, the parabolic wedge buy climax will probably limit the upside. There will probably be sellers not far above this week’s high.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-2-14"
    }
  ],
  "15": [
    {
      "data": [
        "<article class=\"post-86768 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini pullback at top of parabolic wedge buy climaxIntraday market update: Friday February 15, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini pullback at top of parabolic wedge buy climax</strong><br>Intraday market update: Friday February 15, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-02-15T06:20:14-08:00\">February 15, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini pullback at top of parabolic wedge buy climax</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Wednesday was a sell signal bar on the daily chart. When yesterday gapped below Wednesday’s low, the Emini triggered the sell signal. However, yesterday rallied and closed above its open. It is now a buy signal bar for today. Because it was a doji bar, it is a weak buy setup.<p>Since the weekly chart has 8 consecutive bull bars and that is rare, the chart is in a buy climax. The daily chart has a parabolic wedge buy climax. The odds favor at least a 2 – 3 week pullback starting within a week. Wednesday might have been the start.<p>However, the bull channel on the daily chart is tight. Many traders want a 2nd sell signal. Therefore, the bulls might get one more brief new high before the pullback begins. Since yesterday is a buy signal bar, there is an increased chance of a bull trend day today.<p>Most of the trading over the past 3 days has been within trading ranges. Consequently, today will probably have a lot of trading range price action as well. Traders are deciding whether the pullback has begun or if there will be one more brief new high 1st. Less likely, the rally will continue to above the October-November-December triple top without a pullback.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 7 points in the Globex session. If today trades above yesterday’s high, it would trigger a buy signal on the daily chart.<p>But yesterday was a doji bar and therefore a weak setup. In addition, the daily chart is in a buy climax. Consequently, there will probably be more sellers than buyers above yesterday’s high. Therefore, today will probably not be a big bull day.<p>Since the past 2 days were dojis days, today, too, will probably be mostly sideways. In addition, the weekly chart has a bull bar. the weekly chart has been alternating bull and doji bars for 3 weeks. This week will probably close near its high and remain a bull bar.<p>There is not much incentive for the Emini to go far up or down today. However, next week will be a good candidate for the start of a 2 – 3 week pullback.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Emini-trading-range-day-1.png\"><img src=\"2019-2-15.png\" alt=\"Emini trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/EURUSD-Forex-breakout-below-4-month-trading-range.png\"><img loading=\"lazy\" src=\"2019-2-15-1.png\" alt=\"EURUSD Forex breakout below 4 month trading range\"></a></figure><p>The EURUSD weekly Forex chart so far has consecutive bear bars. If today closes near its low, it would increase the odds of a successful breakout below the 4 month range. Since the trading range is about 300 pips tall, the measured move target would be around 1.0970.<p>This week is not especially big. Therefore, the bears do not yet have a sense of urgency. However, if next week is also a bear bar closing near its low, the odds of a resumption of the 2018 bear trend will be 60%. This is especially true if next week is a big bear bar.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD daily chart had a buy signal bar yesterday. The bulls needed to break above yesterday’s high to trigger the micro double bottom buy signal. Instead, the daily chart today traded below yesterday’s low. So far, today is a big bear bar.<p>The bears do not need more than that today. But, they need a follow-through bear bar on Monday.<p>If Monday instead is a bull bar, there would be a micro wedge on the daily chart. The bulls would then have almost a 50% chance of forming a double bottom with the November low.<p>There is not much that the bulls or bears can do today to affect the daily chart. The bears want the week to close near its low. That would create a strong bear bar on the weekly chart. They will therefore sell 20 – 30 pip rallies.<p>The bulls know how important this week’s bar is for the bears. They will therefore buy around the low of the day. They want the week to close at least 30 pips above its low. That would put a tail on the bottom of the bar on the weekly chart. The weekly breakout would therefore be weaker and less likely to succeed. The bulls next week would then try to create a rally so that they would have a double bottom with the November low.<p>Because neither the bulls nor the bears can do much today to change the probabilities on the weekly chart, today will probably be mostly sideways for the rest of the day.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Emini-trading-range-with-late-bull-breakout.png\"><img loading=\"lazy\" src=\"2019-2-15-2.png\" alt=\"Emini trading range with late bull breakout\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini gapped up above Wednesday’s ledge top. While it was another small trading range day for most of the day, it rallied into the close. The week closed on its high. That increases the chance of a gap up on the weekly chart next week.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-2-15"
    }
  ],
  "16": [
    {
      "data": [
        "<article class=\"post-86776 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini weekly chart has climactic streak of 8 bull barsWeekend market update: February 16, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini weekly chart has climactic streak of 8 bull bars</strong><br>Weekend market update: February 16, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-02-16T00:30:10-08:00\">February 16, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2><strong>Market Overview</strong></h2><p>The<strong>Emini</strong>weekly chart has had 8 consecutive bull bars. Because that is rare, it is climactic. The odds favor a 2 – 3 week pullback beginning within a couple weeks.<p><strong>Crude oil</strong>has rallied strongly for 8 weeks. It is in search of a top of what will probably be a trading range for many months. The range will likely be between 40 and 65.<p>The<strong>EURUSD</strong>weekly Forex chart has been in a trading range for 4 months. The bulls have bought every new low since the bear channel began in June. Therefore, the downside from here is probably limited.<h2><strong>Crude oil Futures market:</strong><br>Strong outside up week in developing trading range</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Crude-oil-weekly-chart-has-strong-bull-leg-in-developing-trading-range.png\"><img loading=\"lazy\" src=\"2019-2-16.png\" alt=\"Crude oil weekly chart has strong bull leg in developing trading range\"></a></figure><p>By trading below last week’s low, this week triggered a sell signal on the weekly chart. But, the week then rallied to above last week’s high. That stopped out most of the bears. In addition, this week is now an outside up week and a buy signal bar for next week.<p>A buy signal after a failed sell signal is good for the bulls. However, the 2 month rally is following a tight bear trend. The 1st reversal up typically leads to a trading range and not a bull trend. Therefore, this rally is searching for the top of the trading range. After such an extreme selloff, the developing trading range will probably last many months.<p>Although the 20 week EMA is resistance, especially after a 4 week tight trading range, this week is trying to start a new leg up. The 50% retracement is around the 60 Big Round Number. That is the next magnet above.<h3>Legs in trading ranges often overshoot support and resistance</h3><p>Legs in trading ranges usually overshoot support and resistance. Consequently, the top of the range will probably be closer to 65. However, this rally will likely not get there without first pulling back.<p>The December low is probably around the bottom of the range. When crude oil collapsed to 42 in December, it reversed up sharply. There will probably be buyers there again if the next leg down reaches that level.<p>Because the sell climax was extreme and crude oil will probably be sideways for many months, traders will buy low, sell high, and take quick profits. If a leg is strong, traders will wait for a 2nd signal before entering a reversal trade. For example, after 4 days up, the bears will typically want a double top or a micro double top before selling.<h2><strong>EURUSD weekly Forex chart:</strong><br>Strong selloff to bottom of 4 month trading range</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/EURUSD-weekly-Forex-chart-in-tight-trading-range-at-apex-of-wedge-bull-flag.png\"><img loading=\"lazy\" src=\"2019-2-16-1.png\" alt=\"EURUSD weekly Forex chart in tight trading range at apex of wedge bull flag\"></a></figure><p>The EURUSD weekly Forex chart has consecutive bear bars over the past 2 weeks. However, this week closed above its midpoint and above the January and December lows.<p>The bears need to do more before traders believe this breakout will succeed. For example, if there are consecutive big bear bars closing near their lows and below the November low, the breakout will probably continue down for at least a couple legs.<p>In addition, a reasonable target would be 1.09, which is a measured move down based on the height of the 4 month tight trading range. They do not have a strong breakout yet, so any new low will probably turn up from well above 1.09.<p>That range is within a 9 month trading range that is 600 pips tall. A measured move down from there is 1.06. That currently is unlikely because the weekly chart has been looking for a bottom for 9 months.<h3>Bear leg in what will be a 600 pip tall trading range</h3><p>The entire 2018 selloff is still around a 50% pullback from the 2017 rally. Therefore, the bulls will likely buy not far below the November low, just as they have been buying new lows since June.<p>This is a Stairs pattern. A bear trend in a Stairs pattern usually evolves into a trading range. The top of the range is often at the start of the bear channel. That is the June lower high around 1.1850.<p>A rally over the next several months would probably be a bull leg in the developing trading range and not a bull trend. It therefore would likely be relatively week. Consequently, the bulls would need many months before they could get back to 1.18.<h2><strong>Monthly S&amp;P500 Emini futures chart:</strong><br>Consecutive bull bars in yearlong trading range</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Emini-monthly-candlestick-chart-in-bull-leg-in-yearlong-trading-range.png\"><img loading=\"lazy\" src=\"2019-2-16-2.png\" alt=\"Emini monthly candlestick chart in bull leg in yearlong trading range\"></a></figure><p>The monthly S&amp;P500 Emini futures chart&nbsp;triggered a buy signal this month by going above January’s high. So far, February is a bull bar.<p>However, the Emini is also in the middle of a yearlong trading range. In addition, there have been several abrupt reversals over the past year. Consequently, traders on the monthly chart are hesitant to hold onto trades and are taking quick profits.<p>That reduces the chance that February is resuming the 2017 bull trend. More likely, the 2 month rally is a bull leg in the trading range. Furthermore, the trading range will probably continue for at least several more months.<h2><strong>Weekly S&amp;P500 Emini futures chart:</strong><br>Emini weekly chart has climactic streak of 8 bull bars</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Emini-weekly-candlestick-chart-has-8-consecutive-bull-trend-bars.png\"><img loading=\"lazy\" src=\"2019-2-16-3.png\" alt=\"Emini weekly candlestick chart has 8 consecutive bull trend bars\"></a></figure><p>The weekly S&amp;P500 Emini futures chart formed its 8th consecutive bull trend bar this week. I could find only one instance in the 20+ year history of the Emini with a streak of more than 9 weeks. Therefore, the probability is high that either next week or the following week will have a bear body.<p>Even though the rally is unsustainable and therefore a buy climax, it is strongly bullish. The bulls have been happy to buy above the prior week’s low for 8 weeks. They will be eager to have an opportunity to buy below the prior week’s low. As a result, once there is a pullback, it will probably only last 2 – 3 weeks.<h3>Possible gap up and blow-off top</h3><p>With this past week closing on its high, there is an increased chance of a gap up next week. Many institutions have been taking profits over the past several weeks because of the extreme buy climax. Others have been shorting. If next week gaps up, the result could be panic buying from the bulls afraid of missing a strong breakout above the triple top and from bears covering their shorts.<p>However, the odds are that such a breakout would be a blow-off top. The weak bulls would have bought at the top of a buy climax, and the weak bears would have finally exited their losing shorts. Since both are desperate to buy, they will buy at any price, no matter how high. Once the weak bulls and bears have finally bought, who is left to buy? Probably no one.<p>Strong traders will be happy to sell to those desperate buyers, but only at a high price. The result often is a very sharp rally, and then the end of the bull trend for several weeks.<h3>Profit taking creates a pullback</h3><p>That creates a big bull breakout late in a bull trend. Strong bulls see it as an unusually great, but brief, opportunity to take profits, and they sell. Strong bears also believe it is a climactic end of the rally. They know that strong bulls will take profits, and not be buying. These strong bears therefore short.<p>The result of strong bulls selling out of their longs and strong bears selling to get short is a pullback. It will probably last at least a few weeks.<h2><strong>Daily S&amp;P500 Emini futures chart:</strong><br>Parabolic wedge rally</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Emini-daily-candlestick-chart-in-parabolic-wedge-buy-climax-just-below-2800-triple-top.png\"><img loading=\"lazy\" src=\"2019-2-16-4.png\" alt=\"Emini daily candlestick chart in parabolic wedge buy climax just below 2800 triple top\"></a></figure><p>The daily S&amp;P500 Emini futures chart has rallied for 2 months in a tight bull channel. The momentum up is strong. It is trying to hold above the 200 day moving average (not shown). There is a magnet at the October-November-December triple top just above 2,800. Friday’s strong close increase the odds of higher prices next week. If next week gaps up, there could be enough panic buying to break above the triple top.<h3>No pullback because too many traders want a pullback</h3><p>How is it that a buy climax can continue up for such a long time? Think about what is going on. Do you want to buy a pullback? Yes, and the reason is that you believe any pullback will come back to the top of this rally, which means you will not lose money.<p>That is a very high probability bet. High probability bets always have bad risk/reward. For bulls buying up here, their stop has to be below the December low because a pullback could be very deep. Consequently, the risk is great. Furthermore, the chart has been in a trading range for a year so the remaining reward is small.<h3>Continued bull trend or start of trading range?</h3><p>A bull buying here is betting that one of two things will happen. He believe that the bull trend will continue or it will evolve into a trading range. He is betting against a bear trend because it is currently a low probability bet.<p>If the bull trend continues, the bull can exit with a profit. If the trend becomes a trading range, he knows that the odds are high that a bull leg will follow any bear leg. This is true even if a selloff retraces 90% of the rally. If he buys more lower, the odds are that there will be a higher low. The rally from that low will probably test the top of the current leg up. As a result, he can get out with a profit on his lower buy and breakeven on his 1st buy.<h3>Parabolic wedge buy climax</h3><p>It is important to note that the past 5 weeks have had 3 legs up in the tight bull channel. That is a parabolic wedge buy climax. Wednesday was a sell signal bar. But when a bull channel is tight, many bulls want a 2nd sell signal or a micro double top. Therefore, next week will probably go above this week’s high before a pullback begins.<p>Once there is a reversal down from a buy climax, the bulls typically wait for at least a couple legs down before buying again. That usually takes at least 10 bars, which means 2 weeks.<p>Also, when there is a reversal down from a wedge, there are magnets at the 2 higher lows in the wedge. The nearer one is the February 8 low of 2680.75. If the Emini gets there, it will probably stall for a few days. Traders will decide if the pullback has ended or if it will continue down to the start of the wedge rally. That is the January 23 low of 2612.50. If so, the selloff might take more than a month to get there.<hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-2-16"
    }
  ],
  "19": [
    {
      "data": [
        "<article class=\"post-86771 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini buy climax is testing 2800 triple topIntraday market update: Tuesday February 19, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini buy climax is testing 2800 triple top</strong><br>Intraday market update: Tuesday February 19, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-02-19T06:20:32-08:00\">February 19, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini buy climax is testing 2800 triple top</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>This is the start of the 9th week in a strong bull trend. But, 9 consecutive bull bars on the weekly chart is rare. Therefore, either this week or next week will probably have a bear body. Furthermore, there is a parabolic wedge rally on the daily chart. That will probably lead to at least a 2 week pullback.<p>Because the momentum up is strong, the bulls keep buying. They are trying to break above the October-November-December triple top. With last week closing on its high, this week might gap up. If so, the bulls will try to keep the gap open and continue the rally to above the top.<p>A pullback has been likely, but it has not yet begun. Therefore, if there is a break above the triple top, it could be big. If there are too many institutions betting on the pullback, they might buy back their shorts in a panic if the bulls get their breakout.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 8 points in the Globex session. There is a parabolic wedge top on the daily chart. It increases the odds of a 2 – 3 week selloff. This is especially true with the buy climax on the weekly chart.<p>However, Friday was a bull day closing on its high. Typically a chart has to stop going up before reversing down. Therefore, today will probably not be a big bear day.<p>In addition, the past 3 days were mostly sideways on the 5 minute chart. The strong bull trend on the daily chart is losing momentum now that it is near last year’s triple top. As a result, a strong bull day is also unlikely. That makes another mostly sideways day likely.<p>Because the momentum up is strong and the daily chart is at resistance, there is a small, but real chance of a series of big bull days. Likewise, the buy climax at resistance increases the chance of a dramatic selloff for several weeks.<p>Neither is likely. But, if either becomes clear, traders should not be in denial. There is the potential for a surprisingly big move up or down within a couple weeks.<h2>Friday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Emini-trading-range-with-late-bull-breakout.png\"><img src=\"2019-2-19.png\" alt=\"Emini trading range with late bull breakout\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex micro wedge bottom</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/EURUSD-Forex-micro-wedge-at-bottom-of-4-month-trading-range.png\"><img loading=\"lazy\" src=\"2019-2-19-1.png\" alt=\"EURUSD Forex micro wedge at bottom of 4 month trading range\"></a></figure><p>The EURUSD daily Forex chart formed a 4 day micro wedge bottom. Yesterday was a bull bar and therefore the 1st leg up. A micro wedge typically leads to at least 2 legs up. Therefore, today or tomorrow will probably form a higher low.<p>Yesterday was also a sell signal bar for a double top bear flag with Thursday’s high. Since yesterday had a bull body, this is a low probability sell signal. As a result, there will likely be more buyers than sellers below yesterday’s low. That is consistent with the micro wedge, which will probably to lead to a small 2nd leg up.<p>While the month-long selloff has been strong and it fell below the December low, it is still a leg in the 4 month range. There have been many strong legs up and down. Each reversed. That is always what is most likely in a trading range. Consequently, the odds are that this one will as well.<p>However, every trading range over the past 2 years broke out after about 2 months. Therefore, the odds are increasing that one of the legs will lead to a successful breakout. But, until there is a breakout, there is no breakout. The math is still better to bet on a reversal back up to the middle of the range.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart fell below yesterday’s low overnight. As was likely, the bulls bought the breakout since the sell setup on the daily chart was bad. Yesterday’s low might be important all day. The bears want today to close below yesterday’s low while the bulls want it to close above.<p>While the over night range was 50 pips, the range over the past 3 hours has only been 25 pips. In addition, most of the bars are only about 5 – 7 pips tall. That means that the chart lacks energy. Traders believe that the price is just about right. Day traders are scalping. This is consistent with the chart being in a tight trading range for 6 days.<p>Because the chart is at the bottom of a 4 day range, there is a slightly increased chance of a big bear breakout or big reversal up. But, until there is a clear breakout, day traders will continue to scalp.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Emini-nested-wedge-top.png\"><img loading=\"lazy\" src=\"2019-2-19-2.png\" alt=\"Emini nested wedge top\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini began with a Bull Trend From The Open. After a midday trading range, the bull trend resumed and closed near its high.<p>By today closing above its open, this week so far is the 9th consecutive bull trend bar on the weekly chart. There has only been one longer streak in the 20 year history of the Emini. Consequently, the odds favor a 2 – 3 week pullback beginning this week.<p>But, the momentum up is strong. Most importantly, the triple top above 2800 is a strong magnet. The bulls have failed many times over the past year to break strongly above 2800. While they will probably succeed at some point this year, the buy climax makes a 2 – 3 week pullback likely to come before the breakout.<p>Since the pullback will probably begin this week or next, traders will be looking for a reversal on the daily chart. However, many institutions are probably betting on the pullback. Therefore, there is a chance of a strong break above 2800. Those institutions will cover their shorts, and other institutions will buy the breakout, looking for a test of the all-time high.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-2-19"
    }
  ],
  "20": [
    {
      "data": [
        "<article class=\"post-87057 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini 9th consecutive weekly bull bar so buy climaxIntraday market update: Wednesday February 20, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini 9th consecutive weekly bull bar so buy climax</strong><br>Intraday market update: Wednesday February 20, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-02-20T06:20:47-08:00\">February 20, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini 9th consecutive weekly bull bar so buy climax</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini yesterday traded above last week’s high and it closed above its open. This week therefore currently is the 9th consecutive bull trend bar on the weekly chart. There has only been one instance of more than 9 consecutive bull bars in the 20 year history of the Emini. Consequently, the odds are that either this week or next week will have a bear body on the weekly chart. Traders will therefore look for a reversal down this week.<p>The rally has been very strong. Furthermore, the triple top on the daily chart is an obvious magnet. The Emini has been trying to break above and hold above 2800 for more than a year.<p>Will the bulls finally succeed? Yes, probably at some point this year. But, this buying has been extreme. That makes at least a 2 – 3 week pullback likely before a strong break above 2800. However, until there is a top, the bulls will continue to buy and the odds favor at least slightly higher prices.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 2 points in the Globex session. With the proximity to the strong magnet of the triple top above 2,800, the odds continue to favor higher prices. There is a small chance of an explosive move above that resistance.<p>The bears need to begin to create bear days. They especially need big bear days to begin a 2 – 3 week pullback. Yesterday’s late selloff might be the start of a swing down. However, the bears need strong bear trend days before traders will believe that a pullback is underway. Until they get that, the odds still favor sideways to up trading.<p>Most of the recent days had swings up and down. A lot of time has been within trading ranges. That will probably continue today. But, with the Emini just below major resistance, there is an increased chance of a big trend day up or down within the next 2 weeks.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Emini-nested-wedge-top.png\"><img src=\"2019-2-20.png\" alt=\"Emini nested wedge top\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/EURUSD-Forex-2-week-bear-flag-at-bottom-of-4-month-trading-range.png\"><img loading=\"lazy\" src=\"2019-2-20-1.png\" alt=\"EURUSD Forex 2 week bear flag at bottom of 4 month trading range\"></a></figure><p>The EURUSD daily Forex chart rallied for 4 days from a micro wedge bottom. Because the wedge is at the bottom of a 4 month trading range, this could be the start of a bull leg that could last several weeks.<p>But, the February selloff had an unusually strong series of consecutive big bear bars. When a selloff is that strong, the bulls typically need a small double bottom before they can begin a swing up. Consequently, the odds favor a test down to around 1.1250 within 2 weeks.<p>The bulls expected 2 small legs up from their micro wedge. Once yesterday went above Monday’s high, it met the minimum goal. While the bulls hope this rally will continue, it instead is probably going to be a bear flag.<h3>Bear flag, but bottom of trading range</h3><p>If the bears today can create a bear bar closing near its low, it will be a sell signal bar for the bear flag. However, because trading ranges resist breaking out, even if the bear flag triggers and there is a selloff below 1.1250, the odds are that the bulls will get a reversal up.<p>A reversal up from around last week’s low would create a double bottom. The bulls would then look for a test of the middle of the range, above 1.14, as their minimum goal.<p>I said that the bears see this 4 day rally as forming a bear flag. They still need a strong break below the November low before traders will conclude that the trading range has converted into a bear trend.<p>Because 4 months is a long time for a trading range, there will probably be a breakout within a couple months. However, until there is a breakout, there is no breakout. Despite the strong selloff, the odds are only slightly better for the bears. Another week or two of higher prices will return the probability to 50% for the bulls and bears.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute chart has been in a 30 pip range overnight. This is because the bulls achieved their goal of 2 legs up to the 20 day EMA. The bulls are beginning to take profits and the bears are starting to sell again.<p>Since today is a sell signal bar at the EMA on the daily chart, its close is important. The bears want the day to close on its low. That would form a higher probability sell signal bar on the daily chart. They therefore will sell rallies.<p>However, the bulls want at least a small bull body on the daily chart. They therefore will buy dips below the open.<p>Neither the bulls nor the bears need a big day today. Today is a decision day and the fight will be over the close of the day. Consequently, the overnight trading range will probably continue all day, with both sides fighting over where the day will close.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Emini-expanding-triangle-after-FOMC-announcement.png\"><img loading=\"lazy\" src=\"2019-2-20-2.png\" alt=\"Emini expanding triangle after FOMC announcement\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>Today was filled with reversals. The Emini broke above the range of the 1st 18 bars, then below, and then above again. It remained a trading range day. Because is closed above the middle of the range, it is a low probability sell signal bar for tomorrow.<p>The bulls are still trying to get above 2800 and the triple top just a little higher. At some point, if they continue to fail, they will sell out of their longs. That will probably result in at least a 2 – 3 week pullback. The odds favor a reversal down starting within 2 weeks.<p>However, that increases the chances of a big bull breakout as well. The bears who have been shorting could get squeezed out on a break above the triple top.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-2-20"
    }
  ],
  "21": [
    {
      "data": [
        "<article class=\"post-87061 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini buy climax but 2800 magnet above and no top yetIntraday market update: Thursday February 21, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini buy climax but 2800 magnet above and no top yet</strong><br>Intraday market update: Thursday February 21, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-02-21T06:20:37-08:00\">February 21, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini buy climax but 2800 magnet above and no top yet</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini has a buy climax on the daily and weekly charts. But, a climax can continue to rally far longer than what might seem likely. For example, the bulls could finally get a strong breakout above 2,800.<p>More likely, the bulls will begin to take profits this week or next. That will probably result in a 2 – 3 week pullback.<p>The stock market has had 8 consecutive bull bars on the weekly chart with a 10% rally many times over the past 100 years. Two thirds of the time, the market was down an average of 2% within the next month.<p>There is no reliable top yet on the daily chart. Yesterday had a bull body and therefore is a low probability sell signal bar. However, the risk of a big move up or down is growing. While most days continue to have trading range price action, day traders have to be ready for the 5 minute chart to begin to form trend days.<h3>Overnight Emini Globex trading</h3><p>The Emini rallied to within 2 points of 2,800 overnight and then sold off. That has been major resistance for over a year. The Emini is now down 6 points in the Globex session.<p>The bulls know that many bears will exit their shorts above the triple top on the daily chart. If the bulls can break above, they might get a sharp rally to a new all-time high within weeks.<p>They know this is unlikely. However, they keep buying until they believe they will fail. If they conclude that they cannot achieve their goal, instead of a sharp rally from bears giving up, there could be a sharp selloff from bulls giving up. There is therefore an increased chance of several strong days up or down beginning within a couple weeks. Until then, day traders will continue to look for 2 – 3 hours swings up and down.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Emini-expanding-triangle-after-FOMC-announcement.png\"><img src=\"2019-2-21.png\" alt=\"Emini expanding triangle after FOMC announcement\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex wedge bear flag at bottom of trading range</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/EURUSD-Forex-wedge-bear-flag-at-bottom-of-trading-range.png\"><img loading=\"lazy\" src=\"2019-2-21-1.png\" alt=\"EURUSD Forex wedge bear flag at bottom of trading range\"></a></figure><p>The EURUSD daily Forex chart sold off strongly to the bottom of the 4 month trading range. Since trading ranges resist breaking out, the odds favor a bull leg in the trading range.<p>The chart has rallied for 2 weeks in a bull channel. That channel is a micro wedge and the selloff was strong. Both factors make a test of the low likely. Therefore, the rally will probably exhaust itself in the next few days. The bulls will take profits, which will create a leg down. Because trading ranges resist breaking out, the bulls will buy again below 1.13. That will probably result in a 3 – 4 week rally from last week’s low.<p>The bears hope that the 2 week wedge rally is a bear flag. They will sell it, hoping for a strong break below the November low. But, trading ranges have many strong legs up and down and most reverse. Consequently, that is what is likely here.<p>All trading ranges on the daily chart over the past 2 years converted into trends within a couple months. Therefore, this one is overdue. As a result, traders expect a breakout up or down anytime soon, and then about a 300 pip measured move.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart formed an expanding triangle overnight. This is a Breakout Mode pattern. In addition, the 5 minute chart has been sideways for 3 days. The legs have been big enough for 20 – 30 pip scalps.<p>Since the 240 minute chart is in its 3rd leg up in a wedge rally, the odds favor profit taking within a couple of days. Therefore, if there is a bull breakout above the triangle, the bulls will probably take profits around 1.14. That is about a 50% retracement of the February selloff. If the bears get a reversal down, they will take profits below 1.13.<p>If today goes above yesterday’s high, today will be another outside up day, like Tuesday. However, the odds are that the 2 week tight trading range will continue today. There will be sellers above yesterday’s high, just like there were buyers below yesterday’s low.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Emini-test-of-open-of-week-after-8-bull-trend-bars-on-weekly-chart.png\"><img loading=\"lazy\" src=\"2019-2-21-2.png\" alt=\"Emini test of open of week after 8 bull trend bars on weekly chart\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini formed a trading range day. There was a strong selloff that tested the open of the week. However, the bulls bought the test and the day closed in the middle of the range.<p>Tomorrow is Friday and the bulls want a 9th consecutive bull trend bar on the weekly chart. That is rare. There has only been one streak of more than 9 weeks in 20 years. Consequently, probably either tomorrow will close below this week’s open or next week will have a bear body.<p>Since this week’s open is just below today’s low, it is a magnet tomorrow. This is especially true in the final hour. If the bears get a bear body on the weekly chart, the Emini will probably begin to pull back for 2 – 3 weeks.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-2-21"
    }
  ],
  "22": [
    {
      "data": [
        "<article class=\"post-87066 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini open of week is magnet after 8 bull weeksIntraday market update: Friday February 22, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini open of week is magnet after 8 bull weeks</strong><br>Intraday market update: Friday February 22, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-02-22T06:20:28-08:00\">February 22, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini open of week is magnet after 8 bull weeks</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Today is Friday and therefore today’s close affects the appearance of this week’s candlestick on the weekly chart. The past 8 weeks have had bull bodies. Only once in the past 20 years has there been more than 9 consecutive bull bars. Consequently, either this week or next week will probably have a bear body. With the open of the week just below yesterday’s low, it is an important magnet today.<p>If the bears get a bear body, the Emini will probably pull back for 2 – 3 weeks. In the past 100 years, there have been many times when the weekly chart rallied 10% and had 8 consecutive bull bars. In two thirds of the instances, the Emini down an average of more than 2% both 1 and 2 months later. Therefore, that is likely here.<h3>Bulls want break above triple top</h3><p>Can the rally break strongly above the triple top on the daily chart? Probably not without at least a 2 – 3 week pullback first.<p>The “momentum bulls” have kept buying for 8 weeks, correctly betting that the Emini would go higher. Now it is at resistance and many bulls have a big open profit. If there is profit-taking over the next week, the Emini could accelerate down. The momentum bulls are looking for a quick profit and will not allow a loss to grow. The “value bulls” who bought low need to reduce their risk by taking profits.<p>Finally, the bears see the buy climax and are eager to short. The result can be a quick 2 – 3 week selloff. More likely, the Emini will drift sideways to down for a few weeks. Once traders see that the bears are unable to create a strong selloff, the bulls will buy again. The odds favor a break above the triple top at some point within the next few months.<h3>Overnight Emini Globex trading</h3><p>The Emini i up 9 points in the Globex session. It therefore might gap above yesterday’s high. Yesterday was a one day pullback in a tight bull channel. It is therefore a one day High 1 bull flag. Since it had a bear body, it is a weak buy signal bar. As a result, there might be more sellers than buyers above its high.<p>Furthermore, if today gaps above yesterday’s high, the gap will be small. Small gaps typically close in the 1st hour and have little significance.<p>Even if today gaps up, the body on the weekly chart will probably remain small. The bulls would need a big bull trend day to change that. After 4 trading range days, that is unlikely. Therefore, the fight today will probably be over the size of the body on the weekly chart and whether the week closes above or below its open.<p>While a strong trend day can come at any time, there is no technical reason for one to form today. More likely, today will be a trading range day. The final hour might have a big move up or down. Both the bulls and bears will try to create some sign of strength at the end of the week. They want to influence the probabilities for next week. A bear body on the weekly chart will make a pullback likely over the next few weeks.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Emini-test-of-open-of-week-after-8-bull-trend-bars-on-weekly-chart.png\"><img src=\"2019-2-22.png\" alt=\"Emini test of open of week after 8 bull trend bars on weekly chart\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/EURUSD-Forex-double-top-bear-flag-at-bottom-of-trading-range.png\"><img loading=\"lazy\" src=\"2019-2-22-1.png\" alt=\"EURUSD Forex double top bear flag at bottom of trading range\"></a></figure><p>The EURUSD daily Forex chart rallied for 2 weeks in a micro wedge bull channel to the 20 day EMA. The bears see a higher high double top bear flag. But, it is at the bottom of a 4 month trading range and 80% of trading range breakouts fail. Consequently, a selloff from here is more likely to form a double bottom with last week’s low. The trading range should continue.<p>Every trading range over the past couple years broke out after about a couple of months. This one has lasted 4 months. Traders should expect a breakout soon. But, until there is a breakout, there is no breakout. Reversals are always more likely. Traders will continue to look for reversals every few days until there are consecutive closes above or below the range.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been sideways for 3 days. Traders are deciding if there will be one more one high in the 4 day rally and then a pullback, or if the pullback is underway. Because the range is tight, day traders are scalping for 10 – 20 pips.<p>The most important price today is last week’s high of 1.1342. Last week is a buy signal bar for a double bottom with the November low. But, last week was a bear bar and therefore a low probability buy setup. The odds favor more sellers than buyers above last week’s high. However, if the bulls can show signs of strength, they still can get a reversal up. One sign would be a close this week above last week’s high.<p>The bears always want the opposite. They therefore are selling reversals down from above last week’s high.<p>So far, both the bulls and bears are scalping. This week has been oscillating above last week’s high in a small range. That will likely continue all day.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Emini-trading-range-day-in-by-vacuum-test-of-2800.png\"><img loading=\"lazy\" src=\"2019-2-22-2.png\" alt=\"Emini trading range day in by vacuum test of 2800\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>After an early rally in a wedge bull channel, the Emini entered a trading range. There was a brief, late selloff that tested the open of the day.<p>The day formed another bull trend bar on the daily chart. In addition, the 2800 Big Round Number and triple top are magnets that are just a little higher.<p>This week was the 9th consecutive bull trend bar on the weekly chart. That is unusual and therefore climactic. However, there is no top yet and there are magnets above. The odds favor at least slightly higher prices before a 2 – 3 week pullback begins.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-2-22"
    }
  ],
  "23": [
    {
      "data": [
        "<article class=\"post-87072 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini Parabolic wedge buy climax just below 2800 resistanceWeekend market update: February 23, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini Parabolic wedge buy climax just below 2800 resistance</strong><br>Weekend market update: February 23, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-02-23T00:30:56-08:00\">February 23, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2><strong>Market Overview</strong></h2><p>The<strong>Emini</strong>weekly chart has had 9 consecutive bull trend bars. This is rare and climactic. It is getting drawn to the triple top on the daily chart that is just above 2,800. Because the rally is extreme, bulls will soon take some profits. This will soon create at least a 50 point pullback lasting 2 – 3 weeks.<p><strong>Crude oil</strong>has rallied strongly over the past 2 months. It is in a resistance zone between the 20 week EMA and $60. The rally will probably pull back for several weeks once it gets closer to $60.<p>The<strong>EURUSD Forex</strong>market has been in a tight range for 4 months. This is unusual and therefore there will probably be a breakout soon. The market is sideways because the bulls and the bears are balanced. Consequently, there is a 50% chance of the breakout being up or down.<h2><strong>Crude oil Futures market:</strong><br>Strong minor reversal up to near resistance</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Crude-oil-weekly-chart-bear-rally-stalling-at-resistance.png\"><img loading=\"lazy\" src=\"2019-2-23.png\" alt=\"Crude oil weekly chart bear rally stalling at resistance\"></a></figure><p>The crude oil futures chart broke above last week’s outside up bar and the 20 week EMA. However, this week was a small bull bar. This is therefore a weak breakout and unlikely to lead to much higher prices.<p>The 5 week tight trading range is an area of agreement. Consequently, it is a magnet. Although the current rally might continue to the 50% retracement level at around $60, it will then probably get pulled back into the tight trading range.<p>As strong as the current rally has been, it is the 1st leg up from a strong selloff. A trading range over the next many months is more likely than a bull trend. The rally is simply searching for the top of the range. The top might be $65 or more, but probably not much more.<p>A Big Down, Big Up move creates Big Confusion. That is a hallmark of a trading range. Crude oil will probably stay between $40 and $65 for many months and possibly all year.<h2><strong>EURUSD weekly Forex chart:</strong><br>Apex of wedge, in Breakout Mode</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/EURUSD-weekly-Forex-chart-at-apex-of-triangle-ahead-of-Brexit.png\"><img loading=\"lazy\" src=\"2019-2-23-1.png\" alt=\"EURUSD weekly Forex chart at apex of triangle ahead of Brexit\"></a></figure><p>The EURUSD weekly Forex chart has been selling off for the past year. After a 4 month trading range, the bears are hoping that the past 2 weeks is a resumption of that bear trend.<p>However, there was a bull body this week. While last week was the 2nd consecutive bear bar, its low was above the November low. Furthermore, it had a big tail below and it closed above the November and December lows.<p>The market is simply waiting for a catalyst, and the obvious one is the Brexit deal. When a chart is in breakout mode like this, there is a 50% chance of the breakout being up or down. Furthermore, there is a 50% chance that the initial breakout fails and reverses. Until there is a clear breakout, traders will continue to look for reversals every couple weeks.<h2><strong>Monthly S&amp;P500 Emini futures chart:</strong><br>Strong rally to middle of yearlong trading range</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Emini-monthly-chart-buy-signal-at-2800.png\"><img loading=\"lazy\" src=\"2019-2-23-2.png\" alt=\"Emini monthly chart buy signal at 2800\"></a></figure><p>The monthly S&amp;P500 Emini futures chart has rallied over the past 2 months. However, the bull bar in February is much smaller than that in January. Furthermore, the rally might simply be a buy vacuum test of the top of huge bear bar in December. Finally, the 3 month selloff last year was huge and the current rally has retraced only a little more than half.<p>Therefore, as strong as the rally has been, it is still only a bull leg in a yearlong trading range. Seven of the 14 last bars have been between 2,600 and 2,800. Consequently, that range is an important magnet. Traders should therefore expect the monthly chart to be there for more bars this year.<p>This is true even if the current rally continues up to a new all-time high. The rally will probably have a hard time escaping the gravitational pull of that area of agreement. As a result, there will probably be more sellers than buyers above last year’s high. There is no sign yet that the Emini is about to break free of last year’s trading range.<h2><strong>Weekly S&amp;P500 Emini futures chart:</strong><br>9 consecutive bull bars so unsustainable</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Emini-weekly-chart-has-9-consecutive-bull-trend-bars-at-2800.png\"><img loading=\"lazy\" src=\"2019-2-23-3.png\" alt=\"Emini weekly chart has 9 consecutive bull trend bars at 2800\"></a></figure><p>The weekly S&amp;P500 Emini futures chart had bull bodies for each of the prior 9 weeks. This is unusual and therefore unsustainable and climactic. I could find only one instance in the past 20 years of a streak of more than 9 consecutive bull trend bars on the weekly chart. There were 2 streaks of 9 bars. Each streak of 8 or 9 consecutive bull trend bars led to at least 2 – 3 weeks of sideways to down trading.<p>Furthermore, Carter Worth on CNBC looked back at streaks of 8 bull bars with a 10% rally over the 120 year history of the Dow Jones Industrial Average, like what we have today. This has happened 15 times. Ten of the 15 times led to the S&amp;P being lower one and two months later. The average decline was more than 2%.<p>However, there is no sign of a top. The odds therefore continue to favor at least slightly higher prices.<h3>Bull micro channel is a climax, but it is a sign of strong bulls</h3><p>This week’s low is above last week’s low. In fact, for the past 8 weeks, every low has been above the low of the prior week. This is a 9 week bull micro channel. While unsustainable and a pullback is likely, the bulls will be eager to buy below the low of the prior week. As a result, the 1st pullback will probably last 3 weeks or less.<h3>Price action was stronger this week</h3><p>Six weeks ago, there was a big bull bar closing on its high. The next week was a doji. Four weeks ago, there was another strong bull bar followed by a doji. Finally, 2 weeks ago was another strong bull bar. However, what happened this week? Instead of another doji bar, this week was also a bull bar closing near its high.<p>Why is that important? Because it is a change in the series of the past 6 weeks. Instead of another weak bar following a strong bar, there are now consecutive strong bars. Yes, this could represent a final climactic end to the rally. But, it also might lead to a quick 1 – 3 more weeks up before the bulls are exhausted.<h3>Possible gap up on the weekly chart next week</h3><p>This acceleration up increases a chance of a gap up next week on the weekly chart. Furthermore, with the December sell climax high only about 15 points above this week’s high, the Emini might even gap above that high. On the daily chart, that is the 3rd high in the triple top.<p>A gap above major resistance forces traders to make quick decisions. Many will place bets on what they expect to follow. The bulls will try to squeeze the bears, hoping for a quick 50 point rally.<h3>Where are the bears?</h3><p>While the bears have been absent for 2 months, they are still out there. They are waiting for some price that they believe is too high. Once there, they will sell.<p>Also, the bulls will take profits at some point. Resistance is an obvious possibility. Consequently, instead of a strong new leg up on a gap up, there is an increased chance that it will be a blow-off top and the end of the 2 month rally. If enough bulls take profits and enough bears sell, the Emini could easily fall 100 – 200 points over the next several months.<p>Even if that were to happen, the rally has been very strong. It is likely to be the 1st of at least 2 legs up this year. Therefore, even a 200 point selloff lasting 2 months will probably form a higher low. The odds are that the 2019 bull trend will test the all-time high at some point in 2019.<h2><strong>Daily S&amp;P500 Emini futures chart:</strong><br>Parabolic wedge buy climax just below 2800 resistance</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Emini-daily-chart-has-parabolic-wedge-buy-climax-below-triple-top-and-2800-resistance.png\"><img loading=\"lazy\" src=\"2019-2-23-4.png\" alt=\"Emini daily chart has parabolic wedge buy climax below triple top and 2800 resistance\"></a></figure><p>The daily S&amp;P500 Emini futures chart has rallied strongly in a tight bull channel for 9 weeks. Because there are 3 legs up over the past 6 weeks, the rally is a parabolic wedge buy climax. However, most days are bull days closing above their midpoints. This makes at least slightly higher prices likely.<h3>2800 is a strong magnet</h3><p>The Emini has tested 2,800 many times during the past 15 months. July’s rally went far above. But, the Emini has been unable to hold above it. The October-November-December triple top is just above 2,800. Each of the 3 tops was an attempt to break above 2,800, and each failed.<p>The current rally is another attempt. This one is much stronger that the others. Therefore, the odds are that the Emini will successfully break above this resistance.<p>But when? Prior to this week, a 2 – 3 week pullback was likely to form before the breakout. However, the Emini over the past 2 weeks is getting vacuumed up to the target.<h3>Buy vacuum test of resistance</h3><p>In a buy vacuum test of resistance, traders see the momentum increasing as the market approaches the magnet. They conclude that the rally will reach the target. If you are a bear, why sell here when you believe you soon can sell higher? Therefore, there is a relative lack of sellers just below the target. The market will therefore race up in search of a price where the sellers will sell again.<p>If you are a bull, you are buying because you expect one of two things will happen. First, the rally continues up to the target and you make a profit. Second, there is a pullback.<p>But, when the bull channel is tight, as it has been, the bulls will buy the pullback. That includes bulls who are buying today at the high of the rally. They will buy more 20 – 50 points lower. Why? Because they correctly believe that the best the bears can get over the next month is a pullback in what will become either a bull flag or a trading range.<p>A trading range has bull and bear legs. After the 1st leg down, the bulls are confident of another leg up to where they most recently bought. That will allow them to get out without a loss. If they buy more during the pullback, they will make a profit on their lower entry.<h3>What will happen next week?</h3><p>The bulls will probably take profits around 2,800, or just above the triple top. Since many weak bears will exit above the triple top, it is now likely that the rally will break at least a little above it within a couple of weeks.<p>There is a small chance of a huge break above the triple top and a test of the all-time high. More likely, a break above the triple top will soon find sellers. The sellers will be bulls taking profits and bears betting that the profit-taking of the bulls will create a pullback.<hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-2-23"
    }
  ],
  "25": [
    {
      "data": [
        "<article class=\"post-87070 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini 9th bull week is buy vacuum test of 2800 Intraday market update: Monday February 25, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini 9th bull week is buy vacuum test of 2800</strong><br>Intraday market update: Monday February 25, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-02-25T06:20:35-08:00\">February 25, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini 9th bull week is buy vacuum test of 2800</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Last week was the 9th consecutive week with a bull bar on the weekly chart. There has been only one instance in the past 20 years with a longer streak. Every streak of 8 or more consecutive bull bars led to at least 3 weeks sideways to down. That therefore is likely again here.<p>Will this week be the 10th consecutive bull trend bar? Probably not. Consequently, traders will look for any rally this week to reverse down. That would begin the start of a 2 – 3 week pullback.<p>Why hasn’t the Emini turned down yet? Because it cannot escape the gravitational pull of 2800. The Emini has repeatedly tried to break strongly above it for over a year. It failed every time, including the rally to the September high.<p>There is a triple top just above last week’s high. It is also a magnet. The bulls hope to break strongly above the triple top and 2800 before there is a pullback. With the continued momentum up, they will likely get their breakout today or tomorrow. However, the extreme buy climax will probably limit the rally over the next 1 – 3 weeks.<p>Since the Emini is very close to the targets above, it might get vacuumed up there today. There is therefore an increased chance of a big bull day today or tomorrow. But, most of the days over the past week had predominantly trading range price action. Consequently, that is most likely for today. This is true even if the Emini breaks above 2800.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 14 points in the Globex session. This week will therefore probably gap above last week’s high. In addition, it might gap above the 2800 Big Round Number and one or more of the tops in the 3 month triple top.<p>Because the Emini is testing major resistance, there is an increased chance of a big move up or down today. However, only 20% of days have strong trends from the open that last all day. The odds therefore favor at least one reversal in the 1st hour.<p>Most days enter a trading range in the first 60 – 90 minutes. The bears try to create a good sell signal bar for a wedge top or double top. In addition, the bulls try to create a reversal up from around the EMA. They want a good buy signal bar and a wedge bull flag or double bottom.<h2>Friday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Emini-trading-range-day-in-by-vacuum-test-of-2800.png\"><img src=\"2019-2-25.png\" alt=\"Emini trading range day in by vacuum test of 2800\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/EURUSD-bear-flag-but-bottom-of-trading-range.png\"><img loading=\"lazy\" src=\"2019-2-25-1.png\" alt=\"EURUSD bear flag but bottom of trading range\"></a></figure><p>The EURUSD daily Forex chart has bounced for 2 weeks from the bottom of a 4 month trading range. The rally has stalled at the 20 day EMA. It is a bear flag. If there is a break above last week’s high, but then a reversal, the bear flag will be a wedge.<p>However, trading ranges resist breaking out. Consequently, the odds are against this bear flag leading to a 300 pip measured move down below 1.12. More likely, there will be buyers around the low from 2 weeks ago. They would create a double bottom with that low and then a 2 – 4 week rally to above the middle of the range. Alternatively, there could be a breakout above the bear flag without a test of the low.<p>The 4 month range is telling us that the bulls and bears feel the current price is fair. But, all prior trading ranges over the past 2 years ended within a couple months. Therefore, the tension has been building up for an unusually long time.<p>When that is the case, once there is a successful breakout, it will probably have more energy and endurance. It will therefore probably last for several months and move at least 300 pips.<h3>Overnight EURUSD Forex trading</h3><p>A tight trading range is a breakout mode pattern. But a breakout up or down will likely be brief. The odds favor a test of the low from 2 weeks ago. Consequently, a bull breakout will probably fail. Since a higher low is likely, a bear breakout would probably only last 2 – 3 days.<p>The past 3 days were doji bars in a tight trading range. Today is testing both the top and bottom of that range. Because the bars are small and the range is only 30 pips tall, day traders are scalping.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Emini-Failed-breakout-above-December-stock-market-crash-high.png\"><img loading=\"lazy\" src=\"2019-2-25-2.png\" alt=\"Emini Failed breakout above December stock market crash high\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini gapped up on the weekly chart. It also broke above the December stock market crash high and the 2800 Big Round Number. However, it then reversed down and tested 2800.<p>Today is a sell signal bar for tomorrow. But, the 2 month bull channel is tight. A tight bull channel typically does not reverse into a bear trend. It usually has to transition into a trading range 1st. As a result, the downside risk is not great over the next week.<p>Because the buy climax is extreme, there is probably not much left to this rally before there is a 2 – 3 week profit-taking pullback.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-2-25"
    }
  ],
  "26": [
    {
      "data": [
        "<article class=\"post-87306 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini breakout above December stock market crash high and 2800Intraday market update: Tuesday February 26, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini breakout above December stock market crash high and 2800</strong><br>Intraday market update: Tuesday February 26, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-02-26T06:20:08-08:00\">February 26, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini breakout above December stock market crash high and 2800</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>There has been only one instance of more than 9 consecutive bull bars on the weekly chart in the past 20 years. This is now the 10th week in the streak. Consequently, this week will probably close below the open of the week, which was yesterday’s open.<p>Yesterday created a gap up on the weekly chart. If the bulls take profits this week, their selling will probably close the gap above last week’s high. In addition, there would finally be a bear body on the weekly chart. If so, the Emini will probably pull back for 2 – 3 weeks and 50 – 100 points.<h3>Sell signal on the daily chart</h3><p>Yesterday was the best bear bar in 2 months. In addition, the daily chart is in a parabolic wedge buy climax at major resistance. The reversal is taking place just above 2800. The bulls have failed many times at and above 2800 for more than a year. Also, yesterday was a failed breakout above the December stock market crash high.<p>Consequently, if today forms a buy signal bar, the bears will be more willing to sell above its high and above yesterday’s high. The odds are that a 2 – 3 week pullback is beginning, even if there is a brief push above yesterday’s high.<p>This is a logical area for the bulls to begin to take some profits. If they do, they usually will wait about 10 bars before buying again. Therefore, there will probably be a 2 – 3 week pullback beginning this week or next week.<p>Can the bears get a strong selloff? Probably not. When a bull channel is tight, the 1st reversal down is typically minor. However, if the bears can create a trading range for a couple of weeks, they will have a double top. That would have a better chance of a bigger pullback.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 6 points in the Globex session. The daily chart is still in a Small Pullback Bull Trend. As a result, yesterday’s selloff will probably lead to another 1 – 2 day pullback. The bulls will then try to resume the breakout above 2800 and the triple top.<p>But, the odds are that the daily chart is transitioning into a pullback for 2 – 3 weeks. Therefore, the bears will be more willing to sell rallies and above prior highs.<p>On the 5 minute chart, yesterday was a bear channel. A bear channel is a bull flag. There is a 75% chance of a breakout above the bear channel today or tomorrow. But, the daily chart is losing its bullishness. Consequently, a rally today will probably lead to a trading range and not a strong bull trend.<p>Can yesterday’s selloff continue today? Yes, but the selloff was weak. Until the bears create a strong reversal down on the 5 minute chart, the best the bears will probably get is a trading range over the next week. Since yesterday looked like a bear leg in a trading range, today will probably have at least one bull leg lasting 2 – 3 hours.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Emini-Failed-breakout-above-December-stock-market-crash-high.png\"><img src=\"2019-2-26.png\" alt=\"Emini Failed breakout above December stock market crash high\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex bear flag at bottom of 4 month trading range</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/EURUSD-Forex-bear-flag-at-bottom-of-4-month-trading-range.png\"><img loading=\"lazy\" src=\"2019-2-26-1.png\" alt=\"EURUSD Forex bear flag at bottom of 4 month trading range\"></a></figure><p>The EURUSD daily Forex chart has been in a tight range for 6 days. The bears want this to be the top of a bear flag. They then want a break below the November low and 1.12.<p>However, the bulls either want a bull breakout above the bull flag, or a bear breakout and then a double bottom with the February low. Since most trading range breakout attempts fail, the bull case is more likely. But, it is only slightly so.<p>This is because the 4 month range is about twice as long as every other range over the past 2 years. Consequently, it is likely to break out soon. The continuation of the trading range means the odds favor a leg up after the February leg down.<p>But the extreme duration of the range increases the chance of an impending successful breakout. That breakout has a 50% chance of being down. The result is that the probability now only slightly favors a continuation of the range instead of a bear breakout.<p>Over the past 2 weeks, almost every leg up and down reversed after 2 – 3 weeks. Therefore, the odds favor a test down by the end of next week. If there is one more push above last week’s high and then a reversal down, the bears would have a wedge bear flag. That is a reliable pattern. However, the selloff would probably form a higher low.<h3>Overnight EURUSD Forex trading</h3><p>Today is the 5th day in a 50 pip tall tight trading range. When the range is small like that, it means day traders are scalping. Since there is no sign of a breakout of this 6 day range, day traders will continue to scalp.<p>The odds favor a break of the 6 day range within a week. But there will probably be sellers above 1.14 because that would be about a 50% pullback, and the 3 week rally is still a bear flag. Also, a reversal there would lead to a test of the February low, which is likely.<p>There will also likely be buyers below 1.13. That would be about a 50% pullback of the 3 week rally and a test of a Big Round Number.<p>With buyers below and sellers above, even a breakout this week will probably not go very far.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Emini-doji-day.png\"><img loading=\"lazy\" src=\"2019-2-26-2.png\" alt=\"Emini doji day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>Despite 2 strong rallies today, the Emini formed a trading range day. It closed at the open and it is a weak High 1 bull flag for tomorrow. However, Monday was a strong sell signal bar in a parabolic wedge buy climax. In addition, 2800 has been resistance for over a year. Consequently, there might be more sellers than buyers either above today’s high or Monday’s high.<p>The open of the week is a strong magnet above. Therefore, the Emini will likely test it one more time this week. If the bears can get the week to close below the open, they will break the streak of 9 consecutive bull bars on the weekly chart.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-2-26"
    }
  ],
  "27": [
    {
      "data": [
        "<article class=\"post-87309 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini weak High 1 bull flag at 2800 triple topIntraday market update: Wednesday February 27, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini weak High 1 bull flag at 2800 triple top</strong><br>Intraday market update: Wednesday February 27, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-02-27T06:20:45-08:00\">February 27, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini weak High 1 bull flag at 2800 triple top</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday was a trading range day. On the daily chart, it is a High 1 bull flag and therefore a buy signal bar. Every pullback this year ended after 1 or 2 bars. The bulls hope the bull trend will resume today.<p>However, the Emini is at strong resistance at 2800 and the triple top on the daily chart. In addition, yesterday was a doji day and not a strong bull trend day. Furthermore, there is a parabolic wedge buy climax.<p>Monday might be the start of 2 – 3 weeks of profit taking. Consequently, yesterday is not a strong buy setup. There may be sellers above yesterday’s high and above Monday’s high.<p>How will traders know that a pullback is underway? They will begin to see 2 or more especially big bear bars closing on their lows on the 5 minute chart. In addition, there will be bear trends. Also, there will often be selling in the final 30 minutes.<p>Finally, the pullback on the daily chart will last 3 or more days. Until then, traders will assume that the 2 month Small Pullback Bull Trend is still in effect.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 4 points in the Globex session. Since yesterday was a doji bar on the daily chart, it was neutral. Consequently, there will probably be buyers around its low and sellers around its high.<p>The bears see yesterday as the entry bar for the selloff from resistance above 2800. A doji bar is a weak entry. When that is the case, the bears usually need a micro double top. Therefore, there will probably be a test up this week.<p>Furthermore, the open of the week is important this week. After 9 bull weeks on the weekly chart, the bulls will try for a 10th. That is another reason for a test up to 2808 today or tomorrow.<p>Because the 2 day selloff has been weak, the daily chart is in a strong bull trend, and the open of the week is a magnet above, the odds favor sideways to up for at least a day or two.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Emini-doji-day.png\"><img src=\"2019-2-27.png\" alt=\"Emini doji day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>Wedge bear flag in middle of 4 month trading range</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Wedge-bear-flag-in-middle-of-4-month-trading-range.png\"><img loading=\"lazy\" src=\"2019-2-27-1.png\" alt=\"Wedge bear flag in middle of 4 month trading range\"></a></figure><p>The EURUSD daily Forex chart is back to the middle of its 4 month trading range. Legs up and down have lasted 2 – 3 weeks. This leg will probably end soon.<p>The February selloff was unusually strong. When that is the case, the bear low typically gets tested. Consequently, the daily chart will probably begin retrace at least half of the 3 week rally within a week.<p>While the February selloff was strong, so were many of the rallies over the past 4 months. Trading ranges always have legs that look like they will begin a trend. But, a hallmark of a trading range is disappointment.<p>When traders see strong legs repeatedly reversing, they correctly conclude that reversals are more likely than breakouts. As a result, they exit trades within 2 – 3 weeks and look for a trade in the opposite direction. That will probably happen within the next few days.<p>The daily chart is in Breakout Mode. It is waiting for information from Brexit. Once the future is clear, there will be a trend up or down. A reasonable goal is a 300 – 400 pip measured move based on the height of the 4 month range.<p>The breakout can be up or down. Finally, there is a 50% chance that the 1st breakout will reverse and there would then be an opposite breakout.<h3>Overnight EURUSD Forex trading</h3><p>The 3 week rally has had 3 legs up. It is therefore a wedge bull channel. A wedge bull channel typically breaks to the downside and sells off for a couple legs. The swing down will probably begin this week.<p>There is a 40% chance of a bull breakout above a wedge bear flag. That then usually leads to a couple legs up. A measured move up from here is at the top of the 4 month range.<p>The 5 minute chart has been in a 30 pip range overnight after yesterday’s bull breakout. The odds are that the daily chart will start to turn down within a few days. Consequently, day traders will continue to scalp, but look for a downside breakout. Once they see it, they will swing trade. In addition, they will be more willing to sell rallies than buy dips for a week or two.<p>Less likely, the bulls will get the upside breakout. If so, day traders will be more eager to buy dips than sell rallies.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Emini-wedge-bottom-and-bull-trend-reversal.png\"><img loading=\"lazy\" src=\"2019-2-27-2.png\" alt=\"Emini wedge bottom and bull trend reversal\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini sold off in a sell climax on the open. It reversed up from a wedge bottom. However, it stalled near the 60 minute EMA and last week’s high. The open of the week is an important magnet above. Therefore, the Emini will probably test it tomorrow or Friday.<p>Today was the 2nd day in a pullback on the daily chart. It is therefore a buy signal bar for tomorrow for a High 1 bull flag. But, the weekly buy climax is extreme and Monday was a strong sell signal bar. There will probably be sellers around Monday’s high.<p>Tomorrow is the last day of February. No matter what tomorrow does, February will probably be a bull bar closing near its high on the monthly chart.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-2-27"
    }
  ],
  "28": [
    {
      "data": [
        "<article class=\"post-87312 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini High 1 bull flag but at triple topIntraday market update: Thursday February 28, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini High 1 bull flag but at triple top</strong><br>Intraday market update: Thursday February 28, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-02-28T06:20:49-08:00\">February 28, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini High 1 bull flag but at triple top</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Today is the final day of the month. On the monthly chart, February will probably be a bull trend bar closing near its high.<p>On the daily chart, every pullback for the past 2 months lasted only 1 – 2 days. Yesterday was the 2nd day of a pullback. It is therefore a High 1 bull flag and a buy signal bar for today.<p>However, Monday was a strong sell signal bar. In addition, the daily chart is in a parabolic wedge buy climax at resistance. There is a triple top just above 2800 and Monday reversed down from above the 3rd top.<p>Because the buy climax on the weekly chart is so unusually extreme, the bulls will probably begin to take profits for 2 – 3 weeks. That profit-taking may have started on Monday. Therefore, while yesterday is a buy signal bar, there might be more sellers than buyers above its high and above Monday’s high.<p>The bulls want a 10th consecutive bull bar on the weekly chart. Monday’s selloff never came back to test the open of week at 2808.00. Consequently, the bulls will try to test it today or tomorrow.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 4 points in the Globex session. Yesterday was a good buy signal bar in a bull trend on the daily chart. The Emini today will probably have to go above yesterday’s high to trigger the buy signal. Traders want to know if the bulls will be willing to buy in a buy climax at the top of the 4 month range.<p>Also, the bears want to see if they can turn the bulls back down a 2nd time. If they can, that would create a micro double top and increase the likelihood of a 2 -3 week pullback.<p>Yesterday’s high is an important magnet. And so is the open of the week at 2808.00. Therefore, the odds favor a test of 2808.00 today or tomorrow. The bulls will therefore buy pullbacks.<p>Because the bears expect a test of 2808.00 as well, there is not a strong reason to sell below there. But, they probably will sell there to make the week have a bear body when the week closes tomorrow.<p>Can today be a huge bull day that breaks far above Monday’s high? Or, can today reverse down to far below yesterday’s low? Neither is likely. The odds favor a test of 2808 today or tomorrow. Most of the trading for more than a week has been predominantly sideways. That is likely again today.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Emini-wedge-bottom-and-bull-trend-reversal.png\"><img src=\"2019-2-28.png\" alt=\"Emini wedge bottom and bull trend reversal\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD wedge rally to middle of 4 month trading range</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/EURUSD-wedge-rally-to-middle-of-4-month-trading-range.png\"><img loading=\"lazy\" src=\"2019-2-28-1.png\" alt=\"EURUSD wedge rally to middle of 4 month trading range\"></a></figure><p>The EURUSD daily Forex chart rallied back to the middle of its 4 month range. The rally has had 3 to 4 pushes up and is therefore a wedge. A wedge rally is a buy climax. Buy climaxes typically result in exhausted bulls. They usually lead to a pause. Consequently, the odds favor a few sideways days. This is especially true since trading range markets spend most of their time in the middle third of the range.<p>The bulls want today to close on its high and far above yesterday’s high. They then want tomorrow to also be a bull day. If they get that, today’s breakout above the wedge bear flag will probably continue up to the top of the 4 month range.<p>More likely, the rally will stall today or tomorrow and the chart will go sideways for several days. Look back over the past 4 months. Most of the trading was between 1.13 and 1.15. This is where the market currently is.<p>Trading ranges always have strong legs up and down. But, reversals are more likely than successful breakouts. I said this during the early February collapse, even though the selloff was strong. I also said that at the January high. Nothing has changed. There is no breakout until there is a breakout. Until then, traders correctly expect reversal every 2 – 3 weeks.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart rallied 50 pips overnight. However, it pulled back 30 pips over the past hour. The bulls want a close today far above yesterday’s high, but that is unlikely.<p>Yesterday had a bear body on the daily chart. The rally is in a wedge bull channel. And, the market is back to the middle of its 4 month range. Consequently, there will be probably more sellers than buys above yesterday’s high. Day traders will look to sell rallies to around yesterday’s high.<p>Since the 3 week rally has been strong, a big bear day is unlikely. Consequently, the bulls will buy a 30 – 50 pip pullback. The result will probably be a trading range day.<p>Furthermore, the 5 minute chart will probably enter a trading range between 1.13 and 1.14 for a few days. That is because there was a pause for 3 days last week around 1.13, and channels typically evolve into trading ranges.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Emini-trading-range-day-and-doji-day.png\"><img loading=\"lazy\" src=\"2019-2-28-2.png\" alt=\"Emini trading range day and doji day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>Today was the last day of the month, and February closed near its high. The weekly chart is more important. The bulls have a streak of 9 consecutive bull bars on the weekly chart. I only found one longer streak in the 20+ year history of the Emini. Consequently, the odds favor a close below 2808.00 tomorrow. However, it is a magnet, and the bulls will try to test it tomorrow. It is probably too far above for the bulls to get there tomorrow.<p>Monday’s bear reversal is probably the start of a 2 – 3 week pullback. This is true even if next week goes slightly above this week’s high.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-2-28"
    }
  ]
}