{
  "1": [
    {
      "data": [
        "<article class=\"post-90836 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini oo consecutive outside bar buy signal on monthly chart\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini oo consecutive outside bar buy signal on monthly chart</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-07-01T06:20:30-07:00\">July 1, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Monday July 1, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>June is a buy signal bar on the Emini monthly chart. There is an oo bull flag (consecutive outside bars). If July goes above the June high, which it probably will given the likely big gap up today, it will trigger the buy signal and probably trade higher for a few months.<p>The bears instead want to keep July from going above the June high. If the monthly buy signal triggers, they will sell, hoping to make the breakout fail. If they can get July to close near its low, it would then be a sell signal bar for an expanding triangle top on the monthly chart. The top of the triangle is around 3040, which is therefore a magnet above.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 34 points in the Globex session. Today will therefore probably gap up to a new all-time high. That will trigger the monthly buy signal.<p>A big gap up increases the chance of a trend day. A bull trend day is slightly more likely. But, there is only a 20% chance of a strong trend up or down from the open.<p>When the Emini opens far above its 20 bar EMA, many traders do not want to pay far above the average price. Consequently, a big gap up typically forms an early trading range. The bears will sell rallies. They want a double top or wedge top and an early high of the day. The bulls want any early selloff to around the EMA to reverse up from a double bottom or a wedge bottom.<p>These trading range openings for the 1st 60 – 90 minutes occur 80% of the time when there is a big gap up or down. That 2 sided price action indicates balance and it reduces the chance of a very strong trend day. The trend usually weakens after a few hours. There is then a trading range, which can last for the remainder of the day, or the trend can resume or reverse.<h2>Friday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-end-of-quarter-window-dressing-rally.png\"><img src=\"2019-7-1.png\" alt=\"Emini end of quarter window dressing rally\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/EURUSD-Forex-pullback-and-high-2-bull-flag-at-neck-line-of-head-and-shoulders-bottom.png\"><img loading=\"lazy\" src=\"2019-7-1-1.png\" alt=\"EURUSD Forex pullback and high 2 bull flag at neck line of head and shoulders bottom\"></a></figure><p>The EURUSD daily Forex chart broke above an ii bull flag on Friday. It then broke below overnight. However, so far, today is the 4th consecutive doji bar. This is not strong selling. More likely, the 5 day pullback is a test of the neck line of the 4 month head and shoulders bottom. The March 20 lower high is major and therefore a magnet above. Since it is nearby, the rally will probably test it within 2 weeks.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart sold off overnight to just above 1.13. I have been saying for over a week that there would be a pullback to around 1.13. With the 40 pip reversal up, this might be the end of it.<p>However, there has been no bull bar in 5 days. Consequently, the bulls have not yet been buying aggressively. Therefore, this pullback might test below 1.13 and last another week or so.<h3>Day traders will scalp today</h3><p>The 40 pip rally over the past 5 hours has had only small pullbacks. However, the rally is back to Friday’s low. Friday was a sell signal bar on the daily chart for a 4 day Low 2 top, but this rally weakens the bear case.<p>The bears will begin to sell around Friday’s low and in the 4 day tight trading range. They want the rally to be simply a pullback to the 4 day tight trading range. They then want another leg down to below 1.13.<p>Because the rally is back to the 4 day tight trading range, bear day traders will begin to sell for 10 pip scalps. They are confident that the 5 minute chart will again have trading range price action now that it is back in last week’s trading range. However, they know that today will probably not get back to the overnight low.<p>Since today is a possible buy signal bar on the daily chart, the bulls want today to be a bull bar that closes near its high. They will therefore buy 20 pip pullbacks. However, they, too, will probably scalp since the rally is back in last week’s trading range and is not likely to break above it today.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p>I will post chart after the close.<figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-monthly-oo-buy-signal-and-small-pullback-bear-trend.png\"><img loading=\"lazy\" src=\"2019-7-1-2.png\" alt=\"Emini monthly oo buy signal and small pullback bear trend\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini gapped up on the daily, weekly, and monthly charts today. The selloff closed the gaps on the weekly and monthly charts, but the daily gap stayed open. By going above the June high, the Emini triggered a monthly oo buy signal.<p>The bears had a Small Pullback Bear Trend for 5 hours. They were unable to close the gap on the daily chart. There was an oo bottom just above Friday’s high, and it led to a rally to around the June high.<p>Whenever there is a big gap, there is an increased chance of the Emini going sideways for a few days. That is what is likely here. The bears see today as a sell signal bar for a failed breakout to a new high. However, the bulls see it as both a breakout and a pullback. The odds favor a move to above 3,000 this month.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-7-1"
    }
  ],
  "2": [
    {
      "data": [
        "<article class=\"post-90989 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini gap up triggered oo monthly buy signal\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini gap up triggered oo monthly buy signal</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-07-02T06:20:24-07:00\">July 2, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Tuesday July 2, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday had a big gap up to a new all-time high, but sold off for 5 hours. There was a gap up on the weekly and monthly charts as well, but both closed during the 5 hour Small Pullback Bear Trend.<p>The Emini rallied from just above Friday’s high and the day closed just below last month’s high. That undid most of the damage from the 5 hour selloff.<p>The gap up on the 5 minute chart yesterday was so far above the EMA on the 5 minute chart that many traders did not want to buy that far above the average price. Many prefer to buy a wedge pullback to around the EMA, and they want it to be a 50% pullback. It took 5 hours for them to get their setup. They bought strongly into the close yesterday.<h3>No good sell signals yet</h3><p>While yesterday had a bear body, there was a big tail below. In addition, the momentum up on the higher time frames is strong. Consequently, this is a weak sell setup on the daily chart. This is true despite the a small wedge buy climax on the daily chart. Traders expect only a minor reversal and not a bear trend. The Emini often goes sideways for a few days after a big gap up or down.<p>On the weekly and monthly charts, a reversal down would create a sell signal for an expanding triangle top. But, the rally will probably continue up to the top of the expanding triangle before reversing. That line is currently around 3040. As a result, any reversal down this week will probably be minor.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 1 point in the Globex session. Yesterday’s selloff retraced 50% of the rally that began on Friday. The late rally then retraced 50% of the 5 hour selloff. Big Up, Big Down, Big Up creates Big Confusion. Confusion is a hallmark of a trading range. Consequently, there is an increased chance of a trading range day today.<p>Furthermore, yesterday’s range was big and today will open in the middle 3rd of that range. Today will therefore overlap much of yesterday’s range. Traders will look to buy near yesterday’s low and sell near yesterday’s high. As a result, there is an increased chance of today being an inside day and mostly a trading range day.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-monthly-oo-buy-signal-and-small-pullback-bear-trend.png\"><img src=\"2019-7-2.png\" alt=\"Emini monthly oo buy signal and small pullback bear trend\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/EURUSD-Forex-higher-low-in-head-and-shoulders-bottom-reversal.png\"><img loading=\"lazy\" src=\"2019-7-2-1.png\" alt=\"EURUSD Forex higher low in head and shoulders bottom reversal\"></a></figure><p>The EURUSD daily Forex chart sold off strongly yesterday and retraced about half of last week’s rally. The bulls want another higher low and the a break above the March 20 major lower high. This is still slightly more likely than a resumption of the yearlong bear trend. The bulls need to get a reversal up within a week to continue their 2 month trend.<h3>Trading range always has both bull and bear trend</h3><p>It is important to notice that the chart has been in a trading range for 5 months. Every trading range is also in a bull trend and a bear trend. There is always both a reasonable buy and sell setup.<p>The market is in breakout mode. That means that there is constantly about a 50% chance of either an eventual bull or bear breakout.<p>Right now, the daily chart has been forming higher lows and highs for 2 months. Consequently, the odds continue to slightly favor higher prices. However, a break below the May low will make traders conclude that the bull trend has ended and the bear trend has resumed.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart reversed up 40 pips overnight after yesterday’s strong selloff. Traders are deciding whether yesterday was the resumption of the bear trend on the daily chart or just a test of the 20 day EMA and a 50% pullback from last week’s rally.<p>If the bears get a 2nd strong bear day today, the odds will favor a test of the June low and maybe the May 52 week low. It is currently more likely that yesterday was a sell vacuum test of support.<p>Traders will find out over the next week days. If the bulls can stop the selling and begin to form a base, the rally will resume. If the bears can get follow-through selling over the next few days, the selloff will test the June 18 higher low of 1.1181.<p>Since the selloff is now at support and there was no follow-through selling overnight, the 5 minute chart will probably form a trading range for at least a couple days. Both the bull and bear day traders will look for 10 – 20 pip scalps today. A strong trend up or down is less likely.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-triangle-on-open-then-2nd-leg-bull-trap.png\"><img loading=\"lazy\" src=\"2019-7-2-2.png\" alt=\"Emini triangle on open then 2nd leg bull trap\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>Today was an inside day and a trading range day until the rally into the close. Because today is an inside day closing on its high, it is a buy signal bar for tomorrow.<p>Tomorrow has an early close and Friday will probably be a low volume day because of the Thursday holiday. Consequently, there might not be much movement until next week.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-7-2"
    }
  ],
  "8": [
    {
      "data": [
        "<article class=\"post-90997 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini weak buy signal bar in wedge rally to 3000\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weak buy signal bar in wedge rally to 3000</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-07-08T06:20:31-07:00\">July 8, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Monday July 8, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini closed at a new all-time high on the weekly chart last week. While it finally broke above my minimum target of 3000, it failed to close above it. On the daily chart, the rally from the June 12 low is in a tight bull channel and it has 3 legs. It is therefore a parabolic wedge buy climax.<p>But, the past 3 days had bull bodies. Traders want to see a bear bar and a micro double top before looking for a test down. Also, Friday closed above its midpoint. It is therefore a buy signal bar for today. But, it has a tail on top. That makes it a weak buy setup. Many bulls will take some profits above its high.<p>Also, the rally has stalled at the 3,000 Big Round Number. As a result, the bears will begin to sell with limit orders above the high of the prior bar. This, combined with some profit-taking by the bulls increases the chance of trading range trading for at least a couple days.<p>Can a parabolic wedge on the daily chart begin a bear trend? It often does, but when it does, The Emini typically goes sideways to down for 10 or more bars 1st. An abrupt reversal down would be rare. Consequently, the downside risk on the daily chart is small for at least a week or two.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 7 points in the Globex session. Friday’s gap down and selloff was a Big Down move. The rally was a Big Up move. That creates Big Confusion and makes traders hesitate to bet on a big trend.<p>Instead, they expect the bulls to take profits on rallies and buy selloffs. Also, they know the odds favor bears selling rallies and taking profits around support. The result of both the bulls and bears buying low, selling high, and betting against big trends is usually a trading range.<p>Finally, I have mentioned several times over the past 2 weeks that there is a seasonally bullish tendency between June 26 and July 5. That window is now over. That further reduces the chance of a strong rally this week.<br><h2>Friday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-bull-trend-reversal-1.png\"><img src=\"2019-7-8.png\" alt=\"Emini bull trend reversal\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/EURUSD-Forex-bear-leg-in-5-month-trading-range.png\"><img loading=\"lazy\" src=\"2019-7-8-1.png\" alt=\"EURUSD Forex bear leg in 5 month trading range\"></a></figure><p>The EURUSD daily Forex chart sold off again on Friday. The bears hope that their yearlong bear trend is resuming. They see the 6 week rally as a double top with the March 20 high.<p>However, the bulls have been making higher lows and highs for 6 weeks. The chart has been in a trading range for 5 months. The bears need a break below the May 23 52 week low to convince traders that the bear trend is still intact. Without that, traders will bet that the 2 week selloff is just a bear leg in the 5 month trading range.<p>The bears will look to take profits at support, like the June 18 major higher low. Also, the bulls see that the selloff is now in the bottom half of the range. They therefore will be more willing to buy. But, since the selloff is now close to the support of the June 18 major higher low, many bulls will wait to buy closer to that low. Many also prefer to buy with stop orders after a strong reversal up.<p>Since that 1.1181 low is important and nearby, this selloff probably will continue a little lower. If there is a strong break below, traders will expect a new 52 week low. At the moment, the selloff will probably reverse up from above the May 23 low.<h3>Overnight EURUSD Forex trading</h3><p>The 5 minute chart has been in 25 pip range overnight. In addition, today not break below Friday’s low, despite Friday’s strong selloff. Today so far is an inside day. That is bad follow-through after a bear breakout.<p>If today closes above its open, it will have a bull body on the daily chart. It would therefore be a buy signal bar for tomorrow.<p>The daily chart sold off for 2 weeks in a tight bear channel. Since that channel has had 3 legs, it is a parabolic wedge sell climax. That increases the chance that the selling will end this week around the June 18 low.<p>Day traders expect a trading range after a parabolic wedge sell climax down to support on the daily chart. That would be a Breakout Mode pattern.<p>Because of higher highs and lows for 6 weeks, the bulls will look for a reversal up at some point this week. However, sideways is more likely for at least a couple days. Consequently, day traders will be looking for 10 pip scalps today.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-trading-range-day-and-oo-buy-signal.png\"><img loading=\"lazy\" src=\"2019-7-8-2.png\" alt=\"Emini trading range day and oo buy signal\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini gapped down and entered a tight trading range. The bears have an expanding triangle top on the weekly chart, but no sell signal bar. They also have a parabolic wedge top on the daily chart. They probably will need a micro double top.<p>Traders see the 3 day tight trading range as a Breakout Mode pattern. But, even if the bears get a reversal down to the June 26 start of the parabolic wedge, the Emini would probably enter a trading range on the daily chart. The odds favor a test of the top of the expanding triangle within a month.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-7-8"
    }
  ],
  "9": [
    {
      "data": [
        "<article class=\"post-91030 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini Breakout Mode at 3000 Big Round Number\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini Breakout Mode at 3000 Big Round Number</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-07-09T06:20:04-07:00\">July 9, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Tuesday July 9, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini gapped down and formed a small trading range day yesterday after Friday’s bull reversal day. Big Down, Big Up creates Big Confusion. Yesterday’s trading range was the result.<p>The bulls are struggling to get far above 3,000. The bears want an expanding triangle top on the weekly chart. However, last week was a bull bar on the weekly chart. It is therefore a weak sell signal bar. Consequently, there will probably be more buyers than sellers below its low.<p>There is a parabolic wedge on the daily chart, but the bears do not have a good sell signal bar. They therefore need either a micro double top or a surprise bar down. Since they have neither, the Emini will probably be sideways again today.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 10 points in the Globex session. The daily chart does not have a strong bear sell signal bar or micro double top. This 3 day selloff is therefore more likely a pullback from the 3000 Big Round Number than the start of a swing down.<p>Look at the day sessions over the past 2 days. There were gaps down on the open, but the price action after the gap down openings was not bearish. Friday was a bull trend reversal day and yesterday was a trading range day. This is not how bear trends on the daily chart typically begin.<p>Yes, there can be a surprisingly big bear day at any point and that could be the start of a bigger selloff on the daily chart. Without that, day traders assume that the bulls will come back soon. They know that the odds favor another test of 3,000 within a couple weeks.<p>So far, this selloff is simply a test of the September/May double top. The lack of momentum down on the 5 minute chart reduces the chance of a big bear day today.<p>However, there is no bottom yet and the gap below the July 1 low is a magnet below. That is only about 10 points lower than today’s Globex low. The bulls might wait for a test of 2950 before buying again. If the selloff gets there today, day traders will look for a reversal up.<p>After 2 days of trading range price action, traders expect more of it today.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-trading-range-day-and-oo-buy-signal.png\"><img src=\"2019-7-9.png\" alt=\"Emini trading range day and oo buy signal\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/EURUSD-Forex-double-bottom-and-double-top-so-breakout-mode.png\"><img loading=\"lazy\" src=\"2019-7-9-1.png\" alt=\"EURUSD Forex double bottom and double top so breakout mode\"></a></figure><p>The EURUSD daily Forex chart has been in a trading range for 5 months. Most of the legs up and down lasted 2 – 3 weeks. This 2 week selloff is now testing a major higher low in the bottom half of the range. Consequently, the bulls will probably begin a bull leg within a week.<p>Most of the down legs have required a micro double bottom before a bull leg began. Also, the bull legs typically ended with a micro double top. Therefore, traders expect that the chart will have to stop going down and begin to go sideways for a few days before it can go up.<p>It is in the buy zone since it is near support. Furthermore, there have been 3 legs down in a 7 day bear channel micro channel. This is a parabolic wedge sell climax. As a result, traders will begin to transition from selling to buying over the next few days. This is true even if the bears get a brief breakout below the May 23 52-week low 1st.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 25 pip range overnight. This follows yesterday’s small day. The bears are probably exhausted. They will likely not want to sell aggressively here after an 8 day micro channel and parabolic wedge channel at support. Traders expect limited downside this week.<p>The bulls will begin to look for buy setups that will lead to at least a 50 pip rally today or tomorrow. Until they see one, they will scalp for 10 – 20 pips.<p>Traders expect a bottoming process this week. They would then look for at least a 50% retracement of the selloff, which means a test above 1.13 within a couple weeks.<p>The selling is drying up. But the chart will likely need another day or so of sideways trading before the bulls begin a 2 – 3 week rally.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-outside-up-day-and-bull-trend-resumption.png\"><img loading=\"lazy\" src=\"2019-7-9-2.png\" alt=\"Emini outside up day and bull trend resumption\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini reversed up after a gap down below yesterday’s low. It then entered a tight trading range at the 60 minute moving average for most of the rest of the day. The bulls got trend resumption up into the close. Since the rally broke above yesterday’s high, today was an outside up day.<p>Because today closed near its high and it is an outside up day it is a buy signal bar for tomorrow on the daily chart. However, the past several days had mostly trading range price action. There is an increased chance that tomorrow will be similar.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-7-9"
    }
  ],
  "10": [
    {
      "data": [
        "<article class=\"post-90992 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini bull flag at 3000 but parabolic wedge top\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini bull flag at 3000 but parabolic wedge top</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-07-10T06:20:19-07:00\">July 10, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Wednesday July 10, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>On the daily chart, the bears have a parabolic wedge top at the 3,000 Big Round Number. However, they do not have a good sell signal bar or a micro double top. The 3 day selloff therefore is more likely a bull flag than the start of a bear trend.<p>Yesterday was a bull outside up day. It is therefore a buy signal bar for today. But the daily chart has been sideways for 5 days. In addition, there was mostly trading range price action for 3 days. This is not a particularly strong buy setup. Traders are still deciding if the Emini will have to pull back more before breaking strongly above 3,000.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 7 points in the Globex session. It therefore might gap up today. A breakout above yesterday’s high will trigger a buy signal on the daily chart.<p>Since the daily chart is in a bull trend and 3,000 is a magnet above, there is an increased chance of a bull trend day today.<p>Can today be a big bear trend day? That is unlikely since today is triggering a buy signal in a bull trend on the daily chart. Also, yesterday’s reversal up was strong enough to have at least some follow-through today.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-outside-up-day-and-bull-trend-resumption.png\"><img src=\"2019-7-10.png\" alt=\"Emini outside up day and bull trend resumption\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/EURUSD-Forex-parabolic-wedge-sell-climax-in-trading-range.png\"><img loading=\"lazy\" src=\"2019-7-10-1.png\" alt=\"EURUSD Forex parabolic wedge sell climax in trading range\"></a></figure><p>The EURUSD daily Forex chart sold off for 3 weeks in a tight bear channel. Since the selloff had 3 legs down, it is a parabolic wedge and a sell climax. It is testing the June 18 low. The bulls want a reversal up from here, which would be a double bottom bull flag. They are hoping that the May 23 low is the start of a bull trend that will last for many months.<p>But the past 3 days had bear bodies. Additionally, the channel has been tight and there has only been one small bull bar in 3 weeks. Consequently, the first reversal up will probably be minor.<p>Since traders are starting to believe that the chart is in a bull trend, many are willing to buy and put a stop below the May 23 low. This is just in case the chart resumes up without a micro double bottom.<p>The bears want another new low in their yearlong bear channel. However, the weekly chart is now getting closes above the 20 week EMA and the daily chart is forming higher highs and lows. There is currently less than a 50% chance that the chart is still in a bear trend. It is clearly in a trading range and it is now also in an early bull trend.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart rallied 30 pips a few minutes ago. It broke above yesterday’s high. This triggered a minor buy signal on the daily chart.<p>While the bulls hope that this is resumption of the May/June bull trend, the bear channel on the daily chart is tight. The 1st reversal up is typically minor. Consequently, a 1 – 3 day bounce is more likely than a bull trend.<p>Because a bounce for a few days is more likely than a bull trend, day traders will be quick to take profits on longs if today’s rally stalls.<p>In addition, the bear day traders will look for this morning’s breakout to fail. They therefore will sell if there is a micro double top or a trading range with a good sell signal bar.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-trading-range.png\"><img loading=\"lazy\" src=\"2019-7-10-2.png\" alt=\"Emini trading range\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini rallied on the open but sold off to a new low of the day. It reversed back up from above yesterday’s high then went sideways. Today was a doji day on the daily chart. It is therefore a weak sell signal bar. Consequently, the odds continue to favor sideways to up trading.<p>Most recent days have had a lot of trading range price action. Traders will expect tomorrow to also have at least one swing up and one swing down.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-7-10"
    }
  ],
  "11": [
    {
      "data": [
        "<article class=\"post-91033 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini parabolic wedge above 3000 but weak sell signal bar\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini parabolic wedge above 3000 but weak sell signal bar</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-07-11T06:20:42-07:00\">July 11, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Thursday July 11, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini gapped up and rallied to a new high yesterday. It then sold off to a new low, but the gap stayed open. It reversed up and entered a trading range. By closing near the middle, yesterday was a doji bar on the daily chart.<p>The bears wanted a big bear bar closing near its low. This is because there is a parabolic wedge rally over the past 6 weeks. That is a buy climax and it therefore typically attracts profit-taking by the bulls. But many bulls will not take profits until they see a strong sell signal bar. Yesterday was not good enough. Consequently, the odds continue to favor sideways to up.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 4 points in the Globex session. Yesterday was a big trading range day and today will probably open within yesterday’s range. There is an increased chance that today will mostly overlap yesterday’s range and possibly be an inside day.<p>Whenever the market breaks to a new all-time high, traders wonder if the breakout will succeed or fail. If it succeeds, it can begin to form a series of bull trend days. If it fails, it can form a series of bear trend days.<p>The 1st day or two of either trend can be big. Day traders are therefore ready for a strong trend up or down.<p>However, they know that the Emini has had mostly trading range price action for a couple weeks. Day traders therefore expect at least one reversal every day. The daily ranges have been big enough for at least one swing up and one swing down on most days. That will probably be true again today.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-trading-range.png\"><img src=\"2019-7-11.png\" alt=\"Emini trading range\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/EURUSD-Forex-double-bottom-higher-low-major-trend-reversal.png\"><img loading=\"lazy\" src=\"2019-7-11-1.png\" alt=\"EURUSD Forex double bottom higher low major trend reversal\"></a></figure><p>The EURUSD daily Forex chart is reversing up from a double bottom with the June 18 low. The double bottom is a pullback from a reversal up from the May 30 low. This is a double bottom higher low major trend reversal.<p>All major trend reversal bottoms have a 40% chance of actually becoming a bull trend. Most lead to a leg in the trading range and then the trading range or bear trend continues.<p>This is the strongest setup that the bulls have had in a year. There is now more than a 50% chance of a break above the March high within 2 months. Furthermore, there is a 40% chance of a test of the January high or even the September high over the next many months.<p>The bears want the 2 day rally to stall at around a 50% bounce. They then want a reversal down from a lower high. That would be the right shoulder of a head and shoulders top bear flag where the June 12 high was the left shoulder.<p>But even if they get a breakout below the May low, the odds are that it will fail, like every other bear breakout over the past year. The chart has been in a trading range for 5 months, and most legs up and down reverse. Traders continue will to bet on reversals until there is a clear trend.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 25 pip trading range over the past 6 hours. The bulls want today to close near its high. Today would then be the 2nd consecutive strong bull day on the daily chart. That would increase the chance that a bull trend is underway.<p>The bears want this 2 rally to fail. They therefore will try to get today to close near its low. Today then would be a sell signal bar on the daily chart for a head and shoulders top bear flag. Since the 3 week selloff was in a tight bear channel, the odds are that there will be a lower high and at least a small test down within a week.<p>Because the overnight range has been small, day traders have been scalping. The bears do not need a big bear day. They will be happy with the day simply closing near its low. That would create a good sell signal bar on the daily chart for tomorrow.<p>The bulls, however, would like another bull trend day. So far, the day is a trading range day, and it will probably continue that way.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-trading-range-day.png\"><img loading=\"lazy\" src=\"2019-7-11-2.png\" alt=\"Emini trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini had several legs up and down, and it closed again near the open. This is the 4th doji day in the past 5 days. These are neutral bars and therefore the breakout above 3,000 so far is weak.<p>However, the bears have not yet formed a credible sell signal bar for their parabolic wedge rally. But, they probably will get a decent bear sell signal bar within a week. That will probably lead to a pullback lasting a couple weeks.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-7-11"
    }
  ],
  "12": [
    {
      "data": [
        "<article class=\"post-90995 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini doji bars so weak breakout above 3000\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini doji bars so weak breakout above 3000</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-07-12T06:20:58-07:00\">July 12, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Friday July 12, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini had another trading range day yesterday. The bulls bought the early selloff, but were unable to rally strongly. The bears got a reversal down. Yet, the bulls bought the new low and the test of the 60 minute EMA. Yesterday was the 4th doji bar on the daily chart in the past 5 days. That is a sign of a balanced market.<p>There is a parabolic wedge buy climax on the daily chart. However, the bears do not yet have a sell signal bar or a strong reversal down. They will probably get one within a week or so. Traders will then look for a 2 – 3 week pullback.<p>Today is Friday and therefore weekly support and resistance can be important, especially in the final hour. The bulls want the week to close on its high and above last week’s high. Additionally, they want the 1st weekly close above 3,000.<p>It is unlikely that the week will close below its open. The best the bears can probably hope to get is a close below the midpoint of the week.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 6 points in the Globex session. It might have a small gap up open today. Since 4 of the past 5 days were dojis candlesticks, each has had at least one reversal. Traders will expect at least one reversal again today.<p>Yesterday was an inside bar in a bull trend. It is therefore a buy signal bar for today. But it was a doji, which typically does not lead to a strong bull breakout.<p>Six of the past 7 days were bull days on the daily chart. The bulls want another bull day today. Furthermore, they want this week to close above last week’s high. This week would then be the 1st weekly close above 3,000.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-trading-range-day.png\"><img src=\"2019-7-12.png\" alt=\"Emini trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/EURUSD-Forex-lower-high-trend-reversal-after-double-bottom-trend-reversal.png\"><img loading=\"lazy\" src=\"2019-7-12-1.png\" alt=\"EURUSD Forex lower high trend reversal after double bottom trend reversal\"></a></figure><p>The EURUSD daily Forex chart reversed up 3 days ago from a double bottom. While the entry bar 2 days ago was good, the buy signal bar was a bear doji. Furthermore, there was only one small bull bar in the prior 14 days. That was a weak buy setup. That is why I said that reversal would probably be minor and need a test of the July 9 low.<p>Yesterday was only a small bull doji. The bulls needed a 2nd consecutive strong bull bar. Because they did not get it, there is now a weak rally after a weak bottom. Traders expect at least a small test down within a few days.<p>The bears want a strong reversal down to a new 52 week low. At the moment, the bull case is slightly stronger. Consequently, there will probably be more buyers than sellers below yesterday’s low and around last week’s low.<p>While the chart is in Breakout Mode, the bulls have done more over the past month than they have in a year. There is better than a 50% chance of a break above the June high before there is a break below the May low.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart rallied and sold off 30 pips overnight. Today therefore is forming a micro double top with yesterday’s high. Yesterday was a doji bar on the daily chart, and today so far is also a doji bar. This is a balance market and there is an increased chance of continued trading range price action today.<p>The bears see yesterday as a sell signal bar on the daily chart for a lower high. Since it is a weak sell signal bar and the pattern is weak, there will probably be more buyers than sellers below yesterday’s low.<p>The 5 minute chart is now just above yesterday’s low. This is the buy zone. The odds are against a strong bear trend from here today.<p>With the quiet trading over the past 2 days and now a micro double top, there will probably not be a strong bull trend either. Day traders will continue to scalp, betting on reversals.<h3>Weekly support and resistance are important on Friday’s</h3><p>Today is Friday and therefore weekly support and resistance can be important. The most significant price is 1.1208, which is the open of the week. This is because last week sold off and the bulls want a higher low buy signal on the weekly chart for next week. It would be stronger if the candlestick had a bull body. That requires a close above the open of the week.<p>The bears always want the opposite. But that price is more than 30 pips below and the overnight selloff has been weak. As a result, the odds are that this week will have a bull body on the weekly chart.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Small-pullback-bull-trend-in-Emini.png\"><img loading=\"lazy\" src=\"2019-7-12-2.png\" alt=\"Small pullback bull trend in Emini\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini formed a small pullback bull trend day and it closed on its high. Next week might gap up to another new high. Whether or not there is a gap up, the odds still favor at least slightly higher prices. This week was also the 1st weekly close above 3,000.<p>Although there is a parabolic wedge buy climax on the daily chart, there is no top yet. Also, since the monthly chart is on an oo buy signal, any reversal down will probably just last 1 – 3 weeks.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-7-12"
    }
  ],
  "13": [
    {
      "data": [
        "<article class=\"post-91000 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini weak breakout above 19 month trading range\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weak breakout above 19 month trading range</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-07-13T00:30:17-07:00\">July 13, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Market Overview: Weekend Market Update</h2><p>The<strong>Emini</strong>triggered an oo buy signal on the monthly chart when July traded above the June high. That makes sideways to up likely for a few months.<p>The<strong>crude oil</strong>futures chart has rallied for 6 weeks in a yearlong trading range. It is now in the sell zone, but there is no top yet.<p>The<strong>EURUSD</strong>weekly Forex chart has transitioned into a trading range after a yearlong bear channel. There is now a 40% chance of a rally up to the January high.<h2><strong>Crude oil Futures market:</strong><br>Bull leg in trading range</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Crude-oil-futures-wedge-rally-to-breakout-point-so-breakout-test.png\"><img loading=\"lazy\" src=\"2019-7-13.png\" alt=\"Crude oil futures wedge rally to breakout point so breakout test\"></a></figure><p>The crude oil futures market rallied this week after last week’s selloff. The bulls are hoping that the reversal up in June is a higher low major trend reversal. More likely, the rally is a bull leg in a yearlong trading range that will last many more months.<p>There are still magnets above and therefore the rally will probably go at least a little higher. For example, the top of the 2 big bear bars in May is a target. The top of any sell climax is always a magnet because many bears put protective stops just above the sell climax high. The bears are ready to give up there. Since they are thinking about giving up, there are fewer bears willing to sell once the rally gets near their stops. This lack of sellers often results in the stops getting hit. Because that was the target for the bulls, the bulls take profits and the rally often stalls at a sell climax high.<p>Additionally, the April lower high is resistance. Even if the bulls get a breakout above that high, there will sellers above it. This is because traders believe that the weekly chart is in a trading range. Traders look to sell above prior highs, especially near the top of the range.<h3>Bull leg in yearlong trading range</h3><p>I said this 6 week rally is a bull leg in a yearlong trading range. That means that there will be a bear leg. I have been saying that the approximate sell zone is between 60 and 70. That April 23 high is 67.03 and is a reasonable target for the rally.<p>The bears want to sell, but they want a bear bar closing near its low for a sell signal bar. They do not have that. They will also sell if they see a surprisingly big bear bar closing near its low. Until they get what they want, the odds favor at least slightly higher prices.<p>Is it possible that the weekly chart is now in a bull trend? The bulls have a credible higher low major trend reversal. Last year’s selloff was so strong that there is currently only a 30% chance that this rally will get up to last year’s high. It is more likely that the rally will stall within a few weeks and the chart will then go sideways to down for a month or two.<h2><strong>EURUSD weekly Forex chart:</strong><br>Higher low near bottom of 5 month trading range</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/EURUSD-Forex-double-bottom-major-trend-reversal-after-wedge-bottom.png\"><img loading=\"lazy\" src=\"2019-7-13-1.png\" alt=\"EURUSD Forex double bottom major trend reversal after wedge bottom\"></a></figure><p>The EURUSD weekly Forex chart formed a small bull bar this week after last week’s selloff. This week was a higher low in what the bulls hope is a new bull trend. It is therefore a buy signal bar for next week.<p>The weekly chart was in a bear channel for a year. It has been in a trading range for 5 months. Every trading range is always also in bull trend and a bear trend. It is still in a broader bear channel, despite last month’s breakout above the tight bull channel. The bulls are hoping that this week will be a higher low in a bull channel.<p>Until there is a clear breakout of the range, traders will continue to bet on reversals. They will buy selloffs, sell rallies, and take profits after a bar or two.<h3>Bear channel evolved into trading range</h3><p>The yearlong pattern of reversals down from the 20 week EMA changed in early June. June had 3 closes above the EMA. That had not happened in over a year. It is therefore a sign that the bulls are getting stronger and the bears are becoming less aggressive.<p>The weekly chart had been in a weak bear trend. That meant that lower prices were likely. Now, the bulls have at least a 50% chance of a move above the June high. Further more, they have a 40% chance of a test of the January high.<h2><strong>Monthly S&amp;P500 Emini futures chart:</strong><br>Emini oo buy signal makes higher prices likely</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-monthly-candlestick-chart-has-breakout-above-oo-bull-flag.png\"><img loading=\"lazy\" src=\"2019-7-13-2.png\" alt=\"Emini monthly candlestick chart has breakout above oo bull flag\"></a></figure><p>The monthly S&amp;P500 Emini futures chart&nbsp;has a small bull trend bar so far in July. July is a breakout above the September/May double top and the 19 month trading range. The bigger a breakout is, the more likely it will be successful. However, a small bull bar is still good for the bulls.<p>It is important to remember that June was an outside up bar after an outside down bar in May. July trigger an oo (consecutive outside bar) buy signal by trading above the June high. There is now a 60% chance that the next 3 months will be sideways to up.<p>The bears want the breakout to fail. They need a bear bar closing near its low to convince traders that a reversal down is about to begin. Additionally, they want a big bear bar. That will attract more sellers in August and increase the chance of a failed breakout. Until they get it, the bulls will remain in control.<h3>Expanding triangle top</h3><p>I have been writing about a possibly expanding triangle top since the strong reversal up in January. The top of the triangle is the line drawn across the January 2018 and September 2018 highs. That line is currently around 3040.<p>Most reversals come from undershoots or overshoots. They rarely come exactly at support or resistance. July has not reached the line. If there is a reversal down from here, there would be an undershoot.<p>Overshoots are slightly more common. On the daily chart, traders look for 1 – 2% overshoots. That means if the rally continues up to 3,100 – 3,150, traders will become more wary of a reversal. Since there is room to that area and the oo buy signal should have follow-through this summer, the odds continue to favor at least slightly higher prices.<p>Everyone knows that big reversals often come in August, September, and especially October. Traders will remain cautiously bullish for at least a few more months.<h3>Example of expanding triangle top on monthly chart in 1973</h3><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/SP500-Expanding-Triangle-top-and-bull-flag.png\"><img loading=\"lazy\" src=\"2019-7-13-3.png\" alt=\"S&amp;P500 Expanding Triangle top and bull flag\"></a></figure><p>For an example of an expanding triangle top in the S&amp;P500 monthly chart, look back at the January 1973 high. It was the 3rd leg up where February 1966 and December 1968 were the 1st 2 legs up.<p>A reversal down from an expanding triangle top often leads to an expanding triangle bull flag. That is what happened then. The stock market has been in a strong bull trend on the monthly chart since that October 1974 low, despite a few big 2 – 3 month selloffs.<h2><strong>Weekly S&amp;P500 Emini futures chart:</strong><br>Consecutive bull bars breaking above September/May double top</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-weekly-candlestick-chart-testing-top-of-expanding-triangle.png\"><img loading=\"lazy\" src=\"2019-7-13-4.png\" alt=\"Emini weekly candlestick chart testing top of expanding triangle\"></a></figure><p>The weekly S&amp;P500 Emini futures chart broke above the September/May double top last week. This week was the 2nd consecutive bull trend bar on the weekly chart. When a breakout has consecutive bull bars, traders see the 2nd bar as confirmation. They conclude that the breakout is succeeding and they expect higher prices. With this week closing on its high, next week might gap up.<p>The weekly chart has the same expanding triangle top that is on the monthly chart. Since there is room to the top of the triangle and there are now consecutive bull bars, the probability favors at least slightly higher prices.<h3>The bears want the breakout to fail</h3><p>There is always a bear case. If next week is a bear trend bar, traders will wonder if the 2 week breakout will fail. However, after 2 strong bull bars, the bears will probably need at least a micro double top before they can reverse the trend. Consequently, the 1st reversal down will probably be only a 1 – 2 week pullback.<p>Unexpected events (black swans) can come at any time. If next week forms a surprisingly big bear bar closing near its low, it will overwhelm the past 2 weeks. If the bear bar is huge, traders will conclude that the breakout has failed. They will then assume that a reversal down from an expanding triangle top is underway. By definition, a Bear Surprise Bar is a surprise, which means that it is unlikely.<h2><strong>Daily S&amp;P500 Emini futures chart:</strong><br>Tight bull channel but buy climax</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-daily-candlestick-chart-in-tight-bull-channel.png\"><img loading=\"lazy\" src=\"2019-7-13-5.png\" alt=\"Emini daily candlestick chart in tight bull channel\"></a></figure><p>The daily S&amp;P500 Emini futures chart has rallied strongly from the June 3 low. Once the Emini pulled back on June 11, the spike (breakout) phase of the bull trend ended. The channel phase began with the June 12 low. A breakout followed by a channel is a Spike and Channel Trend. It typically evolves into a trading range.<p>There are now 4 pushes up in a tight bull channel. Once a tight bull channel has at least 3 legs up, it is a parabolic wedge. That is a buy climax. While the rally can continue indefinitely, the bulls usually begin to look to take some profits once a rally becomes climactic.<p>In 25% of bull channels, the market accelerates up and successfully breaks above the bull channel. It then is again in a breakout phase. Over time, the breakout has a pullback. The trend weakens and enters a channel.<h3>Bull channel is a bear flag</h3><p>Most of the time, a bull breakout above a bull channel fails within 5 bars. The market then reverses and has a bear breakout below the bull channel. Whether or not there is a failed bull breakout, there is a 75% chance of a successful bear breakout below the bull trend line. That means that a bull channel behaves like a bear flag.<p>Traders expect the eventual bear breakout to lead to a swing down and a transition into a trading range. Once there is trading range price action, the chart is in breakout mode. The bulls want a bull breakout and a resumption of the bull trend. However, the bears want a bear breakout and a reversal of the bull trend into a bear trend.<h3>How does a bear swing begin?</h3><p>This bull channel will eventually exhaust itself and evolve into a trading range. Until it does, the odds favor higher prices. But the rally already has 4 legs up. Consequently, the bulls will be quick to take profits if they see signs of exhaustion.<p>The most obvious one would be a big bear reversal day that makes a new high and closes on its low. Perfect setups only exist on dishonest websites. Most of the time, a reversal is less clear. When in doubt, stay out. Wait to see convincing evidence that the bears are in control before shorting.<p>For example, if there is a weak sell signal bar, wait to see if there is a 2nd signal bar a few days later. Or, look for 2 consecutive big bear bars or three consecutive smaller bear bars. A single huge bear bar is often reliable evidence that the bulls are taking profits.<p>One of these tops should form within the next few weeks. But the oo buy setup on the monthly chart means that the Emini will probably be sideways to up for at least 2 or 3 months. Therefore, traders expect the 1st reversal down to be minor. That means a 2 – 4 week pullback followed by another test of the high.<hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-7-13"
    }
  ],
  "15": [
    {
      "data": [
        "<article class=\"post-91173 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini parabolic wedge buy climax but no top yet\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini parabolic wedge buy climax but no top yet</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-07-15T06:20:06-07:00\">July 15, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Monday July 15, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini has rallied for 6 weeks and it is at a new all-time high. Since the bull trend has 4 legs up and the channel is tight, the rally is a parabolic wedge buy climax. It is now near the top of the tight bull channel. Consequently, traders expect a 2 – 3 week reversal soon. However, there is no sell signal yet on the daily chart Therefore the odds favor at least slightly higher prices.<p>Furthermore, the Emini is getting near the top of the weekly expanding triangle top. But there is no top yet, and even a minor reversal will probably need at least a micro double top first.<p>Even when the bears finally get their reversal, it will probably be minor. The monthly chart is still on an oo buy signal. That makes sideways to up likely for at least a couple more months.<h3>Overnight Emini Globex trading</h3><p>I said on Friday that this week might gap up on the weekly chart because of Friday’s strong close. The Emini is up 10 points in the Globex session. Today therefore might have a small gap above Friday’s high, which was last week’s high. However, small gaps usually close in the 1st hour.<p>Friday was a Small Pullback Bull Trend. That is unsustainable and therefore climactic. As a result, there is a 75% chance of at least 2 hours of sideways to down trading beginning by the end of the 2nd hour.<p>If the Emini enters a trading range, the bears could then try to create a major trend reversal on the 5 minute chart. Also, the rally is near the top of the month-long tight bull channel. There will probably be at least a 1 – 2 day pullback this week. The odds of a strong selloff over the next few days are small.<h2>Friday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Small-pullback-bull-trend-in-Emini.png\"><img src=\"2019-7-15.png\" alt=\"Small pullback bull trend in Emini\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/EURUSD-Forex-head-and-shoulders-bottom-and-bear-flag.png\"><img loading=\"lazy\" src=\"2019-7-15-1.png\" alt=\"EURUSD Forex head and shoulders bottom and bear flag\"></a></figure><p>The EURUSD daily Forex chart is in the middle of a 5 month trading range. There is therefore both a buy and a sell setup. The bulls have a double bottom higher low major trend reversal. However, the July 9 buy signal bar was weak, as has been the follow-through after the one strong bull day.<p>If today is a bear day, it will be a sell signal bar for tomorrow. Today will be a micro double top with Thursday’s high. Furthermore, the 3 day rally will be the right shoulder in a head and shoulders top bear flag. June 12 would be the left shoulder.<p>The bears want a strong break below the May 23 low. If they get it, traders will conclude that the yearlong bear channel is still in effect. However, the bulls bought every new low over the past year. Consequently, they will probably buy around the May low as well.<p>On the weekly chart, last week was a small buy signal bar. When a buy signal bar is small and the buy signal triggers, there is a 50% chance of a quick reversal down to below the low of the bar and then a 2nd reversal up. The weekly buy signal will trigger if this week goes above last week’s high. Unless the bulls get a strong rally above that high, traders will watch for a reversal down to below last week’s low.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Fores chart has been in a 20 pip range overnight. By going above Friday’s high, today triggered a minor buy signal on the daily chart. However, the rally so far has failed to trigger the weekly buy signal by going above last week’s high.<p>Today is the 3rd day in a tight trading range. There is no sign that today will be different.<p>Traders are deciding between a test of the May low or the June high. The chart might have to do both. If so, it will probably test down 1st. This is because the 3 day rally has been weak and it followed a 3 week tight bear channel. Therefore, many bulls want another test of the June low. In addition, the bulls had their best rally in over a year in June. They therefore will probably get at least one more leg up to test the March or January highs.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p>I will post chart after the close.<figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-Traading-range-day-at-new-all-time-high.png\"><img loading=\"lazy\" src=\"2019-7-15-2.png\" alt=\"Emini Trading range day at new all time high\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini gapped above last week’s high, but sold off on the open. The bear bar was big enough to dominate the rest of the day. After a spike and channel bear trend, the Emini entered a trading range.<p>Today had a bear body on the daily chart and the daily chart has a parabolic wedge buy climax. Traders see today as a sell signal bar for tomorrow. Since the bull channel is tight, the Emini will probably go sideways for a few days as it decides whether to pull back for 1 – 3 weeks.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-7-15"
    }
  ],
  "16": [
    {
      "data": [
        "<article class=\"post-91330 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini parabolic wedge buy climax above 3000 Big Round Number\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini parabolic wedge buy climax above 3000 Big Round Number</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-07-16T06:20:28-07:00\">July 16, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Tuesday July 16, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday sold off on the 1st bar after gapping up to a new all-time high. But, the bear channel on the 5 minute chart was not strong. In the middle of the day, the bulls got a reversal back up to the middle of yesterday’s range.<p>Since yesterday had a bear body on the daily chart, it is a sell signal bar for today. Over the past month, the daily chart has had 4 legs up in a tight bull channel. That is a parabolic wedge buy climax. Now the bears finally have a sell signal bar.<p>But the bar had a prominent tail below and the last 5 days have been strong. The chart will likely have to go sideways and form a micro double top before the bears can begin a 1 – 3 week pullback.<p>Today might trade below yesterday’s low, which would trigger the daily sell signal. Traders want to know if the bulls will finally take profits. More likely, the Emini will go sideways for a few days before deciding whether the bears will finally get a small pullback.<p>The weekly chart has a 7 bar bull micro channel. While the odds favor a pullback beginning within 2 weeks, it will probably only last 1 – 3 weeks.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 1 point in the Globex session. Yesterday’s high was also its open. That open was therefore not tested and it is now a magnet for today or tomorrow.<p>Yesterday’s low was a 5 bar tight trading range with 4 bars having identical lows. That ledge bottom, too, is a magnet.<p>Traders want to test both yesterday’s high and low at some point this week. Also, yesterday’s dominant bear bar on the open might continue its domination for another day or two. There is therefore an increased chance of a test below yesterday’s low.<p>With magnets above and below, the Emini will probably be sideways again today and maybe tomorrow. However, there is still no strong top on the daily chart. Traders continue to expect at least slightly higher prices.<p>Finally, it is important to remember that bull trends on the daily chart have an increased chance of rallies in the final hour.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-Traading-range-day-at-new-all-time-high.png\"><img src=\"2019-7-16.png\" alt=\"Emini Trading range day at new all time high\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/EURUSD-Forex-head-and-shoulders-top-and-higher-low-major-trend-reversal.png\"><img loading=\"lazy\" src=\"2019-7-16-1.png\" alt=\"EURUSD Forex head and shoulders top and higher low major trend reversal\"></a></figure><p>The EURUSD daily Forex chart is turning down from a lower high. I said last week that this was likely. The 3 week bear channel was tight. Consequently, the 1st rally was likely to be minor. That means traders expected a test of the low of the selloff.<p>The bears see this lower high as the right shoulder of a head and shoulders top. The June 12 high is the left shoulder. However, the pattern is in a trading range and most breakouts fail. Consequently, there will probably be a reversal up from either the June or May lows.<p>On the weekly chart, the June rally was the strongest one in a year. It broke above the bear trend line and the 20 week EMA. It is likely to have at least a small 2nd leg sideways to up. Therefore, this selloff will probably not lead to a resumption of the yearlong bear trend. Instead, traders see it as a bear leg in the 5 month trading range. But if the bears get consecutive closes below the May low, they will conclude that the bear trend has resumed.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart sold off 50 pips in a tight bear channel overnight. Traders have only been selling. Once the selling stops and the chart begins to go sideways, the bulls will begin to buy for scalps. However, it will be easier to make money as a bear today and tomorrow.<p>When a channel is tight, there is much less chance of a bull trend reversal. This is because it is a Bear Surprise Bar on a higher time frame chart, like the 60 minute chart. A surprise typically has at least a small 2nd leg sideways to down.<p>Also, there is still room to the June 9 low, which is last week’s low. I said yesterday that the buy signal bar on the weekly chart was small. There was consequently a 50% chance of the buy signal failing and of the bulls getting a 2nd buy signal within a couple weeks. That is still true. Even though yesterday did not go above last week’s high, last week’s low is about 20 pips below the overnight low. It is a target for the rest of this week.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-trending-trading-range-day.png\"><img loading=\"lazy\" src=\"2019-7-16-2.png\" alt=\"Emini trending trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>By trading below yesterday’s low, the Emini triggered a sell signal on the daily chart. But yesterday had a prominent tail below. That lowers the probability of a 2 – 3 week pullback.<p>Furthermore, yesterday’s high was also its open. It therefore was not tested and it is a magnet above. Consequently, it is still more likely that the Emini will have to test yesterday’s high before the bears will get their 2 – 3 week pullback.<p>However, if the bears get 2 – 3 bear bars over the next few days, traders will conclude that the pullback has begun.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-7-16"
    }
  ],
  "17": [
    {
      "data": [
        "<article class=\"post-91333 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini parabolic wedge sell signal triggered Tuesday\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini parabolic wedge sell signal triggered Tuesday</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-07-17T06:20:57-07:00\">July 17, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Wednesday July 17, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini sold off yesterday. Traders are deciding if this is the start of a 2 – 3 week pullback. Because the daily chart has a parabolic wedge top, the odds favor a couple small legs down over the next few weeks. The targets are the bottoms of the pullbacks in the wedge bull channel. That is around 2950 or 2900.<p>Since Monday’s candlestick had a tail below, it is a low probability sell signal bar. There might be more buyers than sellers below its low. The bears will need 2 – 3 consecutive bear days to convince traders that the pullback has begun.<p>Monday’s high was exactly at the open. It was therefore never tested. That makes it a magnet above. Many traders want to see at least a small break above Monday’s high and then a reversal down before looking to sell. However, if the bears get a couple big bear days without that test, traders will conclude that the pullback has begun.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 1 point in the Globex session. Yesterday ended with a 4 hour trading range. Today will probably open within that range. If the bulls can hold above yesterday’s low, they will have a double bottom pullback. That is a buy setup and it often leads to a bull trend.<p>The bears want a break below yesterday’s double bottom. They then want a measured move down to below the 3,000 Big Round Number. They hope that the month-long parabolic wedge bull channel is finally reversing.<p>While it will likely begin to reverse down within the next 2 weeks, the bears need strong follow-through selling after yesterday’s bear day. If the Emini begins to fall, more traders will conclude that the 2 – 3 week pullback has begun. The bulls will begin to take profits and the bears will sell. There is therefore an increased chance of a bear trend day today.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-trending-trading-range-day.png\"><img src=\"2019-7-17.png\" alt=\"Emini trending trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/EURUSD-Forex-Head-and-Shoulders-top-and-bottom.png\"><img loading=\"lazy\" src=\"2019-7-17-1.png\" alt=\"EURUSD Forex Head and Shoulders top and bottom\"></a></figure><p>The EURUSD daily Forex chart has been in a trading range for 5 months. A trading range always has reasonable buy and sell setups. After the 1st break above the 20 week EMA and bear trend line on the weekly chart (not shown), the EURUSD Forex market is currently slightly more likely to rally to above the June high than sell off to below the May low.<p>But a trading range is a Breakout Mode pattern. The probability of a bull breakout is always just about the same as for a bear breakout. Furthermore, the 1st breakout up or down fails 50% of the time.<p>The bulls are trying to form a reversal up from the June 18/July 9 double bottom. They want a bull bar closing near its high today or tomorrow. That would attract buyers and increase the chance of a swing up over the next few weeks.<p>If the bears get below the June 18 higher low by even a few pips, the bull case would be slightly weaker. But they need a strong break below the May low to convince traders that the yearlong bear trend is still intact.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute chart has been in a 20 pip range overnight. Traders are deciding if yesterday was simply a test of the July 9 low or a resumption of the bear trend.<p>All the bulls need to do today is to have the day close above its open. They want a bull body on the daily chart. Today would then be a buy signal bar for tomorrow. The buy setup would be stronger if today closed near its high. Consequently, the bulls will buy 10 – 20 pip selloffs today. Since they do not need a big bull day, they will scalp.<p>The bears want a break below last week’s low. They will sell rallies. Also, they would like a big bear trend day closing far below the July 9 low. With so little energy so far today, they will probably not achieve their goal. Instead, they might try to simply thwart the bulls. The bears will sell rallies for scalps and try to get today to close below its open. That will prevent a strong buy signal bar on the daily chart.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-bear-trend-from-the-open.png\"><img loading=\"lazy\" src=\"2019-7-17-2.png\" alt=\"Emini bear trend from the open\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini sold off on the open and then channeled down. It closed near the low. There is now a 60% chance that the Emini has begun its 2 – 3 week pullback begins.<p>Last week’s low is only about 20 points below. The bears want this week to trade below last week’s low. Since it reversed down from above last week’s high, this week would then be an outside down week. That would be a stronger sell signal bar for next week.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-7-17"
    }
  ],
  "18": [
    {
      "data": [
        "<article class=\"post-91336 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini breaking below bull trend line and parabolic wedge climax\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini breaking below bull trend line and parabolic wedge climax</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-07-18T06:20:27-07:00\">July 18, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Thursday July 18, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday was a spike and channel bear trend day on the 5 minute chart. Also, it was a surprisingly big bear day on the daily chart. A Bear Surprise Day typically has at least a small 2nd leg sideways to down within a week.<p>But when a Bear Surprise Day forms in a bull trend, the follow-through on the next day is usually disappointing for the bears. Consequently, today will probably not be a big bear day. In fact, there is an increased chance of at least a small bull day. This would would disappoint the bears who want a strong follow-through day after yesterday’s big bear day.<p>They are hoping this reversal is the start of a bear trend. More likely, it is the beginning of a 2 – 3 week pullback in a bull trend. The targets are the higher lows in the month-long bull channel. The June 12 low around 2900 is the lowest likely goal.<p>Pullbacks typically lack consecutive big bear trend days. However, if the bears get another big bear day today, that will increase the chance of a bigger reversal, like down to the June low.<p>If this week trades below last week’s low, this week will be an outside down bar on the weekly chart. That would be a stronger sell signal bar on that chart. After a 7 week bull micro channel, a 2 – 3 week minor reversal is more likely than a bear trend.<h3>Overnight Emini Globex trading</h3><p>Since yesterday was a sell climax on the 5 minute chart, there is a 75% chance of at least a couple hours of sideways to up trading that starts by the end of the 2nd hour. Traders expect a disappointing follow-through day for the bears. There is therefore an increased chance of at least a small bull trend today. Day traders will watch for a reversal up in the 1st 2 hours.<p>There is a 25% chance of another big bear day today. If the bears get it, it will increase the odds of a bigger correction. A reasonable target would be the June low around 2750.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-bear-trend-from-the-open.png\"><img src=\"2019-7-18.png\" alt=\"Emini bear trend from the open\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/EURUSD-Forex-head-and-shoulders-top-and-bottom-in-breakout-mode.png\"><img loading=\"lazy\" src=\"2019-7-18-1.png\" alt=\"EURUSD Forex head and shoulders top and bottom in breakout mode\"></a></figure><p>The EURUSD daily Forex chart has been in a trading range for 5 months. There is therefore always going to be both a reasonable buy and sell setup. The bears want a break below the May low and then a measured move down from a head and shoulders top. They hope that last week’s lower high is the first in a series of lower highs and a resumption of the yearlong bear channel.<p>The bulls have a double bottom and a higher low after a strong rally in June. This is a double bottom higher low major trend reversal. It is also the right shoulder of a bigger head and shoulders bottom. They need a break above the June high, which is the head.<p>It is important to note that every new low over the past year reversed up. Consequently, even if the bears get a break below the May low, it will probably fail and there will then be a rally lasting 2 – 3 weeks, like every other breakout in over a year.<p>The chart is still in a trading range and it continues to reverse every few weeks. There is no sign that this is changing.<p>Traders are deciding whether this week will go below last week’s low and become an outside down week. If it does and remains small, it will not be a sign of strong bears. More likely, next week would go sideways for a third week and form a small breakout mode pattern on the weekly chart.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute chart reversed down from above yesterday’s high overnight. While yesterday was a buy signal bar on the daily chart, there is still room down to the neck line of the head and shoulders bottom. Consequently, traders are not convinced the bottom is in. In addition, the 2 day selloff was strong. Many bulls want a micro double bottom and a 2nd buy signal.<p>The 5 minute chart has been in a trading range for 2 days. But, last week’s low is a magnet below. With the strong momentum down on Tuesday, there is a 50% chance that today or tomorrow will trade below last week’s low.<p>However, since last week was small and this week so far is small, and the chart is at the bottom of a month-long trading range, there will probably be buyers below last week’s low. The odds are against a big move up or down today.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p>I will post chart after the close.<figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-bull-trend-reversal-3.png\"><img loading=\"lazy\" src=\"2019-7-18-2.png\" alt=\"Emini bull trend reversal\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>I said that today had an increased chance of being a bull trend day after yesterday’s sell climax. Today sold of and then reversed up strongly. The rally will probably have at least a little follow-through over the next few days.<p>Today is a buy signal bar for tomorrow. It reduces the chance of a 2nd leg sideways to down after the parabolic wedge top on the daily chart.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-7-18"
    }
  ],
  "19": [
    {
      "data": [
        "<article class=\"post-91339 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini buy signal bar after pullback below 3000\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini buy signal bar after pullback below 3000</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-07-19T06:20:53-07:00\">July 19, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Friday July 19, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday was a strong reversal up after Wednesday’s big bear day. I said yesterday before the open that the bears would not get immediate follow-through selling because of the strong bull trends on the daily and weekly charts. A strong bull trend usually has to go sideways before it will go down. The Emini is now sideways. This might continue up to the July 31 FOMC announcement.<p>Furthermore, I said that the odds favored at least a bounce over the next few days. Yesterday is probably the start. It is a buy signal bar for today. But after 3 strong bear days and a parabolic wedge rally, there still might be a 2nd leg sideways to down over the next week.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 6 points in the Globex session. Today might test Wednesday’s sell climax high. Wednesday was a Bear Surprise Day on the daily chart in a bull trend. While a 2nd day sideways to down is likely, there is often a test of the top of the bear bar before that 2nd leg begins. Consequently, there is a magnet at Wednesday’s high of 3009.25.<p>Unless the bulls break above Monday’s all-time high, the odds still favor at least a small 2nd leg sideways to down over the next 2 weeks.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-bull-trend-reversal-3.png\"><img src=\"2019-7-19.png\" alt=\"Emini bull trend reversal\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/EURUSD-Forex-double-top-and-bottom-and-head-and-shoulders-top-and-bottom.png\"><img loading=\"lazy\" src=\"2019-7-19-1.png\" alt=\"EURUSD Forex double top and bottom and head and shoulders top and bottom\"></a></figure><p>The EURUSD daily Forex chart is the middle of a 5 month trading range. Every trading range is a Breakout Mode pattern because it has at least one buy and sell setup.<p>This one has several. The range has higher lows and lower highs and it therefore a triangle. There is also a head and shoulders top and bottom. Finally, over the past 2 weeks, there is both a small double top and double bottom.<p>Since the chart is at the apex of a triangle, it will break out within 2 weeks. When a triangle breaks out, there is a 50% chance that the 1st breakout will fail. Furthermore, there is a 50% chance that the final successful breakout will be up and a 50% chance it will be down.<p>Day traders will look to buy near the bottom and sell near the top. Traders on the daily chart at this point should wait for the breakout. If it is strong and has follow-through, trade in the direction of the breakout. If there is a reversal within a few days, bet on the reversal.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute chart almost complete reversed yesterday’s rally. The overnight selloff has been in a tight bear channel. Day traders will continue to only sell until the selling stops.<p>Since the selloff is now near yesterday’s low, the bears will take some profits soon. Their profit taking rally (short covering) should convert the bear trend into a trading range.<p>But after such a strong selloff, the range might only be 20 pips tall. If so, it will be difficult for the bulls to make money. Bears will sell rallies because the chance of a big reversal up after a tight bear channel is small.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-bear-channel-after-Wednesday-Bear-Surprise-Bar.png\"><img loading=\"lazy\" src=\"2019-7-19-2.png\" alt=\"Emini bear channel after Wednesday Bear Surprise Bar\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini sold off in a huge Bear Trend From The Open after testing Wednesday’s sell climax high. Since today had a bear body and it closed near its low, today is a sell signal bar on the daily chart for Monday.<p>Today meets the minimum objective of a 2nd leg sideways to down after Wednesday’s Bear Surprise Bar. The selloff will probably test the June 26 or June 12 lows between 2900 and 2950 over the next 3 weeks.<p>It is important to note that the Emini has been sideways for 3 weeks with many reversals. This might continue until the July 31 FOMC meeting.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-7-19"
    }
  ],
  "20": [
    {
      "data": [
        "<article class=\"post-91345 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini expanding triangle top and weak monthly oo buy signal\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini expanding triangle top and weak monthly oo buy signal</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-07-20T00:30:33-07:00\">July 20, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Market Overview: Weekend Market Update</h2><p>The<strong>Emini</strong>had a 1st leg down from a parabolic wedge buy climax on the daily chart. It might have one more leg sideways to down. But the monthly oo buy signal still makes it likely to go sideways to up for at least a couple more months.<p><strong>Crude oil</strong>futures are in a yearlong trading range. They sold off sharply this week from the sell zone above 60. They are now in the buy zone at around 55, but will need a micro double bottom before another test of 60.<p>The<strong>EURUSD</strong>Forex market is trying to break above its yearlong wedge bear channel. If this rally breaks above the June high, it will probably test the January high at around 1.18.<h2><strong>Crude oil Futures market:</strong><br>Strong reversal down from wedge rally</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Crude-oil-daily-candlestick-chart-has-strong-breakout-below-wedge-bear-flag.png\"><img loading=\"lazy\" src=\"2019-7-20.png\" alt=\"Crude oil daily candlestick chart has strong breakout below wedge bear flag\"></a></figure><p>Crude oil futures sold off strongly this week. Despite so many pundits on TV last week talking about a bull trend, I said that the rally was a bull leg in a yearlong trading range. Furthermore, I said it was in the sell zone above 60.<p>This week’s selloff was surprisingly strong. When there is a Bear Surprise there is usually at least a small 2nd leg sideways to down. Consequently, traders will sell the first 1 – 3 day rally to around the 20 day EMA, which would be about a 50% pullback.<p>It is now in the buy zone around 55 formed by the July 3 low and the June 10 high. The bulls will probably need at least a micro double bottom before traders will look for the next leg up. Crude oil is now forming a smaller range between 50 and 60 within the yearlong trading range between 43 and 79. Keep looking for for reversals.<h3>Yearlong trading range so bet on reversals</h3><p>It is important to understand what I mean when I continue to say that the chart has been in a trading range and it will probably continue all year. Trading ranges have legs up and down. They often become stronger after 5 – 10 bars. But they trap traders into buying high and selling low.<p>It is natural to hope for a trend. However, markets have inertia. They have a strong tendency to continue to do what they have been doing. Since the crude oil market has been in a trading range, buying strong rallies and hoping for a bull trend, or selling strong selloffs and expecting a bear trend is the wrong approach. It is better to buy low and sell high.<p>Additionally, a trader will make more money taking profits when there is a strong move in his direction. Bulls should exit on strong rallies and bears should take profits on strong selloffs.<p>The probability favors reversals. Obviously, there will be a trend at some point. A trader will make more money trading it like the trading range that it is instead of trading like the trend that it is not.<h2><strong>EURUSD weekly Forex chart:</strong><br>Head and shoulders top and bottom so Breakout Mode</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/EURUSD-Forex-weekly-candlestick-chart-in-breakout-mode-in-trading-range.png\"><img loading=\"lazy\" src=\"2019-7-20-1.png\" alt=\"EURUSD Forex weekly candlestick chart in breakout mode in trading range\"></a></figure><p>The EURUSD weekly Forex chart had 3 closes above the 20 week EMA in June. That was the 1st time this has happened in a year. Furthermore, the June rally broke above the bear trend line at the top of the yearlong wedge bear channel. Traders are now deciding if the 4 week selloff is a failed breakout and the resumption of the bear trend or simply a pullback in an early bull trend.<p>Well, it is both. If the rally continues, traders will say that the selloff was a pullback in a bull trend that began in May. Alternatively, if the selloff continues to below the May low, traders will say that the rally was a bull trap in a yearlong bear trend. Traders need more information, which they will get over the next few weeks.<h3>Traders need more information</h3><p>What should traders do now? The buy setup is minimally better than the sell setup and therefore being long might be a little better than being short. It is basically 50 – 50.<p>On the daily chart, there is a small double top and a small double bottom over the past 3 weeks. It is in the middle of a 5 month trading range. There is both a head and shoulders bottom and a head and shoulders top. Since there are higher lows and lower highs, the past 5 months have formed a triangle.<p>This is a Breakout Mode pattern. Traders know that there is a 50% chance that the 1st breakout up or down will fail. They also believe that the chance of a successful bull breakout is about the same as for a successful bear breakout.<p>It is reasonable to wait for the breakout and maybe until after the FOMC announcement on July 31. If the bulls break above the June high, the rally will probably test the January high just above 1.18.<p>The bulls need to begin to get consecutive big bull trend bars or at least 3 or more small bull bars. Without that, traders will assume that the 5 month trading range is continuing. If the bulls demonstrate clear control, the rally will probably go above the January high of 1.1816.<p>What happens if the bears get their break below the May low? Look back at every other new low over the past year. Each was brief and it was followed by a rally. Traders will assume that there will be buyers below the May low, despite the head and shoulders top on the daily chart.<h2><strong>Monthly S&amp;P500 Emini futures chart:</strong><br>Emini expanding triangle top and weak monthly oo buy signal</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-monthly-candlestick-chart-has-bull-doji-breakout-above-oo-bull-flag.png\"><img loading=\"lazy\" src=\"2019-7-20-2.png\" alt=\"Emini monthly candlestick chart has bull doji breakout above oo bull flag\"></a></figure><p>The monthly S&amp;P500 Emini futures chart&nbsp;in July triggered a buy signal by going above the June high. June was the 2nd consecutive outside bar on the monthly chart. Because July went above its high, there is a 60% chance of 3 months of sideways to up trading.<p>July so far has a small range. The bears want it to close near its low. Furthermore, they want the range to be big. July would then be a sell signal bar for a failed breakout above the oo (consecutive outside bars).<h3>Expanding triangle top on the weekly and monthly charts</h3><p>In addition to the possible failed breakout, I have been talking about a possible expanding triangle top all year. I said that if the Emini broke above the September 2018 high and reversed, there would be an expanding triangle top sell signal.<p>I still believe it will happen. But there is still room to the trend line above the January 2018 and September 18 highs. It is a magnet above. Also, the oo buy signal probably will result in higher prices.<p>Consequently, at the moment, the Emini is still likely to go higher. I have been saying that it might overshoot the line by 1 – 2%. That means traders will me more concerned about a top between 3050 and 3150.<h2><strong>Weekly S&amp;P500 Emini futures chart:</strong><br>Sell signal bar, but bad context for a selloff</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-weekly-candlestick-chart-has-bear-body-and-expanding-triangle-top.png\"><img loading=\"lazy\" src=\"2019-7-20-3.png\" alt=\"Emini weekly candlestick chart has bear body and expanding triangle top\"></a></figure><p>The weekly S&amp;P500 Emini futures chart formed a bear trend bar this week. This is a sell signal bar for a failed breakout above the September/May double top and for the 19 month expanding triangle top. However, the tail below is prominent and there is a 7 week bull micro channel. This is a weak sell setup.<p>Traders want to know if there will be a major reversal. They expect next week to break below this week’s low and trigger the weekly sell signal. They then will decide if the sell signal will result in a major or minor trend reversal.<p>A minor trend reversal means a 1 – 3 week pullback, which would be a bull flag. That would then lead to a test of the high.<p>A major reversal is a bear trend. Traders would expect it to undo the June rally and test to around 2700.<p>It is important to note the importance of the bull micro channel. Every low for the past 6 weeks has been above the low of the prior week. This buying pressure is a sign of strong bulls. When there is a 7 bar bull micro channel, the bulls typically will buy the 1st 1 – 3 week reversal down. Therefore, if the sell signal triggers next week by the Emini breaking below this week’s low, the selloff will more likely be a 1 – 3 week bull flag than the start of a bear trend.<h2><strong>Daily S&amp;P500 Emini futures chart:</strong><br>After Bear Surprise Bar, small 2nd leg down likely</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-daily-candlestick-chart-has-parabolic-wedge-top-trend-reversal.png\"><img loading=\"lazy\" src=\"2019-7-20-4.png\" alt=\"Emini daily candlestick chart has parabolic wedge top trend reversal\"></a></figure><p>The daily S&amp;P500 Emini futures chart had a surprisingly big bear bar on Wednesday. A Bear Surprise Bar traps bulls into a bad long. Many bulls who bought higher now wished they had not. They now hope for a bounce so that they can exit with a smaller loss. It also traps bears out of a good short. Many bears missed the short and want a 2nd chance.<p>With both the bulls and bears looking to sell the 1st rally, the Emini reversed down on Friday. That might be the start of a 2nd leg sideways to down. Furthermore, the Emini might continue its 3 week trading range into the July 31 FOMC meeting.<p>However, this week’s reversal up was strong, as is the the 2 month bull trend. There is currently at least a 40% chance that the rally will continue up to a new high without a small 2nd leg sideways to down.<p>Remember, I have been talking about the parabolic wedge buy climax for several weeks. I said the minimum goal was a couple legs sideways to down. I also said that the selloff might last a few weeks. Finally, I said that the targets for the bears are the higher lows in the month-long wedge bull channel. If Friday’s reversal down continues on Monday, traders should expect the pullback to end around 2900 – 2950.<h3>Wedge top often leads to head and shoulders top</h3><p>When there is a wedge top, traders expect at least a couple legs down. The pullback from the 1st leg down is often the right shoulder of a head and shoulders top.<p>That will probably happen here if this rally stalls next week. The bulls will probably get a 3 – 5 day bounce. If the Emini reverses down from a lower high, traders will sell, expecting a head and shoulders top.<p>It would also be a lower high major trend reversal. But it is important to remember what I often say about major reversals. They only have a 40% chance of leading to an actual trend reversal into a bear trend. More often, they lead to a trading range. Consequently, that is the best the bears should expect over the next few weeks. The monthly chart continues to make higher prices likely for the next 2 months.<hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-7-20"
    }
  ],
  "22": [
    {
      "data": [
        "<article class=\"post-91342 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini 2nd leg down after July 17 Bear Surprise Bar\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini 2nd leg down after July 17 Bear Surprise Bar</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-07-22T06:20:10-07:00\">July 22, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Monday July 22, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>After a month-long parabolic wedge buy climax, the Emini had a Bear Surprise Bar on Wednesday. That typically leads to at least a small 2nd leg sideways to down.<p>In a strong bull trend, there is often a test of the top of that bar before the 2nd leg begins. Friday might be the start of the 2nd leg sideways to down. In fact, it could be a one-day 2nd leg sideways to down and therefore the end of the pullback.<p>More likely these recent big bear days and the 5 week parabolic wedge top will lead to a correction with more bars. A wedge reversal usually tests the bottom of the 1st or 2nd pullback of the wedge rally. Traders expect a 2 – 3 week pullback to between 2900 and 2950.<p>Because Friday was a bear bar closing on its low, it is a sell signal bar for today. But, it is also at the bottom of a 3 day tight trading range. That lowers the probability for stop entry traders. There might be more buyers than sellers below its low. Also, the Emini might stay sideways into next week’s FOMC announcement.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 9 points in the Globex session. Because Friday was a sell climax, there is only a 25% chance of a big bear trend day today. Additionally, there is a 75% chance of at least a couple legs of sideways to up trading beginning by the end of the 2nd hour today.<p>There have been big swings each day for several days, despite the 3 day tight trading range and the 3 week trading range. Traders will expect at least one swing trade today. However, after several big days and reversals, today’s range will probably be smaller and today will probably have more trading range price action.<h2>Friday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-bear-channel-after-Wednesday-Bear-Surprise-Bar.png\"><img src=\"2019-7-22.png\" alt=\"Emini bear channel after Wednesday Bear Surprise Bar\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/EURUSD-Forex-head-and-shoulders-top-and-bottom-so-breakout-mode.png\"><img loading=\"lazy\" src=\"2019-7-22-1.png\" alt=\"EURUSD Forex head and shoulders top and bottom so breakout mode\"></a></figure><p>The EURUSD daily Forex chart has lower highs and higher lows. It is therefore in a triangle. Furthermore, there is a head and shoulders top and bottom. Every head and shoulders pattern is also a triangle. The market is now at the apex of the triangle. Consequently, there will probably be a breakout within a couple of weeks. Traders might be waiting for next week’s FOMC announcement.<p>It is important to understand that a breakout mode pattern has a 50% chance of a bull breakout and a 50% chance of a bear breakout. Additionally, there is a 50% chance that the 1st breakout up or down will reverse.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 25 pip range overnight, just above the bottom of the 3 week trading range. The location is better for the bulls than for the bears because traders expect reversals in a tight trading range.<p>There is no sign that the 5 minute chart is about to breakout. Therefore, day traders are looking for reversals and 10 pip scalps while they wait for a breakout.<p>As I said above, if the bears get a strong breakout below today, there is a 50% chance it will fail. Traders would then look for a reversal back up within a couple days.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-trading-range-day-1.png\"><img loading=\"lazy\" src=\"2019-7-22-2.png\" alt=\"Emini trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>There is a sell signal bar on the weekly chart. But the Emini today reversed up from a test of Friday’s low and last week’s low without triggering either sell signal. Instead, today closed with a bull body. Today is therefore a buy signal bar on the daily chart.<p>After a 7 week bull micro channel on the weekly chart, this week will probably trade below last week’s low at some point this week. However, the best the bears can probably get is a 2 – 3 week pullback.<p>The Emini has been in a tight trading range for 4 days. It is within a bigger 3 week range. With a sell signal bar on the weekly chart and a buy signal bar on the daily chart, the Emini is in Breakout Mode. Traders expect that it will probably be mostly quiet ahead of next week’s FOMC report.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-7-22"
    }
  ],
  "23": [
    {
      "data": [
        "<article class=\"post-91611 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini inside day and week minor sell signals around 3000\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini inside day and week minor sell signals around 3000</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-07-23T06:20:46-07:00\">July 23, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Tuesday July 23, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>There are still sell signals on the daily and weekly charts. Yesterday did not trigger either. Yesterday was an inside day and the week so far is an inside week. However, last week’s 2 Bear Surprise Bars and the 4 week wedge top still make lower prices likely for 2 – 3 weeks.<p>The daily chart has a wedge buy climax. Targets for the bears are the higher lows around 2950 and 2900. A 2 – 3 week pullback is more likely than a major trend reversal down.<p>Since yesterday was a bull inside day after a micro double bottom, it is a buy signal bar for today. The bulls need a strong break above Friday’s high to convince traders that the 6 day pullback has ended. Consequently, even though today could trigger the buy signal, the odds are against a resumption of the bull trend without a deeper pullback first.<p>After 7 weeks without a pullback, the weekly chart will pull back soon. Since last week closed near its low, this week will probably trade below last week’s low. However, traders expect that the bulls will buy not far below.<p>This week so far is a bull inside bar on the weekly chart. It could therefore be a buy signal bar for next week. But even if it is, the odds still favor a pullback after an 8 week bull micro channel and last week’s big bear bar on the weekly chart.<h3>3 week trading range so Breakout Mode</h3><p>The Emini has been in a trading range for 3 weeks. While there have been big moves up and down, there has been no follow-through. This is a Breakout Mode pattern.<p>Traders are waiting for next week’s FOMC announcement. Do not assume that an interest rate cut will result in a rally. When a chart is in breakout mode, it is better to be completely neutral and trade what you see, not what you think should happen. It is impossible to know in advance if most dollars will buy or sell the news.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 11 points in the Globex session. It will therefore likely gap above yesterday’s high. That would trigger a minor buy signal on the daily chart.<p>Yesterday was a buy signal bar but it had a tail on top. Also, there were 2 big bear bars last week and a reversal down from a wedge top on the daily chart. Consequently, the odds are that there will be more sellers than buyers above yesterday’s high. Traders need to see a strong break above Friday’s high before concluding that the bull trend is resuming. They believe that a rally from here might last a few days, but it will probably end below last week’s high.<p>The 3 week range is big enough for a bull trend day today. However, since the Emini is probably heading down to 2900 – 2950, if there is a surprise, down is slightly more likely than up.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-trading-range-day-1.png\"><img src=\"2019-7-23.png\" alt=\"Emini bull trend reversal\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/EURUSD-Forex-breakout-below-neckline-of-head-and-shoulders-top.png\"><img loading=\"lazy\" src=\"2019-7-23-1.png\" alt=\"EURUSD Forex breakout below neckline of head and shoulders top\"></a></figure><p>The EURUSD daily Forex chart broke below the neck line of the month-long head and shoulders top. There is now a 40% chance of about a 200 pip measured move down.<p>That means there is a 60% chance that there will be a reversal up from here or from just below the May low. A reversal up from below the May low would create an expanding triangle bottom with the April low and slightly lower May low. That is a major reversal pattern. Like all major reversal patterns, if there is a good buy signal bar, it would have a 40% chance of a major move up.<p>Whenever there is a breakout, the chance of success is greater if there are consecutive strong trend bars on the breakout. Consequently, the bears want today to close on its low and tomorrow to be another big bear bar closing on its low.<h3>Odds are against a big breakout below May low</h3><p>If the bears get their consecutive big bear bars closing near their lows, the odds will favor a break below the May low. That would be a resumption of the yearlong bear trend.<p>It is important to note that there have been many new lows in the bear channel. Each one reversed up for at least a couple weeks. Traders therefore believe that a break below the May low would soon reverse up. For example, next week’s FOMC announcement could be a catalyst for a big move up or down. A move up would be a failed bear breakout.<p>A black swan is any low probability event. They are real. While the odds favor a reversal up, if there is none, traders should be aware that this time could be different. While unlikely, the selloff could continue down for a 700 pip measured move based on the height of the channel down from the September high.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart sold off 40 pips overnight in a tight bear channel. It broke below the neck line of the month-long head and shoulders top on the daily chart. The overnight rallies have not yet been big enough for the bulls to scalp. However, if the selling dries up and the chart begins to go sideways for a couple hours, the bulls will begin to buy for scalps.<p>Until then, the bears will sell 10 – 20 pip bounces. The want the day to close near its low. They then want tomorrow to be a 2nd consecutive bear trend day. That would increase the chance of a successful bear breakout on the daily chart. They then would probably get a break below the May 52 week low next week.<p>Today’s close is important. If the bears can get the day to close near its low, they will increase their chance of lower prices tomorrow. But if the bulls can get today to close 20 or more pips above the low, they will make traders doubt the breakout. The chance of a failed breakout will be higher if today closes back above the July 9 low of 1.1193.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-bull-trending-trading-range-day.png\"><img loading=\"lazy\" src=\"2019-7-23-2.png\" alt=\"Emini bull trending trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini triggered a weak buy signal on the daily chart today by going above yesterday’s high. After a 3 hour trading range, the bulls got a breakout. Today was a Bull Trending Trading Range Day.<p>While the 3 week trading range is a Breakout Mode pattern, the math is slightly better for the bears near-term. After the big bear days last week and the parabolic wedge top, the odds favor a test down to 2900 – 2950 within the next 2 – 3 weeks.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-7-23"
    }
  ],
  "24": [
    {
      "data": [
        "<article class=\"post-91614 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini weak buy signal at 3000 ahead of July FOMC\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weak buy signal at 3000 ahead of July FOMC</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-07-24T06:20:46-07:00\">July 24, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Wednesday July 24, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Monday was a bull inside day on the daily chart and a buy signal bar. Yesterday gapped up and triggered the buy. But last week’s 2 big bear bars and the month-long wedge buy climax are the dominant feature on the daily chart. The odds favor a 2 – 3 week pullback to 2900 – 2950, even if there is a brief new high first. Unless the bulls break strongly above Friday’s highs, traders will sell this rally.<p>Next Wednesday’s FOMC meeting is unusually important. Consequently, the Emini might not break out of the 4 week trading range until after the announcement. The past 2 days were trading range days. That further increases the chance of mostly trading range price action again today.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 6 points in the Globex session. The 2 day rally on the 5 minute chart has had many bars with prominent tails and many small bars. In addition, it has spent a lot of time going sideways. This price action is more typical of a bull leg in a trading range and not the start of a bull trend.<p>As a result, traders expect it to lead to a bear leg in the 4 week trading range within the next few days. Because a test of around 2900 is likely within a few weeks, the upcoming selloff will probably have several big bear days.<p>This can begin at any time. With next week’s FOMC meeting being important, the Emini might wait until then before breaking out up or down. Traders will expect mostly trading range price action around 3000 again today.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-bull-trending-trading-range-day.png\"><img src=\"2019-7-24.png\" alt=\"Emini bull trending trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/EURUSD-Forex-test-of-double-bottom.png\"><img loading=\"lazy\" src=\"2019-7-24-1.png\" alt=\"EURUSD Forex test of double bottom\"></a></figure><p>The EURUSD daily Forex chart broke below the neck line of a head and shoulders top yesterday. But the bulls see the past 2 days as a test of the April/May double bottom. If today begins a reversal up, the 5 week selloff would be a Double Bottom Pullback. That is a buy signal.<p>Even if the bears get a break below the double bottom, it will probably fail. Look back over the past year. There have been many new lows in the bear channel. Each one reversed up within a few days. There is no reason to believe that this one will be different.<p>Consequently, traders expect a reversal up from around the current level. All financial markets might wait for next week’s FOMC announcement before making a big move up or down.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute chart sold off 30 pips overnight and reversed up over the past 6 hours. Today is the follow-through day after yesterday’s break below the neck line of a month-long head and shoulders top. If the bears get a bear body, especially one closing near its low, they will have a better chance of breaking below the May 52 week low. On the other hand, if the bulls get a bull body, especially one with a big body and a close near the high, today will be a buy signal bar on the daily chart. The bulls would see the 6 week selloff as simply a test of the April/May double bottom.<p>Today’s close is important. The bulls will buy 20 pip selloffs to try to get today to close above the open and near the high of the day. Since the bears want a bear body on the daily chart, they will sell rallies to above the open of the day.<p>Because the overnight range has been small, today will probably close around the open and have a small bull or bear body. The “big” move down and the reversal up were only 30 pips. Today therefore will probably continue with a small range with bulls buying selloffs and bear selling rallies.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p>I will post chart after the close.<figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-small-pullback-bull-trend-and-buy-the-close-bull-trend.png\"><img loading=\"lazy\" src=\"2019-7-24-2.png\" alt=\"Emini small pullback bull trend and buy the close bull trend\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini began with a Bull Trend From The Open, but then entered a trading range. The bulls got trend resumption up and then a Small Pullback Bull Trend for the rest of the day. They made a new all-time high just before the close.<p>Because of today’s strong rally and strong close, tomorrow might gap up. However, the day after a buy climax has a 75% chance of at least a couple of hours of sideways to down trading beginning by the end of the 2nd hour.<p>Last week’s big bear bars and the 4 week wedge buy climax are still important influences, but less so after today. Traders should expect a test of 2900 over the next few weeks even if the rally to a new high continues a little longer.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-7-24"
    }
  ],
  "25": [
    {
      "data": [
        "<article class=\"post-91617 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini pullback soon from wedge top or final bull flag\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini pullback soon from wedge top or final bull flag</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-07-25T06:20:57-07:00\">July 25, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Thursday July 25, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday rallied to another all-time high. It closed on its high after a strong rally and therefore there is an increased chance of a gap up today.<p>But since yesterday was a buy climax, there is only a 25% chance of a strong bull trend today lasting all day. There is a 75% chance of at least a couple of hours of sideways to down trading that begins by the end of the 2nd hour.<p>The wedge buy climax and last week’s big bear bars on the daily chart are still important influences, but less so after yesterday’s rally. Traders should still expect a pullback to around 2900 over the next few weeks. This is true even if this small breakout above the 4 week wedge bull channel lasts for a couple more days.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 5 points in the Globex session. There will probably be a small gap up today. Small gaps typically close in the 1st hour. However, yesterday was surprisingly strong. This will reduce the chance of a bear trend day today. The best the bears can probably get is a trading range day.<p>If the bulls get a bull trend day after yesterday’s buy climax, it will likely not be a strong bull trend day. Day traders should expect a sideways to up day today with at least one swing down.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-small-pullback-bull-trend-and-buy-the-close-bull-trend.png\"><img src=\"2019-7-25.png\" alt=\"Emini small pullback bull trend and buy the close bull trend\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/EURUSD-Forex-testing-52-week-low-after-head-and-shoulders-top-and-Brexit-1.png\"><img loading=\"lazy\" src=\"2019-7-25-1.png\" alt=\"EURUSD Forex testing 52 week low after head and shoulders top and Brexit\"></a></figure><p>The EURUSD daily Forex chart so far has a small break below the May 52 week low. This is a new low in the yearlong bear channel and the daily chart is now back in a bear trend.<p>The bears want consecutive closes below the May low. Furthermore, they want big bear bars closing near their lows. If they get that, traders will begin to look for a 300 pip measured move down after a break below the 5 month trading range.<p>However, there is a 60% chance that this breakout will be like all of the others over the past year. Each strong leg up and down reversed after a few weeks. Traders will therefore look for a reversal back up within a week or two. Next week’s FOMC report could be the catalyst for either a reversal up or the start of a measured move down.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart traded down from above yesterday’s high to below yesterday’s low. Additionally, the strong 60 pip reversal down also broke below the May 52 week low. However, it quickly reversed back up to above yesterday’s high. Today is therefore a bull trend reversal day.<p>Consequently, the overnight selloff might simply be a sell vacuum test of support. That increases the chance of a bull trend reversal on the daily chart within a few days. This selloff would then be like all of the other new lows over the past year. Every bear breakout failed.<p>Today’s close will be important. The bulls want the bear breakout to fail and reverse up from 1.11. They will try to get today to close above the open. Today would then have a bull body on the daily chart. They prefer to get today to close on its high and above yesterday’s high. Today would then be a stronger buy signal bar on the daily chart.<p>The bears want a 300 pip measured move down. They know the odds favor a reversal up within a week. While they want today to close below yesterday’s low and the May low, they believe that is now unlikely.<p>Alternatively, they want to weaken the reversal up. With the strong reversal up over the past 20 minutes, the best they probably will get today is a trading range and maybe a close below the open. The bulls now are in control of the 5 minute chart. Day traders will be more willing to buy selloffs than sell rallies.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-bear-spike-and-channel-trend.png\"><img loading=\"lazy\" src=\"2019-7-25-2.png\" alt=\"Emini bear spike and channel trend\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini reversed down to below yesterday’s low. Yesterday is now a double top with last week’s high. After a Spike and Channel down, the Emini entered a trading range and closed around the 60 minute EMA. It might continue sideways until next week’s FOMC report.<p>There is a parabolic wedge buy climax on the daily over the past month. Also, there have been many big bear bars over the past 2 weeks. The Emini is struggling to hold above 3,000. As a result, the Emini will probably pull back to 2900 – 2950 over the next few weeks. This is true even if it goes a little higher first.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-7-25"
    }
  ],
  "26": [
    {
      "data": [
        "<article class=\"post-91620 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini double top and parabolic wedge buy climax above 3000\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini double top and parabolic wedge buy climax above 3000</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-07-26T06:20:00-07:00\">July 26, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Friday July 26, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini repeated its pattern from last week of strongly reversing trend days. Yesterday totally reversed Wednesday’s rally. Yesterday now is a double top with last week’s high.<p>Nothing has changed. The month-long wedge rally and the several big bear bars are telling traders that the Emini will probably go down for a few weeks. This is true even if it goes a little higher.<p>Logical targets are the higher lows in the wedge rally. That means around 2900 – 2900.<p>There is always a bull case. The bulls have a 40% chance of a big rally from here without a 2 – 3 week pullback first.<p>Next week’s FOMC meeting is unusually important. The Emini might stay sideways until then.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 7 points in the Globex session. Yesterday formed a higher low major trend reversal on the 5 minute chart. The pattern was also a head and shoulders bottom.<p>Today will probably open above the neck line. This will trigger the buy signal. Every major trend reversal pattern has a 40% chance of leading to a trend.<p>However, the daily chart has been in a tight trading range for 4 weeks. Yesterday was in a trading range. Trading range price action is more common than trends. Finally, traders might want to remain neutral ahead of next Wednesday’s important FOMC announcement. Consequently, today will probably not be a strong trend day.<p>Since today is Friday, weekly support and resistance can be important, especially in the last hour. The bulls want the week to close near its high and possibly at a new all-time high. Since the week’s low is far below, the best the bears can reasonably expect is a close below the midpoint of the week.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-bear-spike-and-channel-trend.png\"><img src=\"2019-7-26.png\" alt=\"Emini bear spike and channel trend\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/EURUSD-Forex-bear-channel-ahead-of-FOMC-Fed-rate-cut.png\"><img loading=\"lazy\" src=\"2019-7-26-1.png\" alt=\"EURUSD Forex bear channel ahead of FOMC Fed rate cut\"></a></figure><p>The EURUSD daily Forex chart broke to a new 52 week low yesterday. It is therefore still in its yearlong bear channel. However, every new low over the past year reversed up for 2 – 3 weeks within a few days. In addition, there is also a 5 month trading range and most trading range breakouts fail.<p>In addition, yesterday closed above the May low and above the open of the day. The chance of a successful bear breakout would have been greater if yesterday was a big bear bar closing on its low and far below the May low.<p>Consequently, this breakout so far looks like every prior new low in the bear channel. Traders will expect it to fail and for there to be a 2 – 3 week rally staring within a week.<p>Bear channels can last a long time but not forever. There is a 75% chance of an eventual bull breakout and only a 25% chance of a strong bear breakout with a conversion into a stronger bear trend. Since yesterday was a big doji day, which is neutral, traders need more information. They might be waiting for Wednesday’s FOMC Fed rate cut announcement before deciding on the direction of the next few weeks.<h3>ioi Breakout Mode pattern</h3><p>Today so far is a small day and it is also at yesterday’s open and close. An inside day after an outside day is an ioi Breakout Mode setup (inside-outside-inside, since the day before an outside day is inside of that outside day). Today will therefore be both a buy and a sell signal bar for Monday. Unless the bears begin to get a series on big bear days closing on their lows, the odds favor higher prices for at least a couple weeks.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 20 pip range overnight. It is in the middle of yesterday’s range. Yesterday was a big doji bar on the daily chart with an open and close almost in the exact middle. Today is a continuation of that neutrality.<p>If today remains small, day traders will look for 10 pip scalps. Also, after yesterday’s big reversals, they will expect any 30 – 50 pip today move up or down to reverse.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-small-pullback-bull-trend.png\"><img loading=\"lazy\" src=\"2019-7-26-2.png\" alt=\"Emini small pullback bull trend\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>After a quiet open, the Emini rallied in a Small Pullback Bull Trend to a new all-time high. While there is no top yet, the rally is a buy climax on the daily and weekly charts. Consequently, traders expect a 2- 3 week pullback beginning within a couple weeks. Next Wednesday’s FOMC announcement is a possible catalyst.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-7-26"
    }
  ],
  "27": [
    {
      "data": [
        "<article class=\"post-91626 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini bull micro channel and expanding triangle before FOMC\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini bull micro channel and expanding triangle before FOMC</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-07-27T00:30:04-07:00\">July 27, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Market Overview: Weekend Market Update</h2><p>The<strong>Emini</strong>has an 8 week bull micro channel on the weekly chart ahead of Wednesday’s FOMC meeting. This is a buy climax and makes a pullback likely within a couple weeks.<p><strong>Crude oil</strong>is at the apex of a 9 month triangle. It might have to fall below last week’s low before testing 60 again.<p>The<strong>EURUSD</strong>weekly Forex chart broke below the May low this week. Consequently, the 5 week trading range ended and the bear trend has resumed. However, every leg up and down over the past year reversed, and that is likely this time as well.<h2><strong>Crude oil Futures market:</strong><br>Month-long triangle in middle of 3 year trading range</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Crude-oil-daily-chart-apex-of-triangle-1.png\"><img loading=\"lazy\" src=\"2019-7-27.png\" alt=\"Crude oil daily chart apex of triangle\"></a></figure><p>The crude oil futures has been in a trading range for more than 3 years. Since October 2018, it has 2 lower highs and 2 higher lows. A contracting trading range with 5 or more legs is a triangle, which is a Breakout Mode pattern. Traders believe that the odds of a successful bull breakout are about the same as for a successful bear breakout. A successful breakout is one that has at least a couple legs and lasts 10 or more bars.<p>When a market is in Breakout Mode, there is a 50% chance that the 1st breakout up or down will fail and reverse.<p>The daily chart has been sideways for 7 days. Traders are deciding if the 3rd leg down is complete, or if there will be one more push down for a few days.<p>If there is and there is then a reversal up, there would also be a wedge bottom with the July 3 and July 19 lows. That would increase the chance of a rally back up to the July high and $60 over the following couple weeks.<h3>Middle of 3 year trading range</h3><p>I have been writing all year that 2019 would enter a trading range within the big 3 year trading range. This is because there was a big rally until October 2018 and then a big selloff until December 2018. Big Up, Big Down creates Big Confusion.<p>When traders are confused, they are confident of only one thing. They do not believe any move up or down will get far. They therefore look for reversals and take quick profits. When traders buy low, sell high, and take quick profits, their trading creates a trading range.<p>Reversals within a range are often not clear. When that is the case, traders like to see 2nd signals. For example, there was a double bottom in June. In July, there was a higher high double top, and the 2nd leg up also had a micro double top.<h3>Tight trading range is a Limit Order Market</h3><p>The past 7 days have been in a tight trading range. That means traders are buying near the prior day’s low and selling near the prior day’s high.<p>This is a Limit Order Market, which is bad for stop order traders. It is usually better to wait for a strong breakout up or down and then enter in the direction of the breakout.<p>Alternatively, wait for a breakout up or down that reverses, and enter in the direction of the reversal. This is what traders should expect for at least another week.<h2><strong>EURUSD weekly Forex chart:</strong><br>New low in yearlong bear channel</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/EURUSD-Forex-weekly-chart-breakout-below-wedge-bear-channel.png\"><img loading=\"lazy\" src=\"2019-7-27-1.png\" alt=\"EURUSD Forex weekly chart breakout below wedge bear channel\"></a></figure><p>In June, the EURUSD weekly Forex chart had its strongest bear rally since September. However, this week broke to a new low, resuming the yearlong bear channel. Every breakout to a new low over the past year reversed up within about a week. Traders should therefore expect the same this time.<p>The legs up and down over the past year have all lasted at least a couple weeks. Furthermore, they were around 200 – 300 pips tall. Consequently, traders should expect a reversal up within a couple weeks. They might be waiting for Wednesday’s FOMC announcement.<h3>Bear channels do not last forever</h3><p>While reversals have been reliable for the past year, nothing lasts forever. Traders know that there will a bull or bear breakout at some point. For the past year, I have consistently said that until there is a strong breakout, traders should continue to bet on reversals. Nothing has changed.<p>The bears are hoping for a successful breakout below the bear channel. That happens 25% of the time. But if the bears begin to get 2 or more big bear bars closing below this week’s low, traders will conclude that there will be a swing down.<p>There are 2 other possibilities. If there is going to be a breakout of the channel, there is a 75% chance of a bull breakout above a bear channel. Traders should think of a bear channel as a bull flag.<h3>Channels often spend a lot of time in trading ranges</h3><p>The final possibility is that a channel begins to go sideways. This one has been sideways for 5 months.<p>Once the bears stop getting lower lows, the pattern is a trading range. At that point, the probabilities shift. Instead of the odds favoring a bull breakout, the chance of a bear breakout increases to the same as for a bull breakout.<p>A trading range is a Breakout Mode pattern. There is always both a buy and a sell setup within a trading range. The bulls and bears have an equal chance of a successful breakout.<p>Channels often spend a lot of time in trading ranges. But as long as a bear channel keeps forming new lows, the bear trend is still in effect. That is currently the case after this week’s new low.<h2><strong>Monthly S&amp;P500 Emini futures chart:</strong><br>Weak oo buy signal above September/May double top</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-monthly-chart-breakout-above-double-top-ahead-of-FOMC-meeting.png\"><img loading=\"lazy\" src=\"2019-7-27-2.png\" alt=\"Emini monthly chart breakout above double top ahead of FOMC meeting\"></a></figure><p>The monthly S&amp;P500 Emini futures chart&nbsp;has 3 trading days left in July. July so far is a small bull trend bar. That is disappointing for the bulls, who wanted a big breakout above the September/May double top.<p>May traded above the April high and then below the April low. May was therefore an outside down month. June was an outside up month. When there are consecutive outside bars in a bull trend and the 2nd one is up, those bars form an oo (outside-outside) bull flag.<p>If the next month goes above the high, it triggers a buy signal. There is then a 60% chance of at least 3 more sideways to up bars. Consequently, traders should expect sideways to up trading for at least into September.<p>When I say sideways to up, that allows for a pullback. For example, July is a small month. The bears would not need much selling for August to trade below the July low. That would be a pullback. But since the Emini should trade sideways to up through September, traders will be more willing to buy than sell below the July low.<h2><strong>Weekly S&amp;P500 Emini futures chart:</strong><br>8 week bull micro channel is losing momentum</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-weekly-chart-testing-top-of-expanding-triangle-top.png\"><img loading=\"lazy\" src=\"2019-7-27-3.png\" alt=\"Emini weekly chart testing top of expanding triangle top\"></a></figure><p>The weekly S&amp;P500 Emini futures chart had a bull bar this week. Its low was above last week’s low and its high was barely last week’s high. It is now the 3rd consecutive sideways bar so there is now a 3 bar tight trading range.<p>A tight trading range is a relatively neutral pattern and it is both a buy signal and a sell signal. Because this week had a bull body, it closed near its high, and it is in a strong bull trend, it is a more reliable buy signal bar. Next week is more likely to go above this week’s high than below its low.<p>However, last week was a big bear bar and 2 of the prior 3 weeks were dojis. The bull trend is losing momentum. There will probably be sellers not far above the high.<p>Because the 2 month rally is strong and this week had a bull body, it is a weak sell setup. Traders will buy not far below.<p>If this week is both a weak buy and sell setup, what will happen over the next couple of weeks? Traders should expect that if the Emini goes up, it will soon reverse down. If it goes down, it will probably reverse up. The 2 month rally will likely transition into a trading range within a few weeks.<h3>8 week bull micro channel is a buy climax</h3><p>This week was another bar with a low above the low of the prior week. This is therefore the 8th week in a bull micro channel. That is getting extreme. Extreme means unsustainable and climactic. This increases the chance of a pullback within the next couple weeks.<p>A pullback simply means that the low of the week falls below the low of the prior week. An 8 week bull micro channel is climactic, but it also represents eager bulls. They have been willing to buy above the prior week’s low for 2 months. Many bulls will be eager to buy below the prior week’s low once they finally have the opportunity.<p>Consequently, the 1st pullback will probably only last 1 – 3 weeks. This means it will be a minor reversal and not a major trend reversal into a bear trend. It will form a bull flag. Traders expect that the bull trend would then soon resume.<p>If there is then a new high and another reversal down, there would be a higher probability of a deeper pullback and one lasting longer. Second signals are more reliable. But since there is an upward bias on the monthly chart into September, the downside risk is still small.<h3>Expanding triangle top on weekly and monthly charts</h3><p>The bulls have a problem with their strong 2019 bull trend. Look the collapse after the sharp rally in January 2018. Next, there was a strong reversal up from the February low. There was another collapse from the new high in May 2018. It fell to below the February 2018 low. But the bulls bought it aggressively and the Emini is now above the May/September double top.<p>Do you see the pattern? The Emini is forming a series of higher highs and lower lows. This is an expanding triangle and it is present on the monthly chart as well. Each of the past 4 strong trends up and down reversed.<p>Will this time be different? Probably not. Traders should therefore expect a significant reversal down from above the May high. The rally is now at the top of the expanding triangle. That is the line drawn across the January 2018 and May 2018 highs. It currently is around 3040.<h3>How far down can the Emini fall this year?</h3><p>The reversal down will likely come from a failed breakout above the line at the top of the expanding triangle. In the S&amp;P500, traders like to talk about 1 – 2% overshoots. That means the top of the rally from December will probably be around 3050 – 3150 before there is another strong reversal down.<p>Can the reversal continue down to below the December low? There is currently only a 30% chance of that in 2019. The bears have a 50% chance of a retracement of about half of the rally from the December low within a year. That makes the June low around 2700 a reasonable target.<p>At some point, an expanding triangle evolves into some other pattern. Most often, it becomes an ordinary trading range (remember, triangles are trading ranges that either expand or, more often, contract).<h3>The Fed will probably cut interest rates at Wednesday’s FOMC meeting</h3><p>What happens if the Fed cuts interest rates? Nobody knows. We will find out if more dollars buy or sell the news.<p>Since the upside over the next few weeks is small, a strong rally will soon reverse. Because the weekly chart has been in a micro channel for 8 weeks, the bears will probably only get a minor reversal down.<p>With limited upside and downside for a few weeks, the Emini will probably enter a trading range for several weeks. The bottom of the range might be around 2900. The top could be this week’s high or a little higher.<h2><strong>Daily S&amp;P500 Emini futures chart:</strong><br>Double top ahead of Fed interest rate cut</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-daily-chart-breakout-above-wedge-top-ahead-of-FOMC-Fed-interest-rate-cut.png\"><img loading=\"lazy\" src=\"2019-7-27-4.png\" alt=\"Emini daily chart breakout above wedge top ahead of FOMC Fed interest rate cut\"></a></figure><p>The daily S&amp;P500 Emini futures chart this week traded slightly above last week’s high. If it reverses down next week, traders will see this week’s rally as forming a slightly higher double top with last week’s high. The neck line of the double top is last week’s low. Traders expect a break below the neck line to lead to a measured move down.<h3>Parabolic wedge buy climax</h3><p>There is another problem for the bulls. When there are 3 or more legs up in a tight bull channel, there is a parabolic wedge buy climax. June 11 was the 1st of 5 legs up in a tight bull channel. A buy climax at some point attracts profit takers. After 5 leg up, they will probably take some profits soon.<p>Once the bulls take profits, they will not immediately buy again. Traders typically look for at least 2 legs and 10 bars sideways to down. If the bears fail to get a strong reversal down by then, the bulls will again look for buy setups.<p>When there is a reversal down from any wedge, the 1st target is the bottom of the most recent leg up. That is the July 9 low of 2965.75. More often, the profit-taking gets to around the start of the wedge. Most computers see that as either the June 12 or June 26 lows, which are around 2900. Traders therefore should expect a 2 – 3 week selloff down to around 2900 beginning within a few weeks.<hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-7-27"
    }
  ],
  "29": [
    {
      "data": [
        "<article class=\"post-91623 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini continued buy climax ahead of Wednesday’s July FOMC\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini continued buy climax ahead of Wednesday’s July FOMC</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-07-29T06:20:03-07:00\">July 29, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Monday July 29, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini made a new all-time high again on Friday. However, there is a potential small wedge rally on the daily chart that began with the July 18 low. It is nested within a 5 legged wedge that began with the June 11 high. A wedge is a climax and it typically attracts profit takers.<p>Furthermore, the weekly chart has an 8 bar bull micro channel. Since that is unusual, it, too, is a buy climax.<p>Also, the weekly chart had a big bear bar 2 weeks ago. That is a weak buy signal bar. Consequently, there are probably more sellers than buyers not far above its high.<p>This rally might continue a little longer. There might even be a brief sharp rally after Wednesday’s FOMC announcement. But the bulls will probably take profits soon. That will result in a 2 – 3 week pullback to between 2900 and 2950.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 1 point in the Globex session. It is at the top of a 4 week trading range. A trading range means that traders look for reversals up from selloffs and down from rallies. Consequently, there is a reduced chance of a big bull day, despite Friday’s rally.<p>The Globex session has been in a small range. The bar 2 weeks ago on the weekly chart was a big bear. Also, the weekly chart is in a buy climax. These factors additionally reduce the chance of a big rally today.<p>Friday was a buy climax on the 5 minute chart. There is therefore a 75% chance of at least 2 hours of sideways to down trading today beginning by the end of the 2nd hour. It might have begun in the final minutes on Friday.<p>The dominant force operating on the Emini for the next three days is the uncertainty of Wednesday’s 11 am PST FOMC announcement. That increases the chance of trading range price action until then.<h2>Friday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-small-pullback-bull-trend.png\"><img src=\"2019-7-29.png\" alt=\"Emini small pullback bull trend\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/EURUSD-Forex-breakout-below-trading-range-ahead-of-FOMC-rate-cut.png\"><img loading=\"lazy\" src=\"2019-7-29-1.png\" alt=\"EURUSD Forex breakout below trading range ahead of FOMC rate cut\"></a></figure><p>The EURUSD daily Forex chart broke below a head and shoulders top neck line and then below the May low. This is a resumption of the yearlong bear channel and the bears want a 300 pip measured move down.<p>However, every new low in the bear trend over the past year reversed up within a few days. The bulls then got a 200 – 300 pip rally over the next few weeks.<p>I have mentioned this pattern after every strong rally and selloff for a year. While this will not go on forever, a trader will make more money betting on it continuing until it clearly has ended. Therefore, traders should expect a reversal up this week. It might come after Wednesday’s FOMC meeting.<p>It is important to note that while the odds favor a reversal, traders have to be prepared for a change in the price action. If there are consecutive bear bars closing on their lows and below the May low, the odds will shift in favor of at least a couple legs down and a stronger bear trend.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 30 pip range overnight. It bounced in the past 30 minutes from just above yesterday’s low. Today’s high so far is below yesterday’s high. Consequently, today is still within yesterday’s range and is currently an inside day. Friday was also an inside day.<p>Consecutive inside days is an ii pattern, which is a breakout mode pattern. Because the daily chart is at major support and Wednesday’s meeting is an important catalyst, trader’s are neutral. The ii pattern reflects that. If today remains an inside day, today will be both a buy signal bar and a sell signal bar on the daily chart for tomorrow.<p>When there is a breakout mode pattern, traders know that there is about a 50% chance of a successful bull or bear breakout. Furthermore, they realize that there is a 50% chance that the 1st breakout up or down will reverse.<p>Today does not have to remain an inside day. But it is also the 4th day in a tight trading range. There will probably be sellers around Friday’s high and buyers below Friday’s low. Traders expect a continuation of the 4 day tight range and are looking for reversals to scalp today.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-sell-climax-and-then-triangle-trading-range-day.png\"><img loading=\"lazy\" src=\"2019-7-29-2.png\" alt=\"Emini sell climax and then triangle trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini opened with a sell climax, but reversed up from the 60 minute EMA. It then entered a trading range. With lower highs and higher lows, it was a triangle. This is a Breakout Mode pattern.<p>Today was an inside day on the daily chart. It is a pause in a bull trend and therefore a buy signal bar on the daily chart. But there is an 8 day wedge rally. Traders also see today as a sell signal bar. The Emini will probably stay mostly sideways into Wednesday’s 11 am FOMC announcement on interest rates.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-7-29"
    }
  ],
  "30": [
    {
      "data": [
        "<article class=\"post-91926 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini wedge top ahead of July FOMC announcement tomorrow\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini wedge top ahead of July FOMC announcement tomorrow</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-07-30T06:20:23-07:00\">July 30, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Tuesday July 30, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday sold off on the open but reversed up weakly from the 60 minute EMA. It then formed a trading range day. It was a triangle on the 5 minute chart and that is a Breakout Mode pattern.<p>Because yesterday was an inside day in a bull trend, it is a buy signal bar. But there has been a wedge rally over the past 8 days. Also, the breakout above the July 15 wedge top might fail. Consequently, yesterday is also a sell signal bar. Since it had a bear body and the daily chart is in a wedge rally, the sell setup is slightly more reliable.<p>A triangle generates confusion, which typically results in more sideways price action. This is especially true with the uncertainty surrounding tomorrow’s 11 am FOMC announcement. Unless there is a strong series of trend bars up or down on the 5 minute chart in the 1st hour, day traders will look for reversals again today.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 14 points in the Globex session. It will therefore probably break below yesterday’s triangle on the 5 minute chart. In addition, it might gap below yesterday’s low. That would trigger a sell signal on the daily chart for a 9 day wedge rally and a failed breakout above a 2 month wedge top.<p>The context on the daily and weekly charts is good for a 2 – 3 week pullback down to around 2900. There is therefore an increased chance of a bear trend day today. But with the uncertainty surrounding tomorrow’s FOMC announcement, traders might decide to wait until after the announcement before creating a big trend day up or down.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-sell-climax-and-then-triangle-trading-range-day.png\"><img src=\"2019-7-30.png\" alt=\"Emini sell climax and then triangle trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/EURUSD-Forex-failed-breakout-below-5-month-trading-range-ahead-of-FOMC.png\"><img loading=\"lazy\" src=\"2019-7-30-1.png\" alt=\"EURUSD Forex failed breakout below 5 month trading range ahead of FOMC\"></a></figure><p>The EURUSD daily Forex chart formed a micro double bottom over the past 3 days. Today triggered the buy signal by going above yesterday’s high. The bulls want a 2 – 3 week reversal up, just like they got after every other new low over the past year.<p>There is no sign that this pattern has ended. Consequently, they will probably get their rally beginning within a week. What is unknown is how all financial markets will react to tomorrow’s FOMC announcement. It is possible that there will be a brief strong break below this week’s low before the reversal up begins.<p>Patterns do not last forever. This bear channel has gone on for a year. Bear channels typically have bull breakouts and lead to trading ranges. But the bears are hoping for a strong breakout below the 5 month range and the the start of an even stronger bear trend. If they get consecutive big bear bars closing on their lows, traders will conclude that there will be a successful bear breakout. Without that, the odds favor another 200 – 300 pip rally for a few weeks.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute chart traded above yesterday’s high. Yesterday was a bull bar on the daily chart and therefore a buy signal bar for a failed breakout below the 5 month range. Since there is a 3 day micro double bottom, this is a stronger buy setup.<p>However, instead of rallying strongly above yesterday’s high, the overnight breakout has been small. Furthermore, the 5 minute chart reversed back down below yesterday’s high. This is not how successful breakouts typically behave. Traders might be waiting for tomorrow’s FOMC announcement before deciding if the reversal up or the bear breakout will succeed.<p>Since the overnight range has only been 30 pips, day traders have been scalping. The 2 key prices today are yesterday’s high and today’s open. The bulls want today to close above its open. There would then be a bull body on the daily chart.<p>Additionally, they want today to close above yesterday’s high because yesterday is a buy signal bar on the daily chart. Finally, they want a big bull trend day. However, today’s small range and tomorrow’s FOMC announcement make a continued trading range day more likely.<p>The bears always want the opposite. They especially would like today to close on its low. Today would then be a sell signal bar for 4 day bear flag on the daily chart.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-broad-bull-channel-ahead-of-FOMC-interest-rate-cut.png\"><img loading=\"lazy\" src=\"2019-7-30-2.png\" alt=\"Emini broad bull channel ahead of FOMC interest rate cut\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>After a gap down and a brief rally, the Emini entered a tight trading range. It went sideways for several hours, and then the bulls got brief trend resumption up. The rally was a bull trap and the Emini drifted back down into its 4 hour trading range.<p>Tomorrow’s 11 am FOMC announcement will be unusually important. Day traders should exit their trades ahead of the report. The initial move on the report usually quickly reverses. Day traders therefore should wait until at least 10 minutes after the report before trading again.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-7-30"
    }
  ],
  "31": [
    {
      "data": [
        "<article class=\"post-91929 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini consecutive wedge tops ahead of today’s July FOMC announcement\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini consecutive wedge tops ahead of today’s July FOMC announcement</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-07-31T06:20:13-07:00\">July 31, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Wednesday July 31, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>After a gap down yesterday, the Emini rallied to Monday’s low and entered a trading range. A late rally failed and the day ended back in the earlier trading range.<p>The Emini is in a bull trend on the daily and weekly charts. Yesterday closed above its open and formed a bull bar on the daily chart. It is a High 1 bull flag buy signal bar for today. If today goes above yesterday’s high, it will trigger the buy signal. The big tail on the top of yesterday’s candlestick makes it a weaker buy signal bar. There is an increased chance of more sellers than buyers above yesterday’s high.<p>The bears see yesterday as an entry bar for an 8 day wedge rally and a failed breakout above the July 15 wedge top. There are therefore consecutive wedge tops. The bulls hope that yesterday is only a pullback in a bull trend.<p>The daily and weekly charts should begin a 2 – 3 week selloff down to 2900 within a week or two. While it might begin with today’s FOMC report, the report could lead to a surprisingly big 1 – 3 day rally first.<p>Today is the final day of the month. Monthly support or resistance is much less important today than usual because the FOMC announcement will dominate everything.<p>Most of the price action over the past 2 days has been sideways. Day traders will expect the same up to 11 am. But they know there is an increased chance of a big move up or down after the report. Also, they understand that the move could reverse.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 7 points in the Globex session. But traders know that the 11 am PST FOMC announcement will dominant the day. Day traders will look at the day as starting over at 11 am. Whatever takes place before 11 am has no correlation with what takes place afterwards.<p>There is typically a quick move in the wrong direction in the 1st minute after the report. Furthermore, there is a 60% chance of another reversal within the 1st 10 minutes. Consequently, day traders should not resume trading until at least 10 minutes after the report. They want to see either an unusually big trend bar up or consecutive trend bars in the same direction before taking a position.<p>Because today’s report is unusually important, day traders should be ready for anything. There is an increased chance of a big move up or down. Also, there can be a big reversal. Finally, there is a small chance that there is virtually no reaction and the Emini simply goes sideways in a tight range.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-broad-bull-channel-ahead-of-FOMC-interest-rate-cut.png\"><img src=\"2019-7-31.png\" alt=\"Emini broad bull channel ahead of FOMC interest rate cut\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/EURUSD-Forex-micro-double-top-bear-flag.png\"><img loading=\"lazy\" src=\"2019-7-31-1.png\" alt=\"EURUSD Forex micro double top bear flag\"></a></figure><p>The EURUSD daily Forex chart yesterday was the entry bar for a failed breakout below the 5 month trading range. But the bar was small. Traders wonder if it formed a micro double top with the high of either the bar from 2 days or 3 days earlier. If so, the chart now has a small bear flag after last week’s bear breakout.<p>Alternatively, today might be a pullback from yesterday’s reversal up. The bulls see a micro double bottom and a failed breakout below the May 52 week low.<p>There is therefore both a reasonable buy and sell setup ahead of today’s 11 am PST FOMC announcement on interest rates. Everyone knows that the Fed will probably cut its interest rate today. What no one knows is how much of that cut has already been priced into all financial markets. We will soon find out whether more dollars will buy or sell the news.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 20 pip range overnight. Day traders are having a hard time trying to make even a 10 pip scalp.<p>This unusually small range is a reflection of how tightly coiled all financial markets are ahead of this particular likely Fed interest rate cut. All financial markets are in Breakout Mode, and traders know there is an increased risk of a big move up or down, or of a big reversal after 11 am PST today.<p>Sometimes traders begin to buy or sell strongly before the report. However, day traders should exit all positions ahead of the report. Most of the time, there is a strong brief move that reverses within the 1st minute after the FOMC announcement.<p>Also, there is another reversal within the 1st 10 minutes 60% of the time. Consequently, day traders should typically wait at least 10 minutes after the report before resuming trading. The need to see consecutive trend bars in the same direction or a huge trend bar up or down first.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-crash-after-FOMC-Fed-rate-cut.png\"><img loading=\"lazy\" src=\"2019-7-31-2.png\" alt=\"Emini crash after FOMC Fed rate cut\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini crashed after the Fed rate cut today, but reversed up violently to around 3,000. About half of the selling was caused by the gamma in options. Hedge funds and institution hedge their stock positions in many ways.<p>A common way is to buy puts. For them to buy puts, other firms have to sell puts. There are huge option firms that specialize in selling puts and calls. They are essentially selling insurance to all of the firms that buy stocks.<p>When the stock market goes down, the firms that buy puts have their losses partially offset by the puts that they bought. These puts increase in value. That means that the options selling firms that sold the puts are losing money on their short puts.<p>The rate of loss accelerates as the stocks fall. It is not linear. Gamma measures how fast option prices change with the change in stock price. The gamma becomes big during a quick selloff.<p>That increasing gamma means that the options selling firms are losing money at an increasing rate. When the gamma rises, option selling firms have to reduce their risk. One way to to short stocks. If they short enough, the risk of a further drop in the stock market will not create additional losses for them. What they lose from their short puts, they make from their short stocks and futures.<p>When there is a big down day like today, about half of it is due to fundamentals, like the bulls taking profits and the bears shorting. The other half is created by option selling firms protecting themselves from losses on the puts they sold. Therefore, a big down day is actually not as bearish as it looks.<p>This week fell below last week’s low. The weekly chart now finally has a pullback. However, since the 9 week rally was much weaker than the January rally, the pullback will probably last longer. The odds still favor a test of 2900 over the next couple weeks. August will probably trade below the July low.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-7-31"
    }
  ]
}