{
  "2": [
    {
      "data": [
        "<article class=\"post-84695 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini bear rally in January after December sell climaxIntraday market update: Wednesday January 2, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini bear rally in January after December sell climax</strong><br>Intraday market update: Wednesday January 2, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-01-02T06:20:54-08:00\">January 2, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini bear rally in January after December sell climax</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Monday formed an inside day on the daily chart. It did not trigger the sell signal on the daily chart by going below Friday’s low. Likewise, it did not trigger the weekly buy signal by going above last week’s high, which was Friday’s high.<p>The bears will probably trigger a minor sell signal on the daily chart within the next few days. But last week’s reversal up was strong. In addition it was from the support of a 20% correction and the monthly bull trend line. Consequently, there will probably be a 2nd leg up after the 1st pullback.<p>Last Monday was the buy signal bar for the bear rally. Since it was a big bear bar closing on its high, there were bears selling with limit orders at its high. They have been scaling in higher. Since that is reasonable, they should be able to make a profit. Traders should expect a dip at least a little below last Monday’s high within a couple of week’s. The overnight selloff might be the start of the move down.<p>The buy signal on the weekly chart is minor since it is coming after a strong selloff. Therefore, even if the Emini rallies over the next several weeks, it will probably sell to below last week’s low within a couple months.<p>With a climactic reversal up last week, the Emini will probably be in a trading range for a month or more. Traders will look for reversals ever few days and they will take quick profits. This week is still a holiday week. That increases the chance of mostly trading range trading today.<p>In addition, the bulls will likely trigger the weekly buy signal.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 39 points in the Globex session. There might be a gap down on the open. By trading below Monday’s low, the Emini would trigger a sell signal on the daily chart. Since last Monday was a bear bar and therefore a bad buy signal bar, there is a magnet at its high of 2412.50. That might be too far below to reach today. However, typically a market pulls back to at least one tick below a bad buy signal bar’s high. Consequently, the Emini will probably get there within a couple weeks.<p>Last week’s reversal up was strong and it followed an extreme sell climax. That makes a 2nd leg sideways to up likely. Sometimes the 2nd leg up begins after a test below the low. Traders will expect buyers somewhere around either last Monday’s high or low.<p>A big gap down increases the chance of a trend day. Down is more likely. However, the Emini will open far below the 5 minute EMA. Traders do not like to sell too far below the average price. Therefore, when there is a big gap down, there is an 80% chance of at least one reversal in the 1st hour. Usually, the Emini usually has to get closer to the EMA before a trend begins. The bulls want either a double bottom or a wedge bottom. The bears try to create a double top or wedge bear flag near the EMA.<h2>Monday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-trading-range-and-close-above-2500-on-final-day-of-2018.png\"><img src=\"2019-1-2.png\" alt=\"Emini trading range and close above 2500 on final day of 2018.png\"></a><p class=\"caption\">Here are several reasonable stop entry setups from Monday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex bear trend reversal after failed bull breakout</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/EURUSD-Forex-bear-trend-reversal-after-failed-breakout.png\"><img loading=\"lazy\" src=\"2019-1-2-1.png\" alt=\"\"></a><p class=\"caption\">The EURUSD daily Forex chart broke far above the 2 month trading range on Tuesday, but reversed down from a wedge top. Today triggered a sell signal by falling below yesterday’s low.<p><br>I have been writing over the past several weeks that currency markets have an increased chance of beginning a trend in early January. The bulls yesterday failed in their attempt to break above the 2 month trading range. They now hope that the selloff will form a double bottom with the December 26 or 14 lows.<p>They want the bull channel or trading range to continue. To them, the wedge rally is a bull channel after the November 20 spike up. A Spike and Channel bull trend usually evolves into a trading range and not a bear trend. If the bulls can prevent a strong break below the December low, the 2 month trading range will continue.<p>However, yesterday was a good sell signal bar. In addition, the context is good for the bears. Finally, today so far is a strong entry bar for the bears. Therefore, there is better than a 50% chance chance of a bear break below the trading range within a few weeks and then a bear trend.<p>Until there is a breakout, there is no breakout. The probability for a bear trend is not yet 60%. The bears need big bear bars closing below the December and November lows. Without that, the 2 month trading range will continue.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart fell 130 pips overnight in a Small Pullback Bear Trend. While that is climactic, there is no sign of a bottom. Consequently, the bears will continue to sell even 10 – 20 pip rallies. They want today to close near its low. That would create a strong entry bar on the daily chart and increase the chance of lower prices tomorrow and next week.<p>The bulls 1st need to stop the selling. If they can create a 1 – 2 hour trading range, day traders will begin to scalp longs for 10 – 20 pips in addition to selling rallies.<p>However, they know that the 1st reversal up in a strong bear trend is typically minor. To get a reasonable chance of a 50+ pip rally, which is unlikely today, they usually need some kind of double bottom. That requires 20 or more bars. Without that, most bulls will not buy.<p>Today’s close is important. The bears want the daily chart to begin a bear trend. Bear trends have lots of bear days closing near their lows. If the bulls can get late rallies, the bars on the daily chart will have big tails below. That would discourage traders from continuing to sell at the low and reduce the chance of a bear trend over the next few months.<p>On the other hand, the more consecutive bear bars that close near their lows, the more likely this will be the start of a bear trend. The bears need to show that they can beat back the bulls every day.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-outside-up-day.png\"><img loading=\"lazy\" src=\"2019-1-2-2.png\" alt=\"Emini outside up day\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>By trading below Monday’s low and then above its high, the Emini formed an outside up day today. However, it did not trigger the weekly buy signal. Last week’s high is just above today’s high. Therefore, the bulls will probably trigger buy this week.<p>The 5 day rally from the sell climax and the 20% correction is still probably a minor reversal. It was strong enough to make 2 legs up likely. Therefore, bulls will buy selloffs. The bears will wait for at least a micro double top.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2019-1-2"
    }
  ],
  "3": [
    {
      "data": [
        "<article class=\"post-84697 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini outside up in minor reversal from sell climaxIntraday market update: Thursday January 3, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini outside up in minor reversal from sell climax</strong><br>Intraday market update: Thursday January 3, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-01-03T06:20:15-08:00\">January 3, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini outside up in minor reversal from sell climax</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Yesterday gapped down below Monday’s low. That triggered a weak Low 1 sell signal on the daily chart. As was likely, there were buyers below. Yesterday rallied above Monday’s high, forming an outside up day. But, the bulls were unable to hold above that high into the close.<p>I said last week that the Emini would soon trigger the sell signal on the daily chart and the buy signal on the weekly chart. It reversed down yesterday from just below last week’s high. It therefore failed to trigger the weekly buy signal. However, it is still close enough to make it likely that the bulls will get above that high within a week or two.<p>Nothing has changed. The strong rally on the daily chart is still a minor reversal. The odds are that the Emini will get a 2nd leg sideways to up. Then, it should fall below the December low within a month or two.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 26 points in the Globex session. After yesterday’s outside up day and a 3 day tight trading range, there is an increased chance of an inside day today. The bulls will buy above yesterday’s low and the bears will sell below yesterday’s high.<p>Furthermore, because of the 3 day tight trading range, there might be more sellers than buyers above yesterday’s high. In addition, there are probably more buyers than seller’s below yesterday’s low.<p>Today has an increased chance of being the 4th consecutive trading range day. Since the daily ranges continue to be big, the legs up and down will probably be big enough for swing trades. Day traders will look for weak trends to reverse every 2 – 3 hours.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-outside-up-day.png\"><img src=\"2019-1-3.png\" alt=\"Emini outside up day\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex in Breakout Mode after 2 month trading range</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/EURUSD-Forex-in-Breakout-Mode-after-2-month-trading-range.png\"><img loading=\"lazy\" src=\"2019-1-3-1.png\" alt=\"EURUSD Forex in Breakout Mode after 2 month trading range\"></a><p class=\"caption\">Yesterday reversed down strongly from a wedge rally to the top of the 2 month trading range. However, the bulls still have higher lows and there is therefore a broad bull channel. The chart is neutral and in Breakout Mode.<p><br>I wrote yesterday that the wedge top and strong reversal down were good for the bears. However, I said that until there is a breakout, there is no breakout.<p>The chart is still in its 2 month trading range and remains in Breakout Mode. There is always a reasonable buy and sell setup. The bulls have been forming higher lows since November 12. Therefore, there is a 2 month broad bull channel in addition to the wedge top.<p>Both sides have been alternating control after every few days. Until there is a clear breakout, the chart is neutral and traders will bet on reversals.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart rallied 70 pips and pulled back 40 pips overnight. After yesterday’s big reversal down, the bears needed sustained selling today. So far, this is trading range trading.<p>The 80 pip rally makes it unlikely that the bears will be able to form a strong bear trend day today. Additionally, the 40 pip reversal down and yesterday’s big selloff make a bull trend unlikely. Therefore, today will probably continue the overnight trading range trading. Day traders will look for reversals and 10 – 20 pip scalps.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-gap-down-and-bear-trend-resumption.png\"><img loading=\"lazy\" src=\"2019-1-3-2.png\" alt=\"Emini gap down and bear trend resumption\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>After an initial selloff, today oscillated around yesterday’s low. Although today was a trading range on the 5 minute chart, it was a bear bar on the daily chart.<p>Because December 24 was a bad buy signal bar, today might be the start of a test down to that high.<p>Tomorrow is Friday. The bulls were unable to trigger the weekly buy signal. Instead, this week so far is a Low 1 sell signal bar for next week.<p>Traders tomorrow will pay attention to weekly support and resistance, especially in the final hour. The bears want the week to close near its low.<p>While the bulls want a close above the open, that is unlikely. Alternatively, they want the week to close above its midpoint. That would weaken it as a sell signal bar for next week.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2019-1-3"
    }
  ],
  "4": [
    {
      "data": [
        "<article class=\"post-84846 post type-post status-publish format-standard has-post-thumbnail category-analysis category-video entry override\" aria-label=\"2019 Market outlook analysis\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">2019 Market outlook analysis</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-01-04T03:23:50-08:00\">January 4, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/richardhk/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">BTC Admin</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><div style=\"position:relative;height:0;padding-bottom:56.25%\"><figure><iframe class=\"sproutvideo-player\" style=\"position:absolute;width:100%;height:100%;left:0;top:0\" src=\"//videos.sproutvideo.com/embed/7c9ddfb41c12eac5f4/5b99e332e5ac793c?playerTheme=dark&amp;playerColor=\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></figure></div><p>Duration: 14 mins<h2>Al Brooks’ 2019 Market outlook video report</h2><p>Al was invited by Cam Hawkins (TradingNut.com) to create a video as part of a “2019 Market Predictions” special podcast episode that Cam is putting together.<p>Here is Al’s contribution. You can see this video on<a href=\"https://www.youtube.com/channel/UC2-JF8X_LDFEtSa3Ohfwvpg\" target=\"_blank\" rel=\"noopener\">Al’s YouTube channel</a>if needed.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-1-4"
    },
    {
      "data": [
        "<article class=\"post-84699 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini pullback from strong December sell climax reversalIntraday market update: Friday January 4, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini pullback from strong December sell climax reversal</strong><br>Intraday market update: Friday January 4, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-01-04T06:20:15-08:00\">January 4, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini pullback from strong December sell climax reversal</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Yesterday sold off on the open, but then formed a big trading range day. The selloff was in a bear channel, which is a bull flag. The odds favor a bull breakout of the channel today.<p>There is a magnet below at the December 24 high. It was a bear bar and therefore a bad buy signal bar. Some bears sold above and scaled in higher, correctly believing the Emini would pull back to their 1st entry price. Since the rally last week was strong, the Emini might have a 2nd leg up before testing the December 24 high.<p>The bulls have a magnet above at last week’s high. Last week is a buy signal bar on the weekly chart. However, that could be too far above to get there today. The bulls might have to wait until next week before trying again to get there.<p>The daily chart will likely be in a trading range for at least a few weeks. Consequently, traders will look for every move up or down to reverse within 3 – 5 days.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 33 points in the Globex session. It will therefore gap above yesterday’s bear channel. Furthermore, last week’s reversal was strong enough to make a 2nd leg up likely. Finally, last week is a buy signal bar on the weekly chart. These factors increase the chance of a bull trend day today.<p>But, after 4 sideways days, traders will expect more trading range trading until they see a strong breakout up or down.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-gap-down-and-bear-trend-resumption.png\"><img src=\"2019-1-4.png\" alt=\"Emini gap down and bear trend resumption\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD weekly Forex chart in bear channel and wedge bottom</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/EURUSD-weekly-Forex-chart-in-bear-channel-and-wedge-bottom.png\"><img loading=\"lazy\" src=\"2019-1-4-1.png\" alt=\"EURUSD weekly Forex chart in bear channel and wedge bottom\"></a><p class=\"caption\">The EURUSD weekly Forex chart has been in a tight trading range for 10 weeks. While this week is an outside down week, it has a small body. Therefore, it has no predictive value. The chart is in Breakout Mode.<p><br>The EURUSD weekly Forex chart has been in a tight range for 10 weeks. It is therefore in Breakout Mode. There is always both a bull and bear setup. The bears have a yearlong bear trend. But the bulls have a wedge bull flag.<p>Prior breakouts over the past year came after a couple of months. In addition, Forex markets often begin swings in January. This increases the chance of a breakout within the next few weeks.<p>But, until there is a breakout, there is no breakout. Traders will continue to look for reversals every few days.<h3>Overnight EURUSD Forex trading</h3><p><br>Yesterday was a bull trend reversal day on the daily chart (not shown). It is a buy signal bar for today. Today rallied above yesterday’s high and therefore triggered the buy signal.<p>But, because the chart has been in a tight trading range, buy and sell signals typically fail. Today so far has reversed down 50 pips after triggering the buy signal.<p>Because the reversal down over the past 10 minutes was sharp, there probably will be some follow-through selling. However, day traders will still mostly look for scalps because of the 2 month tight trading range.<p>Since today is Friday, weekly support and resistance are important. This week is an outside down week. If the bears can close the week below last week’s 1.1343 low, that would slightly increase the chance of lower prices next week.<p>However, that is only minor. Traders need to see a clear, strong breakout above or below the 2 month range before they will look for swing trades. Until then, day traders will continue to mostly scalp for 10 – 20 pips.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-weekly-buy-signal-and-bull-trend-from-the-open.png\"><img loading=\"lazy\" src=\"2019-1-4-2.png\" alt=\"Emini weekly buy signal and bull trend from the open\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>By going above last week’s high, the Emini triggered a weekly buy signal today. However, the bulls were unable to get above the February low. Therefore, there is still a gap below the 2018 trading range. But, the odds favor the bear rally getting above the February low next week.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2019-1-4- 1"
    }
  ],
  "5": [
    {
      "data": [
        "<article class=\"post-84703 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Strong Emini rally testing February and October lowsWeekend market update: January 5, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Strong Emini rally testing February and October lows</strong><br>Weekend market update: January 5, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-01-05T00:30:01-08:00\">January 5, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2><strong>Market Overview</strong></h2><p>The<strong>Emini</strong>reversed up strongly over the past 2 weeks. On December 24, I said that there would probably be a rally that would be strong enough to make traders wonder if the bull trend has resumed. The rally probably will go higher, but it is still likely just a strong bull leg in what will become a trading range.<p>The<strong>crude oil</strong>daily chart has a weak bear rally. However, the downside is minimal because the bears are exhausted. The chart will probably be in a trading range for at least a couple months.<p>The<strong>30 year bond futures</strong>chart has a parabolic wedge buy climax. There will probably be at least a couple legs sideways to down over the next 2 weeks.<h2><strong>Crude oil Futures market:</strong><br>20 Gap Bar sell signal after weak Final Bear Flag rally</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Crude-oil-futures-daily-chart-has-20-Gap-Bar-sell-signal-after-weak-bear-rally-1.png\"><img loading=\"lazy\" src=\"2019-1-5.png\" alt=\"Crude oil futures daily chart has 20 Gap Bar sell signal after weak bear rally\"></a><p class=\"caption\">The crude oil futures daily chart is in a strong bear trend. The 2 week rally has been weak. This is the 1st pullback to the 20 day EMA, which means it is a 20 Gap Bar sell setup. The bulls need a big bull bar to indicate that the bears have given up. The bears are still in control, despite the possible Final Bear Flag.<p>The crude oil futures daily chart has a 20 Gap Bar sell setup. But, the bears want a bear bar closing near is low for a sell signal bar. Without that, the bear rally will continue.<p>If the bulls get a big bull bar closing near its high and far above the EMA, it would indicate that the bears have given up. It would likely lead to at least 2 legs up to around the top of the early December tight trading range. That trading range is late in a bear trend. It therefore is a good candidate for a Final Bear Flag reversal.<h4>Minor reversal and trading range likely</h4><p>Even if the bulls get their reversal, the 3 month bear channel has been tight. Consequently, the 1st reversal up will be minor. This means that it will lead to a trading range and not a bull trend.<p>If the 20 Gap Bar sell signal triggers, the target is a test of the low. Since the bear trend has lost momentum, there will probably be buyers below the December low. A reversal up at that point would create a wedge bottom with the November and December lows.<p>Despite the strong bear trend, this selloff is climactic. As a result, there is probably not much downside risk over the next couple of months. A trading range is likely to form because the bears are exhausted and less willing to sell at this low price.<h2><strong>US 30 year Bond futures candlestick chart:</strong><br>Parabolic wedge buy climax</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/US-30-year-Treasury-Bond-futures-daily-chart-in-parabolic-wedge-buy-climax.png\"><img loading=\"lazy\" src=\"2019-1-5-1.png\" alt=\"US 30 year Treasury Bond futures daily chart in parabolic wedge buy climax\"></a><p class=\"caption\">Friday was an outside down bar that closed near its low. It is a sell signal bar for a reversal down from a parabolic wedge buy climax.<p>The US 30 year Treasury Bond future chart has rallied strongly for 2 months in a tight bull channel. Because the channel has 3 legs, it is a parabolic wedge buy climax. A trend like this is unsustainable.<p>The stop for the bulls is too far below. They therefore are risking more open profit than they typically do. As a result, they will take profits.<p>When they take profits, they will not look to buy again just 2 – 3 days later. A reasonable minimum goal is TBTL (ten bars, two legs) down to the 20 day EMA. Also, the reversal usually reaches either of the 2 higher lows. Then, the chart evolves into a trading range for the next 20 or so bars.<h4>Outside down sell signal bar</h4><p>Friday’s outside down candlestick is a sell signal bar. It represents bulls giving up. Bears will sell on a stop below its low. Their protective stop is above Friday’s high. If they get stopped out, they will sell the next reversal down as well if it comes within a few bars after the new high.<p>The odds are that the daily chart will trade sideways to down for at least a couple weeks. However, the tight bull channel means that the bulls are strong. Therefore, the selloff will probably be a minor reversal. This means it will lead to a trading range, not a bear trend.<h2><strong>Monthly S&amp;P500 Emini futures candlestick chart:</strong><br>Bull inside bar after December sell climax</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-monthly-candlestick-chart-has-bull-inside-bar-after-sell-vauum-test-of-bull-trend-line.png\"><img loading=\"lazy\" src=\"2019-1-5-2.png\" alt=\"Emini monthly candlestick chart has bull inside bar after sell vauum test of bull trend line\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has a small inside bar so far in January. Last month bounced from the 8 year bull trend line and a 20% correction.<p>The monthly S&amp;P500 Emini futures candlestick chart has traded in a narrow range so far in January. Last month bounced from both a 20% correction and an 8 year bull trend line. However, December had the biggest bear body in the 10 year bull trend. In addition, it closed below the 2018 trading range. Finally, it was the 3rd bar in a big, fast correction down from the all-time high. The momentum down is strong enough to make lower prices likely.<p>Whenever there is a breakout, the next month is important. January is the follow-through bar. It can help predict what traders can expect over the following months.<h4>Bear case: strong January selling, confirmed bear breakout</h4><p>If the candlestick in January is a big bear trend bar closing on its low, that would signify strong follow-through selling. The bears currently have a 30% chance of this outcome. It would make lower prices likely. The Emini would probably then fall to the next support level, which is the 2,100 top of the 2014 – 2015 trading range.<p>That trading range is a good candidate for a Final Bull Flag. If the Emini reaches its top, it will probably continue to its bottom at around 1,800. That would be about a 40% correction.<h4>Bull case: strong January rally, failed bear breakout</h4><p>The bulls want January to form a big bull trend bar closing on its high. If they succeed, January would become a buy signal bar for February. Traders would suspect that the December bear breakout failed.<p>They would then look for a strong rally in February. If that were to happen, then December would likely be the end of the selloff. Traders would expect a new all-time high within a few months. There is a 20% chance of this at the moment.<h4>Neutral case: Neutral January, need more information</h4><p>Finally, if January is unclear, traders would expect more sideways trading in February. For example, if January remains inside of December’s range and the candlestick has a small body with prominent tails, traders will need more information. This is the most common situation after a breakout.<h4>“The nail that sticks out gets hammered down”</h4><p>The market is the financial king of everyone. It is strong enough to humble everyone else. If there is a prominent figure who claims to have power over the market, the market enjoys hammering that person down.<p>Before he was elected, Trump claimed that he had the power to make the stock market rally. It rallied during his 1st year, and he claimed that he created the rally. Did he? Nope. Did he cause the 20% correction? Nope.<p>However, I have been doing this for over 30 years. Markets are drawn to stops and tend to go beyond them. Stops are magnets. I said many times in late 2017 that the 2017 buy climax was the most extreme in the 100 year history of the stock market. When there is a reversal down from an extreme buy climax, the selloff typically reaches the bottom of the buy climax. December fell below August 2017 start of the buy climax.<p>The rally from the 2016 election to January 2018 was a even bigger buy climax. Although 2016 was not as extreme as 2017, the entire 2 years was a buy climax. That means that there is a Trump magnet at around 2,120 in the Emini.<p>The stock market began its extreme buy climax at his election. Because the 1st half of the 2 year buy climax was less extreme, its low is less important. But, the market tends to hammer the nail that sticks out. Therefore, there is a 40% chance that this selloff will hammer Trump’s rally down to nothing before it is done.<h2><strong>Weekly S&amp;P500 Emini futures candlestick chart:</strong><br>Bull trend reversal triggered this week</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-weekly-candlestick-chart-has-bull-trend-reversal-at-8-year-bull-trend-line-2.png\"><img loading=\"lazy\" src=\"2019-1-5-3.png\" alt=\"Emini weekly candlestick chart has bull trend reversal at 8 year bull trend line\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart closed near its high and above last week’s high. It therefore triggered a weekly buy signal for a reversal up from an 8 year bull trend line.<p>The weekly S&amp;P500 Emini futures candlestick chart broke strongly below a 50 bar trading range in December. All of the bulls who bought stock in 2018 are now holding losing positions. They are worried about the size of the 3 week collapse. Therefore, many are looking to exit with a smaller loss on a bounce to the bottom of the yearlong trading range.<p>Their stock waiting to be sold represents supply and therefore creates resistance. That is around the February or November lows and the 2,600 Big Round Number.<p>The bears know that the bulls are trapped. They, too, will look to sell at that test of resistance, believing that the supply is too much to overcome.<p>Additionally, many bears took profits on the collapse to the monthly bull trend line. Their protective stops were so far above that their risk had become too great. Risk management dictated that they reduce their positions.<p>However, they are still eager to sell a rally up to resistance, which is exactly where the bulls will dump their losing longs. Consequently, there will probably be a 2nd leg down from around 2,550 or 2,600.<h4>Measured move down?</h4><p>Whenever there is a strong break below a trading range, traders begin to consider a measured move down. The 2018 trading range was 400 points tall. Therefore, a measured move down is around 2,150. That is also around the top of the 2014 – 2015 trading range. In addition, it is at the Trump magnet as well (see above). That cluster of support increases the magnetic pull of that level.<p>Finally, of the 32 times in the past 100 years that the market fell 20%, none fell exactly 20%. All fell more. The average was about 30%. A 30% selloff would be below 2,100, which is again in that same area. Therefore, if the Emini continues down, it will probably reach that support zone.<h2><strong>Daily S&amp;P500 Emini futures candlestick chart:</strong><br>Strong Emini rally testing February and October lows</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-daily-candlestick-chart-has-strong-minor-trend-reversal-after-parabolic-wedge-sell-climax-3.png\"><img loading=\"lazy\" src=\"2019-1-5-4.png\" alt=\"Emini daily candlestick chart has strong minor trend reversal after parabolic wedge sell climax\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart reversed up sharply from yesterday’s higher low. It is now just below the February low and the 20 day EMA.<p>The daily S&amp;P500 Emini futures candlestick chart sold off for 10 consecutive days in December. This had never happened in the 20 year history of the Emini, and possibly the 100 year history of the S&amp;P. It is therefore the most extreme sell climax, at least by this measure, in history.<p>Extreme climaxes usually lead to big reversals. Look at my reports in late 2017. I repeatedly warned that the daily, weekly, and monthly charts were all in the most extreme buy climaxes in history. Furthermore, I said that they would probably have a deeper correction than what any pundit on TV was saying at the time.<p>The current rally has been very strong. It has retraced about half of the December crash. It is now just below the 20 day EMA and the February low.<h4>The goal of price action</h4><p>Every market constantly searches for a trading range. That is a price that both the bulls and bears feel is fair. The market typically has to go too far up and down to discover how far far enough is. The December crash and the January reversal are examples.<p>I wrote on December 24 that the Emini was probably going to reverse up within a day. I said that because the crash was the most extreme sell climax in history and it poked just below the 8 year bull trend line. Every bear trend ends at a bull trend line. Traders know that, and therefore the selloff might have been simply a sell vacuum test of support. In addition, I said that the rally would be strong enough to make traders wonder if the bear trend had ended. That is what is taking place today.<h4>Difference between a major and minor trend reversal</h4><p>A major trend reversal means a bear trend becomes a bull trend. A minor is more common. It means that there is a rally up, but it becomes either a bear flag or a bull leg in what will become a trading range. Once in a trading range, the bulls will have a 40% chance of a major trend reversal.<h4>Minor reversal is more likely</h4><p>Well, has the bull trend resumed? Probably not. There are several reasons for this. First, the bear breakout went far below the 2018 trading range. Everyone who bought in 2018 is now holding a losing position. Many will sell out of their longs on the current rally, hoping for a smaller loss. This means that there is a lot of supply above.<p>Next, the bear channel in December was tight. There is only a 30% chance that a strong reversal up from a tight bear channel will immediately become a bull trend. Most traders want to see a test of the low. If there is a reversal up at that point, the bulls will have a 40% chance of a major trend reversal into a bull trend. There would still be a 60% chance of a trading range or a resumption of the bear trend.<p>Finally, traders are scared. Big bars and big reversals make traders quick to take profits. They are unwilling to buy too high or sell too low because they sense the probability of a trend is low.<p>Also, the big moves mean that the stops are far. That means the risk is big. The result is that traders buy low, sell high, and take quick profits. This creates a trading range. Consequently, a trading range is more likely over the next few weeks than a bull trend.<h4>Where do rallies from sell climaxes end?</h4><p>My 1st goal for a rally after a sell climax is the top of the most recent sell climax. That is top of the December 19 outside down bar.<p>The selloff was a parabolic bear channel. When a channel reverses, the rally often reaches the start of the channel. Here, that is the December 12 high, just below 2700. Furthermore, it is around the 20 week EMA.<p>Finally, it is around a measured move up from the low to last week’s high. This week closed above last week’s high. As a result, there is a gap between this week’s close and that high. That increases the chance of a measuring gap and a rally to the start of the parabolic wedge bear channel.<p>However, that would require a huge rally. In addition, it is above the resistance of the February and October lows. If the Emini is to get there, it will probably have to test the December low 1st.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2019-1-5"
    }
  ],
  "7": [
    {
      "data": [
        "<article class=\"post-84701 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini triggered weekly buy signal but still likely bear rallyIntraday market update: Monday January 7, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini triggered weekly buy signal but still likely bear rally</strong><br>Intraday market update: Monday January 7, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-01-07T06:20:15-08:00\">January 7, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini triggered weekly buy signal but still likely bear rally</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Last week broke above and closed above the high of the week before. That triggered a buy signal on the weekly chart. However, there is resistance around the February and October lows and the 20 day EMA. Furthermore, there is still a gap below that February low. The bulls need to break above the resistance this week.<p>A reversal up from a sell climax often reaches the start of the sell climax. That is the December 12 lower high, just below 2700.<p>Unless the bulls break strongly above all of this resistance, the rally will likely form a lower high. The odds favor a new low within a couple months.<h3>Overnight Emini Globex trading</h3><p>The Emini is unchanged and it traded in a tight range overnight. Because it is at resistance on the daily chart, it might go sideways for a few days before deciding whether to break above or reverse down. Furthermore, most of the trading over the past week has been in tight trading ranges. This increases the chance of mostly sideways trading again today.<p>However, the daily ranges have been big for the past month. Consequently, even a sideways day will probably have at least one big swing.<h2>Friday’s setups</h2><div class=\"wp-block-image\"><figure class=\"aligncenter\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-weekly-buy-signal-and-bull-trend-from-the-open.png\"><img src=\"2019-1-7.png\" alt=\"Emini weekly buy signal and bull trend from the open\"></a></figure></div><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD daily Forex chart in Breakout Mode and breakout likely in January</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/EURUSD-daily-Forex-chart-in-Breakout-Mode-and-breakout-likely-in-January.png\"><img loading=\"lazy\" src=\"2019-1-7-1.png\" alt=\"EURUSD daily Forex chart in Breakout Mode and breakout likely in January\"></a><figcaption><em>The EURUSD daily Forex chart has rallied for 3 days in its 2 month trading range.<br>It will probably break out in January</em>.</figcaption></figure><p>The EURUSD daily Forex chart has been rallying for 3 days. Furthermore, 2 months is about as long as trading ranges have lasted over the past year. Consequently, the chart will probably break out of its range this month. However, until there is a breakout, there is no breakout. Despite the 3 day rally, it is equally likely that the breakout will be down as up.<p>The bulls see the rally as a higher low after the December 14 double bottom higher low major trend reversal. However, the bears have a double top on January 19. The rally was a wedge, which typically has a 2nd leg down. Therefore, they expect the 3 day rally to fail today and tomorrow, and then resume last week’s big one day selloff.<p>None of this matters. Traders have been unwilling to hold positions for more than 2 – 3 days. This is because reversals are more common than breakouts in a trading range. But, traders should expect a breakout this month. Once it comes, traders will be willing to hold positions for several weeks instead of just days.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart rallied 50 pips overnight. This is the 3rd day up, and it is now near the top of the trading range.<p>Traders know that a breakout from the range is likely this month. They are therefore willing to hold onto positions a little longer on tests of the top or bottom of the range. But, they will still be quick to reverse if there is a reversal because all prior legs up and down failed.<p>While the 50 pip rally is good for the bulls, it is now within 50 pips of the top of the range. Bulls will begin to take profits and bears will begin to look to sell.<p>If the market begins to go sideways, traders will begin to look for a swing down. Yet, there is an increased chance of a strong breakout within the next few weeks. The initial target will be a 200 pip measured move based on the height of the 2 month range.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-small-pullback-bull-trend-with-close-above-February-2018-low.png\"><img loading=\"lazy\" src=\"2019-1-7-2.png\" alt=\"Emini small pullback bull trend with close above February 2018 low\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p>The Emini rallied in a Small Pullback Bull Trend to close just above the February bottom of the 2018 trading range. On December 24 at the sell climax low, I said that this was likely. The sell climax was likely to lead to a rally that would be strong enough to make traders wonder if the bear had ended.<p>But, as strong as the rally has been, it will still probably fail around 2,600. There is a 60% chance of a test of the December low before a test of the September high<p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\" rel=\"noopener\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr class=\"wp-block-separator\"><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-1-7"
    }
  ],
  "8": [
    {
      "data": [
        "<article class=\"post-84908 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini now in sell zone at resistance of the February lowIntraday market update: Tuesday January 8, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini now in sell zone at resistance of the February low</strong><br>Intraday market update: Tuesday January 8, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-01-08T06:20:23-08:00\">January 8, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini now in sell zone at resistance of the February low</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday rallied strongly on the open to close back above the February low. Back on December 24 at the bear low, I said this was likely to happen. But, I said that the February low was the bottom of a resistance zone, and the rally would probably fail around 2,600. That is still likely.<p>With the strong rally, traders are now wondering if the low is in. There is a 60% chance that we will test the December low before going above the September high. However, the bear rally does not have a top yet. In addition, the October low and the December 12 minor lower high are magnets above.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 16 points in the Globex session. It has rallied for the past 2 days and for 5 of the past 7 days. But, there is resistance above at the October low at around 2,600. The 2018 trading range is resistance and this rally is now in that sell zone. However, there is support below at the February low.<p>Despite the 2 week rally, most of the trading over the past week has been in tight trading ranges. Consequently, the odds are that today will also spend a lot of time going sideways.<p>The 2 week rally is probably a bull leg in what will become a 1 – 2 month trading range. The tops and bottoms of trading ranges are rarely clear as they are forming. In addition, breakouts and reversals often come at times when they appear unlikely. Traders need to be ready for anything. However, the daily ranges have been big and there has been at least one swing trade every day.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-small-pullback-bull-trend-with-close-above-February-2018-low-1.png\"><img src=\"2019-1-8.png\" alt=\"Emini small pullback bull trend with close above February 2018 low\"></a><figcaption>Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.</figcaption></figure><h2>EURUSD Forex reversal down from top of 2 month trading range, but might be pullback</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/EURUSD-Forex-reversal-down-from-top-of-2-month-trading-range-but-might-be-pullback.png\"><img loading=\"lazy\" src=\"2019-1-8-1.png\" alt=\"EURUSD Forex reversal down from top of 2 month trading range, but might be pullback\"></a><figcaption>The EURUSD daily Forex chart sold off overnight after a 3 day rally to the top of the trading range. The bears want a 2nd leg down from last week’s wedge top. However, the bulls want it to be just a pullback in what they hope will be a bull trend.</figcaption></figure><p>The EURUSD daily Forex chart has been in a trading range for 2 months. There have been many strong legs up and down. But, since the chart is in a trading range, traders bet that every strong move will reverse within a few days. The bulls take profits and the bears sell near the top. The bears take profits and the bulls buy near the bottom. This creates is a series of reversals.<p>Since every trading range over the past year broke out by around 2 months, this trading range will likely end this month. It is a mistake to assume that the bulls have an advantage. A chart could not remain in a range is one side was stronger. Until there is a breakout, there is no breakout. However, the build up of tension will likely create a breakout soon. In the meantime, traders make more money betting on reversals.<h3>Overnight EURUSD Forex trading</h3><p>After a 3 day rally to the top of the 2 month trading range, the EURUSD 5 minute Forex chart sold off 50 pips overnight. The selloff over the past 2 hours was in a tight bear channel. Consequently, traders will sell the 1st 20 pip bounce today. The bulls will probably need at least a small double bottom before they can get back to the overnight high.<p>After 3 strong days up, the bears will probably not be able to drive the market down much further today. Yesterday was a big bull day. The breakout point was Friday’s high of 1.1419. That is a reasonable target for the bears today. But it is only 14 pips below the overnight low.<p>With limits on the bulls and bears today, today will probably be in a 50 pip range. Day traders will scalp. Since a breakout of the 2 month range will probably start this month, day traders will be quick to swing trade once the breakout is clear.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-bull-trend-reversal-day.png\"><img loading=\"lazy\" src=\"2019-1-8-2.png\" alt=\"Emini bull trend reversal day\n\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p>The Emini gapped up, but sold off on the open to the February low. It reversed up there again, as it did yesterday. Today was a bull reversal day. But, like most reversal days, it was also mostly a trading range day. It failed to make a new high and it closed below the open.<p>The Emini is now in the sell zone on the daily chart. Today is a Low 2 sell signal bar for tomorrow. However, the 2 week bull channel is tight. Consequently, there might be more buyers than sellers below.<p>Since most of the trading over the past week has been sideways, that is likely again tomorrow. Today’s bull channel is a bear flag. Therefore, tomorrow will probably break below today’s bull channel. In addition, tomorrow might fall below today’s low and trigger a Low 2 sell signal.<p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\" rel=\"noopener\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr class=\"wp-block-separator\"><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-1-8"
    }
  ],
  "9": [
    {
      "data": [
        "<article class=\"post-84910 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini January rally in sell zone despite buying pressure Intraday market update: Wednesday January 9, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini January rally in sell zone despite buying pressure</strong><br>Intraday market update: Wednesday January 9, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-01-09T06:20:49-08:00\">January 9, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini January rally in sell zone despite buying pressure</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini again reversed up at the February low yesterday. The bulls want the 3 week rally to continue to a new all-time high. Even if that were to happen, there will probably be a test of the December low first.<p>On the monthly chart, November was a bull doji bar. That is a weak sell signal bar. Consequently, there are strong bulls who bought its low and they scaled in lower.<p>When a trader takes a reasonable trade and manages it well, he typically can avoid a loss and usually can make a profit. Those bulls need this rally to get back to the November low. That would allow them to get out at breakeven on their 1st buy and with a profit on their lower buy. Therefore, 2,632.50 is a logical target for this rally.<p>While the rally has been strong, it will probably fail within a month or so. Because the Emini is now in the sell zone on the daily chart, it will probably pull back today or tomorrow.<p>Yesterday is a sell signal for a Low 2 bear flag. However, the momentum up is good and it was only a bear doji. That is a weak sell signal bar. Therefore, the bulls will probably buy any 1 – 3 day selloff.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 12 points in the Globex market. Yesterday’s rally was in a bull channel on the 5 minute chart. Traders should think of a bull channel as a bear flag because there is a 75% chance of a bear breakout. This means a sideways to down move to below the bull trend line.<p>However, bull channels can last 2 – 3 days before there is a breakout. In addition, the momentum up on the daily chart is strong. Consequently, the rally might continue for another day or two before pulling back.<p>Since most of the trading over the past 6 days has had a lot of trading range price action, that is likely again today. But, every day has had at least one swing up or down.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-bull-trend-reversal-day-1.png\"><img src=\"2019-1-9.png\" alt=\"\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market has increased buying pressure in its trading range</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/EURUSD-daily-Forex-chart-testing-top-of-2-month-trading-range-1.png\"><img loading=\"lazy\" src=\"2019-1-9-1.png\" alt=\"EURUSD daily Forex chart testing top of 2 month trading range\"></a><figcaption>The EURUSD daily Forex chart rallied for 3 days to the top of the 2 month range. It pulled back yesterday. The bears hope this is just a test of the top of the range. Until there is a breakout, the chart is still in Breakout Mode.</figcaption></figure><p>The EURUSD daily Forex chart reversed down yesterday from the top of its 2 month range. The bears want this to be the start of a move to below the range. However, the bulls see it as a pullback from a 3 day rally. They therefore want a break above yesterday’s high and then the top of the range.<p>When a market is in a trading range that lasts more than 20 bars, the odds of a bull breakout are the same as for a bear breakout. Each leg up and down is strong. Beginners keep thinking every leg will be the one that breaks out. But, experienced traders know that reversals are more likely than breakouts. They therefore buy low, sell high, and take profits a few days later.<p>It is important to note that there is something different this time. Every trading range over the past year broke out by around the end of the 2nd month. Also, big moves often begin in January. Consequently, the breakout is likely within a few weeks.<p>Also, since the November low, the bulls have had 2 streaks of 4 consecutive bull bars and 3 streaks of 3 consecutive bull bars. But, the longest the bears were in control was for 3 bars, and they did this only once. There is now relatively more buying pressure than selling pressure.<p>Charts have 2 variables, price and time. Sometimes time is more important in the early stages of a trend. This subtle relative increase in buying pressure makes a bull breakout more likely.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart traded in a 40 pip range overnight. Day traders are therefore scalping. But, since a breakout or a reversal is likely within a few days, they will quickly switch to swing trading on the 1st strong move up or down.<p>If there is a strong breakout above 1.15, they will expect at least a 200 pip measured move up over the next couple of weeks. The rally would probably continue up to the resistance of the September 24 major lower high at around 1.18.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-trading-range-day-in-buy-climax.png\"><img loading=\"lazy\" src=\"2019-1-9-2.png\" alt=\"\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p>The Emini sold off on the open, but rallied from a parabolic wedge sell climax. It reversed down from a measured move target from the low to the open. This is common trading range price action. It again closed near the open, forming another doji day. This increases the chance of a 1 – 3 day pullback beginning tomorrow or within a few days. After a 5 bar bull micro channel up to the sell zone, tomorrow will probably trade below today’s low.<p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\" rel=\"noreferrer noopener\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr class=\"wp-block-separator\"><h4>Trading Room</h4><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-1-9"
    }
  ],
  "10": [
    {
      "data": [
        "<article class=\"post-84912 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini rally weakening in sell zone above February lowIntraday market update: Thursday January 10, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini rally weakening in sell zone above February low</strong><br>Intraday market update: Thursday January 10, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-01-10T06:20:45-08:00\">January 10, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini rally weakening in sell zone above February low</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini broke above another resistance level yesterday by going above the December 12 low. Since November was a bull doji on the monthly chart, it was a weak sell signal. Consequently, the limit order bulls who bought that low are buying more, trying to get back above that 2632.50 low.<p>Other bulls expect the Emini to get there as well and are buying. The bears know it is a magnet. Many therefore are waiting to sell until the Emini gets there. Consequently, the Emini might get vacuumed up there within a couple of weeks.<p>The bull trend is weakening. Fifteen minutes before the close yesterday, I said that the Emini would drop below the open at the end of the day. This is because a pullback is becoming increasingly likely. In addition, I said that today would probably trade below yesterday’s low, making today a pullback day.<p>While it will probably only last 1 – 3 days, The Emini could drop to last week’s low. In either case, the Emini will still probably work up to the November low within the next few weeks.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 13 points in the Globex session. It will therefore open around yesterday’s low. The result is that today will probably trade below yesterday’s low and therefore be a pullback day.<p>Since there have been many surprisingly big days over the past month, there is an increased chance of a big trend day up or down. This is especially true with the Emini in the sell zone around several breakout points at the bottom of the 2018 range.<p>While it is easy to imagine a big bear day in an overbought market at resistance, traders cannot ignore the opposite. The 3 week rally has been strong enough to have 3 legs up. Also, yesterday’s range was small. Therefore, if today triggers the Low 2 sell signal by falling below yesterday’s low, traders need to be aware that today could rally up above yesterday’s high. That would form an outside up day and be a continuation of the 3 week rally.<p>But, most of the days over the past week have had swings up and down. In addition, they have spent a lot of time within tight ranges. This trading range price action will probably continue today.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-trading-range-day-in-buy-climax-1.png\"><img src=\"2019-1-10.png\" alt=\"\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD daily Forex chart breaking above 2 month trading range</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/EURUSD-daily-Forex-chart-breaking-above-2-month-trading-range.png\"><img loading=\"lazy\" src=\"2019-1-10-1.png\" alt=\"\"></a></figure><p>The EURUSD daily Forex chart broke above the 2 month trading range yesterday. The odds of a swing up will be greater if the bulls can create a series of bull days. However, if the bears can form a strong bear day today, the breakout could fail. It would then be the 2nd leg up in a Low 2 bear flag where November 10 rally was the 1st leg up.<p>I have been saying over the past week that there would probably be a breakout of the 2 month range in January. Furthermore, I said that a bull breakout was more likely because of the building buying pressure.<p>Yesterday was a big bull day closing far above the top of the range. What happens over the next few days will tell traders what to expect over the coming weeks. If the bulls get a big bull day today, there will probably be a strong rally up to 1.18.<h2>What if the breakout fails?</h2><p>If today is a big bear day closing on its low, traders will suspect that the breakout will fail. Today would then be a sell signal bar for a failed breakout. They would also see the breakout as the top of a Low 2 bear flag where the 1st leg up was the rally to November 20.<p>The daily chart has been in a trading range for 2 months. That means complacency and confusion. Most likely, that is still present, although to a lesser degree after yesterday’s breakout. Consequently, today will probably not be clear. Instead, it will probably have something for the bulls and for the bears.<p>Typically, when there is confusion, traders expect either a small bull or bear body. However, unless the bears get either a strong reversal down or 3 consecutive bear bars, the odds are that the breakout will continue.<p>The first target is the most recent major lower high. That was on November 20. Since that was also the start of a wedge bear channel, that is another reason for it to be a magnet. After that, the next targets are a 200 pip measured move up and then the September 24 major lower high around 1.18.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 50 pip trading range overnight. Since today will probably have a small body on the daily chart, day traders will look to buy selloffs and sell rallies. Because the odds now favor a higher prices, traders will be more willing to hold onto longs for a test up to 1.17 or 1.18 over the next few weeks.<p>While today could still become a big bull or bear trend day, the overnight price action lacks energy. The bars are small, have prominent tails, and are in tight trading ranges. That makes a trading range day likely.<p>The key price is the 1.1543 open of the day. This is because the bulls want a bull body. Therefore, if today closes above that price, there will be an increased chance of a success breakout. Consequently, bulls will look to buy below it and bears will look to sell around it.<p>The bears want the day to close on its low. However, the overnight price action lacks conviction. The result will probably be a trading range day that closes slightly above or below the open.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-outside-up-day-and-failed-Low-2-sell-signal-3.png\"><img loading=\"lazy\" src=\"2019-1-10-2.png\" alt=\"Emini ES Outside up day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p>The Emini triggered the Low 2 sell signal on the daily chart by trading below yesterday’s low. It reversed up strongly. After trading sideways, the bulls got a breakout above yesterday’s high. Today was an outside up day, which is a sign of strength.<p>By going outside up, today is the 3rd push up in a tight bull channel. If there is a reversal down, it will be from a parabolic wedge. However, the rally has been strong. Therefore, the bulls will buy the 1st reversal down, even if it is surprising deep.<p>After a couple weeks of mostly trading range trading, tomorrow will probably be similar. Despite the sharp reversals, there has been at least one swing trade up or down every day.<p>Because tomorrow is Friday, weekly support and resistance can be important. This is especially true in the final hour. The most important magnets are the breakout points at the bottom of the 2018 trading range. The most important is the February low.<p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\" rel=\"noreferrer noopener\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr class=\"wp-block-separator\"><h4>Trading Room</h4><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-1-10"
    }
  ],
  "11": [
    {
      "data": [
        "<article class=\"post-84914 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini outside up day after failed Low 2 topIntraday market update: Friday January 11, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini outside up day after failed Low 2 top</strong><br>Intraday market update: Friday January 11, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-01-11T06:20:23-08:00\">January 11, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini outside up day after failed Low 2 top</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday triggered a Low 2 sell signal on the daily chart. But, the bulls then rallied to above yesterday’s high and created an outside up day. This is a sign of strength. However, it is also the 3rd push up in a tight bull channel. Therefore, it is a parabolic wedge buy climax. That usually leads to exhausted bulls and a pullback. While there are targets above, especially the November low, the rally will probably stall within a few days.<p>Outside days often lead to inside days. There is therefore an increased chance that today will reverse down from below yesterday’s high and reverse up from below yesterday’s low.<p>If today is an inside day, it will be both a buy and sell signal bar for Monday. In an overbought market, traders would then conclude that a reversal down for a few days is more likely than a continued rally.<p>In addition, since an outside day is a 2 day trading range, there is an increased chance of a 3rd mostly overlapping overlapping day. Consequently, even if today trades above or below yesterday’s range, it probably will not get far.<p>Because the Emini is now testing the breakout point on the weekly chart, it is in the sell zone. However, the bears will probably need at least a micro double top on the daily chart. Without that, the rally will probably continue up to the November low before the bears will sell.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 7 points in the Globex market. Since yesterday was a buy climax, traders will expect at least a couple hours of sideways to down trading beginning by the end of the 2nd hour. If they get it, today will probably mostly overlap yesterday, which is likely.<p>Even if today is a trading range day, the daily ranges are still big. Consequently, there will be at least one swing up or down.<p>After 3 small days, traders expect that today will probably not be a big trend day up or down.<p>It is Friday, so traders will pay attention to weekly support and resistance, especially in the final hour. The bulls want the week to close on its high. There is resistance above at the October 2607.00 low and support below at the February 2548.00 low.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-outside-up-day-and-failed-Low-2-sell-signal-4.png\"><img src=\"2019-1-11.png\" alt=\"\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex pullback from breakout above 2 month trading range</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/EURUSD-Forex-pullback-from-breakout-above-2-month-trading-range.png\"><img loading=\"lazy\" src=\"2019-1-11-1.png\" alt=\"\"></a></figure><p>The EURUSD daily Forex chart broke above the top of a 2 month trading range. Yesterday was a bear day and therefore a sell signal bar for a failed breakout. However, the breakout was big enough to make a successful breakout more likely. Consequently, there will probably be more buyers than sellers below yesterday’s low.<p>Because yesterday was a bear sell signal bar, the bulls are disappointed. Some will exit and wait for a deeper pullback before buying again. This disappointment is a sign that a successful breakout might lead to a weak rally rather than a strong bull trend.<p>The bulls need to begin to form a series of bull bars closing above their midpoints. If they get that, other bulls will be willing to buy at the market. This would increase the chance of a rally to the 1.17 or 1.18 resistance levels.<p>The bears got a good bear bar yesterday. However, they need a string reversal down within the next few days. Otherwise, the rally will probably continue up for at least 200 pips.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute chart reversed up 40 pips overnight from just above yesterday’s low. Therefore, the bulls so far have been able to prevent the sell signal from triggering.<p>The bulls need signs of strength to convince traders that the breakout is the start of a rally. At a minimum, they need days closing above their midpoints. A sign of a strong bull trend is a series of days closing on their highs.<p>If today closes near its high and remains an inside day, it will be a buy signal bar on the daily chart for Monday. That is a reasonable goal for the bulls Even though the overnight trading has been in a tight range, the bulls will buy selloffs, trying to get a close near the high.<p>Because the overnight range has been small, there is no conviction that the price is wrong. Day traders have been scalping. They might be waiting for next week before looking for a swing trade up or down.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-weak-broad-bull-channel-and-daily-ioi-buy-setup.png\"><img loading=\"lazy\" src=\"2019-1-11-2.png\" alt=\"\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini formed an inside day today after yesterday was an outside day. This is an ioi Breakout Mode setup for Monday. Because the 3 week rally has been unusually strong, it is a buy climax. Bulls will probably not buy aggressively above today’s high.<p>Since the 3 week channel is tight, bears will probably not be too eager to sell on a stop below today’s low. With both bulls and bears not acting aggressively, today will probably continue the 4 day tight trading range. But, since the Emini is overbought and at resistance, traders will be ready for a 1 – 3 day pullback at some point next week.<p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\" rel=\"noreferrer noopener\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr class=\"wp-block-separator\"><h4>Trading Room</h4><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-1-11"
    }
  ],
  "12": [
    {
      "data": [
        "<article class=\"post-84918 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini parabolic wedge buy climax has entered sell zoneWeekend market update: January 12, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini parabolic wedge buy climax has entered sell zone</strong><br>Weekend market update: January 12, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-01-12T00:30:55-08:00\">January 12, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2><strong>Market Overview</strong></h2><p>The<strong>Emini</strong>rallied strongly for 3 weeks. The daily chart now has a parabolic wedge, and the Emini is in the sell zone on the weekly chart. Traders should expect a pullback over the next week or two, and a trading range for at least another month.<p>The<strong>30 year Bond futures</strong>sold off after a wedge buy climax. Because a 2nd leg sideways to down is likely, any rally over the next 2 weeks will probably form a lower high.<p>The<strong>EURUSD daily Forex chart</strong>broke above a 2 month trading range. But it immediately reversed back into the range. If the bulls do not get follow-through buying early in the coming week, the breakout will probably fail. Traders will then assume that the trading range is continuing.<h2><strong>US 30 year Bond futures chart:</strong><br>End of 1st leg down from wedge top</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/US-30-year-bond-futures-1st-leg-down-from-wedge-top-1.png\"><img loading=\"lazy\" src=\"2019-1-12.png\" alt=\"\"></a><figcaption>After a parabolic wedge top, traders expect at least 2 legs sideways to down. They will buy this pullback to the 20 day EMA. However, the rally will probably form a lower high.</figcaption></figure><p>The US 30 year Treasury Bond futures chart pulled back to the 20 day EMA on Thursday. There has been a gap between the low of every bar and the moving average for more than 20 bars. This is the 1st pullback in over 20 days and it is therefore a 20 Gap Bar buy signal.<p>The bulls have been willing to buy above the average price for 2 months. They now finally have an opportunity to buy at the average price.<p>However, will they buy and hold for a move above the December high? Not likely. December ended with a parabolic wedge buy climax. The selloff retraced most of the final buy climax, which is typical.<p>But, this is now a Big Down move after a Big Up move. This creates Big Confusion, which is a hallmark of a trading range. Consequently, any rally over the next 2 weeks will probably form a lower high.<p>After a buy climax, a market usually has at least 2 legs sideways to down. At that point, the bulls will decide whether to buy again or wait to buy lower.<p>The bottom line is that the daily chart will probably bounce next week, form a lower high, and then test this week’s low a week or so after the bounce.<h2><strong>EURUSD Forex weekly chart:</strong><br>Breakout above 2 month range might fail</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/EURUSD-daily-Forex-chart-has-failed-breakout-of-trading-range-1.png\"><img loading=\"lazy\" src=\"2019-1-12-1.png\" alt=\"\"></a><figcaption>After breaking above the 2 month trading range this week, the EURUSD daily Forex chart reversed down enough to create confusion. Despite 2 bear days, a pullback in a bull trend is still slightly more likely than a failed breakout.</figcaption></figure><p>The EURUSD daily Forex chart broke above the 2 month trading range on Wednesday. However, it reversed down over the next 2 days. Will the breakout succeed and continue up to 1.17 or 1.18? Or, will it reverse back down and break below the range?<p>The bulls hope that the 2 day selloff is simply a pullback from the breakout. They see the 5 day rally from the November 12 low as the start of a bull trend. There has been a series of slightly higher highs and lows with deep pullbacks. They hope that this 2 day selloff is just another deep pullback in a broad bull channel.<p>However, they need a reversal back up on Monday or Tuesday. If they do not get it, the breakout will probably fail.<h3>2 month Low 2 bear flag</h3><p>Thursday was a reasonable sell setup on the daily chart. The bears see the 5 day rally from the November 12 low as the 1st leg up from a wedge bottom. Next, there was a 2 month sideways pullback. Finally, the daily chart had one more leg up, beginning with the January 3rd low. Rallies from wedge bottoms typically have at least 2 legs up. The bear trend then often resumes.<p>Friday was a good entry bar for the bears. If they get a third bear bar on Monday, the bull breakout will likely have failed. Traders will conclude that the trading range is continuing or that the 2018 bear trend is resuming.<p>They will watch the selling. If the chart quickly falls below the December low, they will conclude that the bears will get about a 200 pip measured move down to below 1.10.<h2><strong>Monthly S&amp;P500 Emini futures chart:</strong><br>Bull inside bar testing the November low</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-monthly-chart-has-bull-inside-bar-after-test-of-bull-trend-line-and-20-correction.png\"><img loading=\"lazy\" src=\"2019-1-12-2.png\" alt=\"\"></a><figcaption>Emini monthly chart reversing up from bull trend line. But, the 3 month selloff was particularly strong. Consequently, a trading range is more likely than an immediate resumption of the 10 year bull trend.</figcaption></figure><p>The monthly S&amp;P500 Emini futures chart has been reversing up in January. December dipped slightly below the 8 year bull trend line. In addition, it reached the 20% psychological level. That is where the news declares that the stock market has entered a bear trend. However, it has reversed up sharply from that support.<p>So far, the month is a bull inside bar. It rallied above the February 2018 low and is therefore back in the 2018 trading range. Furthermore, it broke above the October low. The next magnet above is the November low.<h3>Traders bet against trading range breakouts</h3><p>Last year, the stock market was in a trading range. Most breakout attempts fail. Consequently, the bulls buy at support and buy more lower. They are betting that the magnet that kept the market sideways for a year will be strong enough to pull any breakout at least slightly back into the range.<p>There are institutions who bought the February low and scaled in lower. They needed the rally to get back to the February low, and it did. That allowed them to get out breakeven on their first buy and with a profit on their lower buys. If bulls can make money buying strong bear breakouts, then maybe the bear breakout is not as strong as traders fear.<h3>November was a bad sell signal bar</h3><p>November’s low is also a magnet for scale-in bulls. November was an inside bar above the 20 month EMA. It had a bull body and a big tail below. Also, it was the 1st pullback to the EMA in over 20 bars. That made it a 20 Gap Bar Buy setup. It was therefore a weak sell signal bar. Consequently, it was reasonable for a bull to buy the November low with a limit order.<p>When a trader takes a reasonable trade, scales in, and uses a wide stop, he has an 80% chance of making money. That is the case here. Therefore, there is a strong magnet at the November low. Both the bulls and bears know that it is a magnet. The bulls keep buying until the rally reaches the target. They then take profits, which often results in a pullback.<h3>Why are support and resistance magnets?</h3><p>As the rally approaches the magnet (resistance), there is little incentive for the bears to sell. They believe the rally will get very close to the target. Why sell if you know you soon can sell higher? This psychology often results in the market getting vacuumed up to resistance.<p>The opposite happens with support below. For example, the stock market crashed down to the 8 year bull trend line only to reverse up sharply over the past 3 weeks. That trend line was support and therefore a magnet. Once there, the sell vacuum ended and the Emini rallied sharply.<h3>What happens when the stock market reaches a magnet?</h3><p>The more important a support or resistance level is, the more potential there is for a big move up or down. In this case, the rally is testing resistance. All of the bulls who bought in 2018 are holding losing positions. If enough use this rally to exit with a smaller loss, they could turn the market down.<p>Many bears took profits at the support of the 8 year bull trend line. They want to sell again. Major resistance is a good location.<p>What traders will find out over the next several weeks is whether there are enough bulls and bears wanting to sell around 2650 – 2700 to overwhelm the buyers. If there are, the Emini will test the December low.<p>But, if the rally just keeps moving up in a tight bull channel, there will encourage more buyers and sellers. The result could be a new all-time high within a few months, although this is unlikely.<p>Which is more certain? As strong as the rally was, it is still significantly weaker than the October and December selloffs. Unless the bulls can create strong bull trend bars in January and February, the odds are that the sellers will overwhelm the buyers. Consequently, the Emini is currently more likely to test the December low than the all-time high.<h2><strong>Weekly S&amp;P500 Emini futures chart:</strong><br>Strong 3 week rally from bull trend line</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-weekly-chart-has-strong-reversal-up-to-bottom-of-2018-trading-range.png\"><img loading=\"lazy\" src=\"2019-1-12-3.png\" alt=\"\"></a><figcaption>The Emini weekly chart has been reversing up strongly for 3 weeks. The momentum up is strong enough for traders to expect a test of the 20 week EMA.</figcaption></figure><p>The weekly S&amp;P500 Emini futures chart has reversed up for the past 3 weeks. Each week was a bull trend bar closing near its high. This is a sign of aggressive, sustained buying. The bulls will continue to buy until the bears can begin to create bear bars. As a result, the rally will likely go at least a little higher.<p>Most bears will wait for the buying to stall before looking to sell. They typically will want at least a micro double top before they will bet on a swing down. At a minimum, that would require at least 2 more weeks. For example, if the Emini goes sideways for the next 3 weeks, it could form a micro double top.<p>The rally is testing the breakout points of the February, April, and November lows. The next resistance is the 20 week EMA, which is above 2650.<p>Can the rally make it all of the way to the December sell climax high? The most recent sell climax high is always a magnet after a climactic reversal. However, at the moment, that is probably too far above for a 1st reversal up.<h2><strong>Daily S&amp;P500 Emini futures chart:</strong><br>Emini parabolic wedge buy climax has entered sell zone</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-daily-chart-has-parabolic-wedge-buy-climax-testing-2018-lows.png\"><img loading=\"lazy\" src=\"2019-1-12-4.png\" alt=\"\"></a><figcaption>While the 3 week rally is strong, it has 3 pushes up in a tight bull channel. That is a parabolic wedge buy climax. The exhausted bulls will probably take profits this week. The result will probably be at least a week of sideways to down trading.</figcaption></figure><p>The daily S&amp;P500 Emini futures chart sold off with 10 consecutive bear days in late December. That has never happened in the 100 year history of the stock market. It was therefore unsustainable and climactic. An extreme sell climax typically leads to a strong rally. That rally can go further up and last longer than what might seem reasonable.<p>I wrote on December 24 that there would probably be a rally that was strong enough to make traders wonder if the bull trend had resumed. That has been the case. Big Down, Big Up, creates Big Confusion. Confusion is a hallmark of a trading range. Traders should therefore expect a lot of trading range trading over the next couple of months.<h3>Support becomes resistance</h3><p>No rally lasts forever. This rally is now testing the bottoms of the bull legs in the 2018 trading range. Each is a breakout point for the December stock market crash. Since they formed the bottom of the yearlong trading range, they were support. Now that the Emini broke far below them, they are resistance.<p>When a market breaks far below support, the 1st rally typically fails to hold above those levels. That support now has become resistance. This resistance zone goes up to about 2700. Unless the bulls break strongly above 2700, the best they can expect from this rally is a trading range over the next couple of months.<h3>Parabolic wedge buy climax</h3><p>The 3 week rally has been in a tight bull channel. Thursday was both a pullback from the 2nd leg up and the start of a 3rd leg up. A strong bull trend in a tight bull channel with 3 legs up is a parabolic wedge buy climax.<p>Most buy climaxes result in exhausted bulls. They take profits and wait for about 10 bars before deciding whether to buy again. This process will probably begin within a couple of weeks. Traders are deciding if the top will be near the November low or the December 12 sell climax high. Therefore the sell zone is between 2600 and 2700.<h3>Targets for the bears</h3><p>If the bears get a reversal down, the 1st target is the most recent higher low. That is the January 3 low. If the Emini gets there, the bulls will try to create a reversal up. That would be a double bottom higher low major trend reversal buy setup.<p>Below that, it is the December low. The bulls will buy at there and try to create a double bottom. The bears want a breakout below that level and then a selloff to the 2100 level at the top of the 2014 – 2015 trading range. A reversal up there would be a breakout test.<p>If that does not hold, the Emini would then probably fall to 1800. That is the bottom of the 2014 – 2015 trading range, which is a good candidate for a Final Bull Flag.<p>I have been writing for over a year that the Emini will probably get there, even if it 1st goes far above. This is still the case. I have been saying that the selloff would probably be within 3 years. In addition, there might be one more new high first.<hr class=\"wp-block-separator\"><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-1-12"
    }
  ],
  "14": [
    {
      "data": [
        "<article class=\"post-84916 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini ioi Breakout Mode setup testing 2018 range bottom Intraday market update: Monday January 14, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini ioi Breakout Mode setup testing 2018 range bottom</strong><br>Intraday market update: Monday January 14, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-01-14T06:20:29-08:00\">January 14, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini ioi Breakout Mode setup testing 2018 range bottom</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini formed an inside day on Friday. Thursday was an outside day. This is an ioi inside-outside-inside pattern on the daily chart, which is a Breakout Mode setup. It is both a buy and a sell signal bar for today.<p>But, the rally has lasted 3 weeks and it is in a tight channel. Therefore, the bulls will probably be getting exhausted. Furthermore, the Emini is testing the bottom of the 2018 trading range. This is the sell zone. Consequently, there probably will not be aggressive buying today above Friday’s high.<p>In addition, because the bull channel is tight, Friday is not a strong sell signal bar. That makes a continuation of the 4 day tight trading range likely today.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 20 points in the Globex session. If it opens here, it will gap down on the daily chart. Trading below Friday’s low would trigger a sell signal.<p>But, the 3 week bull channel has been tight. In addition, Friday was a bull day. Both reduce the chance of a big bear day today. Furthermore, the Emini has been in a tight trading range today. This makes another sideways day more likely than a trend day up or down.<p>The 5 minute chart will gap far below Friday’s close. When there is a big gap up or down on the open, the odds of a trend day increase. A gap down makes a bear trend more likely than a bull trend. But, because of the 4 day tight trading range, a trading range day is still more likely.<p>When there is a big gap down, the Emini will be far below the EMA. After a 4 day tight trading range, the bears will not want to sell this far below the average price. Also, the bulls will probably not buy aggressively in a 4 day tight trading range.<p>There is an 80% chance of at least one reversal in the 1st hour. In addition, the Emini will probably be mostly sideways for the 1st 90 minutes. The bulls will try to create a double bottom or wedge bottom for an early low.<p>However, the bears will try to get a double top or wedge top bear the EMA for an early high. If there is a trading range open, it will reduce the chance of a big trend day up or down.<h2>Friday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-weak-broad-bull-channel-and-daily-ioi-buy-setup-1.png\"><img src=\"2019-1-14.png\" alt=\"Emini weak broad bull channel and daily ioi buy setup\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex bull flag in bull channel</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/EURUSD-Forex-bull-flag-in-bull-channel.png\"><img loading=\"lazy\" src=\"2019-1-14-1.png\" alt=\"\"></a><figcaption>The EURUSD daily Forex chart is pulling back from a new high in a bull channel. Less likely, the breakout above the 2 month trading range is reversing down.</figcaption></figure><p>The EURUSD daily Forex chart has pulled back for 3 days after breaking above a 2 month trading range. Because it has been making higher lows and highs for 2 months, it is also in a bull channel. The bulls want a bull bar today or tomorrow. They would especially like a big bull bar closing on its high. That would be a strong buy signal bar. It would encourage the bulls and make them more confident that the breakout above the 2 month range will continue higher.<p>Three consecutive bear bars increase the odds of a swing down. Consequently, today’s close is important. If the bears can create a 3rd consecutive bear day, traders will conclude that the breakout will probably fail. This is particularly true if today becomes a big bear day closing on its low.<p>Which is more likely? Well, trading ranges constantly disappoint bulls and bears. In addition, the 2 month bull channel is so flat that it is essentially a trading range that is sloped slightly up. As a result, today will probably not be helpful for either the bulls or the bears. That means it will probably close in its middle with a small bull or bear body.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 30 pip range overnight. There is no consensus that the price is wrong, or that one side is winning on the daily chart. Day traders have been scalping for 10 pips. Many have been using limit orders.<p>Because the appearance of the daily chart is important, there is an increased chance of a trend up or down. However, more likely, today will remain quiet and close near the open. This would continue the confusion of the past 2 months. Traders would then to have to wait longer for more information before they will hold for a test of the September high or the November low.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p>I will post the chart after the close.<figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-trading-range-day-so-buy-low-and-sell-high-and-scalp.jpg\"><img loading=\"lazy\" src=\"2019-1-14-2.jpg\" alt=\"Emini trading range day so buy low and sell high and scalp\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>After a big gap down, the Emini rallied to the December 10 low. It then traded sideways for the rest of the day. Because today closed above its open, it formed a bull day on the daily chart.<p>Today formed a pullback on the daily chart. It is a buy signal bar for tomorrow. Since the rally is strong and the November low is a magnet above, the Emini will probably go a little higher.<p>But, since the daily chart is in a parabolic wedge buy climax, the rally will probably stall this week. Buy climaxes exhaust the bulls and typically lead to several days of sideways to down trading.<p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\" rel=\"noreferrer noopener\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr class=\"wp-block-separator\"><h4>Trading Room</h4><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-1-14"
    }
  ],
  "22": [
    {
      "data": [
        "<article class=\"post-85704 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini parabolic buy climax testing top of December sell climaxIntraday market update: Tuesday January 22, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini parabolic buy climax testing top of December sell climax</strong><br>Intraday market update: Tuesday January 22, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-01-22T06:20:32-08:00\">January 22, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini parabolic buy climax testing top of December sell climax</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini has rallied strongly in a tight bull channel for 4 weeks. There are 3 legs up in the channel. This is therefore a parabolic wedge buy climax. The Emini is just below the December 12 high of 2690.50. That was the high of the parabolic wedge sell climax and a logical magnet.<p>A 1 – 2 week pullback typically follows a parabolic wedge rally to resistance. Because Thursday and Friday were strong, the Emini has 60% chance of first having a 1 – 3 day rally to above the December 12 high this week.<p>Risk managers will then tell their traders to reduce their longs. Their stops are now far below. Consequently, there is a significant risk of giving back an unacceptable amount of profit. The result of the profit taking will likely be a couple weeks of sideways to down trading. This should start by the end of this week.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 16 points in the Globex session. Traders are deciding between a 1 – 3 day rally to a new buy climax high and the start of a 1 – 2 week pullback to support.<p>Because of the lack of clarity, day traders will mostly scalp. If there is a strong rally, swing traders will look for a major trend reversal. They expect a reversal down to be strong enough to begin a 1 – 2 week sideways to down move.<p>Alternatively, if there is a strong bear breakout, day traders will conclude that the pullback is underway.<p>A buy climax means that the bulls are exhausted. They begin to take profits on rallies. However, they doubt the resolve of the bears. They therefore continue to buy selloffs to below prior lows.<p>This most often leads to an Endless Pullback. That is essentially a tight trading range that is tilted down. Traders should expect that for the next couple of weeks.<h2>Daily Chart has buy climax</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-parabolic-wedge-buy-climax-after-December-sell-climax.jpg\"><img src=\"2019-1-22.jpg\" alt=\"Emini parabolic wedge buy climax after December sell climax\"></a><figcaption>Four week rally is testing top of December sell climax. But, the rally has 3 pushes up in a tight bull channel. It is therefore a parabolic wedge buy climax.</figcaption></figure><h2>EURUSD daily Forex chart has small wedge sell climax in trading range</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/EURUSD-daily-Forex-chart-has-small-wedge-sell-climax-in-trading-range.png\"><img loading=\"lazy\" src=\"2019-1-22-1.png\" alt=\"\"></a></figure><p>The EURUSD daily Forex chart has sold off for 3 weeks. It is now testing the bottom of its 3 month trading range. The selloff initially was a bull flag. That failed with the big bear bar 2 weeks ago. Now, the bulls have a 5 day wedge. In addition, it is still above the December 14 double bottom.<p>Trading ranges resist breaking out. My 80% rule says that 80% of attempts reverse. Consequently, this selloff will probably bounce this week.<p>However, it might first reach the measured move target just below the 1.13 Big Round Number. That is just below the January 3 start of the last rally. Because that is support, weak traders will have stops there, which makes it a magnet.<h3>Overnight EURUSD Forex trading</h3><p>The 3 week selloff has been losing momentum over the 5 days. The ranges on the daily chart are getting smaller. In addition, the candlesticks have prominent tails above and below. Furthermore, the bars are beginning to largely overlap one another. Finally, the 3 small pushes down create a wedge.<p>The bulls have been buying new lows and reversals up from prior low. Also, the bears continue to sell rallies, but now are taking profits below prior lows. This price action is typically a transition into a trading range. Day traders will probably continue to scalp today.<p>The odds favor a 50 – 100 pip bounce beginning over the next few days. This would be a bull leg in the developing small trading range.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-bear-channel.jpg\"><img loading=\"lazy\" src=\"2019-1-22-2.jpg\" alt=\"The Emini sold off in a bear channel on the 5 minute chart after a parabolic wedge on the daily chart.\n\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini sold off in a bear channel today. Because the daily chart has a parabolic wedge buy climax, the bulls are taking profits. This typically results in a 5 – 10 pullback. That means a week or two of sideways to down trading.<p>Even if there is a strong rally over the next few days, the 4 week buy climax will make risk managers force traders to lighten up. Therefore, traders will sell above last week’s high, expecting the rally to pause for a couple weeks.<p><em>See the</em><a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\"><em>weekly update</em></a><em>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h4>Trading Room</h4><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-1-22"
    }
  ],
  "23": [
    {
      "data": [
        "<article class=\"post-85914 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini endless pullback from parabolic wedge buy climax Intraday market update: Wednesday January 23, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini endless pullback from parabolic wedge buy climax</strong><br>Intraday market update: Wednesday January 23, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-01-23T06:20:15-08:00\">January 23, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini endless pullback from parabolic wedge buy climax</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>As I said before yesterday’s open, there is a parabolic wedge buy climax on the daily chart. It most often leads to an Endless Pullback. This is a small bull flag that keeps adding bars, but the bull trend does not resume. That is what is likely here over the next 2 weeks. It is typically just a tight trading range that tilts down.<p>If the bulls do get one more new high this week, traders will probably sell it. Despite the strong rally over the past 4 weeks, the bulls are now exhausted. Risk managers will insist on traders reducing their longs. The result is usually a 2 week pullback.<p>Can the bears get a strong reversal down? Yes, but when a bull trend has been as strong as the current one, the 1st leg down is typically either brief or shallow. Traders should expect sideways to down price action for a couple weeks.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 10 points in the Globex session. This is a continuation of yesterday’s bull breakout above the bear channel. However, because of the buy climax, the odds are that the Emini will be mostly sideways to down for a couple weeks.<p>When that is the case, there is typically a lot of trading range price action intraday. There are usually more limit order entries and fewer stop order entries. However, the legs up and down are big enough for swing trades, and there still will be many good stop order trades every day.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-bear-channel-1.jpg\"><img src=\"2019-1-23.jpg\" alt=\"Emini bear channel after parabolic wedge top\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex chart waiting for Brexit catalyst before breaking out</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/EURUSD-Forex-chart-waiting-for-Brexit-catalyst-before-breaking-out.png\"><img loading=\"lazy\" src=\"2019-1-23-1.png\" alt=\"\"></a></figure><p>The EURUSD daily Forex chart sold off for 3 weeks after breaking above the 3 month trading range. There are higher lows and highs since November, which is a 3 month bull channel. However, it is within a yearlong bear channel. Finally, it is in the middle of a 3 month trading range. The chart is in Breakout Mode.<p>Over the past 7 days, the bars have become small. In addition, there is a lot of overlap. Finally, there is a 6 day micro wedge bottom. These are signs that the selloff is losing momentum and awaiting information. Brexit is a potential major catalyst for a successful breakout up or down from the 3 month trading range.<h3>Overnight EURUSD Forex trading</h3><p>Because the past 6 days have been trading range days, today will likely be mostly sideways again. The EURUSD 5 minute chart has been in a 25 pip range overnight. Day traders will continue to scalp, waiting for a strong breakout up or down. Since there is no bottom yet, the odds are that the selloff will reach the January 3 low around 1.13 within 2 weeks.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-bear-trend-from-the-open-and-then-bull-trend-reversal.jpg\"><img loading=\"lazy\" src=\"2019-1-23-2.jpg\" alt=\"Emini bear trend from the open and then bull trend reversal\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini sold off strongly from just below yesterday’s high. It reversed up from below yesterday’s low closed in the middle of the range. This is consistent with a sideways to down move after the parabolic wedge rally on the daily chart. There will probably be many mostly sideways days over the next 2 weeks after the exhaustive buy climax.<p><em>See the</em><a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\"><em>weekly update</em></a><em>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h4>Trading Room</h4><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-1-23"
    }
  ],
  "24": [
    {
      "data": [
        "<article class=\"post-85918 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini Endless Pullback after January parabolic wedge rallyIntraday market update: Thursday January 24, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini Endless Pullback after January parabolic wedge rally</strong><br>Intraday market update: Thursday January 24, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-01-24T06:20:37-08:00\">January 24, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini Endless Pullback after January parabolic wedge rally</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini sold off on the open yesterday. It then reversed up from below the prior day’s low. However, it closed with a bear body on the daily chart. In addition, it mostly overlapped Tuesday’s range.<p>Because it was the 2nd day in a pullback in a bull trend, it is a High 1 bull flag buy signal bar for today. But, after the 4 week parabolic wedge buy climax, the bulls are getting exhausted. The Emini will probably be mostly sideways to down for a couple of weeks. This is true even if there is one more push up to the December 12 lower high first.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 1 point in the Globex session. It has been in a narrow range overnight, continuing the 3 day tight trading range.<p>Yesterday’s 4 hour bull channel is a bear flag. The odds are that today will break below the channel. But, today will open in the middle of a 2 day tight trading range, and therefore probably be another mostly sideways day.<p>After 2 sideways days and the 4 week buy climax, the Emini will probably have a lot of trading range price action over the next couple of weeks. Traders will look for reversals every few days. Since the daily ranges have been big, there will probably be at least one swing trade every day.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-bear-trend-from-the-open-and-then-bull-trend-reversal-1.jpg\"><img src=\"2019-1-24.jpg\" alt=\"Emini bear trend from the open and then bull trend reversal\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex testing bottom of 4 month trading range</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/EURUSD-Forex-testing-bottom-of-4-month-trading-range.png\"><img loading=\"lazy\" src=\"2019-1-24-1.png\" alt=\"\"></a></figure><p>The EURUSD daily Forex chart has sold off for 3 weeks after a failed breakout above the 4 month trading range. It is now testing the bottom of the range and the 1.13 Big Round Number.<p>Most trading range breakouts fail. Therefore, a reversal up within a week is more likely than a successful breakout below 1.12. The bulls need a reversal up, which they do not yet have.<p>Every trading range over the past year broke out after about a couple months. Consequently, the odds are that this one will break out within the next month. But, until there is a breakout, there is no breakout. Reversals are more likely than breakouts.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart sold off overnight from a test of yesterday’s high. It broke below yesterday’s low and it is now testing the bottom of the January 3 swing up.<p>A more important support level is the December double bottom at 1.1270. That is therefore a magnet, and it is only 40 pips below today’s current low. Because it is important support, the selloff will probably end at least slightly above that level. As a result, the odds are against much more selling today.<p>However, the selloff has been strong enough so that the bulls will probably need a 2 hour trading range before they can get a reversal up. Consequently, any rally over the next couple of hours will probably be less than 30 pips.<p>Everyone is aware that the trading range will probably break out within the next few weeks. Therefore, traders need to be prepared for a series of trend days up or down beginning at any time.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-trading-range-day.jpg\"><img loading=\"lazy\" src=\"2019-1-24-2.jpg\" alt=\"Emini trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>Today was a trading range day that closed near its open. It is the 3rd day in a tight trading range. It was a doji inside bar and therefore a weak buy and sell signal bar. Traders are deciding if a 2 week pullback has begun or whether there will be one more brief new high 1st.<p>Tomorrow is Friday so weekly support and resistance can be important. The only nearby targets are the high and low of the week.<p><em>See the</em><a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\"><em>weekly update</em></a><em>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h4>Trading Room</h4><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-1-24"
    }
  ],
  "25": [
    {
      "data": [
        "<article class=\"post-85922 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"4 day pullback from Emini parabolic wedge buy climaxIntraday market update: Friday January 25, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>4 day pullback from Emini parabolic wedge buy climax</strong><br>Intraday market update: Friday January 25, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-01-25T06:20:57-08:00\">January 25, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>4th day in pullback from Emini parabolic wedge buy climax</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday was a trading range day and an inside day. It is the 3rd bar in a tight trading range after a parabolic wedge buy climax. Traders are deciding whether a 2 week pullback has begun or if there will be one more new high before the pullback begins. In either case, the daily chart will probably be sideways to down for a couple of weeks, even if there is one more new high first.<p>Because yesterday was the 4th day in a pullback, it is a buy signal bar for today. But, it was not a big bull bar closing near its high. It is therefore a weak buy setup. There might be more sellers than buyers above its high.<p>Today is Friday and therefore weekly support and resistance can be important. This is especially true in the final hour. The bulls want the week to close near its high and the bears want a close near the low. There is no other nearby significant support or resistance.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 21 points in the Globex session. Today will probably gap above yesterday’s high. That would trigger the buy signal on the daily chart. Despite the parabolic wedge buy climax, the daily chart is still in a strong bull trend. In addition, the December 12 top of the crash is a magnet above. Consequently, there is an increased chance of a bull trend day today.<p>If there is a big gap up, there is only a 20% chance of a strong trend from the beginning that will last all day. There is an 80% chance that any early trend will have a reversal. The bulls will look for a double bottom or wedge bottom near the EMA for a swing up. However, the bears want a double top or wedge top, and hope it will be the high of the day.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-trading-range-day-1.jpg\"><img src=\"2019-1-25.jpg\" alt=\"Emini trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex sell climax at bottom of 4 month trading range</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/EURUSD-Forex-sell-climax-at-bottom-of-4-month-trading-range.png\"><img loading=\"lazy\" src=\"2019-1-25-1.png\" alt=\"EURUSD Forex sell climax at bottom of 4 month trading range\"></a></figure><p>The EURUSD daily Forex chart had a big bear breakout below a higher low yesterday. However, today so far is reversing that selloff. There have been many strong breakout attempts over the past 4 months. This is typical in a trading range. However, 80% of breakout attempts fail. It is therefore better to bet on reversals. Traders buy low, sell high, and take profits near the other extreme.<p>If today closes near its high, it would be a buy signal bar. The odds would then favor 1 – 2 weeks of sideways to up trading.<p>The bears need a strong break below the December and November lows before traders will believe the 2018 bear trend is resuming. Until then, traders will bet on reversals.<h3>Overnight EURUSD Forex trading</h3><p>After yesterday’s big bear day, the EURUSD 5 minute Forex chart reversed up in a tight bull channel overnight. Because the channel is tight, the bears will probably have to stop the buying and begin a trading range before they can get a swing down. Consequently, the chart will probably be sideways to up for the rest of the day.<p>The close is important because today is a buy signal bar on the daily chart. If the bulls can close today near its high, traders will be more willing to buy over the next couple of weeks. The bulls will therefore buy 20 – 30 pip selloffs today.<p>The bears want the bar on the daily chart to have a big tail on top. That would be a weaker buy signal bar for tomorrow. It would therefore give the bears hope that the 3 week selloff will break below the 200 pip range.<p>However, since trading ranges resist breaking out, today will probably close near its high. Most bears want to sell in the upper half of the 200 pip range. Those selling today will probably only scalp.<p>In addition, because of the shortage of bears here, today will probably close near its high. It will therefore be easier to make money buying pullbacks than selling rallies.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-trading-range-day-2.jpg\"><img loading=\"lazy\" src=\"2019-1-25-2.jpg\" alt=\"Emini trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini gapped up, rallied briefly, and then entered a tight trading range. It closed the week just above the open. This week is therefore an inside bull doji bar on the weekly chart. After a 4 week rally, that is a High 1 bull flag.<p>But, it is a doji at the 20 week EMA, and therefore a weak setup. In addition, the resistance of the December 12 crash high is just above. Therefore, there are probably sellers not far above this week’s high.<p><em>See the</em><a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\"><em>weekly update</em></a><em>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-1-25"
    }
  ],
  "26": [
    {
      "data": [
        "<article class=\"post-85708 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini testing January parabolic wedge buy climax highWeekend market update: January 26, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini testing January parabolic wedge buy climax high</strong><br>Weekend market update: January 26, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-01-26T00:30:50-08:00\">January 26, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2><strong>Market Overview</strong>:</h2><p>The<strong>Emini daily chart</strong>has rallied for 5 weeks in a parabolic wedge buy climax. It is now in a resistance zone. Traders are deciding whether there will be one more small leg up before beginning a test of last February’s low and 2,500.<p>The<strong>30 year bond futures daily chart</strong>is completing its 1st leg down from a wedge top buy climax. Traders will sell any rally in the next couple of weeks, expecting a 2nd leg down.<p>The<strong>EURUSD weekly Forex chart</strong>has been in a tight trading range for 13 weeks. It will probably break out in February and have a 200 – 300 pip measured move up or down.<h2>30 Year Bond futures daily chart:<br><strong>1st leg down from wedge top buy climax</strong></h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/30-Year-Bond-Futures-pulling-back-from-wedge-buy-climax.png\"><img loading=\"lazy\" src=\"2019-1-26.png\" alt=\"\"></a><figcaption>The 30 year bond futures daily chart turned down from a wedge top.<br>Traders will sell the 1st rally, expecting a 2nd leg down.</figcaption></figure><p>The December rally on the 30 year bond futures chart was strong. However, it was in a wedge bull channel. In addition, it ended with a climactic reversal down from above the top of the channel. When that happens, the bulls typically wait for at least a couple legs down before buying again.<p>A common target is the 1st pullback at the bottom of the wedge. Traders therefore expect that the 1st rally will fail and form a lower high. They then will look for a test of the December 13 low.<h2><strong>EURUSD weekly Forex chart:</strong><br>Tight trading range at apex of wedge bottom</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/EURUSD-weekly-Forex-chart-in-tight-trading-range-at-apex-of-wedge-bottom.png\"><img loading=\"lazy\" src=\"2019-1-26-1.png\" alt=\"\"></a><figcaption>The EURUSD weekly Forex chart is breaking above bull trend line of wedge bottom.<br>However, it is doing it by going sideways in a tight trading range.<br>It is therefore still in Breakout Mode.</figcaption></figure><p>The EURUSD daily Forex chart has been in a tight trading range for 13 weeks. It is therefore in Breakout Mode. Traders expect either a 200 – 300 pip measured move up or down.<p>This week is a buy signal bar. However, until there is a breakout, there is no breakout. Because of the wedge bottom, the odds are slightly better for the bulls. But, the probability is still close to 50% for the bulls and for the bears.<p>All of the trading ranges over the past year broke out within a couple of months. Consequently, the odds are that this one will breakout within the coming month.<p>Traders are probably waiting for more information about Brexit before buying or selling aggressively. Until then, they are taking small trades up and down and exiting every few days.<h2><strong>Monthly S&amp;P500 Emini futures chart:</strong><br>Big bull inside bar, back to middle of 2018 trading range</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-monthly-chart-has-big-bull-inside-bar-in-developing-trading-range-1.png\"><img loading=\"lazy\" src=\"2019-1-26-2.png\" alt=\"\"></a><figcaption>Emini monthly chart has big bull inside bar. It is back to the 20 month EMA after<br>a strong reversal up from an 8 year bull trend line.</figcaption></figure><p>The monthly S&amp;P500 Emini futures chart&nbsp;has a big bull inside bar so far in January. The current close is near the 20 month EMA. Since the chart was above the 20 month EMA for more than 20 months, that is support. That is one of the reasons why January reversed up so strongly.<p>Support is a magnet. December fell far below that support, tested the lower support of the 8 year bull trend line, and reversed up strongly back to the EMA support.<p>As strong as the reversal up has been on the daily and weekly charts, it is only a single bar on the monthly chart. In addition, it still is much smaller than the big bear bar in December. Furthermore, it has retraced only about half of the 3 month selloff.<p>While January has been good for the bulls, they have not erased the damage created by the bears. Therefore, the chart is still good for the bears. A Big Down move followed by a Big Up move creates Big Confusion.<h3>Confusion means equilibrium</h3><p>When traders are confused, they are confident of only one thing… that the market will probably not go too far up or down. The price is just about right. They therefore buy selloffs and scale in lower. In addition, they sell rallies and scale in higher. Because they expect reversals, they take quick profits and do not hold on, hoping for a trend. The result is a trading range.<p>The monthly chart has been in a trading range for a year. It is now back to the middle of the range. While January is buy signal bar for February, the selloff is so strong that a rally from here would probably be minor. Most likely, the trading range will continue for several more months, and possibly all year.<p>This is true even if there is a new high or a break below the December low. Trading ranges resist breaking out. A reversal back into the range is more likely than a new trend.<p>A strong bull bar in January is no better for the bulls than the big bear bar in December was for the bears. There is no breakout until there is a clear breakout. There is nothing on the monthly chart to indicate that a breakout will come soon.<h2><strong>Weekly S&amp;P500 Emini futures chart:</strong><br>Pullback in 4 week rally</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-weekly-chart-has-weak-buy-signal-in-strong-rally.png\"><img loading=\"lazy\" src=\"2019-1-26-3.png\" alt=\"\"></a><figcaption>This week is a doji inside bar after a 4 week rally. That is a weak buy signal bar for next week.</figcaption></figure><p>The weekly S&amp;P500 Emini futures chart reversed up strongly from the December crash down to the 8 year bull trend line. This week was a bull doji inside bar. Just as the Emini got vacuumed down to the 8 year bull trend line, it got vacuumed back up to the 20 week EMA. Despite 4 strong bull trend bars, the rally stopped exactly at the 20 week EMA.<h3>Weak sell signal</h3><p>This week was a small bull doji inside bar. Because the weekly chart has had a strong selloff and a lower high and low, it is in an early bear trend. The bears are hoping that the rally over the past 5 weeks is simply a bear rally up to the EMA.<p>And it might be. But, when a rally is very strong, the 1st reversal down typically fails. The bears usually want at least a small double top before they will sell aggressively again. Consequently, if next week trades below this week’s low, the selloff will probably not get far nor last long.<p>Because bears want a micro double top, there will probably be more buyers than sellers below this week’s low. Any reversal down next week will more likely be a pullback from the 4 week rally than a resumption of the bear trend.<p>But, if the bulls get a 2nd leg up after the pullback, the bears will be more willing to sell a test of last week’s high. Remember, most bears want a micro double top. They will therefore sell a test back up to last week’s high, hoping to get a 2nd reversal down. That would be a higher probability sell signal.<h3>Weak buy signal</h3><p>Because this week is an inside bar in a 4 week rally, it is a High 1 bull flag. But, it only has a small bull body and it closed below the 20 week EMA. In addition, the EMA is falling and it is therefore resistance. This week is a weak buy signal bar and the location is bad. Just as there are probably buyers below this week’s low, there are probably sellers above this week’s high. As a result, the Emini will probably not go very far up or down over the next week.<h2><strong>Daily S&amp;P500 Emini futures chart:</strong><br>Emini pulling back from January parabolic wedge buy climax</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-daily-chart-has-nested-double-top-after-parabolic-wedge-buy-climax.png\"><img loading=\"lazy\" src=\"2019-1-26-4.png\" alt=\"\"></a><figcaption>The Emini daily chart was sideways this week after a parabolic wedge buy climax.<br>The December 12 high is the top of the stock market crash and a magnet above.<br>The bears have a small double top with the January 18 high and<br>a bigger double top with the December 12 high.</figcaption></figure><p>I wrote during the December crash that there would be a rally strong enough to make traders wonder if the bull trend has resumed. That has been the case. Markets spend most of their time in balance, and less time probing up and down.<p>The daily S&amp;P500 Emini futures chart pulled back this week after a strong 4 week rally. That rally had 3 legs up in a tight bull channel. It is therefore a parabolic wedge buy climax. A buy climax creates exhausted bulls.<p>Since the protective stop for the bulls is now far below, they have unusually big risk. Institutional risk managers are demanding that their traders reduce risk. The easiest way is to take some profits on their longs. This long liquidation created the 4 day pullback this week. After a parabolic wedge buy climax, the pullback often lasts about 10 days.<p>There has not yet been a strong reversal down. Consequently, there is no consensus that the high is in. Traders need to see one or more big bear bars before concluding that the bulls have given up and the Emini might be testing the December low.<h3>50% chance of one more leg up</h3><p>Because the bulls have not yet given up, there might be one more leg up. The December 12 lower high was the top of the December stock market crash. Since there are theoretically weak bears with stops above that high, it is a magnet.<p>There is currently a 50% chance that the 4 day selloff is the start of a correction down from the 4 week rally. There is also a 50% chance of a test of the December 12 high of 2,690.50 and the 2,700 Big Round Number before there is a correction down from the rally.<h3>Should correct at least a third of the rally</h3><p>How far down can the Emini fall? A Big Down, Big Up move creates Big Confusion. Confusion typically results in a trading range. A trading range has legs up and down, which can be big and fast. The odds favor a test back down.<p>At a minimum, traders expect a selloff that retraces at least a third of the rally from the December low. A reversal back up from there or from lower would create a major trend reversal. A major reversal has a 40% chance of becoming a bull trend. There is a 60% chance of either a trading range or a continuation of the bear trend.<p>Corrections usually are about 50%. Since the December selloff was so strong, once the correction comes, it will probably retrace at least half of the rally.<h3>December low is support</h3><p>Can the bears get a strong break below the December low? Not likely. If the Emini tests down to around the December low, many stocks will fall below their December lows. AAPL, FB, MS, GOOGL, M, DAL, PFE, JNJ, and XOM have not rallied strongly and are more likely to make a new low if the Emini has a sharp test of the December low.<p>However, many others have had very strong rallies. Examples include AMZN, JPM, NKE, MCD, BA, AMGN, and NFLX. A selloff in those stocks will probably form higher lows.<p>When many stocks form a new low and many others form a higher low, there is a divergence. The lack of consistency weakens the bear case. Therefore, the odds at the moment are against the Emini breaking far below the December low.<p>More likely, any selloff will form a double bottom with the December low. It can be very asymmetrical, with the 2nd bottom far above or below the December low.<p>However the test down looks, there would then probably be a test back up to the top of the January or February rally. The bears will try to create a double top. The January or February top of the current rally will be the neck line of the double bottom. The bulls will therefore hope for a breakout and a measured move up. That would result in a test of the all-time high.<h3>Disappointment is a hallmark of a trading range</h3><p>What is most likely? Disappointment. The Emini is in a trading range. Trading ranges resist breaking out. There are many strong rallies and selloffs. Each looks like the start of a new trend.<p>But there is no follow-through. The trend traders are disappointed and exit. The result is that reversals are more common than breakouts when the market is in a trading range. Confusion and disappointment are the 2 hallmarks of a trading range.<p>When present, as they are now, the chart is usually in a trading range. Trading ranges often last much longer than what seems likely. This is especially true when the buy climax was the most extreme in history, as it was in 2017.<hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-1-26"
    }
  ],
  "28": [
    {
      "data": [
        "<article class=\"post-85924 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini weekly buy signal bar but at resistanceIntraday market update: Monday January 28, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini weekly buy signal bar but at resistance</strong><br>Intraday market update: Monday January 28, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-01-28T06:20:41-08:00\">January 28, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini weekly buy signal bar but at resistance</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Last week was a bull doji doji inside bar on the weekly chart. Since it followed a strong 4 week rally, last week is a buy signal bar on the weekly chart. But, it was a doji and the chart is at the 20 week EMA. Therefore, this is a weak buy setup. There are probably sellers not far above.<p>The Emini has rallied in a parabolic wedge buy climax on the daily chart over the past 4 weeks. This typically results in exhausted bulls and about a 10 bar pullback. Traders are deciding if the pullback has begun or whether there will be one more brief high before the pullback begins.<p>The December 12 high is a magnet above. That was the start of the December crash. Therefore, the bulls might be able to break above it before they finally exhaust themselves.<p>Can the rally break strongly above that December 12 high? Unlikely. The odds favor a retracement of at least a third of the January rally beginning within a couple weeks.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 16 points in the Globex session. If it gaps down today, it will create a one day island top. Island tops and bottoms are minor reversals. I said that on Friday when Friday gapped up and formed a 2 day island bottom.<p>The Emini has been sideways for 6 days. It spent most of the time on the 5 minute chart within trading ranges. That is likely again today.<p>With the gap down, the bears hope that today will be the start of a small double top with the January high and a bigger double top with the December 12 high. However, the bulls hope that today is simply a pullback from Friday’s break above a 4 day bear flag.<p>The 6 day trading range is a sign of balance. Traders are deciding if a 50% pullback from the January rally has begun or if there will be a brief break above the December 12 high first. Until there is a strong breakout, traders will expect that trends up and down will last a couple hours and then enter a trading range or reverse for a couple hours.<h2>Friday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-trading-range-day-3.jpg\"><img src=\"2019-1-28.jpg\" alt=\"Emini trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD daily Forex chart is reversing at bottom of 4 month trading range</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/EURUSD-daily-Forex-chart-is-reversing-at-bottom-of-4-month-trading-range.png\"><img loading=\"lazy\" src=\"2019-1-28-1.png\" alt=\"\"></a></figure><p>The EURUSD daily Forex chart has had strong legs up and down in a trading range for 4 months. In a trading range, there are many strong legs up and down. However, most breakout attempts fail. Traders therefore look for reversals.<p>The 3 week selloff to the bottom of the range ended with Friday’s reversal up. Last week was a buy signal bar on the weekly chart. When the EURUSD traded above last week’s high last night, it triggered the buy signal. However, there has been no follow-through buying. The bulls need a big bull bar on the weekly chart this week to convince traders that the buy signal is significant. So far, it is not.<h2>3 week bear channel so minor reversal up</h2><p>Since the 3 week selloff was in a tight bear channel, the bulls will probably need to create some bull bars this week before they can get a reversal up to the top of the range. Therefore, the daily chart will probably be mostly sideways for a few days. Then, the bulls will try to create a small double bottom and then a rally to the top of the range.<p>The bears hope that Friday’s reversal is just a test of the January 18 high and a 50% pullback. They want a reversal down in the next few days. That would be a double top bear flag with that high. The neck line is last week’s low. They want a strong breakout below and then a 100 pip measured move down.<p>If they get their strong breakout, it would also be a break below the 4 month range. They therefore would expect the selloff to continue down for a 300 – 400 pip measured move based on the height of the 4 month trading range.<p>Traders know that every trading range over the past year had a successful breakout after about a couple of months. While they will continue to bet on reversals, they will quickly switch to trend trading if they see a couple consecutive closes above or below the range.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been sideways since late Friday. Because Friday might be the start of a 2 week rally, the bulls want follow-through buying today. At a minimum, they want a bull bar on the daily chart. Therefore, they will buy dips below today’s open today, trying to get today to close above the open.<p>The bears always want the opposite. They therefore will sell rallies to above the open, hoping to get the day to close below the open. Today would then have a bear body and be a sell signal bar for tomorrow.<p>Because Friday was such a strong reversal up from support, the bulls have a better chance of a bull close on the daily chart today. Furthermore, if today is a trend day, up is more likely than down.<p>However, the past 20 hours have been in a tight range. This tells us that traders have been scalping. Until there is a strong breakout up or down on the 5 minute chart, they will continue to scalp today.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-weak-bull-trend-reversal-in-trading-range-day-2.png\"><img loading=\"lazy\" src=\"2019-1-28-2.png\" alt=\"Emini weak bull trend reversal in trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>By gapping down, today turned Friday into a 1 day island top. There is now a double top and a double bottom over the past 7 days. This is Breakout Mode.<p>Today gapped down, but reversed up. It is a buy signal bar for tomorrow.<p>Even if there is a new high, the Emini will probably test the February 2018 low within a month.<p><em>See the</em><a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\"><em>weekly update</em></a><em>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-1-28"
    }
  ],
  "29": [
    {
      "data": [
        "<article class=\"post-86233 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini buy signal bar after island topIntraday market update: Tuesday January 29, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini buy signal bar after island top</strong><br>Intraday market update: Tuesday January 29, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-01-29T06:20:37-08:00\">January 29, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini buy signal bar after island top</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini gapped down yesterday and formed a one day island top. But, island tops and bottoms are minor reversals. After trading in a tight range, the bulls got a small late rally. Since it closed near its high, it is a buy signal bar for today. If today gaps up, yesterday would be another island reversal.<p>The Emini has a double top and a double bottom over the past 7 days. It is therefore in a tight range and in Breakout Mode.<p>The 7 day tight trading range shows no sign of ending yet. At the moment, one more leg up above the December 12 high is likely.<p>Even if the bulls break above the December 12 top of the crash, the odds are that the Emini will test last February’s low sometime in the next month. Traders will look for a test down to 2,500 at some point in February.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 4 points in the Globex session. It therefore might gap above yesterday’s high. That would create a 1 day island bottom.<p>However, an island reversal is minor. In addition, a small gap typically closes in the 1st hour. Finally, most of the trading over the past 6 days has been in a tight trading range. This is neutral, trading range price action. That is likely again today.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-weak-bull-trend-reversal-in-trading-range-day-2.png\"><img src=\"2019-1-29.png\" alt=\"Emini weak bull trend reversal in trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex 1st leg up in reversal up from bottom of trading range</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/EURUSD-Forex-1st-leg-up-in-reversal-up-from-bottom-of-trading-range.png\"><img loading=\"lazy\" src=\"2019-1-29-1.png\" alt=\"EURUSD Forex 1st leg up in reversal up from bottom of trading range\"></a></figure><p>The EURUSD daily chart reversed up sharply from a higher low at the bottom of the 4 month range. It has now retraced half of the 3 week selloff.<p>Yesterday’s body was smaller and had a tail on top. This is a sign that the 1st leg up is probably about to end.<p>Since the chart has been in a trading range for 4 months, the legs up and down typically subdivide into 2 or 3 smaller legs. Therefore, traders will buy a 1 – 3 day pullback to around the middle of the 3 day rally. They expect a 2nd leg sideways to up.<p>The bears hope that the 3 day rally will form a lower high. They need a strong break below the December low.<p>While the trading range will probably end in February, a bull breakout is as likely as a bear breakout. Furthermore, until there is a breakout, traders will bet on the range continuing. Consequently, they will look for reversals every few days.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute chart rallied and sold off 30 pips overnight. It reversed down from above yesterday’s high. Because yesterday had a tail on top, there is now a small double top. Traders expect a pullback below 1.14 over the next few days.<p>Since the 2 day rally was strong, there will probably be buyers between 1.1350 and 1.14 for a 2nd leg sideways to up. With yesterday stalling, day traders will expect more trading range price action today. They therefore will scalp for 10 – 20 pips.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-trading-range-and-breakout-mode.png\"><img loading=\"lazy\" src=\"2019-1-29-2.png\" alt=\"Emini trading range and breakout mode\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini reversed down from above yesterday’s high. It then reversed up from just above yesterday’s low. It spent most of the day in a tight range and closed in the middle 3rd. This is the 5th consecutive doji bar on the daily chart. There is no sign that the 7 day tight trading range is about to break out.<p>Traders are deciding whether there will be a brief rally above the December 12 lower high before a 50% pullback and a test of the 2,500 Big Round Number.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-1-29"
    }
  ],
  "30": [
    {
      "data": [
        "<article class=\"post-86237 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini has small double bottom and top so Breakout ModeIntraday market update: Wednesday January 30, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini has small double bottom and top so Breakout Mode</strong><br>Intraday market update: Wednesday January 30, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-01-30T06:20:30-08:00\">January 30, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini has small double bottom and top so Breakout Mode</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday was the 5th consecutive doji day in a 7 day tight trading range, There is both a small double top and double bottom. This is Breakout Mode.<p>The Emini is just below the December 12 top of the crash. That is a magnet above. In addition, the January rally was strong. Consequently, a bull breakout is slightly more likely than a bear breakout.<p>However, the January rally was a buy climax. Even if the bulls break above the December lower high, the Emini will probably retrace about 50% of the 5 week rally by the end of February.<p>Because of the dojis and tight trading range, the odds favor more sideways price action. There is no sign of an impending breakout yet.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 11 points in the Globex session. It therefore might gap up above yesterday’s high. That would create a 2 day island bottom.<p>If the gap is small, it will probably close within the first hour. However, the daily chart is in a bull bull flag. Therefore, even if the gap closes, there is still an increased chance of a bull trend day.<p>Since the past 5 days were doji days, traders will need to see a strong early breakout up or down before concluding that today will be a trend day. Without that, the odds favor at least one swing up and one swing down.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-trading-range-and-breakout-mode-1.png\"><img src=\"2019-1-30.png\" alt=\"Emini trading range and breakout mode\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex 1st leg up after test of support</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/EURUSD-Forex-1st-leg-up-after-test-of-support.png\"><img loading=\"lazy\" src=\"2019-1-30-1.png\" alt=\"EURUSD Forex 1st leg up after test of support\"></a></figure><p>The EURUSD daily Forex chart has been sideways for 3 days after reversing up from the bottom of the 4 month trading range. Legs up and down in trading ranges typically subdivide into at least 2 smaller legs. Therefore, the odds are that there are buyers below at around a 50% retracement. Then, the chart will likely have at least a small 2nd leg sideways to up.<p>While all trading ranges over the past year have broken out within a couple of months, this one is different. This is because traders are waiting for the resolution of the Brexit problem.<p>Traders believe the current price is fair. They expect that Brexit will lead to a strong breakout up or down. Furthermore, there will probably be a 300 – 400 pip measured move on the breakout. Until there is a breakout, they will continue to look for reversals every few days.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 20 pip range for the past 7 hours. The moves are so small that it is difficult even for scalpers to make money. Day traders are trading reversals, looking for 10 pip scalps.<p>The daily range has been shrinking for 4 days. Also, the past 3 days have been sideways in a tight trading range. Traders know that the odds favor a 100 pip pullback within a few days.<p>However, they also know that the rally might continue a little higher before the pullback begins. They therefore will scalp until there is a breakout up or down from this 3 day tight range. And, once there is a breakout, they expect it to be small and reverse within a few days.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-bull-trend-and-FOMC-announcement.png\"><img loading=\"lazy\" src=\"2019-1-30-2.png\" alt=\"\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini rallied strongly on the FOMC announcement. It stalled just below the December 12 start of the stock market crash. It might go sideways for a few days. The bears want a double top with that high. However, the momentum up has been strong for 4 weeks. Consequently, the bears will likely need several bear bars before they can get a reversal down.<p>The bulls want a strong breakout above that high. However, rallies typically stall once they reach the top of the most recent sell climax. The Emini will therefore probably be sideways for a few days.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-1-30"
    }
  ],
  "31": [
    {
      "data": [
        "<article class=\"post-86241 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini testing December crash highIntraday market update: Thursday January 31, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini testing December crash high</strong><br>Intraday market update: Thursday January 31, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-01-31T06:20:56-08:00\">January 31, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini testing December crash high</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini rallied strongly on yesterday’s FOMC announcement. However, it stalled just below the December 12 crash high. I have been writing for weeks that this was an important magnet. The bears want a big double top bear flag on the daily chart.<p>The bulls, however, created a strong 6 week rally. Consequently, they know the 1st reversal down will probably be minor. Therefore, there is not much downside risk over for the rest of the week.<p>By going above last week’s high, the Emini triggered a weekly buy signal. But last week was only a doji. This is a weak buy signal bar. Furthermore, the weekly chart is at the EMA and the daily chart is at the December 12 high. Both are resistance. As a result, the Emini will probably stall here for a few days.<h3>Overnight Emini Globex trading</h3><p>The Emini is unchanged in the Globex session. Yesterday reversed down from just below the December 12 high. That was the top of the crash. I have said several times that it was a magnet.<p>If the rally begins to falter, which is likely, the bulls will take profits. In addition, the bears will begin to sell. Both know that about a 50% pullback to around last December’s low and 2500 is likely to begin in February. The rally will probably stall here for a few days.<p>Less likely, the rally will continue up to the November high and 2,800 without more than a small pullback.<p>The chart is now in the sell zone, but there is no top yet. It might go sideways for 1 – 2 weeks before it begins to pull back. In addition, it might go a little higher as well. Finally, because the Emini is at an important price, there is an increased chance of a big trend day up or down.<p>Because yesterday pulled back only slightly from the December 12 high, the Emini will probably test that high again today.<p>Since yesterday was a buy climax, the bulls are probably exhausted. This typically results in at least a couple hours of sideways to down trading that starts by the end of the 2nd hour.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-bull-trend-and-FOMC-announcement-1.png\"><img src=\"2019-1-31.png\" alt=\"\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex trading range but getting higher lows</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/EURUSD-Forex-trading-range-but-getting-higher-lows.png\"><img loading=\"lazy\" src=\"2019-1-31-1.png\" alt=\"EURUSD Forex trading range but getting higher lows\"></a></figure><p>The EURUSD daily Forex chart broke back above its 4 month trading range again overnight. While the chart is still in a 4 month trading range, there are now 3 higher lows. In addition, this is the 2nd breakout above the top of the range. A trading range mostly has about a 50% chance of a breakout up or down. However, the odds now slightly favor a bull breakout.<p>The bears need a breakout below the November low. After a 5 day rally, they 1st will need at least a micro double top. That means that they would need a pullback and then a test of the top of the current leg. Consequently, traders will buy the 1st reversal down.<p>The daily chart is in Breakout Mode. Therefore, a 200 – 300 pip breakout up or down can come at any time. Furthermore, it could be surprisingly strong. Traders know that this trading range has lasted longer than most over the past 2 years. As a result, they expect the breakout soon.<p>But, until there is a breakout, there is no breakout. The probability only slightly favors the bulls. One or two huge bear days would make the chart neutral again or even bearish.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart broke again above the November high last night. That has been the top of the 4 month range. However, the breakout was small and the market reversed down 40 pips. Because the 5 day rally has been strong, the bulls will buy this selloff, even if it falls 100 pips from the overnight high. Consequently, the downside risk over the next couple days is small.<p>Because the overnight breakout was small and reversed down, the bulls lack conviction. In addition, the bears are betting that the 4 month range will continue.<p>The overnight trading range is a sign that both bulls and bears are scalping. They are unsure if the rally will continue a little higher or begin to pull back.<p>Uncertainty means traders bet on reversals and scalp. This overnight trading range price action will probably continue today.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/01/Emini-bull-trend-from-the-open.png\"><img loading=\"lazy\" src=\"2019-1-31-2.png\" alt=\"Emini bull trend from the open\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini broke above several important resistance levels today. The first was the December 12 stock market crash high. Next, it broke back above the 2017 close. The Emini oscillated around it throughout 2017. This made it clear that it was significant. Finally, it broke about the 2,700 Big Round Number. It pulled back later in the day, but closed back on the high.<p>The rally has been strong, but the bulls will begin to take profits at these resistance levels. In addition, the bears will begin to sell. Therefore, the odds favor a 50% pullback beginning within a couple weeks.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-1-31"
    }
  ]
}