{
  "1": [
    {
      "data": [
        "<article class=\"post-88293 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini monthly chart strong first quarter losing momentum\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini monthly chart strong first quarter losing momentum</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-04-01T06:20:31-07:00\">April 1, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Intraday market update: Monday April 1, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>On the monthly chart, the Emini has rallied for 3 months. But, the bodies have been shrinking, which indicates a loss of momentum. March had a relatively small range and small body. It therefore increases the chance of a sideways month in April. A sideways month might test last month’s high and low. The low is about 100 points down from the March close. Consequently, there is an increased chance of a 100 point selloff over the next few weeks.<p>On the weekly chart, last week was a pullback bar in a bull trend. Because it closed with a bull body, it is a buy signal bar. Since there is a 3 month bull trend, this week will probably have to go above last week’s high to trigger the buy. Traders will want to find out if there are buyers or sellers up there.<p>The weekly chart is still on a sell signal from 2 weeks ago. Both the daily and weekly charts have buy climaxes at the 2825 resistance area. The bulls want this rally to make a new all-time high without more than a minor pullback. It is more likely that there will be a 2 month sideways to down move beginning either with March or April.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 20 points in the Globex session. Today will therefore probably gap up on both the daily and weekly charts. If today trades above Friday’s high, which it would with a gap up, it would trigger a buy signal on the weekly chart.<p>If this week rallies above the high from 2 weeks ago but reverses down, the daily chart would have an expanding triangle top with the March 4 and 21 highs. The bulls need 2 closes above the March 21 high to make a new all-time high likely within the next 2 months.<p>A big gap increases the chance of a trend day. A gap up makes a bull trend slightly more likely than a bear trend. However, there are bears who will sell around the high from 2 weeks ago. They expect a swing down for a couple of months and are going to sell rallies. We do not know yet if there are more of them than there are bulls wanting a new all-time high.<p>The past 5 days have had swings up and down. On the daily chart, each has had prominent tails, which indicates the reversals. While today has an increased chance of being a trend day, it is still more likely to have at least one swing up and one swing down.<p>A big gap up typically results in a trading range for the 1st hour. Day traders look for a double top or bottom, or a wedge top or bottom, and then a 2 – 3 hour swing up or down. That swing can continue all day.<h2>Friday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-trading-range-day-2.png\"><img src=\"2019-4-1.png\" alt=\"Emini trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/EURUSD-Forex-double-top-and-double-bottom-ahead-of-Brexit.png\"><img loading=\"lazy\" src=\"2019-4-1-1.png\" alt=\"EURUSD Forex double top and double bottom ahead of Brexit\"></a></figure><p>The EURUSD daily Forex chart traded above Friday’s high. This therefore ended the 8 day bear micro channel. However, the bulls might need a micro double bottom before they can begin a 2 week leg up in the 4 month trading range. A reversal up would form a double bottom with the March low. Every leg up and down, no matter how strong, reversed within a few weeks. Therefore, a reversal up is likely within a week or so.<p>The bears have a double top. They see the 8 day selloff as the start of a bear trend. If they get 2 consecutive closes below the March 7 neck line of the double top, traders will conclude that a breakout is finally underway. They would look for about a 250 pip measured move down.<p>Traders are waiting for news from Brexit. There have been several deadlines, and they keep creating new ones. That news could be the catalyst that finally converts the 4 month trading range into a trend up or down.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 30 pip range overnight. While today broke above Friday’s high, there so far have been more sellers than buyers up there. Traders are deciding if the 8 day bear micro channel needs a micro double bottom before a swing up can begin. Day traders are scalping, waiting for a breakout up or down.<p>On the 4 hour chart, the past 4 days created a channel in a Spike and Channel bear trend. The huge selloff on March 22 was the spike. A bear channel is a bull flag. There is a 75% chance of a break above the bear trend line. That typically converts the bear channel into a trading range. The top of the range is often the start of the channel. That is the March 25 high of 1.1333.<p>However, the channel could easily continue to below the March low before reversing up. There have been many failed breakouts up and down over the past 4 months.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-bull-trend-from-the-open-with-body-gap.png\"><img loading=\"lazy\" src=\"2019-4-1-2.png\" alt=\"Emini bull trend from the open with body gap\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>By gapping above last week’s high, the Emini triggered a weekly buy signal. It also traded above last month’s high. The day was in a weak bull trend until the middle of the day. At that point, the trend became stronger. It closed at the high of the day, well above the March high.<p>However, the bulls need consecutive closes above that high. That would make traders more confident that this rally will reach the all-time high without first having a 1 – 2 month pullback.<p>The bears will try to begin a reversal down this week. But, there is no top yet. The bears will probably need at least a micro double top. Consequently, they 1st have to stop the buying before they can begin the selling. That means they will need at least a few sideways days before traders will look to sell on the daily chart.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-4-1"
    }
  ],
  "2": [
    {
      "data": [
        "<article class=\"post-88532 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini weekly buy signal and breakout above March high\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weekly buy signal and breakout above March high</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-04-02T06:20:07-07:00\">April 2, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Intraday market update: Tuesday April 2, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday had a big gap up, but then a weak bull trend. By going above last week’s high, the Emini triggered a weekly buy signal. The rally broke and closed above the March 22 high of the year as well.<p>If the bulls get consecutive closes above that high, especially if today closes far above, the odds will favor a new all-time high within the next 2 months. Otherwise, the odds will still favor a 2 month pullback before the new all-time high.<h3>Overnight Emini Globex trading</h3><p>While yesterday was not a strong bull trend day, it was relentless. The odds still favor a continuation of the yearlong trading range. This is true even if there is a break to a new all-time high. However, the bulls have not yet begun to take profits. Consequently it is still easier for a day trader to make money on the long side.<p>The Emini is up 2 points in the Globex session. Yesterday broke above the March 21 high, which is resistance. Today is the follow-through day. A 2nd close above that resistance increases the chance of a test of the next resistance. That is the all-time high.<p>Because the daily chart is in a trading range, there is an increased chance of disappointing follow-through today. That means an increased chance of a bear candlestick on the daily chart. Consequently, day traders will look for a major trend reversal down on the 5 minute chart at some point today. Their minimum goal will be a close below the open.<p>Since yesterday was not a strong bull trend day, the odds are against a big bull trend day today. There will probably be a transition into a trading range or a bear swing by the end of the 2nd hour.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-bull-trend-from-the-open-with-body-gap.png\"><img src=\"2019-4-2.png\" alt=\"Emini bull trend from the open with body gap\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/EURUSD-Forex-double-top-and-double-bottom-ahead-of-Brexit-vote.png\"><img loading=\"lazy\" src=\"2019-4-2-1.png\" alt=\"EURUSD Forex double top and double bottom ahead of Brexit vote\"></a></figure><p>The EURUSD daily Forex chart has sold off for 10 days after rallying for 10 days. Every trading range has both a credible buy and sell signal. Here, in the current 4 month range, there is now a double top and a double bottom over the past month. Traders are waiting for more information from Brexit before they are willing to bet on the direction of the breakout.<p>Every leg up and down for 4 months has reversed after about 2 – 3 weeks. This selloff has lasted 2 weeks. Since it is now at the bottom of the range, the bears will probably take profits soon and the bulls will look for a reversal up to buy.<p>Because this is the longest trading range in over 2 years, the breakout will probably come soon. There is a 50% chance of the breakout being up and a 50% chance of it being down. Until there are consecutive closes above or below the range, the odds continue to favor reversals. Every leg up or down is more likely to reverse than break out, even though one will eventually break out.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a bear channel on the 4 hour chart since March 25. A bear channel has a 75% chance of a bull breakout. That means the odds favor a break above the bear trend line this week.<p>At that point, the bulls will try for a rally and either a bull trend or a bull leg in a trading range. The bears, however, want the breakout to go sideways and form a bear flag.<p>The daily ranges have been small during the US sessions over the past week. Day traders have been scalping. The overnight range has only been 20 pips. That makes it difficult for scalpers to make money. Traders are waiting for news from Brexit, which can come at any time.<p>Since the chart has sold off to the bottom of the 4 month range and there is a bear channel on the 240 minute chart, the bulls are looking to buy a reversal up. Day traders know this and will look for a reversal up, hoping for a 30 – 50 pip swing up. They would also swing trade a strong selloff, but a successful break below the 4 month range on this particular selloff is less likely than a reversal up.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-trading-range-day.png\"><img loading=\"lazy\" src=\"2019-4-2-2.png\" alt=\"Emini trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>As I mentioned before the open, today was likely to have at least 2 hours of trading range price action. This was because yesterday’s rally was weak.<p>Today was the 1st pullback in a 12 bar bull micro channel on the 60 minute chart. The odds therefore are that the Emini would test above Monday’s high this week. It did so at the end of the day. However, once there is a new high, traders will begin look for a deeper pullback from the 60 minute bull micro channel over the next few days.<p>There is now a wedge top on the daily chart. Because today closed near its low, it is a sell signal bar for tomorrow on the daily chart.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-4-2"
    }
  ],
  "3": [
    {
      "data": [
        "<article class=\"post-88535 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini bull flag and bull micro channel at March high\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini bull flag and bull micro channel at March high</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-04-03T06:20:43-07:00\">April 3, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Intraday market update: Wednesday April 3, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>I mentioned before the open yesterday that yesterday would probably have at least 2 hours of trading range trading. That was because Monday’s rally was weak and therefore likely to transition into trading range price action. The entire day was a trading range day.<p>Yesterday closed near its low. There are now 3 legs up on the daily chart. That is a wedge bull channel. Yesterday is now a sell signal bar for today. However, it was small, the momentum up has been good, and the all-time high is a magnet above.<p>Yesterday is also a pause in a bull trend. It is therefore also a High 1 bull flag coming into today. Its bear body reduces the chance of a sustained rally today and tomorrow.<p>Since the 3 month bull channel is tight, the Emini might have to go sideways for a few days before there is a reversal down. But, as I have said several times over the past few weeks, the odds are that the Emini will test the March low and begin to trade sideways to down within a couple weeks.<p>This is still more likely than the rally continuing straight up to a new all-time high. But, the closer the rally gets to that high, the more likely the bulls will get a new high.<h3>Bull micro channel on 60 minute chart</h3><p>Coming into yesterday, the 60 minute chart had a 12 bar bull micro channel. This is similar to what I have been saying about the weekly chart. When there is a micro channel with many bars like this, the bulls typically buy the 1st reversal down. And they did yesterday.<p>Next, the odds favor a breakout above the top of the micro channel and a brief resumption of the bull trend. That was Monday’s high, and yesterday broke a little above it. Today might rally more.<p>Finally, the micro channel is a sign that the bulls might be exhausted. As a result, there is usually a deeper pullback after the rally gets above the top of the micro channel for a few days. Therefore, there will probably be sellers not too far above Monday’s high.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 18 points on the Globex chart. Today will therefore gap above yesterday’s high. When there is a big gap up, there is an increased chance of a trend day. A bull trend is slightly more likely.<p>However, a big gap up means that the 5 minute chart will be far above its 20 bar EMA. Traders do not like to pay too much above the average price. Consequently, the first 60 – 90 minutes usually enters a trading range until the EMA gets near the market.<p>At that point, the bulls will look to buy a wedge bull flag or a double bottom near the EMA.<p>A trading range always has both a bull and bear setup. The bears will look to sell a double top or a wedge rally.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-trading-range-day.png\"><img src=\"2019-4-3.png\" alt=\"Emini trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/EURUSD-Forex-double-bottom-and-double-top-ahead-of-Brexit.png\"><img loading=\"lazy\" src=\"2019-4-3-1.png\" alt=\"EURUSD Forex double bottom and double top ahead of Brexit\"></a></figure><p>The EURUSD daily Forex chart turned up overnight from above the March 7 low. This is a double bottom. There is a Spike and Channel bear trend over the past 6 days on the 240 minute chart. Traders expect a test of the start of the channel, which is the March 25 high, just above 1.13.<p>The daily chart has had many 2 – 3 week long legs up and down over the past 4 months. This reversal is probably the start of a couple weeks of sideways to up trading.<p>Brexit is an important catalyst. A surprise announcement can come anytime. It could lead to a huge move up or down. Until then, traders will continue to look for reversals every 2 – 3 weeks.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart rallied 70 pips from yesterday’s low. The rally has been in a tight bull channel. This is a sign of eager buying. When that is the case, there is usually at least a small 2nd leg up after the 1st reversal down. Consequently, day traders will look to buy 10 – 30 pip pullbacks today, and a 50% pullback over the next few days.<p>They will wait to sell for scalps. As long as the bull channel on the 5 minute chart remains tight, it will be difficult for the bears to make money. However, today will likely begin to enter a trading range. Once it does, the bear day traders will scalp reversals down from above prior intraday highs.<p>The bears hope that this rally will form a double top with Monday’s high. That would create a small bear flag on the daily chart. They then want the 2 week bear trend to resume and break strongly below the March 7 low.<p>Two weeks of sideways to up is more likely because every breakout attempt for 4 months reversed. This one will therefore probably also reverse for at least a couple weeks.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-wedge-top-and-wedge-bottom.png\"><img loading=\"lazy\" src=\"2019-4-3-2.png\" alt=\"Emini wedge top and wedge bottom\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The strong early selloff made a bull trend day unlikely. The rally to a new high made a big bear trend unlikely. This resulted in a trading range day. The midday selloff turned the day into a bear trend reversal day. Profit taking by the bears created a reversal up into the close. The day closed near the open and was a bear doji day.<p>Today is now a sell signal bar for tomorrow. But, a bear doji is a weak sell signal bar.<p>A gap down tomorrow would create a 3 day island top. However, island tops are minor reversals.<p>The odds still favor a 2 month selloff before a new all-time high. But, if the bulls begin to get a series of bull bars closing near their highs, the probability which shift in favor of a new all-time high.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-4-3"
    }
  ],
  "4": [
    {
      "data": [
        "<article class=\"post-88539 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini and Forex Update: Emini buy climax testing 2900 big round number\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini and Forex Update: Emini buy climax testing 2900 big round number</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-04-04T06:20:53-07:00\">April 4, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Thursday April 4, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Although the Emini gapped up yesterday, it was a trading range day. Yet, the daily chart continues to work higher. The bulls want a break above the 2900 Big Round Number and then a new all-time high.<p>But, the weekly buy climax might be a problem for them. It could be too good. The bulls bought the 1st pullback in the 10 bar bull micro channel. There is typically a new high in the channel, and there has been. Then, however, the bulls often take profits.<p>This can result in a deeper, longer pullback. For example, TBTL (Ten Bars, Two Legs). On the weekly chart, that is a couple of months.<p>At the moment, there is a 50% chance of this coming before there is a new all-time high. If the Emini goes straight up to a new high, it will probably then enter a broad trading range for several months.<h3>The weekly chart is important</h3><p>Tomorrow is Friday. It therefore determines how this week will look on the weekly chart. So far, the week is a small bull bar. But, this week is the 3rd push up in 6 weeks in a tight channel. That is a parabolic wedge rally. There is therefore an increased chance of a reversal down next week.<p>However, the bears will probably need a bear bar on the weekly chart this week before they can get a reversal. Therefore, traders should watch for a possible reversal down to Monday’s open today or tomorrow.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 1 point in the Globex session. There have been many strong swings down on the 5 minute chart over the past 2 weeks. Each one turned out to be a bull flag. The bulls have been refusing to give up, and the daily chart continues to work higher.<p>Yesterday’s strong, late reversal up increases the chance of follow-through buying in the 1st 2 hours today.<p>Most days over the past 2 weeks have had both a swing up and a swing down. That therefore is likely again today.<p>On the daily chart, Tuesday was a bear day and therefore a bad buy signal bar. That is part of the reason for yesterday’s selloff. Yesterday was also a bear day. It is therefore a weak entry bar. The Emini might have to go sideways today before going higher.<p>Also, it might wait until tomorrow to decide whether to close near the top or bottom of the week. A close near the top will increase the chance of a new all-time high within a couple months.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-wedge-top-and-wedge-bottom.png\"><img src=\"2019-4-4.png\" alt=\"Emini wedge top and wedge bottom\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/EURUSD-Forex-double-bottom-and-double-top-ahead-of-Brexit-1.png\"><img loading=\"lazy\" src=\"2019-4-4-1.png\" alt=\"EURUSD Forex double bottom and double top ahead of Brexit\"></a></figure><p>The EURUSD daily Forex chart reversed down overnight after yesterday’s one day bounce. The bulls expect at least a small 2nd leg sideways to up after the 2 week sell climax down to the bottom of the 4 month trading range. Consequently, they will probably buy this selloff.<p>The bears want today to close near its low. It would then be a bear day on the daily chart. That would make it a Low 1 bear flag and a sell signal bar for tomorrow.<p>However, the 4 month trading range has had many attempts to break out of the top and bottom. Each has failed. In addition, there will be more Brexit news within the the next 2 weeks. That is another reason against a bear breakout this week.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart sold off 40 pips overnight. It has retraced about 50% of the rally from Tuesday’s low. The odds are that the selling will stop within the next couple of hours.<p>But, the overnight bear channel has been tight. Therefore, the bulls might need to transition into a trading range for an hour or two before they can begin a rally.<p>Neither the 2 day rally nor the overnight selling has been strong. They look like legs within a developing trading range. Day traders are therefore looking for both buy and sell scalps, expecting a trading range today and tomorrow.<p>Everyone knows that there will likely be a sharp 200 – 400 pip move beginning soon. But, no one knows if it will be up or down. Day traders are waiting for a 50 – 100 pip strong breakout either way before they will aggressively swing trade. In the meantime, they are mostly scalping up and down for 10 – 20 pips.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-bull-trend-reversal-after-wedge-bottom.png\"><img loading=\"lazy\" src=\"2019-4-4-2.png\" alt=\"Emini bull trend reversal after wedge bottom\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini continued yesterday’s rally on the open. After a 17 bar bull micro channel, it sold to test yesterday’s low and the 60 minute EMA. It rallied from a wedge bottom and closed near the middle. Today was a doji inside day on the daily chart. It is therefore both a buy signal bar and a sell signal bar. However, it is a weak bar for both the bulls and bears.<p>Tomorrow is Friday and the weekly candlestick is currently a bull bar. If the bulls can close the week on its high tomorrow, they will increase their chance of a new all-time high within a couple of months.<p>The bears want a selloff tomorrow. They would like the week to close near its low. It would then be a sell signal bar for a 6 week small wedge on the weekly chart. The odds are against a big bear trend day tomorrow.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-4-4"
    }
  ],
  "5": [
    {
      "data": [
        "<article class=\"post-88542 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini inside bar and test of 2900 big round number\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini inside bar and test of 2900 big round number</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-04-05T06:20:53-07:00\">April 5, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update: &lt;br /&gt;Friday April 5, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini formed an inside day yesterday. It is therefore both a buy signal bar and a sell signal bar. The bulls want a test of 2900 and then a continuation up to a new all-time high. Yesterday had a bull body and the Emini is in a bull trend. It is therefore a better buy setup than sell setup.<p>Since this 3 month rally is climactic, the bears want a reversal down. However, until there is a big bear trend bar on the daily chart, the bulls will continue to buy every 20 point selloff.<p>Today is Friday so today will determine how the weekly chart will look. The momentum up has been strong for 3 months and there is no clear top yet. Therefore, the bulls will try to get the week to close near its high. If they are successful, it will increase the chance of a new all-time high within a couple months.<p>The bears always want the opposite. If they can get a big selloff today, the week could close near its low. It might then be a good sell signal bar for next week. The selloff might come in the final hour. At the moment, the odds favor the bulls and higher prices.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 7 points in the Globex session. It is close enough to the 2900 Big Round Number to get there today. Because that is a magnet and the momentum up has been strong, there is an increased chance of a swing up today.<p>However, yesterday was in a bull channel for the 2nd half of the day. A bull channel is a bear flag. There is a 75% chance of a break below yesterday’s bull trend line today. That does not require a bear trend. If the Emini simply goes sideways for a couple of hours, it will break below the bull channel. The bull trend would then have evolved into a trading range.<p>Most days over the past week have had at least one swing up and one down. Consequently, that is likely again today.<p>What is most important today is the appearance of the weekly candlestick once today closes. Therefore, there is an increased chance of a surprisingly big swing up or down in the final hour.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-bull-trend-reversal-after-wedge-bottom.png\"><img src=\"2019-4-5.png\" alt=\"Emini bull trend reversal after wedge bottom\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/EURUSD-Forex-ii-Breakout-Mode.png\"><img loading=\"lazy\" src=\"2019-4-5-1.png\" alt=\"EURUSD Forex ii Breakout Mode\"></a></figure><p>The EURUSD daily Forex chart has an inside day so far today. In addition, yesterday was an inside day. Consecutive inside days is an ii pattern. It is a neutral and therefore Breakout Mode setup. If you look at a smaller time frame, you will see that an ii pattern is a triangle.<p>The bears see yesterday as a Low 1 bear flag. If today remains an inside day, the ii will be a bear flag for Monday. However, the bear flag is at the bottom of a 4 month trading range. Therefore, a bear breakout of the flag will probably fail.<p>For the bulls, they see the ii as a test of Tuesday’s low. Yesterday was therefore a micro double bottom. They want a rally back to the top of the 4 month range.<h3>A Breakout Mode pattern is neutral</h3><p>A Breakout Mode pattern is neutral. The breakout is as likely to be up as down. Furthermore, there is a 50% chance that the initial breakout will fail.<p>Traders are waiting for information about Brexit. It is foolish to have a strong conviction either way when the chart is telling us that the market is neutral. Until there is a breakout of the 4 month range, the odds continue to favor reversals.<p>But, this is the longest trading range in 2 years. The breakout will likely be within a month.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a small range overnight. This is obviously true, given that today is the 2nd consecutive inside bar.<p>Yesterday is a bear inside bar in a 10 day bear trend. The bears want to break below its low to trigger a sell signal today. However, on the daily chart, yesterday had a big tail below and it is at the bottom of the trading range. This is a low probability sell setup. Consequently, there are probably more buyers than sellers below.<p>Yesterday formed a micro double bottom with Tuesday’s low. It is therefore also a buy setup. But, with a bear body, it is a weak buy setup. Also, it is just below the resistance of the 20 day EMA. There are probably more sellers above than buyers.<p>With sellers above, buyers below, and no news on Brexit, today will probably be another scalping day for day traders.<p>Everyone knows that a surprise from Brexit is going to come soon. That will probably lead to the start of a trend lasting at least a couple of months. In the meantime, day traders will look to scalp reversals and small breakouts.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-trading-range-below-2900.png\"><img loading=\"lazy\" src=\"2019-4-5-2.png\" alt=\"Emini trading range below 2900\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>After a gap up and brief early rally, the Emini entered a tight trading range. The day remained small, but closed near its high. This increases the odds of higher prices next week.<p>The weekly chart had 2 sell signals over the past 5 weeks. This week broke above both top attempts. Since the week closed near its high, the Emini will probably break above 2900 next week and test the all-time high within a month.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-4-5"
    }
  ],
  "6": [
    {
      "data": [
        "<article class=\"post-88548 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini nested wedge buy climax in buy vacuum\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini nested wedge buy climax in buy vacuum</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-04-06T00:30:33-07:00\">April 6, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Market Overview: Weekend Market Update</h2><p>The<strong>Emini</strong>weekly chart broke above the two top attempts of the past 6 weeks. With the week gapping up and closing near its high, higher prices are likely over the next few weeks. The Emini will probably make a new all-time high within a month or two.<p>The<strong>crude oil</strong>weekly futures accelerated up over the past 2 weeks. The breakout is strong enough to make at least a small 2nd leg up likely after the 1st brief pullback.<p>The<strong>EURUSD</strong>weekly Forex chart is waiting for news from Brexit. It could come suddenly at any time. Until then, traders will look for reversals every 2 – 3 weeks.<h2><strong>Crude oil Futures market:</strong><br>Accelerating up</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Crude-oil-weekly-futures-chart-in-bull-breakout.png\"><img loading=\"lazy\" src=\"2019-4-6.png\" alt=\"Crude oil weekly futures chart in bull breakout\"></a></figure><p>Crude oil futures have rallied strongly for 3 months. The rally has been especially strong since early March. There are now 5 consecutive bull trend bars on the weekly candlestick chart.<p>This week’s candlestick was a big bull trend bar that closed on its high. It followed a good buy signal bar last week. This is a new breakout. There will be trapped shorts who will be desperate to buy the 1st small pullback. Consequently, the odds favor at least a small 2nd leg up after the 1st 1 – 2 week pullback.<p>While a strong breakout is unsustainable and climactic, there is no top yet. Higher prices are likely. Buy climaxes eventually entice bulls to take profits. Once the profit-taking begins, there will probably be a pullback lasting 1 – 2 months.<p>When a bull channel is tight, it usually has to transition into a trading range before it can reverse into a bear trend. Therefore, the weekly chart will probably have to to sideways for many weeks before the bears can create a significant swing down.<h2><strong>EURUSD weekly Forex chart:</strong><br>Imminent breakout up or down on Brexit news</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/EURUSD-weekly-Forex-chart-at-bottom-of-5-month-trading-range-ahead-of-Brexit-1.png\"><img loading=\"lazy\" src=\"2019-4-6-1.png\" alt=\"EURUSD weekly Forex chart at bottom of 5 month trading range ahead of Brexit\"></a></figure><p>The EURUSD weekly Forex chart has sold off from the June high in a week bear channel. It now has been in a tight trading range for 5 months. Every leg up and down has reversed within 2 – 3 weeks. This is the longest time in a trading range in over 2 years. As a result, traders expect a breakout soon.<p>Obviously, everyone is expecting Brexit to be the catalyst that leads to the breakout. However, it is a mistake to assume that either the bulls or bears currently have an advantage. The market could not be going sideways if it was more likely to go up or more likely to go down. It is going sideways because the bulls and bears are equally strong. They have been alternating control every few weeks.<p>Because the daily chart is now at the bottom of the trading range, the odds favor sideways to up over the next week. But news from Brexit can convert the 5 month trading range into a bull or bear trend in an instant.<h3>Trading range means Breakout Mode</h3><p>The chart is in Breakout Mode. When that is the case, there is a 50% chance that the 1st breakout will fail. Furthermore, there is a 50% chance that once there is a successful breakout, it will be up, and a 50% chance it will be down.<p>There are several choices for the top and bottom of the range. This matters because traders expect a measured move up or down once there is a breakout. The 4 month range is about 350 pips tall. Therefore the measured move targets are around 1.08 for the bears and about 1.19 for the bulls.<p>It is important to remember that there is no breakout until there is a clear breakout. In the meantime, it is better to bet on reversals.<h2><strong>Monthly S&amp;P500 Emini futures chart:</strong><br>Testing all-time high and regaining momentum up</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-monthly-chart-has-strong-bull-leg-in-trading-range.png\"><img loading=\"lazy\" src=\"2019-4-6-2.png\" alt=\"Emini monthly chart has strong bull leg in trading range\"></a></figure><p>The bodies of the Emini futures monthly candlesticks have been shrinking for 3 months. This is a sign of a loss of momentum and it increases the chance of a pause in the rally. I wrote last week that because last month was a doji bar, it was a one bar trading range.<p>Trading ranges tend to continue and this increases the chance of another sideways bar in April. I said that April might test both last month’s high and low. It is currently above last month’s high. If the Emini is to test the March low in April, it would have to reverse down in the next couple of weeks.<p>Can the momentum pick up again? Can April be a bull trend bar with a big body and a close above the March high? Yes, but there are several weeks left to the month. This gives plenty of time for the bears to reassert themselves. At the moment, the odds now favor a test of the all-time high in April or May.<h3>The importance of the size of body on April’s candlestick</h3><p>If the month continues to hold near its high, the Emini will probably make a new all-time high in April or May. However, if it turns down and the month closes near its low, the Emini will probably be sideways to down for at least another month.<p>I have been writing over the past 2 months that the reversal up from the 10 year bull trend line would probably lead to a new high this year. What we don’t know yet is if the rally will go straight up without a pullback or first pull back for a couple months. Traders will have a better idea near the end of April once they see whether the month is holding at the high or has reversed to its low.<h3>Possible Final Bull Flag and Expanding Triangle top</h3><p>The 3 month rally has been extreme and it is late in a 10 year bull trend. That makes the yearlong trading range a good candidate for a Final Bull Flag. Therefore, if there is a new high, the 2018 trading range will be a magnet. Any rally above 3,000 will probably get drawn back down to the middle or bottom of the yearlong trading range by the end of next year.<p>If there is a reversal down from a new high, there would be an Expanding Triangle top of the weekly and monthly charts. The initial target for the bears would be the bottom of the triangle, which is the December low. A selloff from a new high to that low could take many months after a reversal down.<p>If there is a bear trend after a reversal down from a new high, traders will look for a measured move down . The selloff will probably reach the 2014 – 2015 trading range at around 2000. This will probably happen within the next few years.<h2><strong>Weekly S&amp;P500 Emini futures chart:</strong><br>Bull Surprise Bar makes higher prices likely</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-weekly-chart-has-bull-breakout-above-2-sell-signal-bars.png\"><img loading=\"lazy\" src=\"2019-4-6-3.png\" alt=\"Emini weekly chart has bull breakout above 2 sell signal bars\"></a></figure><p>The weekly S&amp;P500 Emini futures chart had a gap up this week. This is important because there were 2 sell signals over the past 6 weeks. The gap up this is a sign that the bulls are not yet exhausted.<p>The bull candlestick with a close near the high is a sign that the top-picking bears are giving up. The odds favored a pullback after 2 sell signals following a 10 week bull micro channel. But, this week broke above the sell signal bar from 2 weeks ago. Furthermore, it closed above that high and near the high of the week.<h3>Bull Surprise Bar</h3><p>This week represents surprisingly good buying pressure. Therefore, this week was a Bull Surprise Bar. A Bull Surprise Bar is a low probability event. It traps bears into losing shorts and bulls out of good longs. Both are desperate for a pullback to buy. The bears want to exit with a smaller loss and the bulls are eager to get long. This typically results in at least a small 2nd leg up.<p>The bigger the bar is, the bigger the surprise. This week did not have a particularly big bull body. Consequently, there is not as much desperation to buy as there might have been. As a result, the bears have a 40% chance of a reversal down next week.<p>For them, this week is the 3rd leg up in a 6 week micro wedge top. Also, the Emini is testing the 2900 Big Round Number. But, the bears need a strong sell signal bar next week to undo what the bulls accomplished this week. At the moment, the odds favor a test of the September 2956.00 all-time high by the end of May. It might even come within a few weeks.<h2><strong>Daily S&amp;P500 Emini futures chart:</strong><br>Emini nested wedge buy climax in buy vacuum</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-daily-chart-has-nested-wedge-tops-but-no-trend-reversal-yet.png\"><img loading=\"lazy\" src=\"2019-4-6-4.png\" alt=\"Emini daily chart has nested wedge tops but no trend reversal yet\"></a></figure><p>The daily S&amp;P500 Emini futures chart rallied this week and broke above the March 21 high. This is now the 3rd leg up where March 4 was the 1st. Three legs up in a tight bull channel is a parabolic wedge.<p>Furthermore, this 3rd leg up is made of a smaller wedge. March 26 and April 1 are the 1st 2 legs up in this wedge. When the 3rd leg in a wedge is made of a smaller wedge, there is a nested wedge pattern. A nested pattern has a higher probability of reversing down.<p>But, the bears need either a credible sell signal bar or one or more big bear bars. Without either, the odds favor higher prices. Everyone is aware of the magnetic pull of the 2956.00 all-time high.<h3>More momentum bulls than value bulls</h3><p>Much of the recent buying is from momentum bulls. They are buying because the Emini is going up. These bulls see the magnet not far above and are betting that the Emini cannot escape the magnetic pull. They want to ride the momentum up for a quick profit.<p>These traders are not buying because they think the market is cheap. Value bulls buy when they think the market is cheap and they buy more on selloff because it is then cheaper. Late in a bull trend, if the market rallies strongly, most of the buying is from momentum bulls, not value bulls. Momentum bulls want a quick profit.<p>In addition, momentum bulls are risk adverse. As soon as they are disappointed by a loss of momentum, they exit. Their goal is a relatively small reward, knowing the probability is high. If the risk becomes big, their math becomes bad. They will exit to avoid a growing risk.<p>A trader will lose money if his risk/reward becomes bad and his probability is dropping. The result often is a rush to the exits as soon as the Emini begins to turn down late in a bull trend. The momentum bulls can exit in a panic and create a quick down draft. There were several examples in 2018.<h3>Odds now favor a new all-time high</h3><p>I have been writing since December that the bulls would probably get a new all-time high this year. Until this week, the odds favored a 2 month pullback to a higher low, and then a new high later in the year.<p>This week was strong enough to make the new high likely to come by the end of May. It might even come in April. However, one or two big bear days over the next few weeks could flip the odds back in favor of a 2 month pullback before a new high.<hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-4-6"
    }
  ],
  "8": [
    {
      "data": [
        "<article class=\"post-88545 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Bull surprise bar on Emini weekly chart\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Bull surprise bar on Emini weekly chart</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-04-08T06:20:45-07:00\">April 8, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Monday April 8, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini formed a bull trend bar on the weekly chart and it closed near its high. This was after 2 weekly sell signals over the prior 5 weeks. The bears might be giving up. The bar was strong enough to qualify as a bull Surprise Bar. Surprise Bars typically have at least a small 2nd leg up. Consequently, the Emini will probably be sideways to up over the next.<p>If the bears can create a big bear trend bar that closes near its low this week, they will erase last week’s bullishness. If they succeed, the odds would again shift back in favor of a 1 – 2 month pullback. After last week’s rally, the Emini will probably test the all-time high before the end of May.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 3 points in the Globex session after coming within 2 ticks of 2900. That Big Round Number is resistance.<p>There is also a nested wedge on the daily chart. This increases the chance of profit-taking at some point this week. That means one or more strong bear trend days. Consequently, day traders will watch for topping patterns on the 5 minute chart.<p>While the bulls want a strong break above 2900 today, the rally on all time frames is extreme. In addition, the momentum up is dissipating on the 60 minute chart over the past 2 weeks. Most days have been predominantly sideways. This reduces the chance of a big rally above 2900 today. Even if the bulls got that rally, it would probably be an exhaustive move leading to 1 – 2 weeks of profit taking.<h2>Friday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-trading-range-below-2900.png\"><img src=\"2019-4-8.png\" alt=\"\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/EURUSD-Forex-ii-buy-signal-and-double-bottom-ahead-of-Brexit.png\"><img loading=\"lazy\" src=\"2019-4-8-1.png\" alt=\"EURUSD Forex ii buy signal and double bottom ahead of Brexit\"></a></figure><p>The EURUSD daily Forex chart broke above last week’s ii (consecutive inside bars) buy setup last overnight. The bulls have a double bottom with the March low. At a minimum, they want a rally back above the March 26 sell climax (final bear leg) and a 50% retracement. Because the chart has been in a trading range for 5 months, they will probably achieve that objective over the next 10 days.<p>Since the 3 week selloff has been strong, the bears hope that today forms a micro double top with Wednesday’s high at the EMA. They want the breakout above the ii to fail and for the daily chart to reverse strongly below the March low.<p>Traders want to see consecutive closes beyond the trading range before believing that a breakout up or down will succeed. Everyone is waiting for news from Brexit, which will probably come soon. It will likely be a catalyst for a 300 pip measured move above or below the 5 month trading range.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart rallied 40 pips overnight. By breaking above Friday’s high, the rally triggered an ii buy signal on the daily chart.<p>But, the consecutive bear bars on the daily chart and the strong 10 day selloff reduce the chance of a strong rally to the March high. In addition, the uncertainty of Brexit is a problem as well. Finally, the daily chart has been in a tight range for 7 days and most breakout attempts fail.<h3>240 minute chart has head and shoulders bottom</h3><p>The 240 minute chart has a higher low major trend reversal. In addition, the March 26 high is the top of a bear channel. It is therefore a magnet, especially since it is also in the middle of the 5 month range.<p>Because the overnight rally has been in a tight bull channel on the 5 minute chart, it is strong. Therefore, the best the bears will probably get today is a 20 – 30 pip pullback.<p>While there is a chance of a strong rally from here today, the daily chart is in a 7 day tight trading range just below the daily EMA. These 2 factors will probably limit the upside. Since the context and buy setup are good for the bulls, this is probably the start of a rally up to around 1.1330.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-double-bottom-higher-low-major-trend-reversal.png\"><img loading=\"lazy\" src=\"2019-4-8-2.png\" alt=\"Emini double bottom higher low major trend reversal\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>Today was the 1st pullback on the daily chart in 9 days. The bulls bought below Friday’s low.<p>The Emini reversed up from below Friday’s low and from the 60 minute EMA on the open. It rallied for the rest of the day. Since it traded above Friday’s high, it became an outside up day.<p>Today was a pullback in a 9 day bull trend. Even though it was an outside up day, it is a High 1 bull flag and a buy signal bar for tomorrow. The bulls are trying to break strongly above 2,900 and then the September all-time high.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-4-8"
    }
  ],
  "9": [
    {
      "data": [
        "<article class=\"post-88781 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini outside up buy signal bar 2900\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini outside up buy signal bar 2900</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-04-09T06:20:02-07:00\">April 9, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Tuesday April 9, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini yesterday had its 1st pullback in 9 days on the daily chart. The bulls bought below Friday’s low and the bull trend continued to above Friday’s high. Yesterday therefore was an outside up day in a bull trend. It is now a buy signal bar for today.<p>The bulls are trying to break above the 2900 Big Round Number, and then the all-time high. There are climaxes on the daily and weekly charts. This reduces the chance of a strong rally from here. But, there is no reversal yet. Consequently, the odds favor higher prices.<p>While the odds favor higher prices, they could quickly switch in favor of the bears. The bears need this week to sell off and close near its low. It would then reverse last week’s bull breakout. Furthermore, it would be a Low 3 sell signal bar on the weekly chart. That would be a micro wedge top.<p>If today is a bear inside day after yesterday’s outside up day, it would be an ioi sell signal bar for tomorrow. If instead it falls below yesterday’s low and closes near its low, it would be a reversal day. That, too, would be a sell signal bar for tomorrow.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 6 points in the Globex session. Yesterday was a buy climax. Consequently, there is only a 25% chance of another big bull day today.<p>In addition, there is a 75% chance of at least a couple hours of sideways to down trading that begins by the end of the 2nd hour. It might begin on the open.<p>The high of the Globex session was exactly 2900.00. Today is the 3rd day testing that level. If the Emini does not break above it this week, it will probably try the other direction… down, at least for a few days.<p>There is a nested buy climax on the daily chart. Since the rally is stalling at resistance, there is an increased chance of one or more bear trend days this week.<p>It is always possible that there could be a couple big bull days breaking far above the resistance. But, they would be late in a buy climax. They therefore would probably lead to exhausted bulls. Consequently, there would likely then be profit-taking for a couple of weeks rather than a continuation up to above the all-time high.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-double-bottom-higher-low-major-trend-reversal.png\"><img src=\"2019-4-9.png\" alt=\"Emini double bottom higher low major trend reversal\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/EURUSD-Forex-double-bottom-after-double-top-ahead-of-Brexit.png\"><img loading=\"lazy\" src=\"2019-4-9-1.png\" alt=\"EURUSD Forex double bottom after double top ahead of Brexit\"></a></figure><p>The EURUSD daily Forex chart resumed its 6 day rally yesterday from a double bottom with the March low. It is testing the March 22 low and the 20 day EMA. Since this is resistance, it could test back down from here.<p>However, the March 26 high is a stronger magnet. That is the top of the most recent sell climax. Furthermore, it is around a 50% retracement of the late March selloff. That means it is also the middle of the 5 month trading range.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD rallied in a tight bull channel through the 1st half of yesterday. It then entered a tight trading range. The rally resumed in the Asia session. However, it converted into a broader and therefore weaker bull channel at the start of the European session. It evolved into a trading range 4 hours ago. Day traders today will be back to scalping as they wait for a breakout up or down.<p>On the 240 minute chart, the March 25 high is the start of a bear channel after a strong bear breakout. That typically gets tested. Consequently, the 6 day rally will likely get there within a week.<p>The rally from here to there will probably be weak. Once there, the chart will likely go sideways for a few days. The EURUSD Forex market would be back to the middle of its 5 month range. Traders will then decide if the rally continues to the top or reverses back to the bottom.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-wedge-top.png\"><img loading=\"lazy\" src=\"2019-4-9-2.png\" alt=\"Emini wedge top\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini was in a trading range for the 1st several hours. The bull breakout reversed down from just above the 60 minute EMA and the open of the week. There was a late bear breakout to a new low and today closed near its low.<p>Yesterday was an outside up day. By today trading below yesterday’s low, today triggered a micro double top sell signal at the 2900 resistance level. There is also a nested wedge top on the daily chart.<p>However, the past 2 days were bull days and every pullback for 3 months has lasted only 1 – 2 days. Consequently, the bears will need one or more big bear days or several small bear days to convince traders that they have taken control.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-4-9"
    }
  ],
  "10": [
    {
      "data": [
        "<article class=\"post-88794 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini micro double top and nested wedge at 2900\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini micro double top and nested wedge at 2900</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-04-10T06:20:57-07:00\">April 10, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Wednesday April 10, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Monday was an outside up day. It got to within 1 tick of 2900, but then reversed to below Friday’s low. The 2 days created a micro double top on the daily chart. In addition, there is a nested wedge top on the daily chart.<p>The bears are hoping that this is the start of a 2 month pullback. However, they need to start to create bear bars to convince traders that they are in control. If they can form one big bear bar or several small bear bars over the next week, traders will begin to wonder if 2900 will be the high for the next 2 months.<p>Every pullback for 3 months has lasted only 1 – 2 days. The bulls are hoping that this is just another dip in its Small Pullback Bull trend. Because yesterday was a pullback in a bull trend, it is a buy signal bar.<p>But, its bear body makes it a weak buy setup. There might be more sellers than buyers above its high. This is especially true because the Emini has been stalling at 2900, which is 1 tick above the high of the week.<p>The bulls need a strong break above 2900 to convince traders that this rally will continue up to the all-time high without pulling back for a month or two 1st.<h3>Overnight Emini Globex trading</h3><p>The selloff from yesterday’s high never gave Buy The Close bulls a chance to exit without a loss. When that is the case, the bulls scale in lower, expecting a test back to that final high close. That final high close was at yesterday’s high. Consequently, that is a magnet for today. It is also a magnet because yesterday is a High 1 bull flag on the daily chart.<p>The Emini is up 3 points in the Globex session. It tested the highest close of yesterday’s day session 15 minutes ago. However, it will probably test it again in today’s day session.<p>Yesterday is a buy signal bar on the daily chart and the chart is in a bull trend. Today will probably go above yesterday’s high today. That would trigger a buy signal on the daily chart.<p>However, yesterday had a bear body, and 2900 is resistance above. Therefore, there will probably be sellers not too far above yesterday’s high. In addition, most days over the past 2 weeks have had swings up and down. That further reduces the chance of a big trend day today. Today will probably also have at least one swing up and one swing down.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-wedge-top.png\"><img src=\"2019-4-10.png\" alt=\"Emini wedge top\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/EURUSD-Forex-day-trading-in-trading-range.png\"><img loading=\"lazy\" src=\"2019-4-10-1.png\" alt=\"EURUSD Forex day trading in trading range\"></a></figure><p>The EURUSD daily Forex chart has rallied for 7 days from a higher low double bottom. The rally lacks consecutive big bull bars closing near their highs. It therefore is not strong. However, a reversal up from a spike and channel sell climax typically tests the top of the channel. That is the March 25 high, which is about 50 pips above today’s current high. This rally is so weak that it might test down first.<p>Yesterday was a doji bar at the EMA. Each of the past 5 days had tails on top. Day traders are selling rallies. This lack of conviction reduces the chance of the rally continuing much longer. Consequently, there will probably be a test back down within a few days. The 1st target for the bears is Monday’s buy climax low.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart reversed down 10 minutes ago from above yesterday’s high. On the 240 minute chart, the 7 day rally is a wedge. That is a buy climax. Traders will therefore expect a couple legs down on the 240 minute chart starting within a few days. It could be starting today.<p>Yesterday was a doji day, which is a one day trading range. So far, today is a doji day as well. Furthermore, it reversed up from a perfect double bottom test of yesterday’s low and down from above yesterday’s high. That is a type of outside down day. If it closes near the low, the EURUSD will probably test 1.12 over the next few days.<p>Because most of the trading over the past 2 weeks was mostly sideways in the US session, day traders expect to scalp up and down today. The selloff of the past 10 minutes will probably remain as the high of the day. day traders will sell rallies and look to buy reversals up from around yesterday’s low. But, the reversal down was strong enough so there is a slightly increased chance of a bear trend day.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-weak-bull-trend-and-expanding-triangle.png\"><img loading=\"lazy\" src=\"2019-4-10-2.png\" alt=\"Emini weak bull trend and expanding triangle\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini formed a small trading range day, but rallied into the close. Today triggered a High 1 buy signal by going above yesterday’s high. But, yesterday was a bear bar and therefore a weak buy signal bar. However, 2900 is a magnet above. The Emini will probably test above it this week.<p>There is a nested wedge on the daily chart. Since the Emini is at resistance, the bears have a better chance of a swing down. But, they need to create bear bars. Without more selling pressure, the odds continue to favor a test of the all-time high.<p>So far, this week has been small. The bears hope to keep it from being a big bull trend bar on the weekly chart. It would then be bad follow-through after 2 big bull bars.<p>If they can get the week to close on its low, it would be a sell signal bar for next week. There would be a 7 week wedge top and buy climax on the weekly chart. That would increase the chance of a 2 month pullback before a test of the all-time high.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-4-10"
    }
  ],
  "11": [
    {
      "data": [
        "<article class=\"post-88797 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini High 1 bull flag at 2900 resistance\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini High 1 bull flag at 2900 resistance</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-04-11T06:20:02-07:00\">April 11, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Thursday April 11, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini formed a trading range day yesterday, but had a small, late bull breakout. By going above Monday’s high, yesterday triggered High 1 bull flag buy signal on the daily chart.<p>There is a magnet above at 2900. The Emini will probably test above it today or tomorrow. If the bulls can get 2 closes above it, the odds will favor a continuation up to the all-time high within a month.<p>On the other hand, there is a nested wedge on the daily chart and a buy climax on the weekly chart. If the bears can begin to create bear days, the odds will switch in favor of a 2 month pullback. The Emini has been sideways for 6 days because traders are deciding between the 2 alternatives.<p>Tomorrow is Friday and therefore the weekly chart is becoming important.<br>The past 7 weeks have formed a small wedge rally on the weekly chart. So far, this week is small. It is therefore a bad follow-trough bar on the weekly chart after the 2 week rally. If the bears can close the week below the open, this week will be a sell signal bar for next week for a small wedge top.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 3 points in the Globex session. The bulls will probably get a break above 2900 today or tomorrow. If they fail, there will be a micro double top on the daily chart with Monday’s high. When a market tries to go one way several times and fails, it then typically tries to go the other way. As a result, if there is a rally to around 2900 but it begins to reverse, the selloff could lead to one or more bear trend days.<p>Can the bulls get a big break above 2900? While it is possible, the daily and weekly charts are late in strong bull trends. The bulls might start to take profits on strength.<p>For example, if there is a big bull trend day closing far above 2900 within the next week, the bulls might sell the close instead of buying more. Their thought could be that it is too extreme and therefore unlikely to go much higher. It would then be a great opportunity to take a big profit that might be brief. That is how an exhaustive buy climax works.<p>Most days over the past 2 weeks had a lot of trading range price action. Since markets have inertia, today will also likely have at least one swing up and one swing down.<p>Because of the repeated tests of 2900, there is an increased chance of a big trend up or down. But, with the week being small, it will probably stay small and close around the open of the week.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-weak-bull-trend-and-expanding-triangle.png\"><img src=\"2019-4-11.png\" alt=\"\"></a><figcaption>Emini weak bull trend and expanding triangle</figcaption></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/EURUSD-Forex-day-trading-in-bear-flag-and-double-bottom.png\"><img loading=\"lazy\" src=\"2019-4-11-1.png\" alt=\"EURUSD Forex day trading in bear flag and double bottom\"></a></figure><p>The EURUSD daily Forex chart has been sideways for 3 days at the EMA. In addition, the rally up from the double bottom has lacked consecutive big bull bars closing near their highs. Consequently, the rally is probably not the start of a trend up to the March high.<p>More likely, it is either a bear flag or a bull leg in a trading range. A bear flag means that the bears expect a strong break below the April low.<p>But, a bull leg in a trading range means that there will be buyers around the April low and they will get a 2nd reversal up from there.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart formed a triple top over the past 3 days. In addition, the rally on the 240 minute chart has had 3 legs up and is therefore a wedge. A wedge rally is a type of buy climax. As a result, the odds favor a test down. The 30 pip selloff over the past 90 minutes might be the start of a test down to 1.12.<p>There were 4 days in early April with lows just above 1.12. Consequently, it is a magnet below.<p>Most of the trading over the past 10 days has been within days that largely overlapped the prior day. So far, today is another example. Its high has been a fraction of a pip above the highs of yesterday and Tuesday.<p>Yesterday was a big day so today is unlikely to trade below its low. In addition, the selloff on the 5 minute chart so far lacks consecutive big bear bars. Therefore, there is not sustained, strong selling. This will make traders expect a trading range soon.<p>Once the selling stops, the bulls will buy reversals up from prior lows. The bears will look to sell rallies. Both will probably only scalp for 10 pips unless there is an increase in the size of the bars and of the legs.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-bear-trending-trading-range-day-and-sell-cimax.png\"><img loading=\"lazy\" src=\"2019-4-11-2.png\" alt=\"Emini bear trending trading range day and sell climax\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini tried again for the third time in 5 days to break above 2900. It could not and there was a strong midday reversal down.<p>Today was a bear trending trading range day and it closed back around the bottom of the upper trading range. Therefore, the bulls have not yet given up. They may try again to get above 2900.<p>The bears now have a micro double top on the daily chart. There is a nested wedge as well. However, today had a big tail below and is a weak sell signal bar. The bears need a strong reversal down next week. Otherwise, the bulls will get their breakout above 2900.<p>The open of the week has been a magnet all week. Traders might wait until the final hour tomorrow to decide whether to close the week above or below the open.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-4-11"
    }
  ],
  "12": [
    {
      "data": [
        "<article class=\"post-88801 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini gapping above 2900 resistance\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini gapping above 2900 resistance</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-04-12T06:20:54-07:00\">April 12, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Friday April 12, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini tested 2900 again yesterday, and reversed down in the middle of the day. I have been saying that the bulls would probably get a breakout above 2900 this week. Today will probably gap above that Big Round Number.<p>If the bulls can get the day to close near its high, the odds will favor higher prices over the next few weeks. The next resistance is the 2956.00 all-time high.<p>I have been writing all week that the appearance of this week’s candlestick would be important. Today is Friday and its close determines how this week will look. The bears had been hoping for a close below the open of the week. Now, they will hope for a close back below the 2900 resistance.<p>The bulls had 2 big bull trend bars on the weekly chart over the past 2 weeks. I have been saying that those 2 bars created a breakout above a credible top from 3 weeks ago. I said that the odds favored at least a a couple small legs up over the next few weeks. If this week’s candlestick is a bull body closing near its high, the probability of higher prices over the next few weeks will be 60%.<h2>Overnight Emini Globex trading</h2><p>The Emini is up 18 points in the Globex session. The day session will probably have a big gap up above the 2900 Big Round Number. Whenever there is a big gap up, there is an increased chance of a trend day. If there is a trend, a bull trend is more likely.<p>Today’s open is especially important. Most days over the past 2 weeks had trading range opens. If today has several consecutive trend bars up or down, the odds of a trend day will go up.<br><h3>A big gap increases the chance of a trend</h3><p>When a gap up is big, the Emini is far above the EMA. That means far above the average price. The bulls do not want to pay an above average price unless the price action is above average. They need to see bull bars closing near their highs.<p>While a trend day is more likely today, there is only about a 30% chance of a big trend from the 1st bar. More often, the bulls prefer to buy closer to the average price. There is therefore a 70% chance of a trading range in the 1st hour, even if the 1st few bars are up. The bulls will look to buy a double bottom or wedge pullback to around the EMA. They then will look for a swing up.<p>The bears want the breakout to fail. While they can get a reversal down from the 1st bar, they usually need a double top or wedge top.<p>I want to make this clear. Bear day traders will look for either a double top or wedge top and then a bear trend day. Bull day traders want a double bottom or wedge bottom near the EMA and a bull trend day. A bull trend is more likely than a bear trend. There is only a 30% chance of a strong bull or bear trend from the open.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-bear-trending-trading-range-day-and-sell-cimax.png\"><img src=\"2019-4-12.png\" alt=\"\"></a><figcaption>Emini bear trending trading range day and sell climax</figcaption></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/EURUSD-Forex-day-traders-have-breakout-above-bear-flag.png\"><img loading=\"lazy\" src=\"2019-4-12-1.png\" alt=\"EURUSD Forex day traders have breakout above bear flag\"></a></figure><p>The EURUSD daily Forex chart had a weak rally for 10 days. It was a bear flag at the EMA. Today so far is a big bull trend day breaking above the bear flag. The bulls hope that it is the start of a test up to the top of the 5 month trading range.<p>If today closes near the high of the day, traders will see it as a successful breakout. In general, a bull breakout above a bear flag has a 60% chance of at least 2 small legs up to around a measured move. That would result in a test of the top of the 5 month range.<p>Whenever there is a breakout, traders pay attention to the next few bars. For example, even if today closes near its high, the bulls will want at least a small bull day tomorrow. If they get it, the probability that the breakout will continue to succeed would remain at 60%.<p>However, if the bears get a small bear body Monday, the probability will drop to close to about 55%. If Monday closes on its low and has a relatively big bear body, then the probability of a failed breakout would be about 50%.<p>This means that there will be a fight today over the close and another fight Monday over the open. The bulls want today to close near its high and Monday to close above its open. The bears always want the opposite.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart rallied 50 pips early in the European session. It has been in a 20 pip rang for the past 3 hours. The bulls have already accomplished their initial goal of breaking above the 10 day bear flag.<p>All they need for the rest of the day is to try to get the day to close near its high. Having the range grow from here does not significantly improve the odds of higher prices next week. Consequently, the bulls will buy 10 – 20 pip selloffs today. Since all they need is a close near the high, bull day traders will take profits around the high of the day. Swing traders will hold for about a 100 pip measured move up over the next week.<p>The bears failed to resume their bear trend from the March 20 high. They need to show traders that they can regain control. They probably cannot reverse the breakout today. Therefore, the best bear day traders can hope to get today are 10 pip scalps.<p>However, the bears would like the bar on the daily chart to be a weaker bull bar. At a minimum, they would like a conspicuous tail on top. They therefore will sell rallies, hoping to get the day to close at least 20 – 30 pips below today’s high. It would weaken the bull breakout further if the close was below yesterday’s high.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-bull-trend-reversal-after-wedge-bull-flag.png\"><img loading=\"lazy\" src=\"2019-4-12-2.png\" alt=\"Emini bull trend reversal after wedge bull flag\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>After a big gap up above the 2900 resistance level, the Emini reversed down and then up. It was a trading range day. The bulls want follow-through buying next week. That would increase the chance of a new all-time high over the next month.<p>The bears, however, want a reversal down from the wedge top of the past month. But, without a strong reversal down, the odds continue to favor a test of the all-time high.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-4-12"
    }
  ],
  "13": [
    {
      "data": [
        "<article class=\"post-88784 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini gap above 2900 resistance but buy climax and 3rd leg up\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini gap above 2900 resistance but buy climax and 3rd leg up</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-04-13T00:30:05-07:00\">April 13, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Market Overview: Weekend Market Update</h2><p>The<strong>Emini</strong>gapped above the 2900 resistance level this week. Traders want to see follow-through buying next week. If they get it, they will expect a new all-time high within a month. The bears want a reversal down from a wedge rally to resistance.<p>The<strong>crude oil</strong>futures market has been in a strong bull trend for 4 months. However, the big bull bar from 2 weeks ago might be a blow-off top. The bulls will probably begin to take profits soon. Once they do, there will likely be a pullback for at least a couple weeks.<p>The<strong>EURUSD</strong>Forex market bounced over the past 2 weeks. It is in Breakout Mode. Everyone is waiting for news from Brexit. But, traders need to understand that the breakout can come on any unexpected news, even if the news appears minor.<h2><strong>Crude oil Futures market:</strong><br>Strong bull trend, but possible exhaustion soon</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Crude-oil-futures-blowoff-top-and-exhaustive-buy-climax.png\"><img loading=\"lazy\" src=\"2019-4-13.png\" alt=\"Crude oil futures blowoff top and exhaustive buy climax\"></a></figure><p>The crude oil futures weekly chart had a big bull bar last week and a small bull bar this week. When a big bar comes late in a bull trend, it attracts profit takers. If enough traders take profits, the bull trend will pull back. It could then enter a trading range.<p>When a rally is as strong as this one has been, the 1st reversal down is typically minor. That means either a bull flag or a bear leg in what will grow into a trading range. The bears therefore will only take quick profits and the bulls will buy the selloff.<h3>Transition into trading range likely soon</h3><p>Traders do not believe that a bear trend will start within the next couple weeks. However, a trading range is becoming increasingly likely. The first target for the bears is the March 21 high, which is the breakout point of the April 1 bull breakout.<p>The rally has broken above the 3 month bull channel on the weekly chart. That typically leads to profit taking. It is also at a measured move projection based on the March 13 breakout. The March 25 low tested the March 1 high. Therefore, the March 13 bar was a good candidate for a measuring gap.<p>But resistance is not enough of a reason to sell a strong bull trend. The bears want to see bear bars closing below their midpoints, big bear bars, and consecutive bear bars. Without that, the Small Pullback Bull Trend will continue. The bulls will keep buying small pullbacks until they start to see big pullbacks.<h2><strong>EURUSD weekly Forex chart:</strong><br>Minor rally in weak bear channel</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/EURUSD-weekly-Forex-chart-weak-reveral-at-bottom-of-trading-range.png\"><img loading=\"lazy\" src=\"2019-4-13-1.png\" alt=\"EURUSD weekly Forex chart weak reversal at bottom of trading range\"></a></figure><p>The EURUSD weekly Forex chart formed a bull trend bar this week after 3 bear bars. But, the body was not especially big and there was a conspicuous tail on top. This is not yet a strong bull trend reversal. Furthermore, the chart has been forming lower highs and lows since January 10. In addition, every leg up or down for 6 months has reversed after 2 – 3 bars. The bulls need much more before traders will conclude that a bull trend reversal is underway.<p>What about the bears? They keep getting lower highs and lows, but the bear channel is almost horizontal. Traders are trading it like a trading range. They are buying low, selling high, and taking quick profits.<p>Since the bear channel is essentially a tight trading range, the weekly chart is in Breakout Mode. Traders are waiting for a strong breakout up or down before concluding that the trading range has ended and a trend has begun.<p>When a market is in Breakout Mode, there is a 50% chance that the 1st breakout up or down will fail. Furthermore, there is a 50% chance that a successful will be up and a 50% chance it will be down.<p>Until there are consecutive closes above or below the range, traders will assume that the trading range is still in effect. They will then continue to buy low, sell high, and take quick profits.<h3>Longest trading range in 2 years</h3><p>This trading range has lasted 5 months. That is the longest trading range in 2 years. Consequently, traders expect a breakout up or down at any time.<p>Everyone assumes that the breakout will come on Brexit news. Europe and the Brits keep deferring the conclusion. It is a mistake to believe that this is the only catalyst. The breakout can come at any time and on any news.<p>This includes news that initially appears insignificant. Sometimes the news will report something as minor. Then, several weeks later after a big move in the markets, they will say that the news caused the big move.<h2><strong>Monthly S&amp;P500 Emini futures chart:</strong><br>Regaining momentum up</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-monthly-chart-in-strong-trend-above-2900.png\"><img loading=\"lazy\" src=\"2019-4-13-2.png\" alt=\"Emini monthly chart in strong trend above 2900\"></a></figure><p>The monthly S&amp;P500 Emini futures chart has a fourth consecutive bull trend bar so far this month. After 3 months with shrinking bodies, April’s body is currently bigger than March’s. This is a sign that the bulls are regaining momentum. If the month closes near its high, May will probably test the 2956.00 all-time high.<p>Less likely, the Emini could sell off in the 2nd half of April. If April closes with a bear body, it would be a sell signal bar for May. The bears would see the 4 month rally as a lower high major trend reversal. It would also be a head and shoulders top.<p>Even if April closes on its low, the odds would still favor only a minor pullback. It could last a couple months. Traders would probably buy below the April low, expecting a quick resumption back up to the September all-time high.<h2><strong>Weekly S&amp;P500 Emini futures chart:</strong><br>Strong breakout and follow-through</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-weekly-chart-breakout-above-Low-2-top.png\"><img loading=\"lazy\" src=\"2019-4-13-3.png\" alt=\"Emini weekly chart breakout above Low 2 top\"></a></figure><p>The weekly S&amp;P500 Emini futures chart triggered a credible sell signal 3 weeks ago. But, last week closed above the sell signal bar’s high. In addition, it was the 2nd consecutive bull bar closing near its high. And now this week also closed near its high. This strong breakout and follow-through make higher prices likely. Consequently, even if the Emini reverses down for a week or two, the bulls will probably buy the selloff.<p>Whenever there is a breakout, there is at least a 40% chance it will fail. It sometimes reverses abruptly. More often, the bears need at least a micro double top. Consequently, even if the Emini sells off for a couple of weeks, the bulls will likely buy it.<br><p>A reversal down less often comes without a micro double top. When it does, the bears want to see strong evidence that the bulls have given up. That can come from a surprisingly big bear bar, or 3 or more consecutive smaller bear bars. At that point, the bears would begin to sell, looking for at least a small 2nd leg down.<h2><strong>Daily S&amp;P500 Emini futures chart:</strong><br>Emini gap above 2900 resistance but buy climax and 3rd leg up</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-daily-chart-has-wedge-but-no-top.png\"><img loading=\"lazy\" src=\"2019-4-13-4.png\" alt=\"Emini daily chart has wedge but no top\"></a></figure><p>The daily S&amp;P500 Emini futures chart gapped up on Friday above the 2900 resistance level. It is in its 3rd leg up over the past month. The 1st two legs were the March 4 and March 21 highs. A reversal down next week would therefore be from a wedge top.<p>However, the bull channel over the past 3 weeks is tight. And so is the entire 4 month bull channel. When that is the case, the 1st reversal down is typically minor. A strong bull trend usually has to transition into a trading range before it can reverse into a bear trend.<h3>What about those wedge tops?</h3><p>A strong bull trend is constantly forming wedge tops. But<a href=\"https://www.brookstradingcourse.com/what-is-price-action/#80%Rule\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">my 80% rule on inertia</a>says that 80% of trend reversal attempts fail. Therefore, betting on a wedge reversal is a low probability bet unless there are other factors.<p>Sometimes the wedge can have decent selling pressure, like big pullbacks after the 1st 2 legs. That increases the chance of a reversal. That is not the case with the current rally.<p>The rally of the past 3 weeks has been especially strong. It is therefore climactic. A buy climax can go very far up before the bulls get exhausted and take profits. However, traders should always be thinking of both a plausible bull and bear argument.<p>The argument for the bears is that there are now 3 pushes up. They want the breakout above 2900 to fail and reverse down from a wedge top. For them, Friday was not a big bull trend bar. It is therefore a sell signal bar for Monday.<p>Since it was not a big bear bar, it is a weak sell signal. They know that they only have a 40% chance of a reversal down this coming week. But, they will sell if the Emini starts to drop.<h3>Possible island top</h3><p>If the Emini gaps down this week, it will form an island top with Friday’s gap up. Island tops and bottoms are common and are minor reversals. Consequently, an island top next week is no more likely to lead to a bear trend than any other type of reversal.<p>The key for the bears is not an island top, but rather a strong reversal down. They need to start to create bear bars. They especially need some combination of bear bars closing below their midpoints, consecutive bear bars, and big bear bars. Without that, the odds continue to favor a test of the all-time high.<hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-4-13"
    }
  ],
  "15": [
    {
      "data": [
        "<article class=\"post-88804 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini breakout above 2900 but doji bar and buy climax\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini breakout above 2900 but doji bar and buy climax</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-04-15T06:20:37-07:00\">April 15, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Monday April 15, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini gapped above the 2900 resistance level on Friday. However, Friday closed near its open and formed a doji bar. That hesitation increases the chance of a failed breakout. The bears prefer a bear body for a sell signal bar. They therefore want today to close near its low.<p>If today or any day this week gaps down, Friday’s gap up will have created an island top. Island tops and bottoms are typically minor reversals. However, the Emini is at resistance and in a buy climax on the daily and weekly charts. That increases the chance of a reversal down. But, without the bears creating several bear bars closing below their midpoints, the odds favor a test of the all-time high.<p>When there is a gap above resistance, the Emini often goes sideways for a few days. At that point, it decides whether to resume up or reverse down. With Friday being a doji bar, there is a 50% chance of mostly sideways trading again today.<h3>Buy climax on 60 minute chart</h3><p>The 60 minute chart has rallied in a tight bull channel for 3 weeks. That is unusually long and therefore a buy climax. Consequently, the bull channel will likely evolve into a trading range this week.<p>There is typically a pullback that is about twice as big as the biggest pullback in the tight bull channel. Therefore, there will probably be a 50 point selloff at some point this week.<p>It could begin any day. The Emini might have to form a micro double top on the 60 minute chart first. If so, there would have to be at least one sideways day to create that top.<h3>Overnight Emini Globex trading</h3><p>The Emini is unchanged in the Globex session. Today is important because the bulls need to hold above 2900 to increase the chance of a new high within a month.<p>Also, this week is important because the bulls want follow-through buying on the weekly chart. If instead this week has a bear body on the weekly chart, it will increase the chance of a pullback next week.<p>If this week has a big bear body and it closes on its low, the weekly chart will have a small wedge top. That would increase the chance of at least 2 – 3 weeks of pulling back.<p>Because there is a buy climax on the 60 minute chart, day traders will look for a top on the 5 and 60 minute charts this week. They expect a 50 point selloff this week or next week. That would probably require 2 – 3 days down.<p>However, there have been many selloffs on the 5 minute chart over the past 3 weeks. Every one reversed up and led to a new high. If a 50 point sell is to start this week, it will probably begin with an unusually strong bear breakout on the 5 minute chart. That can be an extremely big bear bar or 2 – 3 very big bear bars. If traders see a strong bear breakout, they will be more eager to sell small rallies, expecting at least 2 – 3 days of lower prices.<h2>Friday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-bull-trend-reversal-after-wedge-bull-flag.png\"><img src=\"2019-4-15.png\" alt=\"Emini bull trend reversal after wedge bull flag\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/EURUSD-Forex-follow-through-day-after-breakout-above-bear-flag.png\"><img loading=\"lazy\" src=\"2019-4-15-1.png\" alt=\"EURUSD Forex follow-through day after breakout above bear flag\"></a></figure><p>The EURUSD daily Forex chart broke above a bear flag on Friday. Today is important because the bulls need follow-through. If today is a bull bar, it will increase the probability of at least a small 2nd leg up. If it is a big bull bar closing on its high, the rally will probably continue to the top of the 5 month range.<p>The day is small so far after both the Asian and European sessions. It will therefore probably not get much bigger. That makes strong follow-through buying unlikely.<p>The bears always want the opposite. At a minimum, they want today to have a bear body. That would reduce to probability of significantly higher prices. Instead, it will make some sideways days likely. If today closes on its low, tomorrow will probably trade below today’s low.<p>If today has a relatively big bear body and closes on its low, Friday’s breakout will likely fail. Traders would then look for several days down this week.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 20 pip range overnight. That is so small that it is even difficult for day traders to make a 10 pip scalp.<p>The key price today is the 1.1306 open. Whenever today is above that price, the bears will sell reversals down. This is because they want a bear body on the daily chart.<p>But, whenever the EURUSD Forex market is below today’s open, the bulls will buy it. This is because a bull bar on the daily chart today increases the chance of higher prices this week.<p>While there always can be a big breakout up or down at any time, that is unlikely today. The range has been small all day and the chart is back in the middle of its 5 month range. That is a neutral zone and it reduces the incentive for traders to move it violently higher or lower.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-bull-trend-reversal-at-2900-support.png\"><img loading=\"lazy\" src=\"2019-4-15-2.png\" alt=\"Emini bull trend reversal at 2900 support\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini sold off early and reversed up. It has done that many times over the past 3 weeks.<p>The 60 minute chart is in a Small Pullback Bull Trend. Since that is a buy climax, it will probably transition into a trading range this week. Traders will look for a pullback that is about twice as big as the pullbacks in the bull channel. Therefore, they will look for about 50 points down from the high.<br><br>Friday’s gap might be a measuring gap on the 60 minute chart. Therefore, the Emini might have to rally to around 2920 before beginning a 50 point selloff.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-4-15"
    }
  ],
  "16": [
    {
      "data": [
        "<article class=\"post-88956 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini buy climax around 2900 but no exhaustion yet\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini buy climax around 2900 but no exhaustion yet</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-04-16T06:20:26-07:00\">April 16, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Tuesday April 16, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini sold off again yesterday on the open. The bulls bought the selloff, just as they have done for more days over the past 3 weeks.<p>The most interesting thing right now is the 60 minute chart. It has been in a Small Pullback Bull Trend for 3 weeks. That is a lot of bars. A bull channel typically eventually converts into a trading range. This one should this week.<p>A reasonable goal for the bears is a pullback that is about twice as big as the biggest one in the bull channel. Consequently, the Emini will probably begin about a 50 point pullback sometime this week.<p>It probably will not begin until after testing the measured move target around 2920 based on Friday’s gap.<h3>Overnight Emini Globex trading</h3><p>I have been saying in the chat room that Friday’s gap up was a likely measuring gap on the 60 minute chart. I said that the target was around 2920. Today is up 10 points in the Globex session, which puts it at that target.<p>I have also been saying that the 60 minute chart has been in a tight bull channel for about 100 bars. That is a long time and therefore a buy climax. Typically, there is a break below the bull channel and a pullback that falls about twice as far as the biggest pullback in the channel. If that pullback was to begin today, it would probably test last week’s 2877.25 low within a couple weeks.<p>A big gap up has only a 20% chance of leading to a strong trend from the open that lasts all day. Much more likely is a trading range for the 1st hour. The bears want a wedge top or double top and then a swing down. However, the bulls will look for a reversal up from a selloff to the EMA. They expect either a double bottom or wedge bull flag there.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-bull-trend-reversal-at-2900-support.png\"><img src=\"2019-4-16.png\" alt=\"Emini bull trend reversal at 2900 support\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/EURUSD-Forex-pullback-in-wedge-bear-flag.png\"><img loading=\"lazy\" src=\"2019-4-16-1.png\" alt=\"EURUSD Forex pullback in wedge bear flag\"></a></figure><p>The EURUSD daily Forex chart has been sideways for 3 days after a 2 week rally. The rally is a weak bull channel. Since it has 3 legs up after a strong selloff, it is also a wedge bear flag.<p>But, this bull channel is tight and yesterday was a doji. That is a weak sell signal bar in a rally that is not climactic. Traders do not yet believe that the rally is overdone.<p>The weak rally back to the middle of the 5 month range is a sign that traders think that the price is fair for the bulls and bears. There is no sense that the price is terribly wrong and that the market has to move quickly to a more accurate price.<p>Traders are deciding if this rally is a wedge bear flag or a leg that will continue up to the top of the range. Because the chart has been sideways for 3 days, traders have not yet made up their mind. They want to see a better buy or sell signal bar, or a strong breakout up or down. In the meantime, the odds favor more quiet trading today.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 30 pip range overnight. It reversed up from below yesterday’s low. Yesterday was a sell signal bar for a 2 week wedge bear flag. But, it was a doji bar and not a strong sell signal bar. In addition, the 2 week rally has been in a tight bull channel. A weak sell setup like this is more likely to have more buyers than sellers below the sell signal bar. So far, that has been the case.<p>The fight today will be over the close. If the bears can close the day on its low, today would be a good entry bar. This is despite the weak sell signal bar yesterday. That would increase the chance of at least slightly lower prices tomorrow.<p>Alternatively, if the bulls can close the day on its high and at least 20 pips above the open, today will be a good buy signal bar for tomorrow. That would increase the chance of higher prices over the next couple days.<p>What is most likely? Confusion. The price is in the middle of a 5 month trading range and the daily chart has been sideways for 3 days. Most days over the past 3 weeks have had prominent tails. These are signs of a lack of conviction. Therefore, that will probably continue today.<p>Traders will sell rallies and prevent a strong buy signal bar on the daily chart. In addition, they will buy selloffs and prevent a strong entry bar after yesterday’s sell signal. In a balanced market, traders buy low, sell high, and take quick profits.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-bear-trend-rsumtion-after-wedge-top.png\"><img loading=\"lazy\" src=\"2019-4-16-2.png\" alt=\"Emini bear trend resumption after wedge top\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini gapped up to the measured move target on the 60 minute chart and sold off. It spend most of the day in a tight trading range. The bears got trend resumption down at the end of the day.<p>Since there were 3 pushes up over the past 7 days, there is a small wedge top on the daily chart. In addition, because today was a bear day, it is a sell signal bar for tomorrow. However, the late rally weaken the sell signal. The bulls might get one more high before the pullback begins.<p>The 3 week bull channel has been tight. Therefore, the 1st reversal down will probably be minor. The best the bear can probably get is a 50 point pullback over the next week to around last week’s low and the 20 day EMA.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-4-16"
    }
  ],
  "17": [
    {
      "data": [
        "<article class=\"post-88959 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini small wedge buy climax at measured move target at 2920\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini small wedge buy climax at measured move target at 2920</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-04-17T06:20:06-07:00\">April 17, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Wednesday April 17, 2019<br></h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>I have been saying that last Thursday’s gap up might be a measuring gap. Yesterday sold off after gapping up to the 2920 target area. But, it reversed up late in the day.<p>On the daily chart, yesterday closed below its midpoint. It is therefore a sell signal bar in a buy climax. There were 3 small pushes up over the past 7 days so there is a small wedge top.<p>However, because the 3 week bull channel is tight, if there is a selloff today, it will probably be minor. Also, the tail on the bottom of the yesterday’s bar makes it a weaker sell signal bar. Finally, the Emini is close enough to the all-time high that it is within its gravitational field. The Emini might have to reach the magnet before it can pull back.<p>The 60 minute chart has been in a tight bull channel for about 100 bars. That is unsustainable and therefore a buy climax. Typically, there will soon be a pullback that is approximately twice as big as the biggest pullback in the rally. Since that was about 20 points, traders will expect a 40 – 50 point pullback starting within a week. That target would correspond to last week’s low and the 20 day EMA.<h3>Buy vacuum test of all-time high</h3><p>Everyone sees the Emini getting vacuumed up to the 2956.00 all-time high. The rally is climactic. Therefore, at some point, the bulls will take profits. Once they do, the bull trend will probably convert into a trading range for 1 – 2 weeks.<p>That might come only after the Emini gets up to the old high. It is common for a rally to go sideways once it tests an important prior high. The bulls who bought lower take profits and the bulls who bought at the prior high are relieved to be able to sell out without a loss.<p>Traders then decide between a double top and a successful breakout to a much higher price. Less likely, it will break strongly above the old high without pausing or reverse down abruptly without going sideways first.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 7 points in the Globex session. Most days over the past 3 weeks have sold off and then reversed up. This has resulted in a continuation of the 4 week rally. Day traders therefore are looking for every sharp selloff to reverse up.<p>They will trade that way until one doesn’t. They need to see a relentless selloff with follow-through selling for 1 – 3 more days before they will believe that a bear leg has begun on the daily chart.<p>In addition to lots of bull reversals for several weeks, the Emini has also spent a lot of time in tight trading ranges. This is good for day traders who want to scalp with limit orders.<p>However, it reduces the number of reliable stop entries. Day traders have to patiently wait for strong signal bars and good patterns. Every day has had at least one swing and most days have had at least 2. This should continue.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-bear-trend-rsumtion-after-wedge-top.png\"><img src=\"2019-4-17.png\" alt=\"Emini bear trend resumption after wedge top\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/EURUSD-Forex-bull-leg-in-5-month-trading-range-awaiting-Brexit-news.png\"><img loading=\"lazy\" src=\"2019-4-17-1.png\" alt=\"EURUSD Forex bull leg in 5 month trading range awaiting Brexit news\"></a></figure><p>The EURUSD daily Forex chart has rallied for 3 weeks in a tight bull channel. However, it has been sideways for 4 days. Yesterday was an inside day and therefore a buy signal bar on the daily chart.<p>But, it had a bear body. Therefore, it is a weak buy setup. Consequently, there might be more sellers than buyers above its high. Today broke above yesterday’s high, which triggered the buy signal. However, it has pulled back below the high.<p>The daily chart has been sideways for 4 days, which is a tight trading range. It is also in the middle of a 5 month trading range. There is no energy. Traders do not sense that the price is horribly wrong. In fact, they think it is just about right. They therefore buy as it goes down and sell as it goes up.<p>They are confident that it will not go up too far or down too far, and therefore they take quick profits. This results in a continuation of the 5 month range.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 25 pip range for the past 6 hours. It broke above yesterday’s high, but pulled back.<p>Today might be forming a small double top with Friday’s high. Traders will watch for a reversal down. If one begins, the 1st target is a 50% retracement of the 3 week rally. Since that rally has been small and weak, that is only about 50 pips below. The next target for the bears is the April 1.1184 low.<p>The daily ranges have been small for several weeks. Furthermore, there has been little movement during the US session. Day traders are therefore scalping. There is no sign that this is about to change.<br><p>For the past 2 weeks, I have been writing that the selloff down to the April 2 low was a spike and channel sell climax. In addition, I said that there would typically be a rally to the March 26 top of the channel and then an evolution into a trading range. That is what is happening.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-outside-down-and-bear-trend-from-the-open.png\"><img loading=\"lazy\" src=\"2019-4-17-2.png\" alt=\"Emini outside down and bear trend from the open\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars.<br>Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini sold off from above yesterday’s high to below its low. Today is therefore an outside down day. Since there is an 8 day wedge rally, today is a sell signal bar for tomorrow. If there is a reversal down, it will probably be about 50 points and test last week’s low and maybe the March 21 high.<p>Whenever there is an outside down day, there is an increased chance of an inside day for the next day. The bulls will try to create a bull inside day tomorrow, which would be a buy signal bar for Monday. The Emini is closed on Good Friday.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-4-17"
    }
  ],
  "18": [
    {
      "data": [
        "<article class=\"post-88962 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini small wedge top could lead to 50 point pullback\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini small wedge top could lead to 50 point pullback</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-04-18T06:20:06-07:00\">April 18, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Thursday April 18, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini yesterday traded above Tuesday’s high and then below its low. Yesterday was therefore an outside down day. There is also an 8 bar wedge rally on the daily chart.<p>Because yesterday was an outside down day in a buy climax, it is a sell signal bar for today. However, the bull channel on the daily chart is tight. That reduces the chance of a sharp selloff. Instead, the Emini might go sideways for a few days before going down.<p>The day after a big outside day is often an inside day. If today stays inside of yesterday’s range and has a bull body, it will be a buy signal bar for Monday. The Emini is closed tomorrow for Good Friday.<p>In addition, the 60 minute chart has been in a small pullback bull trend for about 100 bars. That is a long time and therefore unsustainable and climactic.<p>A tight bull channel typically converts into a trading range. A reasonable target for a pullback would be the April 9 low, which is also a test of the March 21 high. Consequently, traders should look for about a 50 point pullback over the next week. The next targets are the March 21 high and the April 1 gap.<p>Attorney General Barr is releasing the Mueller report today at 6:30 a.m. PST. He is releasing the Mueller report around 8 am PST. That could be the catalyst for a selloff over the next week or two.<h2>Today is the last trading day of the week</h2><p>Since today is the last trading day of the week, its close is important. If the week closes below the open, there will be a bear bar on the weekly chart.<p>It would be the 3rd sell signal bar in 8 weeks and therefore there would be a wedge top. However, the weekly chart is in a strong bull trend. As a result, if the sell triggers next week, the selloff will probably be minor.<h3>Overnight Emini Globex trading</h3><p>The Emini reversed up from a selloff in the Globex session. It is now 5 points above yesterday’s close. Since it will probably open within yesterday’s range, there is an increased chance of an inside day. If there is going to be one and the day opens near the low, traders will look for an early low of the day.<p>Attorney General Barr speaks at 6:30 am PST today and he will release the Mueller report around 8 am PST today. Either could lead to a strong move up or down. The bulls want a break above yesterday’s high and then a test of the all-time high. But, there is a buy climax on the daily and weekly charts. That lowers the chance of a big rally today.<p>Because yesterday was a possible top in a sell climax, there is an increased chance of a big bear day after the Mueller report this morning. The bears want to trigger a sell signal by having the Emini break below yesterday’s low. There is an increased chance of a big bear trend today.<p>Trading range days are always more common. Consequently, even though there is a catalyst and an increased chance of a trend, the odds still favor at least one swing up and down.<h3>Bear channel is a bull flag</h3><p>Yesterday was a bear channel. A bear channel is a bull flag. That means that today will probably break above yesterday’s bear trend line. A channel typically converts into a trading range.<p>While there will probably be a big move up or down on the report early today, the odds still favor a lot of sideways trading today. The open of the week could be a magnet all day.<p>Today is the last trading day of the week. If the bears close the week below the open, this week will be a sell signal bar for next week on the weekly chart. But, it the bulls close the week above the open, the 4 month rally will probably continue up to test the all-time high over the next several weeks.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-outside-down-and-bear-trend-from-the-open.png\"><img src=\"2019-4-18.png\" alt=\"Emini outside down and bear trend from the open\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/EURUSD-Forex-breakout-below-bear-flag-but-in-trading-range.png\"><img loading=\"lazy\" src=\"2019-4-18-1.png\" alt=\"EURUSD Forex breakout below bear flag but in trading range\"></a></figure><p>The EURUSD daily Forex chart rallied for 2 weeks in a weak bull channel after a strong selloff in late March. A bull channel is a bear flag. The bears broke below the bull channel overnight.<p>But, they have not yet broken below the 5 month trading range. Traders want to see consecutive closes below the bottom of the range before they will conclude that the trading range has converted into a trend.<p>Until then, they will buy every selloff, sell every rally, and take quick profits. This is because they are correctly betting that reversals are more common than breakouts when there is a trading range.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart sold off strongly on the start of the European session. Since then the 5 minute chart hast been in a 20 pip trading range.<p>Everyone sees the break below the 2 week bull trend line. Everyone knew that the bull channel was likely to have a bear breakout. Therefore, this selloff is a test of the April low. What traders want to see is either a strong break below or a strong reversal up.<p>Because reversals are more common than breakouts when there is a trading range, traders expect a reversal up from somewhere around the April low. While it could come today, that is unlikely. The overnight momentum was strong enough to make at least a small 2nd leg down likely. Consequently, traders will look to sell rallies.<p>But, since the chart has been in a tight range for 5 hours, day traders will also look to buy reversals up for scalps. Since a 2nd led down over the next few days is likely, it will probably be easier to make money selling rallies.<p>Finally, there has been very little movement in the US session over the past several weeks. The big moves have been coming in the European session. As a result, US day traders expect to scalp, even after a big selloff, like this one. However, Attorney General Barr’s announcement at 6:30 am PST or the release of the Mueller report around 8 am PST could lead to a strong move up or down today.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-bull-trend-reversal-day.png\"><img loading=\"lazy\" src=\"2019-4-18-2.png\" alt=\"Emini bull trend reversal day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>Most days over the past 3 weeks sold off and then reversed up. Today was another example. What is different now is yesterday’s selloff. It was strong enough to have a 2nd leg down early next week. Despite today’s strong rally, the bears will look for a lower high major trend reversal on the 60 minute chart next week. If they get a good sell signal bar, they will expect about a 50 point selloff from Wednesday’s high.<p>The bulls are hoping that today’s reversal up will have follow-through on Monday. They want the 4 week rally to reach the old high without a deeper pullback.<p>Today is a buy signal bar for Monday. Since it was a doji bar and yesterday was a bear bar on the daily chart, it is a weak buy setup. There might be more sellers than buyers on Monday above today’s high.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-4-18"
    }
  ],
  "20": [
    {
      "data": [
        "<article class=\"post-88971 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini minor reversal from April parabolic wedge buy climax\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini minor reversal from April parabolic wedge buy climax</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-04-20T00:30:36-07:00\">April 20, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Market Overview: Weekend Market Update</h2><p>The<strong>Emini</strong>is in a strong rally on all time frames. Wednesday’s big outside down day in a parabolic wedge rally and the bear body on the weekly chart make a minor reversal likely soon. It might have begun on Wednesday.<p>The<strong>crude oil</strong>rally is near a measured move target. Traders should expect that the two week tight trading range will probably be the Final Bull Flag before there is a pullback to around $60.<p>The<strong>EURUSD</strong>Forex market has been in a tight trading range for 5 months. However, since the bulls have been unable to get consecutive closes above the 20 week EMA, a bear breakout is slightly more likely than a bull breakout.<h2><strong>Crude oil Futures market:</strong><br>Possible Final Bull Flag at Measured Move target</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Crude-oil-futures-daily-chart-in-bull-trend-but-final-flag.png\"><img loading=\"lazy\" src=\"2019-4-20.png\" alt=\"Crude oil futures daily chart in bull trend but final flag\"></a></figure><p>The crude oil futures market has been in a strong bull trend for 4 months. The daily chart has been sideways for 2 weeks. This is therefore a bull flag. With a measured move target just 26 cents above the top of the bull flag, crude oil will probably reach the target next week. But, what then?<p>A tight trading range late in a bull trend is often the Final Bull Flag. Because the market has been sideways, traders think that the current price is fair. If there is a bull breakout, crude oil will be above a fair price. Also, many bulls will take profits at the measured move target. Consequently, the small trading range is a good candidate for the Final Bull Flag.<h3>Final Bull Flag</h3><p>When looking at any bull trend of any market, once there is a trend reversal, look back at the final bull flag. It is often a tight trading range just below resistance. Therefore, when traders see a flag like this in a buy climax, they know that many bulls will take profits on a breakout above the bull flag. If there is heavy profit-taking, there will be a swing down.<p>It sometimes is the start of a bear trend. But, when the bull channel is tight, like the one in crude oil, a conversion into a trading range is more likely. As a result, traders will look for a reversal down from around 65.<p>If there is a big bear bar or several consecutive small bear bars, traders will conclude that strong profit-taking is underway. At a minimum, they will expect at least a couple legs down to support.<p>The first support is the March 21 high of 60.39. That is the breakout point of the current 3 week breakout. Traders should expect a test down to around 60 in the next couple of weeks.<p>If the reversal down is strong and falls far below 60, the next support is the March 1 high at 60.39. That is also a breakout point. Below that is the March 8 low just below 55.<h3>How high can a buy climax go?</h3><p>Suppose that the past 2 weeks is not the Final Bull Flag. How high can the rally go? There is no limit, but the current rally is extreme. That means that it will attract an increasing number of profit takers. Also, the bears will begin to bet on a reversal down from a buy climax.<p>That is why a pullback is likely soon. The pullback could simply be a tight trading range that lasts for a few weeks. More likely, it will test at least down to 60, just below the most recent breakout point.<p>When bulls take profits after a big rally, they are not looking to buy again a few bars later. They would simply hold long. Profit-takers want to wait to see how much profit-taking will take place. They typically will wait 10 or more bars and for at least a couple legs down.<p>At that point, if the selling is stopping, the bulls will buy above a bull bar and bet on a resumption of the rally. When a buy climax is as extreme as this one has been, the pullback will likely continue sideways to down for a month or more.<p>Until there is a clear top or a strong reversal down, the bulls will continue to buy. However, a potential Final Bull Flag just below a Measured Move target typically leads to profit taking. Consequently, traders will look for a short-term top within the next couple weeks.<h2><strong>EURUSD weekly Forex chart:</strong><br>Tight trading range, but holding below 20 week EMA</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/EURUSD-weekly-Forex-chart-in-weak-bear-channel.png\"><img loading=\"lazy\" src=\"2019-4-20-1.png\" alt=\"EURUSD weekly Forex chart in weak bear channel\"></a></figure><p>The EURUSD daily Forex chart has been in a tight trading range for 5 months. It has reversed directions every 2- 3 weeks during that time. It is still in Breakout Mode.<p>Typically, the probability of the breakout for the bulls and for the bears is 50%. However, the chart continues to make at least slightly lower highs and lows. In addition, it has not had consecutive closes above the 20 week EMA in over a year. Consequently, the bears have a slightly higher chance of a downside breakout.<p>But, not much. If there was a clear consensus among traders that there would be a bear breakout, the breakout would be underway. The lack of a breakout indicates that the bulls have almost the same chance as the bears.<p>Traders need to see consecutive closes above or below the range before concluding that the trading range has converted into a trend. Until then, they will continue to look for reversals every 2 – 3 weeks.<h2><strong>Monthly S&amp;P500 Emini futures chart:</strong><br>Strong rally to the top of the 16 month trading range</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-monthly-candlestick-chart-testing-all-time-high.png\"><img loading=\"lazy\" src=\"2019-4-20-2.png\" alt=\"Emini monthly candlestick chart testing all-time high\"></a></figure><p>The monthly S&amp;P500 Emini futures chart has rallied for 4 months after reversing up from its bull trend line. However, it is now at the top of the 16 month trading range. It has sold off twice from here in the past 16 months. Consequently, traders are not yet convinced that the rally will break strongly above the September all-time high.<p>Prior to this month, the bodies of the past 3 months have been shrinking. This indicates a loss of momentum as the Emini gets higher. So far, April’s body is bigger than March’s. If it is this way at the end of the month, traders will conclude that the momentum up is resuming. It will make a new all-time high likely either in April or May.<p>But, the month is only half over. This month could look very different on April 30 once it closes.<p>For example, the open of the month is 2859.00. That is only about 50 points below this week’s close. A few bear days could easily drop the Emini back below the open of the month. That would increase the chance of a 1 – 2 month pullback before there is a new all-time high.<p>While the month is good for the bulls at this point, traders should reserve judgement until the month closes.<h3>Can the rally fail?</h3><p>Most breakout attempts fail. However, this rally might be a resumption of the 10 year bull trend after a couple legs down to the bull trend line.<p>If there is a strong breakout to a new high, traders would look for a measured move up based on the height of the 16 month trading range. The measured move target would be 3400 or 3600, depending on whether traders are looking at the February 2018 or December lows.<p>If there is not a strong breakout to a new high, traders will conclude that the 16 month trading range could last many more months. A reversal down from below the old high would be the right shoulder of a head and shoulders top. If there is a reversal down from above the September high, there would be an expanding triangle top.<p>Since trading ranges resist breaking out, if there is a reversal down, a bear leg in the 16 month range is more likely than a strong break below the December low.<p>The 4 month rally has been strong. Traders will expect at least a micro double top before there is a significant selloff. Consequently, the downside risk over the next couple of months is small. The best the bears will probably see is a test of 2700 before the bulls regain control.<h2><strong>Weekly S&amp;P500 Emini futures chart:</strong><br>Strong rally, but shrinking bodies and micro wedge</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-weekly-candlestick-chart-losing-momentum-at-all-time-high.png\"><img loading=\"lazy\" src=\"2019-4-20-3.png\" alt=\"Emini weekly candlestick chart losing momentum at all-time high\"></a></figure><p>The weekly S&amp;P500 Emini futures chart has been in an extremely strong bull trend for 4 months. There have only been 2 pullbacks and each lasted only one week.<p>A bull trend that is in a tight bull channel like this typically has to stop going up before it can reverse down. Therefore, the weekly chart will probably have to enter a trading range before the bears can get more than a few consecutive down weeks.<h3>Surprise Bars trap both bulls and bears</h3><p>The bears tried to get a top 5 weeks ago. After the sell signal trigger, the Emini reverse up surprisingly sharply for 4 weeks.<p>Bull Surprise Bars typically trap bulls out. They were not expecting such a strong rally and many missed the move. They now want a pullback since they expect at least a small 2nd leg up.<p>Bull Surprise Bar also trap bears. They sold 5 weeks ago, expecting at least a few weeks down. Instead, the Emini broke far above the high from 5 weeks ago. Many of these bears are now trapped into a bad short. They are hoping for a pullback so that they can buy back their shorts with a smaller loss.<p>With both bulls and bears eager to buy a pullback, the odds are against a bear trend reversal over the next several weeks. The best the bears can probably get is a few weeks down.<p>If they get it, they will then hope that the bull trend is converting into a trading range. Once it is in a trading range, they will have a better chance of a swing down.<h2><strong>Daily S&amp;P500 Emini futures chart:</strong><br>Emini minor reversal from April parabolic wedge buy climax</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-daily-candlestick-chart-has-outside-down-reversal-in-buy-climax.png\"><img loading=\"lazy\" src=\"2019-4-20-4.png\" alt=\"Emini daily candlestick chart has outside down reversal in buy climax\"></a></figure><p>The daily S&amp;P500 Emini futures chart has rallied in a tight bull channel for 4 months. The biggest pullback lasted 4 days. All of the other pullbacks ended after a day or two.<p>Wednesday formed a bear outside down day. It closed below Tuesday’s low. It also was the 3rd push up in a month-long wedge rally. Wednesday was a sell signal bar. When Thursday traded below Wednesday’s low, it triggered the minor sell signal.<p>However, instead of a 2nd consecutive big bear day, Thursday closed near its high. Not only is that a bad entry bar for the bears, it is now a High 1 bull flag for the bulls.<p>But, it had a bear body. In addition, it was the 4th consecutive bear day. It is therefore a weak buy signal bar in a weak buy setup. There are probably more sellers than buyers above its high.<h3>Is a 50 – 100 point pullback underway?</h3><p>The bears need a lower high or micro double top this week. They then need a strong break below this week’s low. If they get it, traders will conclude that a bigger pullback has begun.<p>The first target for the bears is the March 21 high of 2866. That is the most recent breakout point. There were pullbacks below the breakout points after both the March 4 and March 21 highs. Consequently, the odds are that this breakout will pull back as well.<p>The rally has had 3 legs up since March 4. Since it is in a tight bull channel, this is a parabolic wedge rally. That is a buy climax. If there is a reversal, it will likely have at least 2 small legs down.<p>There is currently a 40% chance of a selloff to the start of the wedge. That is the March 8 low of 2726.50<p>The bears have a credible start for the pullback. However, if the bulls break strong above Wednesday’s high, the Emini will probably continue up to the all-time high before the bears try again.<hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-4-20"
    }
  ],
  "22": [
    {
      "data": [
        "<article class=\"post-88968 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini buy climax on 60 minute chart might form lower high\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini buy climax on 60 minute chart might form lower high</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-04-22T06:20:20-07:00\">April 22, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Monday April 22, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Most days over the past 3 weeks sold off and then reversed up. Thursday was another example. That reversal at the end of the week converted a developing strong bear bar on the weekly chart into a bear doji bar. Last week is now a weak sell signal bar on the weekly chart.<p>Thursday is a buy signal bar on the daily chart. But it is a bear doji and it followed a big bear bar. Since that is a weak buy setup, there will probably be more sellers than buyers above its high.<p>The 60 minute chart has been in a Small Pullback Bull Trend for about 100 bars. Since that is unusual, it is unsustainable and climactic. The odds favor a conversion into a trading range. That might have begun with Wednesday’s selloff. Traders will find out this week.<p>At the moment, the odds favor a 2nd leg down on the 60 minute chart. When a Small Pullback Bull Trend converts into a trading range, it does so with a bigger pullback. Typically, one that is about twice as big as the biggest pullback in the trend. Therefore, the odds slightly favor about a 40 – 50 point pullback this week.<p>But, the bull trend has been exceptionally strong. The Emini could easily continue up to the all-time high without a bigger pullback. What happens over the next couple of days should tell traders which outcome is more likely.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 9 points in the Globex session. Because of the 60 minute chart’s buy climax, the odds favor at least a 50 point pullback this week. It could come in the form of one or more big bear trend days or in a channel that just drifts down. Wednesday might have been a bear spike in a spike and channel bear trend on the 60 minute chart.<p>With most of the days over the past 3 weeks having swings up and down and lots of overlapping days, a channel down is more likely than a collapse. This means that the 5 minute chart will probably continue to have lots of trading range days, but begin to form lower highs and lows.<p>There is always a bull case, especially with the daily chart being in a strong bull trend. The bulls obviously want a strong break above the all-time high. Bull trends often have unusually big bull bars late in the trend. They typically are exhaustive and lead to a pullback. However, day traders should be aware that there is always an increased chance of a big bull day when the daily chart is in a bull trend.<h2>Thursday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-bull-trend-reversal-day.png\"><img src=\"2019-4-22.png\" alt=\"Emini bull trend reversal day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from last Thursday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/EURUSD-Forex-double-bottom-pullback-and-major-trend-reversal.png\"><img loading=\"lazy\" src=\"2019-4-22-1.png\" alt=\"EURUSD Forex double bottom pullback and major trend reversal\"></a></figure><p>The EURUSD daily Forex chart sold off strongly on Thursday but formed a bull inside bar on Friday. Friday is a buy signal bar for a failed bear breakout. The bulls see Thursday as another test of the bottom of the 5 month trading range.<p>But this one is forming a special pattern. It is a Double Bottom Pullback and a higher low major trend reversal. The bulls needed a bull bar closing on its high on Friday and got it. Next, they needed today to trade above Friday’s high. They got that as well. Finally, they need a reversal up this week.<p>The bears hope that Friday and yesterday will form a bear flag below the 20 day EMA. They then want a break below the double bottom. Finally, they need consecutive closes below the double bottom. They would prefer to have closes far below the trading range. If they get all of this, traders will conclude that the 5 month trading range has ended and the 2018 bear trend is resuming.<p>However, trading ranges resist breaking out. I have made this point many times over the past 5 months. I keep saying that reversals are more likely than breakouts. That is still the case.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart traded above Friday’s high and therefore triggered a buy signal today. It would be better for the bulls if today closes near its high and above Friday’s high.<p>Sometimes a successful buy signal immediately forms a big bull bar. At other times, it forms a few small bars and then a big bull trend day. In either case, there is an increased chance of one or more big bull trend days this week.<p>The bears need to prevent the bulls from getting bull bars on the daily chart. They therefore will sell whenever the chart is at a prior high on the 5 minute chart. They need to form bear trend bars on the daily chart or at least bars that close below their midpoints. That would lead to a credible sell signal bar on the daily chart. They then will try to get one or more big bear trend days that break below the March low.<p>While the overnight rally has only been 30 pips, it has been in a tight bull channel. This is good for the bulls. It makes it hard for bears to make money. It therefore increases the chance that the daily chart is reversing up.<p>As long as the 5 minute chart continues in a tight bull channel today, day traders will only buy. Day traders will buy for scalps and traders on the daily chart will buy for a reversal up. The bears need to stop the buying and create a trading range. If they are successful, day traders will begin to sell for scalps today.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/emini-bull-trend-resumption.png\"><img loading=\"lazy\" src=\"2019-4-22-2.png\" alt=\"\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini gapped down on the 5 minute chart. After rallying to the 60 minute EMA, it entered a tight trading range. The bull trend resumed up at the end of the day. By going above Thursday’s high, the Emini triggered a High 1 bull flag buy signal on the daily chart.<p>Last week reversed down from a nested wedge top on the 60 minute chart. Typically, there is a 2nd leg down. Traders will find out tomorrow or Wednesday if the bull trend on the daily chart is resuming or a 2nd leg down on the 6 minute chart will begin.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-4-22"
    }
  ],
  "23": [
    {
      "data": [
        "<article class=\"post-89148 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini nested wedge top on 60 minute chart at 2900\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini nested wedge top on 60 minute chart at 2900</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-04-23T06:20:44-07:00\">April 23, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Tuesday April 23, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Tuesday gapped down on the 5 minute chart and reversed up to the 60 minute EMA. It then entered a trading range. By going above Thursday’s high, the Emini triggered a buy signal on the daily chart. The bulls still see the 2 day selloff as a pullback in a rally to a new all-time high.<p>However, the 60 minute chart has a nested wedge top and Wednesday was a strong bear day. There is typically a 2nd leg down from a wedge top. Traders will find out today or tomorrow if the 60 minute chart’s top or the daily chart’s bull flag will control the next week or two.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 1 point in the Globex session. The Emini has been sideways for 6 days. Furthermore, most days over the past month have had at least one swing up and one swing down. This trading range price action is likely to continue again today.<p>As always, traders will be ready for a surprisingly big move up or down. But, “surprisingly” means that trading range price action is more likely.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/emini-bull-trend-resumption.png\"><img src=\"2019-4-23.png\" alt=\"emini bull trend resumption\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/EURUSD-Forex-triangle-within-5-month-trading-range-so-breakout-mode.png\"><img loading=\"lazy\" src=\"2019-4-23-1.png\" alt=\"EURUSD Forex triangle within 5 month trading range so breakout mode\"></a></figure><p>The EURUSD daily Forex chart has pulled back from a breakout below last week’s bear flag. The 2 day rally is therefore a small bear flag.<p>However, there was a higher low double bottom on April 2. In addition, last week’s sell climax formed another higher low. When there are 5 legs in a trading range and higher lows and a lower high, there is a triangle. That is a Breakout Mode pattern. It is within a 5 month trading range, which is a bigger Breakout Mode pattern.<p>Everyone knows that there will be a breakout. But it is a mistake to assume that the odds of a bear breakout are much higher than those of a bull breakout. The chart could not be going sideways if traders felt that one side had a significant advantage. Until there is a breakout, there is no breakout. The bears and bulls have almost exactly the same odds.<p>When there is a Breakout Mode pattern, the 1st breakout fails and reverses 50% of the time. The successful breakout has a 50% chance of being either down or up. In the meantime, traders will continue to bet on reversals.<h3>Bear flag on daily and weekly charts</h3><p>The EURUSD Forex chart broke below yesterday’s low 15 minutes ago. This triggered a sell signal on the daily chart. But, the 2 day bear flag was made of 2 bull bars. That is a weak sell setup and so far, the breakout is small. There might be more buyers than sellers below yesterday’s low. If this is a failed breakout, the reversal back up might not come until tomorrow.<p>On the weekly chart, last week was a bear bar closing near its low and below the 20 week EMA. It is a sell signal bar. Today’s selloff also broke below last week’s low. This therefore triggered a weekly sell signal.<p>However, the weekly chart is in a tight trading range. Every breakout up and down over the past 5 months reversed within a week. Traders will expect this one to reverse as well.<p>But, this is the longest trading range in over 2 years. Therefore, traders know that a successful breakout is likely soon. If today’s breakout continues to grow and if there are two closes below the March low on the daily chart, traders will conclude that a bear trend has begun.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a bear breakout over the past 30 minutes. It triggered daily and weekly sell signals. So far, the bars and the breakout are not big.<p>However, traders know that the 5 month trading range is extreme. There is therefore an increased chance of a successful breakout. If the EURUSD 5 minute chart accelerates down or trends down relentlessly today, it will have an increased chance of being the start of a successful breakout. If so, there will be many bear trend days over the next few weeks.<p>It is important to remember that every breakout over the past 5 months failed. Even though a successful breakout is overdue, the odds continue to favor failed breakouts until there are 2 consecutive closes on the daily chart below the trading range.<p>At the moment, traders will sell rallies today. However, if the legs down are small, traders will conclude that this breakout will fail. If this breakout begins to go sideways, day traders will look to buy a reversal up.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-bull-trend-from-the-open.png\"><img loading=\"lazy\" src=\"2019-4-23-2.png\" alt=\"Emini bull trend from the open\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini had an early rally with 6 big bear bars. That typically results in a trading range. Instead, the bulls got a strong breakout and formed a Small Pullback Bull Trend. This ended with a buy climax and then a tight trading range.<p>Since the trend was a surprise, the odds favor at least a small 2nd leg up this week. Because the high was only about 16 points below the all-time high, the Emini will probably get there this week.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-4-23"
    }
  ],
  "24": [
    {
      "data": [
        "<article class=\"post-89152 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini bull surprise bar just below all-time high\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini bull surprise bar just below all-time high</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-04-24T06:20:39-07:00\">April 24, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Wednesday April 24, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday was an extremely strong bull trend after a 6 day pause in the bull trend. Its high was about 16 points below the all-time high.<p>The bears had a credible minor top last Wednesday. Yesterday broke far above that high. Because the size of yesterday’s trend was a surprise, the odds favor at least a small 2nd leg up within a few days. It might come today. If so, today could break to a new all-time high.<p>Because yesterday was climactic on the 5 minute chart, there is a 75% chance of at least a couple hours of sideways to down trading today that begins by the end of the 2nd hour.<h3>Overnight Emini Globex trading</h3><p>The Emini is unchanged in the Globex session. It will probably open within yesterday’s 4 hour trading range. The day after a huge day is often a small trading range day. A trading range day has at least one small swing up and one small swing down.<p>The all-time high is only 16.25 points above yesterday’s high. That is within reach today. However, yesterday’s 4 hour trading range means that the bulls are exhausted. They therefore might wait a few days before buying aggressively again and getting a new high.<p>Can today be a big trend day? After yesterday’s 4 hour tight trading range and with the all–time high not far above, today will probably not be another big bull day. With the all-time high an obvious magnet above and with yesterday’s strong momentum up, today will probably not be a big bear day. The bulls and bears will both probably be cautious. This increases the chance of a smaller day today with legs up and down.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-bull-trend-from-the-open.png\"><img src=\"2019-4-24.png\" alt=\"Emini bull trend from the open\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/EURUSD-Forex-triangle-in-5-month-trading-range.png\"><img loading=\"lazy\" src=\"2019-4-24-1.png\" alt=\"EURUSD Forex triangle in 5 month trading range\"></a></figure><p>The EURUSD daily Forex chart has been in a trading range for 5 months and a triangle for 1 month. This is the longest trading range in 2 years and therefore the odds favor a breakout soon.<p>Trading ranges always look bearish when the market is near the bottom and bullish near the top. However, they could not continue if either side had a significant advantage. Consequently, traders will continue to bet on reversals until there is a clear breakout. They typically want to see consecutive closes above or below the range before they will switch to trend trading.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 30 pip range overnight. In addition, it is within yesterday’s range. Because it is testing the low of the 5 month range, traders are prepared for either a reversal or a breakout. Either could lead to a big trend day.<p>More likely, today will continue to be quiet. The bulls will try to get the day to close above the open. It would then be a bull inside bar on the daily chart. In addition, it would form a micro double bottom with yesterday’s low. This would be a buy signal for a reversal up from the bottom of the 5 month range.<p>The bears always want the opposite. Not only do they want a bear day on the daily chart, they would prefer to get the day to close on its low. Today would then be a sell signal bar on the daily chart. This would increase their chance of breaking below the 5 month range tomorrow. They then would hope for a series of bear days over the next few weeks.<p>Because today so far is small, traders are probably looking at it as a potential buy or sell signal bar for tomorrow on the daily chart. The bulls will buy dips and try to get the day to close near the high. The bears will sell rallies and try to get the day to close near its low. While a breakout could come today, it is unlikely with the bars and range as small as they are.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-trading-range-day-after-buy-climax-test-of-all-time-high-3.png\"><img loading=\"lazy\" src=\"2019-4-24-2.png\" alt=\"Emini trading range day after buy climax test of all-time high\"></a></figure><p>Today was a small trading range day after yesterday’s strong bull trend day. There were expanding triangle tops and bottoms. The bulls see today as a buy signal bar for tomorrow. However, the bears see it as a sell signal bar for a failed breakout.<p>But, when a breakout is as big as yesterday’s was, there is typically at least a small 2nd leg up. Consequently, there are probably buyers not too far below today’s low.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-4-24"
    }
  ],
  "25": [
    {
      "data": [
        "<article class=\"post-89155 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini pullback from test of 2956 all-time high\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini pullback from test of 2956 all-time high</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-04-25T06:20:40-07:00\">April 25, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Thursday April 25, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini formed a trading range day yesterday after Tuesday’s big bull breakout. Because it is a pause after a breakout, it is a High 1 bull flag buy signal bar for today. But the bear body makes it a weak buy signal bar.<p>When a breakout is big, the Emini often has to go sideways for several days before the bulls will buy again. They will probably get their test of the all-time high within the next week. Traders might be waiting for next Wednesday’s FOMC meeting.<p>The bears hope that Tuesday was a blow-off top. They see yesterday as a sell signal bar for today. However, when a breakout is as big as Tuesday was, the bears typically need a micro double top before they can get a reversal down. Consequently, there will probably be more buyers than sellers below yesterday’s low.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 1 point in the Globex session. It is 24 points below the all-time high. That is an important resistance level and therefore a strong magnet.<p>The Emini is close enough so that it will probably be unable to escape the magnetic pull. Traders expect a test of that high within a week. There is therefore an increased chance of a big trend day up or down on any day over the next week.<p>Since the Emini has been in a tight trading range for a day and a half, the odds favor more sideways trading today. Traders might be waiting for next Wednesday’s FOMC meeting before testing the September high.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-trading-range-day-after-buy-climax-test-of-all-time-high-3.png\"><img src=\"2019-4-25.png\" alt=\"Emini trading range day after buy climax test of all-time high\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/EURUSD-Forex-breakout-below-5-month-trading-range-3.png\"><img loading=\"lazy\" src=\"2019-4-25-1.png\" alt=\"EURUSD Forex breakout below 5 month trading range\"></a></figure><p>The EURUSD daily Forex chart broke below the 5 month trading range yesterday. So far, today is a 2nd consecutive bear trend day. It today has a bear body on the daily chart, it will confirm the breakout.<p>That means the odds would favor a swing down to around measured move targets. The nearest one is 243 pips below the March 7 low of 1.1177. That low is the neck line of the February 28 and March 20 double top. The target would be 1.0944.<p>If the selloff continues below that target, the next one is based on the height of the 5 month trading range. Some computers will use the November 12 low and others will use the March 7 low. That means traders would look for about 350 pips below the March 7 low, or about 1.08.<p>Another reasonable target is based on the June and September double top. The neck line is the August 1.1301 low. The projection is 550 pips below that low, or around 1.0750.<p>What if the bulls get a strong bull trend reversal today? They would need several bull days to undo this bear breakout. The weekly chart has been in a bear channel for 10 months. It would take a rally above the January high to convert the channel into a trading range.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart sold off 40 pips overnight. However, the selloff lacked consecutive big bear trend bars. It therefore is not a strong bear trend. Bull day traders therefore will buy for scalps today. They would like a bull trend reversal day today to avoid a bear body.<p>But, the small bars and prominent tails are a sign of a lack of energy. There is no sense that the price is terribly wrong. That reduces the chance of a big move up or down. However, the lack of conviction means that today will probably not close on its low.<p>The bears will sell rallies. Their minimum goal is a bear body on the daily chart. The do not need the selloff to continue lower today. If the day closes around its current level, today would be a strong follow-through bar on the daily chart. That would increase the chance of lower prices over the next month or two.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p>Note: Al is traveling so no chart and End of Day summary for today.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-4-25"
    }
  ],
  "28": [
    {
      "data": [
        "<article class=\"post-89319 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini testing all time high ahead of May FOMC announcement\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini testing all time high ahead of May FOMC announcement</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-04-28T00:30:24-07:00\">April 28, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Market Overview: Weekend Market Update</h2><p>The<strong>Emini</strong>rally has been very strong. Traders expect a new all-time high this week. Even if there is profit-taking, the 1st reversal down will probably only be minor.<p><br><strong>Crude oil</strong>finally reached its highest reasonable target this week. I have been writing every week for 4 months that higher prices are likely. Now, there will probably be at least a 2 week pullback to $60.<p>The<strong>EURUSD</strong>weekly Forex chart has been in a tight bear channel for 10 months. It also has been in a tight trading range for 5 months. This week broke below the range. Traders expect lower prices, even if there is a bounce for a week or two.<h2><strong>Crude oil Futures market:</strong><br>Start of pullback to $60 breakout point</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Crude-daily-chart-breaking-below-bull-trend-line-1.png\"><img loading=\"lazy\" src=\"2019-4-28.png\" alt=\"Crude daily chart breaking below bull trend line\"></a></figure><p>The crude oil futures turned down this week with a big bear trend bar on the daily chart. This will probably lead to at least a couple small legs down to 60.00 over the next 2 weeks.<p>Once there is profit taking after a buy climax, the chart usually enters a trading range. The pullback could last a couple of months. It might even test the start of the channel at the March 8 or January 14 lows.<p>In December, I said that the December trading range would probably be the Final Bear Flag. For the past 4 months, I wrote every week that there was no top, and that the rally would continue. Last week, I said that the rally would probably end around the 65 measured move target.<p>Friday’s big bear bar is a sign that the bulls are taking profits. Those who did not now expect a 2nd leg down. They will use a bounce to sell out of their longs.<p>Friday was a surprisingly big bear day in a buy climax. A Bear Surprise bar typically leads to at least 2 legs down. Traders will sell rallies for at least a couple weeks.<h2><strong>EURUSD weekly Forex chart:</strong><br>Trading range breakout and 10 month tight bear channel</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/EURUSD-weekly-Forex-chart-breaking-below-5-month-trading-range.png\"><img loading=\"lazy\" src=\"2019-4-28-1.png\" alt=\"EURUSD weekly Forex chart breaking below 5 month trading range\"></a></figure><p>The EURUSD weekly Forex chart has been in a bear channel for 10 months. It has also been in a tight trading range for 5 months. This week broke below the bottom of the trading range. The odds favor lower prices.<p>However, if next week is a bull bar, there will probably be a 1 – 2 week bounce 1st. Every move up and down for 10 months has lasted only 1 – 3 weeks. This one might as well. But, because of the bear channel, traders will expect the sequence of lower highs and lows to continue. One caveat is Wednesday’s FOMC announcement could be a catalyst for a big move up or down.<p>On the daily chart, there were consecutive closes below the March low. That increases the chance of a swing down that has at least 2 small legs. The bears want a 400 pip measured move down over the next couple of months. This is based on the height of the 5 month trading range.<h2><strong>Monthly S&amp;P500 Emini futures chart:</strong><br>Emini testing all time high ahead of May FOMC announcement</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-monthly-candlestick-chart-in-buy-climax-test-of-all-time-high.png\"><img loading=\"lazy\" src=\"2019-4-28-2.png\" alt=\"Emini monthly candlestick chart in buy climax test of all-time high\"></a></figure><p>The monthly S&amp;P500 Emini futures chart has 2 trading days left in the month. April will probably remain as the 4th consecutive bull trend bar. The magnets above are the all-time high and the 3,000 Big Round Number. After 4 strong bull bars, the bears will probably need at least a micro double top before they can get more than a 1 – 2 month pullback.<p>It is important to realize that the 16 month trading range might be the Final Bull Flag. If the bulls get their breakout to a new all-time high, the bears will be ready to sell if they see aggressive profit taking by the bulls.<p>This is a monthly chart. Consequently, the several bars required for a reversal means the downside risk is small for the next couple months.<p>A reversal down from above the September high would form an Expanding Triangle top. The target for the bears is the bottom of the triangle, which is the December low. That is probably too far to reach in 2019. More likely, the bulls will buy and create a higher low after a 33 – 50% pullback.<p>The 4 month rally and the 10 year bull trend are strong. Consequently, the bears will probably need at least a micro double top before they can get a reversal down. Since this would take a few months, the downside risk is small for the next couple months.<h2><strong>Weekly S&amp;P500 Emini futures chart:</strong><br>Strong rally should test all-time high this week</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-weekly-candlestick-chart-in-buy-vacuum-test-of-all-time-high.jpg\"><img loading=\"lazy\" src=\"2019-4-28-3.jpg\" alt=\"Emini weekly candlestick chart in buy vacuum test of all-time high\"></a></figure><p>The weekly S&amp;P500 Emini futures chart had a couple reversal attempts in March. The bulls quickly bought them. With the pullbacks lasting only 1 bar, the best the bears can probably get over the next several weeks is a 3 week pullback.<p>Even then, the bulls will buy it. A strong trend typically needs at least a micro double top, like the September high, before there is a swing down. Less often, there will be a blow-off top like in January 2018.<h2><strong>Daily S&amp;P500 Emini futures chart:</strong><br>Small Pullback Bull Trend ahead of May FOMC</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-daily-candlestick-chart-in-Small-pullback-bull-trend-1.png\"><img loading=\"lazy\" src=\"2019-4-28-4.png\" alt=\"Emini daily candlestick chart in Small pullback bull trend\"></a></figure><p>The daily S&amp;P500 Emini futures chart is in a Small Pullback Bull Trend. It will probably break to a new all-time high this week. However, if there is not a close far above the old high, the rally will probably attract some profit-taking. This could lead to a test of the March 21 high within a couple weeks.<p>Wednesday’s FOMC announcement always can lead to a surprisingly big move that can last for several days. The bulls hope for the rally to continue to above 3,000 before there is a pullback. However, the bears want a double top with the September high.<p>With the bull channel as tight as it is, the bulls will likely need at least a micro double top before there is a test back to 2800. In addition, when a channel is tight, the 1st reversal typically is minor. Consequently, the best the bears will probably get over the next few weeks is a trading range, not a bear swing.<p>Traders are aware of the adage, “Sell in May and go away.” There is a tendency for sideways to down trading in May and June. But, the 4 month rally has been extremely strong. Even if the bears were to get a 50% correction lasting several months, there will be eager bulls looking to buy it.<hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-4-28"
    }
  ],
  "29": [
    {
      "data": [
        "<article class=\"post-89159 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini small pullback bull trend near 2956 all-time high\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini small pullback bull trend near 2956 all-time high</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-04-29T06:20:54-07:00\">April 29, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Monday April 29, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini rallied in a Small Pullback Bull Trend on Friday. This is within a month-long Small Pullback Bull Trend on the daily chart. While there might be profit-taking around the September all-time high, the odds are that the best the bears will get is a couple weeks of a pullback to around the March 21 high. That was the breakout point of the rally of the past 3 weeks.<p>Everyone is aware of the all-time high 2956.00 magnet just above. Even if there is profit-taking, the bulls will probably get closer before they take profits. In addition, a strong rally like this often ends with a blow-off top. The odds continue to favor higher prices.<p>It is important to note that the Emini might start to go sideways ahead of Wednesday’s FOMC announcement. That could lead to either a strong break above or reversal down. But, because the bull trend is so strong, the bulls will buy any 1 – 3 week selloff.<h3>Overnight Emini Globex trading</h3><p>The Emini is unchanged in the Globex session. After a big bull day on Friday, there is an increased chance of exhaustion. That typically results in a small day and a close around the open. But the all-time high magnet is only about 13 points above. The Emini could quickly get there any day this week.<p>Tomorrow is the last day of the month. Most bars on all time frames have at least a small conspicuous tail on the top and bottom. Currently, the April bar has no visible tail on the monthly chart. There is therefore an increased chance of a 10 – 20 point pullback by tomorrow’s close.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-High-2-bottom-and-Small-Pullback-Bull-Trend.png\"><img src=\"2019-4-29.png\" alt=\"Emini High 2 bottom and Small Pullback Bull Trend\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/EURUSD-Forex-pause-after-breakout-below-trading-range.png\"><img loading=\"lazy\" src=\"2019-4-29-1.png\" alt=\"EURUSD Forex pause after breakout below trading range\"></a></figure><p>The EURUSD daily Forex chart had consecutive closes below the 5 month trading range last week. That increases the chance of a swing down over the next month or two.<p>The chart has also been in a tight bear channel for 10 months. There have been many legs up and down lasting 1 – 3 weeks. There is no sign that this is about to change. Consequently, traders should not be surprised by a 2 week rally coming at any time. However, the odds continue to favor lower prices.<p>Friday was an outside up day, but it closed in its middle. While that is not good follow-through for the bears, it is also a only a weak attempt by the bulls at a failed breakout. The bulls will probably need at least a micro double bottom before they can get a 2 – 3 week bounce. They need a strong break above the March 20 high to convince traders that the 10 month bear channel might be ending.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 25 pip range overnight. The bars are small, the tails are prominent, and the bars mostly overlap adjacent bars. There is no energy, and this reduces the chance of a big move today. Traders might be waiting for the next catalyst, which is Wednesday’s FOMC announcement. Day traders have been scalping for the past 2 days.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><img loading=\"lazy\" src=\"2019-4-29-2.jpg\" alt=\"Emini bear trend reversal\"></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini continued Friday’s weak rally, but failed to break above the all-time high. It will probably succeed this week, either before or after Wednesday’s FOMC announcement. A test of an important high typically results in a week or two of sideways trading rather than an immediate strong breakout.<p>Today sold off into the close and closed around the low and open. It is therefore a sell signal bar on the daily chart. But, the bull channel on the daily chart is tight and today’s doji body means that this is a weak sell setup. The market will probably wait for Wednesday’s FOMC report before there is a big move up or down.<p>Also, with so many of the bars Friday and today being in tight trading ranges, tomorrow will probably be quiet as well.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-4-29"
    }
  ],
  "30": [
    {
      "data": [
        "<article class=\"post-89360 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini testing all-time high ahead of May FOMC report\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini testing all-time high ahead of May FOMC report</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-04-30T06:20:58-07:00\">April 30, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Tuesday April 30, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini yesterday continued Friday’s weak rally until late. It then reversed down to close near the open and low. Yesterday became a bear trend reversal day on the daily chart. Consequently, it is a sell signal bar for today.<p>But, it was a bull doji bar and the daily chart is in a tight bull channel. This is therefore a minor sell setup. The best the bears will probably get is a 2 – 3 week, 2 – 3% pullback, like the other pullbacks in the past 4 months.<p>While the correction might begin today, today will likely be quiet ahead of tomorrow’s FOMC announcement. Most days over the past month have had at least one swing up and one swing down. There is no strong reason to expect otherwise today.<p>Traders are confident of a new all-time high. What they do not know is if it will come before tomorrow’s FOMC announcement, immediately afterwards, or a few weeks later.<p>It is important to note that today is the final day of the month. That increases the chance of a surprise move up or down, especially in the final hour.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 1 point in the Globex session. If it opens here, it will be just above yesterday’s low. That would make a break below yesterday’s low likely. Because the Emini is in a buy climax and at a major prior high, there is an increased chance of a big move up or down today.<p>Even though trading below yesterday’s low would trigger a sell signal on the daily chart, the sell setup is weak. Consequently, there will probably be more buyers than sellers below yesterday’s low. This is especially true with tomorrow’s important catalyst. The Emini typically does not have a big move just ahead of a catalyst.<p>Since today is the last day of the month, there is an increased chance of a sharp move up or down in the final hour.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-bear-trend-reversal.jpg\"><img src=\"2019-4-30.jpg\" alt=\"Emini bear trend reversal\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/EURUSD-Forex-bear-rally-in-bear-channel.png\"><img loading=\"lazy\" src=\"2019-4-30-1.png\" alt=\"EURUSD Forex bear rally in bear channel\"></a></figure><p>The EURUSD daily Forex chart has reversed up for 3 days after breaking below a 5 month trading range. But, it has been in a bear channel for 10 months. There have been many new lows and some minor new highs. However, as long as the chart continues to make lower highs and lows, it is still in a bear trend.<p>The bulls need a break above a major lower high. They then need a higher low, and then another new high. In addition, they need a break far above that major lower high. The most recent major lower high is the March 20 high of 1.1448.<p>Even if the bulls accomplish all of this, that simply ends the bear trend. It does not necessarily begin a bull trend. More often, it converts the bear trend into a trading range. At that point, the bulls will need a major trend reversal buy setup and a successful break above the trading range before traders will conclude that a bull trend has begun.<p>Therefore, traders will assume that this rally is a bull leg in the bear channel. There have been many other similar rallies. Each has lasted 2 – 3 weeks. Consequently, traders will assume that this rally will fail within a couple weeks at around the April 12 lower high of 1.1324.<p>Tomorrow’s FOMC announcement is a possible catalyst for a surprisingly big move up or down. However, it will unlikely not be enough to break above the March 20 lower high.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart rallied 50 pips overnight after yesterday’s reversal up from below the 5 month trading range low. The rally is now testing the 20 day EMA. Because the pullbacks for the past 6 hours have been small, day traders could only make money by buying.<p>While the pullbacks have been small, the rally over the past 2 hours has had small bars will prominent tails. That is a sign of loss of momentum. It increases the chance of an evolution into a trading range.<p>If the rally begins to evolve into a trading range, day traders will start to sell for scalps in addition to buying. However, a tight bull channel typically does not convert into a bear trend without 1st entering a trading range for 20 or more bars. As a result, it will be easier to make money focusing on buy setups today until the bears can get at least one 30 pip reversal.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-bull-trend-reversal-day-1.png\"><img loading=\"lazy\" src=\"2019-4-30-2.png\" alt=\"Emini bull trend reversal day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>By breaking below yesterday’s low, the Emini triggered a sell signal on the daily chart. Since it was a weak signal, there were likely to be more buyers than sellers below, and there were.<p>The Emini broke strongly below an early trading range, which became the Final Bear Flag on the 5 minute chart. The strong bear breakout was a bear trap and an exhaustive sell climax. The Emini reversed up to a new high, and the rally stop exactly at yesterday’s high. It was therefore almost an outside up day and it is now a buy signal bar for tomorrow.<p>Tomorrow is an FOMC announcement day. The Emini is in a buy climax on the daily chart at the all-time high. As a result, there is an increased chance of a big move up or down after the 11 am PST report tomorrow.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-4-30"
    }
  ]
}