{
  "1": [
    {
      "barNumber": "1",
      "description": "F BO HOY, BRB, but tail, S2. since Y was TR and now at top, might get PB to"
    },
    {
      "barNumber": "2",
      "description": "CCBRB, PP will get BO belo wGX L and 67 H SP and test MA and 50P, but TC so PP"
    },
    {
      "barNumber": "3",
      "description": "H1 near EMA, BL CH, PL, test of GXL, but DD after 3 BRB, B2"
    },
    {
      "barNumber": "4",
      "description": "BLB, new HOD, but did not close above 1, still PS TRO and LOM, PS STC, B2"
    },
    {
      "barNumber": "5",
      "description": "DT 1, F BO HOY 2ES, L2 top, PH, should dip below 67 Y and GXL, but 2 BLB, PS"
    },
    {
      "barNumber": "6",
      "description": "SBD but tail, TRO, PS F BO GXL and 67 H, PS 2LT, need FT, PS still LOM and"
    },
    {
      "barNumber": "7",
      "description": "H1, BRTP 6, LL DB 1, but TR, better to wait for breakout or 2nd signal. Low"
    },
    {
      "barNumber": "8",
      "description": "II but TR, better to wait for breakout or 2nd signal. Low probability, bad for"
    },
    {
      "barNumber": "10",
      "description": "IOI, BOM, slightly more bullish since only 1 C below MA. BR want FT after 6"
    },
    {
      "barNumber": "12",
      "description": "H2 8 above MA, TRI, BOM, PB AIL, PL, but tail, LOM, PS SA, B2"
    },
    {
      "barNumber": "13",
      "description": "F BO TRI, but DD, just above MA, still on 12 B, S2. still BOM, but only 1 C"
    },
    {
      "barNumber": "14",
      "description": "OU, AIL, but tail, PS DT 9, PS DBL 8 will exit longs. not yet BTC. BL need"
    },
    {
      "barNumber": "17",
      "description": "LH MTR 5, BLE4, but SPBL, tail, S2. H1, AIL, but BRB, no CCBLBC so not yet"
    },
    {
      "barNumber": "19",
      "description": "SBD, OO, DT MTR, DBL giving up, PH"
    },
    {
      "barNumber": "20",
      "description": "F BO OO, HL at MA in BL CH, still AIL, but top of TR, SBD 19, B2"
    },
    {
      "barNumber": "21",
      "description": "L1 after 19 SBD, but tail, C above MA. might get BO below TR and then TTRD to"
    },
    {
      "barNumber": "24",
      "description": "H2 40, F BO OO 19, DB 14, still TR, PP still AIL, BRE, PL, but B2, still PS"
    },
    {
      "barNumber": "26",
      "description": "DT 21, Tri 5 19, but just above MA in middle of TRO, TRO 5 19, NS, PS BB"
    },
    {
      "barNumber": "31",
      "description": "OU, but tail. still on 24 B but still in Triangle, NS"
    },
    {
      "barNumber": "33",
      "description": "DT PB, LH MTR, but DD, AIL, CC BLB, PS BB, S2. BLE4"
    },
    {
      "barNumber": "34",
      "description": "H1, SPBL, but DD, top of TR, NS"
    },
    {
      "barNumber": "36",
      "description": "OB, DD, SPBL,"
    },
    {
      "barNumber": "37",
      "description": "BO, C above 36, PS MG. TRI 30 is PS FF and MGB"
    },
    {
      "barNumber": "39",
      "description": "HH MTR, F BO TRI, OD, BLE4, PH, but tail, SPBL , S2"
    },
    {
      "barNumber": "40",
      "description": "H1, SPBL, weekly MM and Aug H MGA, but weak rally, PS 41R"
    },
    {
      "barNumber": "42",
      "description": "3 CCBLBC, SPBL, BTC, MGA are Aug H, which is ATH, and MMTA from weekly"
    },
    {
      "barNumber": "43",
      "description": "H1, MGA, SPBL, but DD, weak rally. PW 33 39, 41R, PH, BLE4, but TC, SPBL,"
    },
    {
      "barNumber": "44",
      "description": "PW, but TC, just below TGA, S2. BLE4"
    },
    {
      "barNumber": "46",
      "description": "H1, SPBL, MGA, but 3 CC BRB, PS SA, NS. not strong rally so PP swing down and"
    },
    {
      "barNumber": "48",
      "description": "H1, SPBL, MMTA fro 6 L to 5 H, but BRB, jjust below TGT, W 44 47, NS. PS SA"
    },
    {
      "barNumber": "50",
      "description": "MW 44 47 at MMT, AIBLE, but SPBL, MRV"
    },
    {
      "barNumber": "52",
      "description": "H1, SPBL, but at BRB, MMT, MW, PS SA 50 MW, NS. SPBLNBO"
    },
    {
      "barNumber": "55",
      "description": "LH, but MRV. TTR, MA just below"
    },
    {
      "barNumber": "58",
      "description": "BO, C below EMA and TTR, MGB is 5 H top of LTR, but PP forming UTR in TTRD so"
    },
    {
      "barNumber": "59",
      "description": "SBD, CCBRBC, AIS, but PP just test of open in TRD. BR want TRVD and C at LOD."
    },
    {
      "barNumber": "60",
      "description": "L1, but BLB, just above apex of TRI 30, PP MBO"
    },
    {
      "barNumber": "61",
      "description": "BBRBC, PS BTC since back in TR 30. LP STC"
    },
    {
      "barNumber": "62",
      "description": "SX, DB 28, but 9 BBRMC, BRB, MRV, B2, PS SA, PP TR like 1 - 30"
    },
    {
      "barNumber": "63",
      "description": "L1, 60ma and LOD MGB, but BLD, back in 30 TR, LPS, PS BB, NS. PS PW 59 62"
    },
    {
      "barNumber": "66",
      "description": "L2, 60ma and LOD MGB, but DD, TTR, in earlier TR so LP, NS"
    },
    {
      "barNumber": "67",
      "description": "BBRBC, might reach 60ma, but PP not much LR"
    }
  ],
  "3": [
    {
      "barNumber": "1",
      "description": "HL DB LOY but PP will fall below LOY and GXL since mo down in GX mkt, 3 bear"
    },
    {
      "barNumber": "2",
      "description": "LL MTR, F BO LOY, PL< but BRD, just below MA, TR, better to wait for breakout"
    },
    {
      "barNumber": "3",
      "description": "L1 after GD and PS BRT, but CC DD at LOY, LOM, S2"
    },
    {
      "barNumber": "6",
      "description": "BLBC, SBU, C above 3 NL of DB 2 5, H2 2, PS LOD, but just below MA, need FT"
    },
    {
      "barNumber": "7",
      "description": "CCBBLB1C, SBU, but stop below 5 so TR, better to wait for breakout or 2nd"
    },
    {
      "barNumber": "8",
      "description": "DT 1, 5 H MGB since BBSB, some BL want to B 50P to reduce risk. PH but tail,"
    },
    {
      "barNumber": "9",
      "description": "BLBC, AIL, PS T1BU, but PS DBL7 will exit, 5 H MGB, NS, B2"
    },
    {
      "barNumber": "10",
      "description": "MDT 7, 5 H MGB, but PP MRV"
    },
    {
      "barNumber": "11",
      "description": "CCBBRBC, 5 H and LOY MGB, but PP MRV after SBU 6 7. still AIL"
    },
    {
      "barNumber": "13",
      "description": "H1, AIL, but 3 BRB, 5 H and LOY MGB, NWS below 5 since PS BRCH down to MGB"
    },
    {
      "barNumber": "14",
      "description": "OD, SBD, should test 5 H and maybe LOY, but BRN1"
    },
    {
      "barNumber": "15",
      "description": "HL MTR, H2 13, test 5 H, PL, but PS MMD to LOY after 14 OD, NWS below 5"
    },
    {
      "barNumber": "19",
      "description": "L1, MGB, but AIL, 3 BLB, DD, NS, S2. H1, AIL, but DD, NS"
    },
    {
      "barNumber": "20",
      "description": "BO, but need FT, else DT 10 and more TR"
    },
    {
      "barNumber": "21",
      "description": "BLB so FT, but tail, ,PS DT 10. DT 10 but 7 BBLMC, BLB, PP BB, S2, BLE4. PS"
    },
    {
      "barNumber": "23",
      "description": "OU, BL CH in SCBL, but top of TR, NS"
    },
    {
      "barNumber": "24",
      "description": "MDT 21, DT 10, PH, but small body, TBLC, NS, S2"
    },
    {
      "barNumber": "25",
      "description": "OU, BO above TT 10 21 24, but need FT, did not close above TT. almost 50%"
    },
    {
      "barNumber": "26",
      "description": "IOI, COL, HH MTR, F BO 10, BLE, PH, but TBLC, NS"
    },
    {
      "barNumber": "27",
      "description": "H1, AIL, but TTR 21, LP, PS LOM, NS. still on 26 S."
    },
    {
      "barNumber": "28",
      "description": "LH, PS start of leg down to 15 L"
    },
    {
      "barNumber": "29",
      "description": "SBD, might test 15 L and form TR. still AIL, PS DB 23, but weak rally so PP"
    },
    {
      "barNumber": "30",
      "description": "EMA and closing near their lows so probably will go lower and possible Sell"
    },
    {
      "barNumber": "31",
      "description": "H2 27, COH, PP still AIL, but 3 BRB, NWS"
    },
    {
      "barNumber": "33",
      "description": "LH but still on 31 B, AIL, NS. apex of TRI 10 25, BOM"
    },
    {
      "barNumber": "35",
      "description": "OU, AIL, but middle of TTR, NS"
    },
    {
      "barNumber": "37",
      "description": "SBD but bottom of TTR 22, PS BTC, S2. BOM"
    },
    {
      "barNumber": "38",
      "description": "CCBRBC, 15 L MGB, but bottom of TTR 22, NS, PS BTC"
    },
    {
      "barNumber": "41",
      "description": "H2, COH, AIL, but apex of TTR. NS"
    },
    {
      "barNumber": "44",
      "description": "FT from 43 SBU, PS MMU. BR want W 10 25"
    },
    {
      "barNumber": "45",
      "description": "CC SBU, might get some PTG PB around 79 H, but BTC, 2LSU likely"
    },
    {
      "barNumber": "46",
      "description": "DT 79 but DD. BLE4, S2"
    },
    {
      "barNumber": "49",
      "description": "L1 but DD, MRV, PP BB and at 25 H BOP and MA, S2. still AIL, S2"
    },
    {
      "barNumber": "50",
      "description": "H1 but 4 BWBLB, room to MA and 25 H, NWS"
    },
    {
      "barNumber": "54",
      "description": "L2 46, but 5 BWBRB, TC, PP MRV, PS BB since TTR 46"
    },
    {
      "barNumber": "56",
      "description": "H1, AIL, but TTR, PS SA, NWS"
    },
    {
      "barNumber": "60",
      "description": "OSC around 4537 MMU from pandemic crash. AIL since 6, but TTR, DT 54 58, DB"
    },
    {
      "barNumber": "63",
      "description": "III and OOO at apex of TTR, BOM. CC tops with 36 TRI, and 58 TW, but TTR so"
    },
    {
      "barNumber": "64",
      "description": "F BO below TTR, H1 at MA, 20GBB, but 3 BRB, TTR, B2"
    },
    {
      "barNumber": "67",
      "description": "BO, ATH MGA for OUD, but NS since PS W 25 54"
    },
    {
      "barNumber": "68",
      "description": "BRB, BFT, BLE. W 25 54, PH, but SPBL 38 and HOY MGA, NS"
    },
    {
      "barNumber": "81",
      "description": "End of Day"
    }
  ],
  "7": [
    {
      "barNumber": "1",
      "description": "6 day TTR, just above bull CH on daily chart. odds still favor at least"
    },
    {
      "barNumber": "2",
      "description": "CCBRB, STC, but TR, better to wait for breakout or 2nd signal. Low"
    },
    {
      "barNumber": "3",
      "description": "BLBC, PL, BRE, but small, PP MRV. LLW MGB"
    },
    {
      "barNumber": "4",
      "description": "SBD, but tail. getting near LLW MGB, still STC, 4 BBRMC, but NWS, bottom of 6"
    },
    {
      "barNumber": "5",
      "description": "MDB,, LLDB 3, BRE4, but MRV, 5 BBRMC, SA, B1"
    },
    {
      "barNumber": "6",
      "description": "2BR, LLDB 3, but 5 BBRMC, PP MRV, B2"
    },
    {
      "barNumber": "7",
      "description": "L1, but tail. 3LD so PS PW, PS BB, NS"
    },
    {
      "barNumber": "8",
      "description": "BBRB, LLW MGB, LW was small GU. LLW also around MMD from 4 MG, but might enter"
    },
    {
      "barNumber": "9",
      "description": "at TG MM, LLW, GU, bottom of 6 DTTR, PS PW, but BL need strong BSB. tail,"
    },
    {
      "barNumber": "10",
      "description": "IB, L1 but tails, at SP, PS BB, Ns. PW 3 6 at SP, PL, BRE4, but 4 BRB, B2"
    },
    {
      "barNumber": "11",
      "description": "L1, SPBR, BR want 1st hour to close below 5 DTTR, but BLB, PP BB, S2. PW,"
    },
    {
      "barNumber": "12",
      "description": "L1 but tail, at SP, PW, PS BB, NS. PW 2EB, PL but BRB, NS. PP TR soon. MGA MA"
    },
    {
      "barNumber": "14",
      "description": "L2, still AIS, SPBR, but CC BLB at SP and after SX, PL, PS BB, S2. still on B"
    },
    {
      "barNumber": "18",
      "description": "DTBF 7, should fall below 12 H since 12 and 10 were BBSB. 40% chance BO below"
    },
    {
      "barNumber": "20",
      "description": "CCBBRBC, still AIS, 40% chance of MMD below 9. TR likely"
    },
    {
      "barNumber": "23",
      "description": "L1, AIS, but just above SP, NS. HL DB 9, HL MTR, PL, but BRB, NS"
    },
    {
      "barNumber": "24",
      "description": "MDB, HL DB, PL, BRE"
    },
    {
      "barNumber": "25",
      "description": "SBU, but tail, still no C above MA. PL, but need BO above MA, else more TR"
    },
    {
      "barNumber": "27",
      "description": "LH at MA, TRI 7 17, but 4 BWBRB, PS BB, S2. BL need BO above MA and 17 H for"
    },
    {
      "barNumber": "30",
      "description": "TRI, DBPB, BRE, but tail, just below MA, NS"
    },
    {
      "barNumber": "31",
      "description": "SBU, C above MA but not far above and not above 27 LH. PS AIL, but need FT,"
    },
    {
      "barNumber": "32",
      "description": "CC C above MA, AIL, BO 17 H NL of DB and H of 60 min bar, but tail. SBU 30 31"
    },
    {
      "barNumber": "33",
      "description": "F BO 17, HH DT 17, W 22 27, BLE, but SBU, S2. H1, AIL, PS MG 32, 60ma MGA,"
    },
    {
      "barNumber": "36",
      "description": "H2, AIL, OU, but top of TR 6, TTR 32, not quite to MA SP so PS more SD, NS"
    },
    {
      "barNumber": "37",
      "description": "LH DT 32, but TTR above MA, AIL, PS MG 32, S2. BLE or below 36"
    },
    {
      "barNumber": "38",
      "description": "OD, W 27 32, F BO TR 7, but TTR, just above MA, 60ma MGA, NS"
    },
    {
      "barNumber": "39",
      "description": "OO, 60ma MGA"
    },
    {
      "barNumber": "40",
      "description": "CCBLBC so SBU, PS MG, but 60ma RS just above, PS W 27 32"
    },
    {
      "barNumber": "41",
      "description": "W 27 32, but SBU and 60ma MGA, S2, PP BB"
    },
    {
      "barNumber": "44",
      "description": "H1, but just below 60ma, PS SA. W, OD 43, but TC, PP MRV. PP PH soon, maybe"
    },
    {
      "barNumber": "46",
      "description": "H1, SPBL, but at 60ma, OOM MG just above, PP MBO and PB soon, N2. W 32 43,"
    },
    {
      "barNumber": "48",
      "description": "H1, SPBL, but BRB, CC BRB, room to MA, W BX, PP SA for 2LSD, B2, or NWS"
    },
    {
      "barNumber": "51",
      "description": "DT 45 at 60ma, but BRD, TTR 41, MRV, PS just test MA and 43 L at bottom of"
    },
    {
      "barNumber": "54",
      "description": "HH at 60 MA, but PP MRV. MGB 43 bottom of TTR, then 36 L bottom CH up after"
    },
    {
      "barNumber": "57",
      "description": "H1 but 3 BRB, PP SA, B2"
    },
    {
      "barNumber": "58",
      "description": "SBD, but PP MBO, might tesh 36 L, PP BRTR and near bottom of UTR in TTRD"
    },
    {
      "barNumber": "61",
      "description": "Big OU at bottom of UTR in TTRD, but 3 BRB and room to LOY and 50P so NWS"
    },
    {
      "barNumber": "63",
      "description": "L1 but PP 2LSU after 61 SBU, so PP BB, S2. still AIL 32"
    },
    {
      "barNumber": "64",
      "description": "H2, but BRB, middle of UTR"
    },
    {
      "barNumber": "67",
      "description": "BO, CUPHU, but PS BLTR"
    },
    {
      "barNumber": "68",
      "description": "LH MTR, 2BR, but more likely PB from 67. middle of TTR 41, PP more TTR"
    },
    {
      "barNumber": "81",
      "description": "End of Day"
    }
  ],
  "8": [
    {
      "barNumber": "1",
      "description": "BO LOY, BBRBC, but bottom of 7 day TR, S2, PS BTC"
    },
    {
      "barNumber": "2",
      "description": "OU, COH, PL, but PS SA at COY and MA"
    },
    {
      "barNumber": "4",
      "description": "L1, PH, but DD, 50P from big REVU for L of 2 to H of 4, PP AIL, bottom of Y"
    },
    {
      "barNumber": "5",
      "description": "H2, F BO LOY 2EB, PL, 50P but 3 DD, PS TRO, NS"
    },
    {
      "barNumber": "7",
      "description": "F BO MA, L2, PH, but lots of REV and tails, PP TRO, NS. PS SPBL, S2. might"
    },
    {
      "barNumber": "8",
      "description": "F BO MA, PH, 50P from Y, MDT 7, still on 7 L2 S, BLE4 below 8, but AIL, DD,"
    },
    {
      "barNumber": "11",
      "description": "CCBRBC, CCBRB1C, AIS, but still PS TRO, NS"
    },
    {
      "barNumber": "12",
      "description": "4 CC BRB, AIS, STC, but NS since PS DB 5 at LLW"
    },
    {
      "barNumber": "13",
      "description": "BO LOD, GXL and 4500 BRN and MMD MGB. STC but NWS since TR, better to wait"
    },
    {
      "barNumber": "16",
      "description": "SX, PL, but 7 CCBRB, PP MRV. L1 but BBRL at SP MM 4500 BRN, GXL, PP BB, NS"
    },
    {
      "barNumber": "18",
      "description": "LL MDB 16 at MMT and GXL and 4500BRB, PL, TR more likely than BLT. PP MRV to"
    },
    {
      "barNumber": "19",
      "description": "CCBRL1C, but TR more likely than BLT. SBU"
    },
    {
      "barNumber": "20",
      "description": "L1, MDT 16, but SBU 18 19, tail, PP BB, S2. AIL, but TR more likely than BLT"
    },
    {
      "barNumber": "22",
      "description": "MDT and W 16 19 at MA and 2 L, but AIL, 5 BBLMC, PP BB and TR or SPBL, S2. PS"
    },
    {
      "barNumber": "23",
      "description": "MW at MA, but 6 BBLMC, MRV. BL want BO above MW and MA, but 50P more likely"
    },
    {
      "barNumber": "24",
      "description": "MW at MA, COL, but 7 BBLMC, PS BB and SPBL. MRV, might get 50P. Only 30%"
    },
    {
      "barNumber": "25",
      "description": "CCBBRBC, but still AIL, at 50P and 4500 BRN and 18 BSB H, PP MRV and HL"
    },
    {
      "barNumber": "27",
      "description": "HL MTR, but 4 BRB, PP SA, B2"
    },
    {
      "barNumber": "28",
      "description": "OD, PP AIS, but PP BB 18 for W 2 18, and PS HL and H2, but 5 BRB, B2"
    },
    {
      "barNumber": "29",
      "description": "HL MTR, H2 27, but 6 CC BRB, LP, NS, B2, PS SA in SPBR. still might fall"
    },
    {
      "barNumber": "30",
      "description": "L1 but bottom of TR, BLB, PP BB"
    },
    {
      "barNumber": "31",
      "description": "SBU, HLMTR, but tail, at MA, B2. BL need C above MA, else TR"
    },
    {
      "barNumber": "32",
      "description": "BBLBC, C above MA, PS MG. BR want F BO and LH in BRCH at MA. AIL, but might"
    },
    {
      "barNumber": "33",
      "description": "BL FT, AIL, but PS BLCH instead of SPBL. BLE4. BR want BT but 4 BLB, BO 23 H"
    },
    {
      "barNumber": "34",
      "description": "BBLBC, but PS BVT of LLW and MMU from 31 H. BTC, but nee stop below MA. MA"
    },
    {
      "barNumber": "36",
      "description": "BO above LLW, test 13 SX H, MMU from 31 H so PS PTG soon, but BB around MA."
    },
    {
      "barNumber": "37",
      "description": "L2 24, F BO MA and LLW, but MRV, BB around MA. H1, but BRB, BX, PP SA around"
    },
    {
      "barNumber": "38",
      "description": "SBD, but MRV, PP SD to MA, PS BTC, S2"
    },
    {
      "barNumber": "39",
      "description": "L1 but BLB and just above MA, PP BB around MA. H1 but DD after 2 BRB and BX"
    },
    {
      "barNumber": "40",
      "description": "HL at MA, AIL, but might go SD more so NWS. BL want new HOD but might enter"
    },
    {
      "barNumber": "41",
      "description": "L1 but PP MRV and BB. H1 but 6 BBRMC, NWS. AIL, but might get deeper PB. 3 DD"
    },
    {
      "barNumber": "43",
      "description": "H1, MDB, MA, but 8 BBRMC, NWS. PS SA for MMD to 31 L and TR instead of BLT."
    },
    {
      "barNumber": "44",
      "description": "OD, PS MMD to 31 L, but PS BRTP and TR. TR likely, but bottom might be 31 L."
    },
    {
      "barNumber": "45",
      "description": "H2 43, but DD after SBD 44, NWS. still AIL"
    },
    {
      "barNumber": "48",
      "description": "II on 60m. On 5 min, AIL, but TR since 35. should reach OOD before EOD, and"
    },
    {
      "barNumber": "49",
      "description": "TRI 7 36, but AIL, PP MRV, NS"
    },
    {
      "barNumber": "50",
      "description": "H1, 36 H and OOD MGA, but BRB, top of TR 35, NS. PS W 47 49"
    },
    {
      "barNumber": "52",
      "description": "W 47 49, LH DT 36, but AIL, PP MRV in TR, OOD MGA, DD, PS BB, NS"
    },
    {
      "barNumber": "55",
      "description": "SBU, BO 60m II and OOD, but need FT, else W 23 36"
    },
    {
      "barNumber": "56",
      "description": "F BO, BLTP, test OOD, W 23 36, but tail. SPBL, NS. H1, HOD and 60ma MGA, but"
    },
    {
      "barNumber": "57",
      "description": "MDT 55, W, at OOD, but BLB, NS, S2"
    },
    {
      "barNumber": "58",
      "description": "OD, W top, but at MA, NS. middle of TR since 35, at MA, so PP not swing down,"
    },
    {
      "barNumber": "60",
      "description": "HL in BL CH at MA, but BBRB 58 after W top, TTR 49, TR 35, LOM, HPW"
    },
    {
      "barNumber": "61",
      "description": "LH after W 23 36, but just above MA, TTR, NS, HPW"
    },
    {
      "barNumber": "63",
      "description": "OU, above MA, AIL, but TTR, NS. might get 1 more push up for W 36 55 at 60ma."
    },
    {
      "barNumber": "65",
      "description": "MDB above MA, AIL, but TTR, OOD might remain MGN for test of day, NS, HPW"
    },
    {
      "barNumber": "68",
      "description": "4 CC BLB, BGP, AIL, increased chance of BL BO, but PP will not get above"
    },
    {
      "barNumber": "81",
      "description": "End of Day"
    }
  ],
  "10": [
    {
      "barNumber": "2",
      "description": "BBRBC, should continue down to below 75 H since TR likely and expect BO of SR"
    },
    {
      "barNumber": "3",
      "description": "CCBRB1C, should BO below 75 H, then SD to EMA. BL want SX and REVU, but SBD,"
    },
    {
      "barNumber": "6",
      "description": "SX at MA, but 4 CCBRBC, B2. COY and LOY MGB. altho T1BD, PP will be BB around"
    },
    {
      "barNumber": "8",
      "description": "SVT LOY and GXL, PL, BRE. EG, H2 5. BR want MG but BLB, S2"
    },
    {
      "barNumber": "9",
      "description": "MDB, SX, PL, BRE or above 8. ok swing B above or above 8, but HPWB2"
    },
    {
      "barNumber": "10",
      "description": "L1, PS MG 7, but at LOY, NS. BLE. BL need BLB so bad EB. some BL will BTC to"
    },
    {
      "barNumber": "11",
      "description": "H2, MDB, still on 9 B, but TTR, might be SA for MDT 10. still on 10 S. PS MDT"
    },
    {
      "barNumber": "12",
      "description": "L2 below MA, AIS, but only 2T BRB so LRP, NS. TTR late in BRT so PS FF. MMTB"
    },
    {
      "barNumber": "13",
      "description": "SBD, room to MMT, but tail, PS FF 12 TTR."
    },
    {
      "barNumber": "14",
      "description": "L1, MMTB, PS MG 13, but tails, NS. FF 12 TTR, F BO LOY, ET Y 50, but 3 BRB,"
    },
    {
      "barNumber": "15",
      "description": "BBRC, still STC, room to MMTB, but tails, far below MA, LRP, NS,"
    },
    {
      "barNumber": "16",
      "description": "OU, PL, ET 50, FF 12, W 9 13, MDB, but DD, NS, TR, better to wait for"
    },
    {
      "barNumber": "17",
      "description": "L1 but happened too fast to S. TTR, PS LOM, BTW"
    },
    {
      "barNumber": "18",
      "description": "OU at MMT, PL, but tail, TR, better to wait for breakout or 2nd signal. Low"
    },
    {
      "barNumber": "19",
      "description": "L1, AIS, PS MG 13, but MW, tail, NS, TTR, LOM, PS BB, S2. IOI, BOM, but BRB"
    },
    {
      "barNumber": "20",
      "description": "HL for 2LSU after MW, PL, but big DD, TTR, just below MA, NS, B2"
    },
    {
      "barNumber": "21",
      "description": "L2 19, AIS, PS MG 13, but BLB, TTR, S2"
    },
    {
      "barNumber": "22",
      "description": "OD, AIS, COL, but bottom of TTR, NS, HPW"
    },
    {
      "barNumber": "23",
      "description": "HL, TRI, but tail, just below MA, NS, LOM, still AIS"
    },
    {
      "barNumber": "24",
      "description": "OD, still AIS, PS MG 13,but just above 18 L, LOM, S2. better to S belo w17"
    },
    {
      "barNumber": "25",
      "description": "HL DB 18, COH, PL, but middle of TTR, just below MA, AIS, NS. TR, better to"
    },
    {
      "barNumber": "26",
      "description": "L1, AIL, BRCH below MA, but on 25 B, TTR, PS BB, NS, HPW"
    },
    {
      "barNumber": "28",
      "description": "OD, but still above 25 H so OK to be long. better to S below 18 than 28 since"
    },
    {
      "barNumber": "30",
      "description": "F BO 18 TTR, LL DB 18, COH, PL, but TR, better to wait for breakout or 2nd"
    },
    {
      "barNumber": "31",
      "description": "CCBLBC, but need BO above MA for AIL."
    },
    {
      "barNumber": "32",
      "description": "BO above MA and LOY and 18 H top of TR, COH, PP AIL, but need FT. 3 CCBLBC,"
    },
    {
      "barNumber": "33",
      "description": "H1, AIL, but BRB, weak FT, PS SA. should hold above MA for at least 5 bars. F"
    },
    {
      "barNumber": "34",
      "description": "MDT 32, but PP BB around MA, S2. BL want BLT and rally back to 60MA and LLW,"
    },
    {
      "barNumber": "35",
      "description": "H1, AIL, but 3 bar TTR, might get PB to MA, BLE4"
    },
    {
      "barNumber": "38",
      "description": "BO, back to 9 H, reasonable B so PS some PTG"
    },
    {
      "barNumber": "39",
      "description": "H1, room to MMTA, but PS PW 32 38 and SA at MMT, NWS. MGB 34 L bottom of BLCH"
    },
    {
      "barNumber": "40",
      "description": "MDT, PW 32 34 38, but BLD, PP MRV, S2"
    },
    {
      "barNumber": "46",
      "description": "top of TTR 38, ET 40 43, might test 34 L at start of BLCH. PP MRV"
    },
    {
      "barNumber": "48",
      "description": "3 CCBRBC, SBD, C below MA, 34 L and LOY and 18 H MGB, but still AIL. ET 41"
    },
    {
      "barNumber": "50",
      "description": "PS BLTP after 3 BRB and with MGB"
    },
    {
      "barNumber": "51",
      "description": "OD, MGB are 34 L, 18 H, 50 P and 28 H"
    },
    {
      "barNumber": "53",
      "description": "CCBRBC, EMA and closing near their lows so probably will go lower and"
    },
    {
      "barNumber": "59",
      "description": "MMD, W 48 54, COH, BRE, but count might have started over with 53 so might"
    },
    {
      "barNumber": "60",
      "description": "OD, but PS 3LD and W 54 59, LBLM, NS"
    },
    {
      "barNumber": "61",
      "description": "CCBBRBC, PS MG, but more likely 3LG 54 59, S2. BL might want MDB after 2BBRBC"
    },
    {
      "barNumber": "62",
      "description": "W 54 59, MGA 59 H, but SBD 60 61, NS"
    },
    {
      "barNumber": "64",
      "description": "L1 in BRCH 46, but in BZ from 30 TTR, W bottom, PS BB, NS"
    },
    {
      "barNumber": "65",
      "description": "H2, but BRBC 64, just below MA, NS. might get L2 64"
    },
    {
      "barNumber": "66",
      "description": "MDT below MA right after MDB and W, BOM"
    },
    {
      "barNumber": "67",
      "description": "BO, but PS FF and HL DB 29, in BZ 40, PS BTC instead of STC, NS,"
    },
    {
      "barNumber": "81",
      "description": "End of Day"
    }
  ],
  "13": [
    {
      "barNumber": "1",
      "description": "YSX. on daily chart, MGB are bottom of CH and 50d MA. MGA Y 45 H and 60ma and"
    },
    {
      "barNumber": "2",
      "description": "CCBBRBC,"
    },
    {
      "barNumber": "3",
      "description": "CCBBRBC, but around Y 30 L, MA, 50P, BDBUC, PP bounce soon. BL want SX down to"
    },
    {
      "barNumber": "4",
      "description": "RB at SP, PL, but BRB, 4 BRB, NWS, handle in CUPU, PL"
    },
    {
      "barNumber": "5",
      "description": "SBU but tail, SBR 4 so MGB. big REVUD, TRO likely"
    },
    {
      "barNumber": "6",
      "description": "L1, but PP TRO, NS"
    },
    {
      "barNumber": "7",
      "description": "SBD. COY and LOY MGB, but PP BB around LOY. NWS"
    },
    {
      "barNumber": "10",
      "description": "H2 4, HL MTR, HL DB LOY, BRE, but only 1 BLB today, still STC, B2. PP will"
    },
    {
      "barNumber": "11",
      "description": "L1, only 1 BLB today, BL TL at bottom of CH on weekly chart just a little LR."
    },
    {
      "barNumber": "12",
      "description": "H2 4, H2 10, PL, stop below 10, but bottom of weekly BLCH and LLW just below,"
    },
    {
      "barNumber": "14",
      "description": "BO, C above 11 NL of DB 10 12, but tail, C below MA, PS DBL 12, so PS PTG,"
    },
    {
      "barNumber": "15",
      "description": "L1 at MA, MGB, but tail, SVT LOY, good BSB 12, PS SPBL and BB, NS."
    },
    {
      "barNumber": "16",
      "description": "BLB C above 15 and MA so another BO, PS SPBL and PL, but tail, no CC BLB, PP"
    },
    {
      "barNumber": "17",
      "description": "W, BLE4, but DD, TC, SPBL, PS MG 16, S2. lack of CCBLB, weak rally, PP BLTR"
    },
    {
      "barNumber": "19",
      "description": "H1 but BRB at MA, PP still AIS, PS SA, B2"
    },
    {
      "barNumber": "20",
      "description": "OD, AIS, but DD, ,4 BTTR, NS"
    },
    {
      "barNumber": "21",
      "description": "SBD, weekly BL TL just below so MGB"
    },
    {
      "barNumber": "22",
      "description": "F BO LOY, F BO DB, test of weekly TL, RB, PL, BRE4. still weekly TL MGB so LP"
    },
    {
      "barNumber": "23",
      "description": "BBLBC, PL, but still AIS, weekly BL TL just below, NS. L1, MGB, but BLB, PS"
    },
    {
      "barNumber": "24",
      "description": "CCBLB, PL, but need BO above MA for AIL. BRCH, but LBLM, PP BB 22, BLB, S2"
    },
    {
      "barNumber": "25",
      "description": "3 CC BLB but at MA, PS STC. becoming AIL, might test 22 H since BBSB and at"
    },
    {
      "barNumber": "26",
      "description": "H1 but BRB at MA, B2."
    },
    {
      "barNumber": "27",
      "description": "IOI, L2 BRF, BRCH, BL TL MGB, but NS since PP 2LSU after 22 W"
    },
    {
      "barNumber": "28",
      "description": "OD but DD, PS test 22 BBSBH, PS BB for HL MTR, Ns"
    },
    {
      "barNumber": "29",
      "description": "HL MTR but 4 CC BRB, just below MA, B2. On 27 L2 S but 3 DD, BRE4, PP BB 22"
    },
    {
      "barNumber": "30",
      "description": "OD, BRCH, but PP BB LOD since BRCH"
    },
    {
      "barNumber": "32",
      "description": "HL MTR but 7 BRB, PP MRV, PS SA, B2. BRE4"
    },
    {
      "barNumber": "33",
      "description": "SBU, HL MTR, C above MA, PL, but top of BRCH, 7 CC BRB, HPWB2. PS STC but"
    },
    {
      "barNumber": "34",
      "description": "H1 but BRB at MA, NS, PS SA. L1 in BRCH, but TR 10, tail, PS BB, PP BB 22, NS"
    },
    {
      "barNumber": "35",
      "description": "BLBC, C above MA, but LH, BL need EMA. Higher prices likely. Always In Long"
    },
    {
      "barNumber": "36",
      "description": "L1 at MA in BRCH, but SPBL, S2. BLE4"
    },
    {
      "barNumber": "37",
      "description": "H1, SPBL, but DD, need BO above 28, else still BRCH. PP TR 10. might test 16"
    },
    {
      "barNumber": "38",
      "description": "L2, AIS, BR IB, CC DD at MA in BRCH, but more likely TR, PP BB around 32 L."
    },
    {
      "barNumber": "39",
      "description": "SBD but tail, PS TRI 22 32, PS BTC, S2"
    },
    {
      "barNumber": "40",
      "description": "TRI, BOM, PL but tail, just below MA. Odd favor test of 16 H at some point"
    },
    {
      "barNumber": "43",
      "description": "F BO 35 and TRI, but PS BTC since BL do not want S signal to trigger. BLE"
    },
    {
      "barNumber": "45",
      "description": "MDT, BLE, NS, since TRI, PS BB for SPBL"
    },
    {
      "barNumber": "48",
      "description": "SBD but tail, near bottom of TR 10, PP BB 40 and 32 and LOD"
    },
    {
      "barNumber": "52",
      "description": "DB 22, MDB 49, but 9 BBRMC, PP MRV, PP SA around MA, B2. BRE4. BL TL on"
    },
    {
      "barNumber": "54",
      "description": "MW 49 51, LL MTR, BRE4, but 11 bar BRMC, PP MRV, B2. weekly BL TL just below"
    },
    {
      "barNumber": "55",
      "description": "L1 at MA, but CC BLB, PS BL, S2"
    },
    {
      "barNumber": "56",
      "description": "DT 52, bottom of G on daily is MGB, but PS BB 54 since CH"
    },
    {
      "barNumber": "57",
      "description": "BO below weekly BL TL, G on daily chart below 4421 and MM drom DT 28 44 MGB,"
    },
    {
      "barNumber": "58",
      "description": "F BO MW, PL, but MGB, TC"
    },
    {
      "barNumber": "59",
      "description": "L1, MGB are MM and bottom of G on daily, but BRCH so PB BB and at MGN"
    },
    {
      "barNumber": "62",
      "description": "H2 54, PL, F BO TRI, but 8 BBRMC, 4 BRB, B2"
    },
    {
      "barNumber": "65",
      "description": "L1 at MA in BRCH, COL, but NS, TR, better to wait for breakout or 2nd signal."
    },
    {
      "barNumber": "66",
      "description": "H1, 40 C MGA, but at MA in BR CH, NS. still on 65 S, now MDT 64. G on daily"
    },
    {
      "barNumber": "67",
      "description": "SBD, G is MGB, but PS BRTP and DB 67"
    },
    {
      "barNumber": "81",
      "description": "End of Day"
    }
  ],
  "15": [
    {
      "barNumber": "1",
      "description": "BO LOY, BBRBC, but bottom of 7 day TR, S2, PS BTC"
    },
    {
      "barNumber": "2",
      "description": "OU, COH, PL, but PS SA at COY and MA"
    },
    {
      "barNumber": "4",
      "description": "L1, PH, but DD, 50P from big REVU for L of 2 to H of 4, PP AIL, bottom of Y"
    },
    {
      "barNumber": "5",
      "description": "H2, F BO LOY 2EB, PL, 50P but 3 DD, PS TRO, NS"
    },
    {
      "barNumber": "7",
      "description": "F BO MA, L2, PH, but lots of REV and tails, PP TRO, NS. PS SPBL, S2. might"
    },
    {
      "barNumber": "8",
      "description": "F BO MA, PH, 50P from Y, MDT 7, still on 7 L2 S, BLE4 below 8, but AIL, DD,"
    },
    {
      "barNumber": "11",
      "description": "CCBRBC, CCBRB1C, AIS, but still PS TRO, NS"
    },
    {
      "barNumber": "12",
      "description": "4 CC BRB, AIS, STC, but NS since PS DB 5 at LLW"
    },
    {
      "barNumber": "13",
      "description": "BO LOD, GXL and 4500 BRN and MMD MGB. STC but NWS since TR, better to wait"
    },
    {
      "barNumber": "16",
      "description": "SX, PL, but 7 CCBRB, PP MRV. L1 but BBRL at SP MM 4500 BRN, GXL, PP BB, NS"
    },
    {
      "barNumber": "18",
      "description": "LL MDB 16 at MMT and GXL and 4500BRB, PL, TR more likely than BLT. PP MRV to"
    },
    {
      "barNumber": "19",
      "description": "CCBRL1C, but TR more likely than BLT. SBU"
    },
    {
      "barNumber": "20",
      "description": "L1, MDT 16, but SBU 18 19, tail, PP BB, S2. AIL, but TR more likely than BLT"
    },
    {
      "barNumber": "22",
      "description": "MDT and W 16 19 at MA and 2 L, but AIL, 5 BBLMC, PP BB and TR or SPBL, S2. PS"
    },
    {
      "barNumber": "23",
      "description": "MW at MA, but 6 BBLMC, MRV. BL want BO above MW and MA, but 50P more likely"
    },
    {
      "barNumber": "24",
      "description": "MW at MA, COL, but 7 BBLMC, PS BB and SPBL. MRV, might get 50P. Only 30%"
    },
    {
      "barNumber": "25",
      "description": "CCBBRBC, but still AIL, at 50P and 4500 BRN and 18 BSB H, PP MRV and HL"
    },
    {
      "barNumber": "27",
      "description": "HL MTR, but 4 BRB, PP SA, B2"
    },
    {
      "barNumber": "28",
      "description": "OD, PP AIS, but PP BB 18 for W 2 18, and PS HL and H2, but 5 BRB, B2"
    },
    {
      "barNumber": "29",
      "description": "HL MTR, H2 27, but 6 CC BRB, LP, NS, B2, PS SA in SPBR. still might fall"
    },
    {
      "barNumber": "30",
      "description": "L1 but bottom of TR, BLB, PP BB"
    },
    {
      "barNumber": "31",
      "description": "SBU, HLMTR, but tail, at MA, B2. BL need C above MA, else TR"
    },
    {
      "barNumber": "32",
      "description": "BBLBC, C above MA, PS MG. BR want F BO and LH in BRCH at MA. AIL, but might"
    },
    {
      "barNumber": "33",
      "description": "BL FT, AIL, but PS BLCH instead of SPBL. BLE4. BR want BT but 4 BLB, BO 23 H"
    },
    {
      "barNumber": "34",
      "description": "BBLBC, but PS BVT of LLW and MMU from 31 H. BTC, but nee stop below MA. MA"
    },
    {
      "barNumber": "36",
      "description": "BO above LLW, test 13 SX H, MMU from 31 H so PS PTG soon, but BB around MA."
    },
    {
      "barNumber": "37",
      "description": "L2 24, F BO MA and LLW, but MRV, BB around MA. H1, but BRB, BX, PP SA around"
    },
    {
      "barNumber": "38",
      "description": "SBD, but MRV, PP SD to MA, PS BTC, S2"
    },
    {
      "barNumber": "39",
      "description": "L1 but BLB and just above MA, PP BB around MA. H1 but DD after 2 BRB and BX"
    },
    {
      "barNumber": "40",
      "description": "HL at MA, AIL, but might go SD more so NWS. BL want new HOD but might enter"
    },
    {
      "barNumber": "41",
      "description": "L1 but PP MRV and BB. H1 but 6 BBRMC, NWS. AIL, but might get deeper PB. 3 DD"
    },
    {
      "barNumber": "43",
      "description": "H1, MDB, MA, but 8 BBRMC, NWS. PS SA for MMD to 31 L and TR instead of BLT."
    },
    {
      "barNumber": "44",
      "description": "OD, PS MMD to 31 L, but PS BRTP and TR. TR likely, but bottom might be 31 L."
    },
    {
      "barNumber": "45",
      "description": "H2 43, but DD after SBD 44, NWS. still AIL"
    },
    {
      "barNumber": "48",
      "description": "II on 60m. On 5 min, AIL, but TR since 35. should reach OOD before EOD, and"
    },
    {
      "barNumber": "49",
      "description": "TRI 7 36, but AIL, PP MRV, NS"
    },
    {
      "barNumber": "50",
      "description": "H1, 36 H and OOD MGA, but BRB, top of TR 35, NS. PS W 47 49"
    },
    {
      "barNumber": "51",
      "description": "L below L of 50 so end of bull micro channel after 23 bars. should get new"
    },
    {
      "barNumber": "52",
      "description": "W 47 49, LH DT 36, but AIL, PP MRV in TR, OOD MGA, DD, PS BB, NS"
    },
    {
      "barNumber": "55",
      "description": "SBU, BO 60m II and OOD, but need FT, else W 23 36"
    },
    {
      "barNumber": "56",
      "description": "F BO, BLTP, test OOD, W 23 36, but tail. SPBL, NS. H1, HOD and 60ma MGA, but"
    },
    {
      "barNumber": "57",
      "description": "MDT 55, W, at OOD, but BLB, NS, S2"
    },
    {
      "barNumber": "58",
      "description": "OD, W top, but at MA, NS. middle of TR since 35, at MA, so PP not swing down,"
    },
    {
      "barNumber": "60",
      "description": "HL in BL CH at MA, but BBRB 58 after W top, TTR 49, TR 35, LOM, HPW"
    },
    {
      "barNumber": "61",
      "description": "LH after W 23 36, but just above MA, TTR, NS, HPW"
    },
    {
      "barNumber": "63",
      "description": "OU, above MA, AIL, but TTR, NS. might get 1 more push up for W 36 55 at 60ma."
    },
    {
      "barNumber": "65",
      "description": "MDB above MA, AIL, but TTR, OOD might remain MGN for test of day, NS, HPW"
    },
    {
      "barNumber": "68",
      "description": "4 CC BLB, BGP, AIL, increased chance of BL BO, but PP will not get above"
    },
    {
      "barNumber": "81",
      "description": "End of Day"
    }
  ],
  "17": [
    {
      "barNumber": "1",
      "description": "Y was ID and 4th CC day in TTR. PS ID again today for II on daily so PS SA"
    },
    {
      "barNumber": "2",
      "description": "CC BRB but big tails, not big bodies, and at 60ma and in middle of Y. TRO,"
    },
    {
      "barNumber": "4",
      "description": "SBD, BO GXL, LOY MGB"
    },
    {
      "barNumber": "5",
      "description": "CCBBRB, still STC, but PS BB around LOY. BL want 2LT 2"
    },
    {
      "barNumber": "6",
      "description": "2LT 2, BLB, BRE, but small body, B2"
    },
    {
      "barNumber": "7",
      "description": "L1 but tail, bottom of 5 day TTR, PS BB, NS"
    },
    {
      "barNumber": "8",
      "description": "MDB 6, PL, BRE, but DD, NS. BR want BO below 5 day TTR and weekly CH and 50d"
    },
    {
      "barNumber": "9",
      "description": "SBD, BO LOY, 50d MA MGB, but bottom of 5d TTR so BZ"
    },
    {
      "barNumber": "10",
      "description": "F BO LOY, MW 6 8, PW 2 6, PL, BRE, but TC so PP MRV"
    },
    {
      "barNumber": "11",
      "description": "L1 but still on 10 B, stop below 10. better to S below 10, PS SPBL and LOD"
    },
    {
      "barNumber": "12",
      "description": "OU but tail, DBL might exit"
    },
    {
      "barNumber": "13",
      "description": "BRD, DBL might exit. L2 but tail, S2"
    },
    {
      "barNumber": "16",
      "description": "DB with L of 4 days ago at bottom of 5 day TTR, COH, BRE, W 6 10, PL, but 50d"
    },
    {
      "barNumber": "17",
      "description": "L1, 50M MGB, AIS, but CC BLB, NS, S2"
    },
    {
      "barNumber": "18",
      "description": "L1, 50M MGB, AIS, SPBR, but tail, far below MA, LBLM, NS, PP BB and below 16"
    },
    {
      "barNumber": "19",
      "description": "II, L1, 50M MGB, but still on 16 B, S2"
    },
    {
      "barNumber": "21",
      "description": "big OU, F BO LOD and 16 W, just above 50M, PL, PS start of 2 week rally, but"
    },
    {
      "barNumber": "22",
      "description": "FT, PS AIL, but DD and still below MA. DT 12 T MA, but SBU 21 with FT, S2"
    },
    {
      "barNumber": "23",
      "description": "BRB, LH DT 12, 40% chance of BO 21 NL and then MMD, NS. BL want HL around 20"
    },
    {
      "barNumber": "24",
      "description": "SBD, AIS, 40% chance will fall for MMD from DT12 23"
    },
    {
      "barNumber": "25",
      "description": "LL MTR, ET 16 21, within a tick of 50M, but 3 BLB, BRE4, B2"
    },
    {
      "barNumber": "26",
      "description": "H2 25, LL MTR, but 5 BRB, BRE4, B2"
    },
    {
      "barNumber": "28",
      "description": "BLB but tail, just below MA, B2. L1 but BLB, bottom of TTR 16, NS"
    },
    {
      "barNumber": "29",
      "description": "BBRBC, but bottom of TTR so PS BTC"
    },
    {
      "barNumber": "32",
      "description": "3 BWBRB, PS LOD, but need BO MA and TTR 16, else LOM"
    },
    {
      "barNumber": "33",
      "description": "LH at MA in BR CH 12, COL, but still BOM, NS, PS BB and start of SPBL. TTR,"
    },
    {
      "barNumber": "34",
      "description": "HL in PS SPBL, but need BO of TTR and MA, B2"
    },
    {
      "barNumber": "35",
      "description": "BBLBC, C above MA so BO MA, but need FT and BO 23 NL of DB 21 29 and top of"
    },
    {
      "barNumber": "36",
      "description": "W rally to LH DT at MA, but NS since TTR and at 50M on daily, PS SPBL and BB"
    },
    {
      "barNumber": "37",
      "description": "H1, SPBL, but top of TTR, NS"
    },
    {
      "barNumber": "39",
      "description": "W 33 36 rally to DT 12, PH, BLE, but just above MA and TC, NS, PS still in"
    },
    {
      "barNumber": "40",
      "description": "H1 but BRB, PP SA for 2LSD after W"
    },
    {
      "barNumber": "43",
      "description": "BO but not big so PS HL MTR soon. middle of TTR, NHP STC. BRE4"
    },
    {
      "barNumber": "46",
      "description": "still AIS and STC, but bottom of TTR, NS"
    },
    {
      "barNumber": "48",
      "description": "HL DB MTR 29, exactly at 50M, OU, COH, PL, but 6 BRB, PS STC and SA, NS, B2"
    },
    {
      "barNumber": "49",
      "description": "HL DB 29 MTR, MDB, PL, but TC and just below MA, NS, PS SA and at MA. HPW for"
    },
    {
      "barNumber": "50",
      "description": "L1, MDT 48, AIS, at MA, but BLB, bottom of TR, NS"
    },
    {
      "barNumber": "51",
      "description": "OD at MA, AIS, but tail, bottom of TR, NS"
    },
    {
      "barNumber": "52",
      "description": "BO below TR and 50MA, BR want MMD, but need FT. BL want F BO and need BLB"
    },
    {
      "barNumber": "53",
      "description": "F BO but tail and small body, NS, B2. BRE, but BR want L1 soon"
    },
    {
      "barNumber": "54",
      "description": "CCBLB, COH, PL, but NS. L1 but CC BLB, PS BB, S2"
    },
    {
      "barNumber": "55",
      "description": "L1, but 3 BLB, NS. still on 53 B, but BL need BO MA"
    },
    {
      "barNumber": "56",
      "description": "4 CC BLB, BL want REVU from below 50M, but PS STC since at MA, NS. still AIS"
    },
    {
      "barNumber": "57",
      "description": "OD, LH DT 51 at MA, but after 4 BL so PS BB , NS"
    },
    {
      "barNumber": "58",
      "description": "HL, FBO TTR 2EB, still on 53 B, but BRB, after BBRB and just below MA, NS,"
    },
    {
      "barNumber": "59",
      "description": "BLBC, but just below MA, PS STC. BL need BO MA"
    },
    {
      "barNumber": "60",
      "description": "L2 at MA, AIS, but TTR 52, LOM, PS BB, NS"
    },
    {
      "barNumber": "62",
      "description": "DB, F BO TR 25 and 50MA, PL, but TTR, NS"
    },
    {
      "barNumber": "63",
      "description": "CCBLBC, C above MA, but barely. need FT and C far above MA for AIL. BR want"
    },
    {
      "barNumber": "64",
      "description": "DT at MA, but BRD, S2"
    },
    {
      "barNumber": "65",
      "description": "BRBC, DT, but PS BTC since BL do not wantBO below BRBC at MA"
    },
    {
      "barNumber": "66",
      "description": "OD, but PS BT 62 BSB H. BR want LH DT 57 and BO below LOD. DD in TTR, still"
    },
    {
      "barNumber": "67",
      "description": "still on 62 B but TTR 63, at MA and 50M, BOM, LOM. traders want to see CC big"
    },
    {
      "barNumber": "81",
      "description": "End of Day"
    }
  ],
  "22": [
    {
      "barNumber": "1",
      "description": "FOMC announcement at 11 am PST today. Day traders should exit positions before"
    },
    {
      "barNumber": "2",
      "description": "CCBRB1C, but PP MRV"
    },
    {
      "barNumber": "3",
      "description": "H1, CUPU, but 9 CC BRB, B2"
    },
    {
      "barNumber": "5",
      "description": "CCBLB1C, GX H MGA. other MGA are Fri L, 4400 BRN, MP of August, 50MA"
    },
    {
      "barNumber": "6",
      "description": "SBU, BO 60ma, BTC"
    },
    {
      "barNumber": "7",
      "description": "CCBLBC, many MGA"
    },
    {
      "barNumber": "8",
      "description": "LH DT HOY, L2 1, top of 3 day TR, but SBU 5 6 7, BLB, PP BB, S2, BLE4"
    },
    {
      "barNumber": "9",
      "description": "H1, MGA, but BRB, PS SA, B2"
    },
    {
      "barNumber": "10",
      "description": "BL IB, H1, but PS W 1 8 at HOY, NS"
    },
    {
      "barNumber": "11",
      "description": "II, H1, but NS since PS W 1 8 and DT HOY. PH, L2, but DD, strong SBU 6 7, NS"
    },
    {
      "barNumber": "12",
      "description": "DD, but still AIL, MGA. BLE4. W 1 8, PH, but DD, S2"
    },
    {
      "barNumber": "13",
      "description": "BLB, AIL, MGA, but tail, did not C above 12 so not strong BLT. W 1 8, PH, but"
    },
    {
      "barNumber": "14",
      "description": "H1, but weak rally, LBRM, NWS, NS. W 1 8 but DD, PS new W 8 13, S2"
    },
    {
      "barNumber": "15",
      "description": "W 1 8, BRB, BLE, PH, but NS, tail, S2"
    },
    {
      "barNumber": "16",
      "description": "H2, but 3 DD, weak rally, NS, PS LOM 8"
    },
    {
      "barNumber": "18",
      "description": "BO, C above 13, PS MG, MGA. BR want BRT and W 8 13, but need strong SSB"
    },
    {
      "barNumber": "19",
      "description": "W 8 13, F BO HOY, RB, but BLB, S2. BLE4"
    },
    {
      "barNumber": "20",
      "description": "W but SBU 18, MGA, SPBL, NWS, might get L4 (CC L2)"
    },
    {
      "barNumber": "21",
      "description": "H1, SPBL, MGA, but NS since lots of tails, PS FBO and L4 8 14 20"
    },
    {
      "barNumber": "23",
      "description": "L4, PH, BLE, but SPBL, NS, PP MRV"
    },
    {
      "barNumber": "24",
      "description": "H1, SPBL, MGA, but BRD, NS"
    },
    {
      "barNumber": "25",
      "description": "SBU, SPBL, MGA"
    },
    {
      "barNumber": "28",
      "description": "BX at MMT from 18 MG, L4 8 14 20, TGTB 23 L at bottom of BX, but DD, SPBL,"
    },
    {
      "barNumber": "29",
      "description": "big DD, F BO 4400 BRN, BX, BLE. PH but SW more likely than down ahead of 11"
    },
    {
      "barNumber": "30",
      "description": "IOI, H1, SPBL, but extreme BX 29, NS, B2. PH25 L MGB since most recent BX,"
    },
    {
      "barNumber": "31",
      "description": "II so H1, but extreme BX, NWS, B2. PH, 23 L and MA MGB, but PP MRV, and PS"
    },
    {
      "barNumber": "32",
      "description": "H1, F II, but CC BRB, B2. BRE above 30 II or HOD. PP 2LSD, PS to MA and 25 L."
    },
    {
      "barNumber": "34",
      "description": "MDB 32, AIL, but 6 BBRMC, BX, B2, still on 31 II S. PS TTR and LOM ahead of"
    },
    {
      "barNumber": "36",
      "description": "3 CCBLB, AIL, but TR more likely than new H, might go a little above 30 II to"
    },
    {
      "barNumber": "38",
      "description": "LH, DT 30, 25 L MGB, but PP 20GB BL at MA"
    },
    {
      "barNumber": "42",
      "description": "20GBB, H2 34, but 25 L MGB, B2. exit daytrades ahead of 11 AMPT FOMC"
    },
    {
      "barNumber": "43",
      "description": "BO, need FT for AIS, still on 31 II S and 38 LH S, but PP TR soon around HOY"
    },
    {
      "barNumber": "44",
      "description": "EMA and closing near their lows so probably will go lower and possible Sell"
    },
    {
      "barNumber": "47",
      "description": "IOI at HOY, H2 34, but 10BBRMC and only 35 minutes to FOMC, PP MRV, NS, HPW"
    },
    {
      "barNumber": "49",
      "description": "LH but 3 BLB, FOMC soon, HPW"
    },
    {
      "barNumber": "55",
      "description": "FOMC, big OU, PP AIL, PP BTC, but better to wait for FT"
    },
    {
      "barNumber": "56",
      "description": "HH DT 29 at 4400 BRN, F BO 55, PH, but more likely PB from 56, S2. MGA are"
    },
    {
      "barNumber": "60",
      "description": "H1, DB 56, top of G and 50MA MGA, but TTR 56, PS LOM and SA, NS, PP NWS"
    },
    {
      "barNumber": "61",
      "description": "LH at 4400 BRN but just above MA, tail, TTR, LOM, S2"
    },
    {
      "barNumber": "63",
      "description": "EMA, but bears need big bear bars closing near their lows to significantly"
    },
    {
      "barNumber": "64",
      "description": "SBD, but just above 60ma and 55 L, NS, TR, better to wait for breakout or 2nd"
    },
    {
      "barNumber": "66",
      "description": "L1 but BBL 65 at 60ma, S2, PP BB"
    },
    {
      "barNumber": "67",
      "description": "DB PB 55 65, but BRB, TTR 65 just below MA, NS. BRE4"
    },
    {
      "barNumber": "81",
      "description": "End of Day"
    }
  ],
  "23": [
    {
      "barNumber": "1",
      "description": "F BO HOY, but tail, BLB, 50M MGA"
    },
    {
      "barNumber": "2",
      "description": "CCBLB1C, should go above 50M and GXH, BTC. TR, better to wait for breakout or"
    },
    {
      "barNumber": "3",
      "description": "BL FT, still BTC. BO 50M and GXH"
    },
    {
      "barNumber": "4",
      "description": "BBLBC, BO above 50M, but might start to go SW around 50M since it has been"
    },
    {
      "barNumber": "5",
      "description": "BRB, but C above MP. still BTC, but no CCBBLBC so PS PW 1 3 5. 50M might be"
    },
    {
      "barNumber": "6",
      "description": "CCBRB, COL, PH, PW 2 4, BLE, but 6 BBLMC, MRV, S2. PS BTC since BL do not want"
    },
    {
      "barNumber": "8",
      "description": "H1, but BRB, PS PW 4 7, LBRM, PS SA, NWS. 8 BBLMC,"
    },
    {
      "barNumber": "9",
      "description": "H1, COH, but PS SA and PTG, PS PW, B2"
    },
    {
      "barNumber": "10",
      "description": "PW 6 7, LBRM, BLE4, but DD, 10 BBLMC, MRV, S2, PP BB"
    },
    {
      "barNumber": "11",
      "description": "H1, BTC, but PW 7 10, PP PTG soon, but PP BB and MRV after 11 BBLMC, S2"
    },
    {
      "barNumber": "12",
      "description": "PW, COL, BLE. PH but 12 BBLMC, PP MRV, NS, HPWS2"
    },
    {
      "barNumber": "13",
      "description": "H1, but PP 2LSD after PW, B2, or NWS"
    },
    {
      "barNumber": "15",
      "description": "H2 13, DB 8, BT 6, should get new H, but 2 BRB, LRP"
    },
    {
      "barNumber": "16",
      "description": "SBU"
    },
    {
      "barNumber": "17",
      "description": "CCBLBC, SBU 16 17. PS MMU from 8 14 DB, and a measured move up\">DBBF"
    },
    {
      "barNumber": "18",
      "description": "BLTP, PH, BLE, but SBU 16 17, PP BB and 2LSU, S2"
    },
    {
      "barNumber": "19",
      "description": "CCBRB1C, PH, but SBU 16 17 so still PP MRV. TR likely after BX on open"
    },
    {
      "barNumber": "21",
      "description": "H1, AIL, SPBL, but 3 BRB, PS TR, NWS below 8. L1, still on 18 S for PH, but"
    },
    {
      "barNumber": "23",
      "description": "DB 8, BT 6, 17 C MGA, but 7 BBRMC, TR since 8, PS MRV and DT 21, NS"
    },
    {
      "barNumber": "24",
      "description": "BO but tail, not big BLB, PP MBO and more TR. DBTCBL might S around 17 C and"
    },
    {
      "barNumber": "25",
      "description": "CC BLB, AIL, 17 C MGA, but tail, top of TR 8, B2"
    },
    {
      "barNumber": "26",
      "description": "LH, HST 12 17, but 3 BLB, AIL, PP MRV, S2, PP BB"
    },
    {
      "barNumber": "27",
      "description": "DBPB 8 23, still AIL, PP BTC, stop below 8. HST but 3 BLB, tail, S2"
    },
    {
      "barNumber": "28",
      "description": "DBPB, BRE, but DD after BBRB, middle of TR, still on 18 S, NS"
    },
    {
      "barNumber": "30",
      "description": "DT LH MTR 26, but CC BLB, S2. TR since 8. BOM,"
    },
    {
      "barNumber": "32",
      "description": "IB, but TTR, Tri 17 26 30. BOM. AIL but PS FF. DT LH, but just above MA, PP"
    },
    {
      "barNumber": "33",
      "description": "COL, TRI, PH, but just above MA, AIL, PP BB around MA, NS, S2"
    },
    {
      "barNumber": "36",
      "description": "OU, 20GBB, but top of TTR, NS"
    },
    {
      "barNumber": "39",
      "description": "IOI, H1, but weak BLT, NS. HH MTR, FF 35 TRI, but DD, MA SO just below, S2."
    },
    {
      "barNumber": "43",
      "description": "H1, but odds favor at least 3 bars with L below MA before EOD so PP SRS not"
    },
    {
      "barNumber": "46",
      "description": "II, H1, but should get PB to MA soon so PP FF. W 40 44"
    },
    {
      "barNumber": "51",
      "description": "BRD, W 40 44, should start SD to MA here or soon. OK for BL to exit at mkt or"
    },
    {
      "barNumber": "52",
      "description": "H1, SPBL, MMTA, but 2 BRD and should get at least 3 bars with L below MA so"
    },
    {
      "barNumber": "55",
      "description": "PW 44 51, 99.9% chance of at least 3 bars with lows below MA before EOD, BLE,"
    },
    {
      "barNumber": "58",
      "description": "1st bar with L below MA. even though 36 and 57 touched EMA, L was not visibly"
    },
    {
      "barNumber": "59",
      "description": "20GBB, but only 2 bars with L below MA. wait for 3 before looking to B, and"
    },
    {
      "barNumber": "60",
      "description": "3rd bar with L below MA so BL will start looking to B, but might need MDB"
    },
    {
      "barNumber": "61",
      "description": "L1 but AIL and PP BB for test HOD. S2"
    },
    {
      "barNumber": "62",
      "description": "H2 at MA, 20GBB, MMTA and HOD MGA, but BRB, B2."
    },
    {
      "barNumber": "63",
      "description": "CCBRB1C, EMA and closing near their lows so probably will go lower and"
    },
    {
      "barNumber": "64",
      "description": "H2, but DD. MAGB but DD, NWS"
    },
    {
      "barNumber": "65",
      "description": "H2 60 64, MAGB, BLB, but tail, NWS. B2. if BL get BO above MA, then PP will"
    },
    {
      "barNumber": "66",
      "description": "L1, AIS 63, but weak BRCH, CC BLB, PP BB, NS"
    },
    {
      "barNumber": "67",
      "description": "L1, 23 L at start of BL CH MGB, but 3 CCBLB, PS BB, NS. 3 CCBLB, COH, but not"
    },
    {
      "barNumber": "81",
      "description": "End of Day"
    }
  ]
}