{
  "5": [
    {
      "data": [
        "<article class=\"post-59949 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Year end rally after presidential election Emini weekend update: November 5, 2016\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Year end rally after presidential election<br>Emini weekend update: November 5, 2016</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2016-11-05T00:30:47-07:00\">November 5, 2016</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Exhaustion gap</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/11/m.png\"><img loading=\"lazy\" src=\"2016-11-5.png\" alt=\"Monthly emini closed gap so buy climax\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart finally pulled back below the July 2015 high. The July 2016 breakout is therefore an exhaustion gap.<p>The monthly S&amp;P500 Emini futures candlestick chart has pulled back for 3 months. I have been writing since the July breakout that the breakout was probably an exhaustion move. When a strong breakout occurs after 20 bars in a trend, it is more likely an exhaustion gap than a measuring gap. The July breakout came after 100 bars in a bull trend. By this week trading below the July 2015 top of the 2 year trading range, the bears closed that gap. Hence, the July 2016 bull breakout is now an exhaustion gap. This therefore meets one of the objectives that I have discussed since July.<p>Furthermore, there were 7 consecutive bull trend bars on the monthly chart in August. In the 18 years of the Emini, there have never been 8. In addition, every time there has been 7, the Emini corrected about 100 points. This is also a 5% pullback. The Emini met that objective as well this week.<h3>Bull flag more likely than reversal</h3><p>Because there are other targets below on the daily chart, this pullback will probably fall further. Yet, the 3 bar pullback is still more likely a bull flag on the monthly chart than the start of a bear trend. However, because the 2 year trading range is probably the final bull flag before a 1 – 3 year correction, there will probably be sellers above the old high.<h3>Emini at 1500 in 2 – 3 years</h3><p>Because of the Final Flag top on the monthly chart, traders will sell any new high. The odds are that the Emini will trade down to the bottom of the Final Bull Flag, even if there is one more new high. Hence, the selloff should reach 1800 within a year or two.<p>Since the bottom of the 2 year trading range is support and the monthly chart is in a bull trend, bulls will buy there. As a result, there probably will be a rally. That rally will then probably fail around the old high.<p>If it turns down from a lower high, it would form a lower high major trend reversal. Because there is a Final Flag in 2016, a lower high would be the right shoulder of a Head and Shoulders top. The Final Flag would be the left shoulder.<p>The monthly chart has been in a bull trend for 7 years. Because that is unusual, it is unsustainable and therefore climactic. Hence, the Emini will probably sell off for at least TBTL Ten Bars, Two Legs.<p>Ten monthly bars is about a year, but it could be longer. Especially relevant is the double top around 1500. The gap between the current price and those tops probably will close. A correction is often about half as long as the bull trend. Since the bull trend lasted 7 years, the move down might take 3 years. Because Emini corrections are often climactic, the test of 1500 will probably come in less than 3 years.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Breakout below 4 month trading range</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/11/w-1.png\"><img loading=\"lazy\" src=\"2016-11-5-1.png\" alt=\"weekly emini bear breakout\"></a><p class=\"caption\">This week, the weekly S&amp;P500 Emini futures candlestick chart had a big bear trend bar. This is a strong breakout below the 4 month trading range. Yet, the bears need follow-through selling next week if this selloff will lead to a reversal.<h3>Measuring gap or exhaustion gap?</h3><p>The weekly S&amp;P500 Emini futures candlestick chart this week had a big bear bar that closed below the past 16 bars. The bears want a measuring gap. Hence, they need a bear bar again next week as well. If next week is a big bear bar closing on its low, the bears might be able to test the July 1975.00 bottom of the buy climax. That would be below last year’s close. It would therefore turn the Emini negative on the year.<p>The bulls want next week to have a bull body. They would then see it as a buy signal bar for a failed bear breakout. It would also be a big High 2 bull flag with the September 16 low. In addition, it would be around a 50% pullback of the July rally. This would turn last week’s bear breakout into an exhaustion gap.<p>Most likely, next week will not be a strong bear trend bar nor a strong bull reversal bar. While the odds are there will be some follow-through selling, this is more likely a Big Up (July), Big Down, Big Confusion pattern. Therefore, the weekly chart will probably go sideways within a week or two. Furthermore, next week will probably disappoint the bulls and bears. Therefore, the Emini might go sideways for 2 – 3 weeks.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Year end rally after presidential election</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/11/d.png\"><img loading=\"lazy\" src=\"2016-11-5-2.png\" alt=\"daily emini sell climax\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart broke strongly below the September 12 bottom of the 4 month trading range.<p>The daily S&amp;P500 Emini futures candlestick chart had 7 consecutive bear bars in its break below the 4 month trading range. This is unsustainable and therefore a sell climax. Yet, there is still no bottom.<p>I have written many times about the August double top in the tight trading range. I posted an<a href=\"https://www.brookstradingcourse.com/analysis/october-5-correction-before-presidential-election/\">example of that type of pattern</a>in my October 5 weekly blog. The title of that blog was, “October 5% correction before presidential election.” While the 5% correction came before the election, it also came 3 days after October.<h3>Sell climax will probably end next week</h3><p>That article has a 5 minute chart with a double top in a tight trading range. This is comparable to the tight trading range double top in August on the daily chart. I said that this pattern often has 2 legs down. Especially relevant is that the 2nd leg is often a sell climax. In addition, bulls usually buy the sell climax and there is then usually a strong reversal up.<p>The daily chart is currently in a sell climax. The odds are that there will be a sharp reversal up. Yet, the channel down has been tight. Therefore, there will probably be at least a little more down before the buyers come in. If there is a climactic reversal up, it will probably come within a week or so. Hence, it might come just after the election. A reversal up does not mean a new high, yet it might last until the end of the year.<h3>Support below</h3><p>Furthermore, I have talked many times about the pullback probably falling to 2040 – 2060. The July 6 low was the 1st pullback after the June bottom. It is therefore a magnet for the bears who held and scaled in during the past 4 months. They will take profits there. In addition, there is a big gap below the June 29 low of 2035.75. Lastly, the Emini might test all of the way down below last year’s close to the June bull trend low. Yet, that is unlikely. However, if the bears hold the market there, the stock market would have a down year.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2016-11-5"
    }
  ],
  "12": [
    {
      "data": [
        "<article class=\"post-60264 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"President Trump’s stock market year end rallyEmini weekend update: November 12, 2016\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">President Trump’s stock market year end rally<br>Emini weekend update: November 12, 2016</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2016-11-12T00:30:55-08:00\">November 12, 2016</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>3 month bull flag</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/11/m-1.png\"><img loading=\"lazy\" src=\"2016-11-12.png\" alt=\"emini bull flag at all time high\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart formed an outside up month after a 3 month pullback. Because there is a 4 bar tight trading range, it might continue sideways for another month or two.<p>The monthly S&amp;P500 Emini futures candlestick chart has pulled back for 3 months since the August high. I said in August that August was the 7th consecutive bull trend bar on the monthly chart. In addition, there have never been 8 consecutive bull bars since the Emini began 18 years ago. Furthermore, after every time there were 7, the Emini corrected down about 100 points. I therefore said that the Emini was likely to pull back for about 100 points. It did this week.<p>Since 7 consecutive bull bars is a sign of strength, I said that the bulls would buy the 100 point pullback. They therefore saw the selloff as a bull flag instead of a bear trend reversal.<h3>Closure of gap above July 2015 trading range</h3><p>The Emini went sideways for about 4 months. During that time, I said that the gap above the top of the 2 year trading range had a 70% chance of closing. There, the strong July breakout above the range was more likely an exhaustion gap than a measuring gap. Because of that, I said that if the bulls broke to a new high, it would probably soon fail. This is because the magnetic pull of the July 2015 high was strong. The bulls were unlikely to be able to escape its pull.<p>Since there were probably sellers above the July to October trading range and buyers below the July 2015 high, traders could fade whichever came first. As a result, bulls bought below the July 2015 high, expecting the current rally to go to a new all-time high. While the Emini rallied strongly this week, there is still room to the all-time high of 2185.00.<h3>Major reversal after new all-time high</h3><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/11/m-50-y.png\"><img loading=\"lazy\" src=\"2016-11-12-1.png\" alt=\"monthly emini buy climax after trump election\"></a><p class=\"caption\">The rally has lasted 7 years on the monthly chart. There have been many other rallies in the past 50 years that have lasted 5 – 7 years. Each one was followed by a 25 – 50% correction of the rally. Therefore the same is likely this time.<p>How long can last week’s rally last if it leads to a new high? Maybe 5 – 10 bars. Since this is a monthly chart, that means the current rally might last all of 2017. Yet, the 2 year trading range will probably be the Final Bull Flag.<p>The bull trend began in March 2009 at 473.50. The current high is about 2100. That is about a 1600 point rally. A 50% correction would be 800 points. That is probably too much. However, a 25% correction would be 400 points. That would take the Emini down to 1700. It would therefore be below the 1800 low of the 2 year trading range.<p>In the current bull trend, the Emini broke above a double top at around 1500. Those highs were in 2000 and 2007. That is therefore a support area. If there is a repricing of the Emini, which is likely, that would be a logical magnet.<h3>The importance of the bond market</h3><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/11/US.png\"><img loading=\"lazy\" src=\"2016-11-12-2.png\" alt=\"bond futures wedge top\"></a><p class=\"caption\">The 30 year bond futures chart is reversing down from a nested wedge top on the monthly chart. This chart shows 15 years of a 30 year rally.<p>As a result of the nested wedge tops, this is probably the end of the 30 year bull trend. Therefore, interest rates will probably continue to rise for 10 – 20 years. Because of this, investors will begin to get good returns from CDs and other low risk interest rate investments. They therefore will transfer some of their portfolio from stocks to these safer alternatives. This selling of stocks will contribute to the stock market repricing.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Strong bull breakout above a High 2 bull flag</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/11/w-2.png\"><img loading=\"lazy\" src=\"2016-11-12-3.png\" alt=\"emini weekly chart bull flag\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart dipped below the July 2015 high at the top of a 2 year trading range. After closing that gap, it reversed up strongly this week.<p>The weekly S&amp;P500 Emini futures candlestick chart reversed up strongly this week after last week’s strong bear breakout. The bulls saw the selloff from the August all-time high as a big High 2 bull flag. Yet, this week’s candlestick had a big tail on top. Because it is stalling at the all-time high, it might go sideways for a week or two before breaking to a new high. Since the reversal up was so strong, the odds favor a new all-time high soon.<p>The bears want this sharp rally to be a bull trap that creates a double top with the August all-time high. While this is possible, it is not likely. Yet, if the bears can prevent a new all-time high for several weeks, they could create a micro double top. This would increase the probability of a reversal down. Until there is a micro double top, the odds favor sideways to up over the next few weeks.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Buy climax and test of the all-time high</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/11/d-1.png\"><img loading=\"lazy\" src=\"2016-11-12-4.png\" alt=\"daily emini bull flag at all-time high\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart had huge bars this week, but was unable to break to a new all-time high. The bulls are exhausted. They therefore might need more bars before they begin to buy again. The bears want a double top with the August high.<p>The daily S&amp;P500 Emini futures candlestick chart had a climactic reversal up this week. Yet, it failed to break above the 4 month trading range to a new all-time high. Since the rally covered 100 points in one week, which is unusual, the bulls are probably exhausted. As a result, many take partial windfall profits. Hence, they want to see if the bears can create a double top with the August all-time high.<h3>Bull flag formation</h3><p>If the bears are unable to turn the market down after 2 – 3 attempts, the bulls will conclude that the bears are weak. The bulls therefore buy the 2nd or 3rd reversal back up. Hence, they see the pullback as a High 2 bull flag, or a Triangle, or a Wedge bull flag. This is how these patterns typically form.<p>Yet, if the bears are able to get a strong bear breakout, the bulls will continue to wait. They want to see the selloff stall at some support level before buying again. Because the rally was so strong, the odds are that the bulls will buy the 1st reversal down. Hence, the 1st reversal will probably be minor. It therefore would more likely be a bear leg in a trading range than the start of a bear trend.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2016-11-12"
    }
  ],
  "19": [
    {
      "data": [
        "<article class=\"post-60486 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Presidential election stock market rally is stallingEmini weekend update: November 19, 2016\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Presidential election stock market rally is stalling<br>Emini weekend update: November 19, 2016</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2016-11-19T00:30:55-08:00\">November 19, 2016</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>President Trump’s all-time high bull breakout</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/11/m-2.png\" target=\"_blank\"><img loading=\"lazy\" src=\"2016-11-19.png\" alt=\"monthly emini breakout above August high\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart formed an outside bar this month after a 4 month pullback from a new high.<p>The monthly S&amp;P500 Emini futures candlestick chart currently has an outside up month. The bulls want the month to close above last month’s high. This would therefore be an additional sign of strength.<p>The 4 month pullback from the August high was a bull flag. The odds therefore favor at least a little more up. Yet, the monthly chart is in a 4 month tight trading range. This limits the chances for a big bull breakout. Furthermore, it increases the chances that the Emini will be mostly sideways for at least one more month.<h3>What do the bears need for a monthly sell signal?</h3><p>If December is an inside bar, it would create an ioi Breakout Mode setup. If it is a bull bar, the bulls would be more inclined to buy above December’s high. Hence, they would be looking for at least one more month up.<p>Yet, the bears want December to be reversal bar. If December trades above November, the bears will try to create a bear reversal bar. If December is an inside bar, the bears will try to make it close on its low. In the absence of a strong sell signal bar, most bear will not sell on a stop below December’s low.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Follow-through buying after last week’s breakout</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/11/w-3.png\" target=\"_blank\"><img loading=\"lazy\" src=\"2016-11-19-1.png\" alt=\"Weekly emini breakout of wedge bull flag\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart had a bull body this week. Bulls therefore see this week as an acceptable follow-through bar.<p>The weekly S&amp;P500 Emini futures candlestick chart this week had a bull body. While the bar was not a strong bull trend bar, the bull body increases the chances of higher prices over the next couple of weeks. The odds would have been better if this week was a big bull trend bar.<p>Yet, it is still possible for next week to reverse this week. The bears want to create a big bear trend bar next week. Furthermore, they want it to close on its low and at or below this week’s low. They would then increase the chance of a higher high major trend reversal on the weekly chart.<p>Because last week was such a big bull bar and this week was a consecutive bull bar, the Emini will probably go at least a little higher. This is true even if next week is a bear sell signal bar. If it is, there will probably be more buyers than sellers below its low.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Presidential election stock market rally is stalling</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/11/d-2.png\" target=\"_blank\"><img loading=\"lazy\" src=\"2016-11-19-2.png\" alt=\"daily emini small wedge top\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart made a new all-time high this week. Additionally, it is in an 8 bar bull micro channel. Yet, the bears see the rally was an 8 day wedge.<p>The daily S&amp;P500 Emini futures candlestick chart broke to a new high and has an 8 day bull micro channel. While the 8 day channel has lacked big consecutive bull bars, it was strong enough so that bulls will buy the 1st reversal down.<p>Because the 8 day rally had 3 pushes up, it is a wedge top. Yet, when a wedge top is also a tight bull channel, it usually is a minor top. As a result, bulls will buy the reversal down. Furthermore, bears will be hesitant to sell below bars until after at least a couple big bear days. Therefore, while the rally will probably pull back next week, the pullback will likely create a bull flag. Hence, the odds still favor higher prices, even if a couple small legs down follow the small wedge top.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2016-11-19"
    }
  ],
  "26": [
    {
      "data": [
        "<article class=\"post-60741 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"President Trump stock market rally will pull back next weekEmini weekend update: November 26, 2016\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">President Trump stock market rally will pull back next week<br>Emini weekend update: November 26, 2016</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2016-11-26T00:30:58-08:00\">November 26, 2016</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Outside up month</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/11/m-3.png\"><img loading=\"lazy\" src=\"2016-11-26.png\" alt=\"S&amp;P500 Emini monthly chart breakout\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has an outside up month in November. The bulls want it to be a Measuring Gap, while the bears hope it will be an Exhaustion Gap.<p>The monthly S&amp;P500 Emini futures candlestick chart traded below October’s low and above its high. November is therefore an outside month. If the Emini is on its high when the month closes on Wednesday, it would be a sign of especially eager buying. It would therefore make higher prices likely. The bulls are hoping for a measured move up after the 2 year trading range. The target is around 2380.<p>Because this big bull outside bar is in a 4 bar tight trading range, there is an increased chance that the bulls will be disappointed once the month closes. Hence, there might be a tail on the top of the bar. This would therefore be a sign that bulls took some profits. They therefore would be less confident of higher prices.<h3>Measuring Gap or Exhaustion Gap?</h3><p>Since traders correctly believed that the rally from February might reverse down after breaking above the 2 year trading range, there is an increased chance that November will be a Measuring Gap. Whenever there is a surprise bar, like Novmeber, the odds favor follow-through buying. Because November is breaking above a possible top, it could lead to a Measured Move up from the February low. While that is unlikely after a bull trend has lasted 100 bars as this one has, that Measured Move target is just below 2600.<p>When a bull breakout comes late in a bull trend, it is more likely an Exhaustion Gap than a Measuring Gap. Exhaustion usually does not mean trend reversal. More often, it means that the gap closes, and the Emini has to go sideways for 5 – 10 bars before the bulls will buy again. That is the risk here. The odds are that the gap between the December close and the November high will close. That means that the Emini will probably trade back below the November high within a few months. However, because there is no sign of a top, the odds still favor higher prices after that pullback.<h3>Possible ioi setup in December</h3><p>When an outside bar forms in a tight trading range, there is an increased chance of an inside bar next month. This means that December might have a low above the November low and a high below the November high. If so, this would create a 3 month ioi Breakout Mode setup.<p>Because it would be in a strong bull trend, the odds would favor a bull breakout. Yet, after a 4 month trading range and a 5 month parabolic wedge rally, the bears would have a 30% chance of a major reversal down.<h3>Parabolic Wedge Top</h3><p>I have written several times over the past few months about a possible parabolic wedge top. November is the 3rd push up in a tight channel since the February low. That means this this is a parabolic wedge rally. It increases the chances of a big reversal down.<p>Yet, when a parabolic wedge reverses down, it usually pulls back for 10 bars into a bull flag first. Then, the bears get a strong bear breakout below the bull flag. Ten bars on the monthly chart is almost a year. Hence, even if this is a parabolic wedge top that reverses down, it will take about a year before a clear bear trend begins.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Continued strong bull breakout</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/11/w-4.png\"><img loading=\"lazy\" src=\"2016-11-26-1.png\" alt=\"S&amp;P500 Emini weekly chart in strong breakout\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart had its 3rd consecutive strong bull trend bar this week. The odds are that there will be at least a 2nd leg up after the 1st pullback.<p>The weekly S&amp;P500 Emini futures candlestick chart had a strong bull trend bar this week. This was the 3rd consecutive strong bull trend bar. It therefore was strong follow-through buying after the breakout above the 3 month wedge bull flag. Because this breakout is strong, the odds are that bulls will buy the 1st pullback. Hence, the bears will probably need at least a micro double top before they can create even a minor reversal down.<p>While the August to November pullback could be the Final Bull Flag, there is no sign of a top yet. When a breakout is this strong, even a micro double top is a low probability setup for a trend reversal. Traders will not believe that the bears have taken control until there is a strong reversal down.<p>That reversal can come from a huge bear trend bar, or a series of 3 or more smaller bear trend bars. Because there is no sign of either, the odds favor higher prices. Traders expect the 1st reversal down to be minor. Hence, they know that it will probably become a bull flag that leads to higher prices.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>President Trump stock market rally will pull back next week</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/11/d-3.png\"><img loading=\"lazy\" src=\"2016-11-26-2.png\" alt=\"S&amp;P500 Emini daily chart near measured move targets\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart in is an 12 bar tight bull micro channel. This is unsustainable. Yet, bulls will buy the 1st pullback.<p>The daily S&amp;P500 Emini futures candlestick chart has not had a pullback in the 12 days since the election. Hence, it is a 12 bar bull micro channel. The 2 days formed a bull breakout. The next 10 have been in a tight channel. This is therefore a Spike and Channel Bull Trend. The stock market breaks below the bull channel 75% of the time. It can do this by reversing down or by going sideways. In addition, there is a 50% chance that the pullback will fall to the beginning of the channel, around 2150.<h3>Micro Channel is a buy climax</h3><p>Eleven days in a tight bull channel is unusual. Hence, it is unsustainable and climactic. While micro channels can grow to 20 bars, that is extreme rare. As a result, the odds are that the Emini will pull back next week.<p>A pullback simply means that a day will trade below the low of the prior day. Bulls usually buy the 1st pullback in a micro channel. Yet, they also understand what typically follows. There is usually one more new high over the next several days. Then, the stock market usually begins a pullback.<p>The minimum goal for the bears is a 2 legged move. In addition, they expect it to retrace at least 50% of the channel, or about 30 points. Furthermore, the pullback usually lasts at least half as long as the rally. Therefore the pullback will probably last at least a week, have 2 legs, and fall 30 points.<h3>Measured Move targets</h3><p>While most resistance fails, all bull trends end at resistance. It is therefore helpful to know where the resistance is. The Emini is at the top of its tight bull channel. Hence, it is at resistance.<p>In addition, there is a gap between the November 10 low and the November 8 high. This is therefore a potential Measuring Gap. The target is 2207.50, which the Emini hit on Friday.<p>Finally, a Spike and Channel rally often pulls back after a Leg 1 = Leg 2 Measured Move. Because the Spike is usually Leg 1, Leg 1 ended with the 2 day rally after the election. Since the Channel is usually Leg 2, it started with the low of November 10. The target is therefore 2208.75. Some computers will use the November low for the bottom of the spike. Their target is therefore up at 2245.<p>Because there are 3 targets that are within a few points, the probability is greater that the Emini will pull back soon. Yet, the Emini often overshoots targets before reversing. This is especially true when a rally is strong, like this one.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2016-11-26"
    }
  ]
}