{
  "6": [
    {
      "data": [
        "<article class=\"post-56087 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"August buy climax and correction Emini weekend update: August 6, 2016\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">August buy climax and correction<br>Emini weekend update: August 6, 2016</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2016-08-06T00:30:20-07:00\">August 6, 2016</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Follow-through buying after last month’s breakout</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/08/m.png\"><img loading=\"lazy\" src=\"2016-8-6.png\" alt=\"S&amp;P Emini futures market analysis weekly report for August 6, 2016.  Those learning how to trade the markets see that this month’s candlestick pattern on the monthly chart is a strong bull breakout to a new all-time high. August stock market crash is unlikely. However, they will be ready for a possible August buy climax and correction.\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart had 6 consecutive bull trend bars coming into this month. Last month was a strong bull breakout. The bulls want a bull trend bar this month to confirm last month’s breakout. Yet, 6 consecutive bull bars on the monthly chart is climactic. The odds favor a bear body when the bar closes at the end of the month. Traders need to be ready for a possible August buy climax and correction.<p>The monthly S&amp;P500 Emini futures candlestick chart has rallied for 6 consecutive months. This is therefore strongly bullish. Six consecutive trend bars on the monthly chart is unusual and hence unsustainable and climactic. Therefore, August will probably be a bear bar. Hence, it will probably close below its open. Because the Emini is early in the month, it could rally for several weeks before reversing back down below the open of the month.<p>Alternatively, it could selloff all month. It is too early to be planning trades based on this information. Yet, traders should be wary if the Emini is above the open of the month late in the month. The odds would then favor a selloff to below the open of the month. If the bulls get a 7th consecutive bull trend bar, then the odds would favor a bear bar in September. This is despite the strong bull trend.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Resumption of the July rally, but August buy climax and correction?</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/08/w-1.png\"><img loading=\"lazy\" src=\"2016-8-6-1.png\" alt=\"S&amp;P Emini futures market analysis weekly report for August 6, 2016. Those who trade the markets for a living see a weakening bull trend bar for the follow-through bar as the candlestick pattern on the weekly chart. Traders doubt August stock market crash. However, they will be ready for a possible August buy climax and correction.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart had a strong rally in July. After 2 weeks of a sideways pause, the bulls created an outside up bar this week. They therefore once again took control. Because this week was a doji and it comes after another doji, a small bar, and a climactic rally, the Emini will probably pull back more within the next few weeks.<p>The weekly S&amp;P500 Emini futures candlestick chart has rallied for 6 weeks without a bear body. This is a strong bull breakout above the 2 year trading range. Yet, the bodies of the 1st 5 weeks shrank. Hence, the bulls were getting less eager to buy as the price moved higher. This past week traded below the prior week’s low and then above its high. It therefore was an outside up week. Yet, its body was small, which is a sign that the bulls are less willing to buy at the highs. As a result, bears will begin to sell new highs for scalps, and bulls will start taking profits at new highs.<p>This is the earliest indication that a bull breakout might start to pull back. With the rally as strong as it has been, the odds are that bulls will buy the pullback. Additionally, bears believe that the reversal would be minor. They therefore will buy back their shorts when they have a small profit. This unwillingness to let the Emini fall too low will limit the depth of the reversal. Therefore, a bull flag is more likely than a trend reversal.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Strong breakout to a a new all-time high</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/08/d-3.png\"><img loading=\"lazy\" src=\"2016-8-6-2.png\" alt=\"S&amp;P Emini futures market analysis weekly report for August 6, 2016. Online day traders saw weak breakout to a new all-time high as the candlestick pattern on the daily chart. Traders think pullback, not August stock market crash.  However, they will be ready for a possible August buy climax and correction.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart gapped up on Friday and broke to a new all-time high. Because the bar was a big bull trend bar, the bulls were strong. Therefore the odds favor at least a little more buying next week.<p>The daily S&amp;P500 Emini futures candlestick chart this week had a breakout below the 3 week trading range. Yet, bulls bought the test of the moving average, which was a 20 Gap Bar buy setup. The bulls were strong enough to rally above the top of the trading range to a new all-time high on Friday. However, just as a tight trading range resisted the downside breakout, it will tend to resist this upside breakout as well. Hence, it might be the<a href=\"https://www.brookstradingcourse.com/price-action/10-best-price-action-trading-patterns/#final-flags\" target=\"_blank\">Final Bull Flag.</a><h3>Nested failed bear breakouts</h3><p>This reversal up for below a trading range is a nested pattern. A nested pattern has a smaller version of the pattern in the final leg. Sometimes the final leg has an even smaller version of the pattern. The Emini has a nested pattern that involves its 2 year, 3 month, and 3 week trading ranges.<p>The Emini was in a trading range for 2 years. The bears broke below the range in January, yet reversed up strongly to a new high. The Emini then was in a 3 month trading range earlier this year. After a strong breakout below this smaller range in June, the bulls again strongly bought the bear breakout. This led to another all-time high. Finally, the Emini was in a tight trading range for the past 3 weeks. The bears got a breakout this week, yet the bulls again bought the bear breakout. As a result of their strong buying, the Emini again moved to a new all-time high on Friday.<p>A nested pattern has a higher probably of a profitable reversal. Yet, there is still no top. The 3 week trading range might become the Final Bull Flag, but the bears need a reversal setup or a strong bear breakout. While the reversal will probably come in August, there is no sign of either yet.<h3>Targets for the bulls</h3><p>The Emini is in a strong bull trend on the daily, weekly, and monthly charts. Bulls will look to take profits at<a href=\"https://www.brookstradingcourse.com/how-to-trade-manual/support-and-resistance/#measured-moves\" target=\"_blank\">Measured Move targets</a>. They base most of them on the heights of Trading ranges. The June 23 – July 1 double top was about 100 points tall. Its target is around 2200. The height of the 3 week trading range was also about 100 points tall. Many computers will ignore the June 27 bear breakout. They will see it as an outlier and simply a brief poke below the 100 point range.<p>The most important measure move target is based on the 300 point height of the 2 year trading range. That target is around 2400. The bulls have a 40%b chance of getting there without first seeing a 100 point pullback.<h3>Targets for the bears</h3><p>While there is a 60% chance that the current rally will not last all of August, there is no top yet. If the Emini begins to reverse next week, the first target for the bears is the top of the 3 week trading range. The bears need to close the gap between Friday’s close and the top of the range. Other targets are the gap below Friday’s low and the June high top of the 3 month trading range.<p>There is still a 60% chance of a 40 – 100 point pullback in August. A 100 point pullback is near the July 6 low. That was the 1st pullback in the July reversal. Because scale in bears theoretically begin selling there, they will continue to sell above that price until the Emini falls to around their 1st entry. Once there, they buy back their shorts. They get out breakeven on that 1st short on July 7, while making a profit on their higher entries.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2016-8-6"
    }
  ],
  "13": [
    {
      "data": [
        "<article class=\"post-56514 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Stock market August correctionEmini weekend update: August 13, 2016\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Stock market August correction<br>Emini weekend update: August 13, 2016</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2016-08-13T00:30:47-07:00\">August 13, 2016</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Strong breakout, but possible stock market August correction</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/08/m-1.png\"><img loading=\"lazy\" src=\"2016-8-13.png\" alt=\"Day traders are ready for a Stock market August correction. emini monthly chart has a strong breakout but it is a buy climax\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has 7 consecutive bull trend bars. This is unusual on the monthly chart so the odds are that August will close below its open. It is too early to know if the rally will eventually reach the Measured Move target. The 2 year trading range late in the bull trend is probably the Final Bull Flag. Traders should be ready for a possible stock market August correction.<p>The monthly S&amp;P500 Emini futures candlestick chart has had 6 consecutive bull trend bars. Because this is unusual on the monthly chart, it is unsustainable. Therefore, it is a buy climax. Hence, the odds are that August will have a bear body, which means a close below the open of the month. If August is a bear trend bar, it would be a sell signal bar in September. However, after 6 consecutive bull trend bars, the odds are that there would be buyers below the August low. Hence, the best the bears will probably get is a pullback in a bull breakout.<p>The bears want the 2 year trading range to be the Final Bull Flag. While it probably will be, the odds are that they will need at least a Micro Double Top before they will be able to create a reversal. Furthermore, the rally may reach 2400 before the final top is in. That is a Measured Move up based on the 300 point height of the 2 year trading range.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Strong breakout but losing momentum</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/08/w-2.png\"><img loading=\"lazy\" src=\"2016-8-13-1.png\" alt=\"Traders should be ready for a possible stock market August correction. Emini weekly chart has a perfect doji candlestick pattern. it is a sell signal bar and 2nd entry sell signal.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart has rallied for 7 weeks, but the last 4 have had small bodies. The rally is losing momentum. Yet, there is no sign of a top.<p>The weekly S&amp;P500 Emini futures candlestick chart has been rallying for 7 weeks. Yet, the past 4 weeks have had small bodies, which is a sign of a loss of momentum. Furthermore, the 1st 6 weeks had bull bodies. That is extreme behavior and it is therefore climactic. Because the Emini broke above a 2 year trading range last month, traders are wondering if the breakout will fail.<p>This past week is the 2nd sell signal bar since the breakout, and 2nd signals have a higher probability of success. As a result, bears will be more willing next week to sell if next week trades below this past week’s low. Furthermore, bulls will be more eager to exit. They see the past 4 weeks as disappointing. Hence, the odds of a failed breakout are higher.<p>While the rally can continue indefinitely, the loss of momentum and the absence of bears bars make a pullback likely soon.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Nested Final Flags on 5 time frames, but targets above</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/08/d-4.png\"><img loading=\"lazy\" src=\"2016-8-13-2.png\" alt=\"Traders should be ready for a possible stock market August correction. Emini near measured move target after nested Final Flag and Expanding Triangle tops\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart has measured move targets around the big 2200 round number. While there are nested Final Flag Tops on 5 time frames, the odds still favor a little more up before a reversal down.<p>The daily S&amp;P500 Emini futures candlestick chart The Emini daily chart has been in a tight trading range for 6 days. There is an adage on Wall St. that says, “A small trading range above a bigger trading range will reverse back down.” While most sayings are not reliable, this one is interesting because it is consistent with what I have been saying about the nested Final Flag Tops.<p>The monthly chart was in a 2 year trading range. It broke to the downside and then reversed up strongly in January and made a new high. The weekly chart was in a trading range for several months and broke to the downside in February. It, too, reversed up strongly to a new high. Finally, the daily chart was in a trading range in July. After a bear breakout, it reversed up to a new high.<h3>Nested tops now also on 60 minute</h3><p>Most noteworthy is that the nested Final Bull Flags is now extending down to the 60 minute and 5 minute charts. They are also Expanding Triangle Tops, but because the shape is not good, I am referring to them as Final Flags. The daily chart has been in a 6 day tight trading range. The 1st 4 days formed a tight trading range on the 60 minute chart. The bears got a bear breakout, but the bulls bought it and the Emini rallied to a new high. The 5 minute chart was in a tight trading range on Thursday. Friday broke below it. If there is one more new high, then the same Final Flag Topping pattern will be on the monthly, weekly, daily, 60 minute, and 5 minute charts. It might even form on the 1 minute chart on Monday.<h3>Is the top in?</h3><p>The daily chart still has Measured Move targets around 2,200 and 2,220. Furthermore, the momentum up is good enough to get there. The odds favor a test of the resistance levels above. Yet, the bull trend is old and weakening, there is an unusual nested top on 5 time frames, and August often has strong pullbacks. Therefore, the odds also favor a 50 – 100 point selloff within the next several weeks, whether or not there is a test of 2,220 first.<p>Because there are obvious resistance targets above, there is a risk of a Buy Vacuum test of those levels. Support and resistance are magnets. Hence, when the market gets close, it often accelerates to the magnet. Once there, the magnetism often suddenly disappears.<h3>Possible Buy Climax soon</h3><p>If traders become very confident of reaching the targets, bulls buy aggressively. Sellers stop selling because they know they soon will be able to sell at a higher price. As a result, the market can accelerate dramatically to the targets. Furthermore, it often overshoots the resistance. However, the bulls take profits at the targets. Additionally, the market is then exactly where the strong bears want it be. With bulls selling to take profits and bears shorting, the market can reverse down sharply and for a long time. In conclusion, traders should not be surprised if there is a climactic top soon.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2016-8-13"
    }
  ],
  "20": [
    {
      "data": [
        "<article class=\"post-56800 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini August buy climaxEmini weekend update: August 20, 2016\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini August buy climax<br>Emini weekend update: August 20, 2016</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2016-08-20T00:30:50-07:00\">August 20, 2016</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Breakout and Emini August buy climax</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/08/m-3.png\"><img loading=\"lazy\" src=\"2016-8-20.png\" alt=\"Monthly Emini has bull breakout of Final bull flag. there are measured move targets above.\"></a><p class=\"caption\">The Emini has had 7 consecutive bull trend bars on the monthly candlestick chart. While last month was a strong bull breakout, this month so far is a doji bar. That is therefore weak follow-through buying. Hence, it increases the chances of a pullback soon.<br>There are monthly measured move targets above and no sign of a top. Yet, an overbought rally can pull back at any time.<p>The monthly S&amp;P500 Emini futures candlestick chart is having its 7th consecutive bull trend bar this month. Because this is unusual on the monthly chart, it is unsustainable. It is therefore a type of buy climax. The minimum objective for the bears is a bear body this month. Hence, all that they need is a close that is 1 tick below the open. They obviously are looking for a reversal down, but that is their minimum objective.<h3>Possible Final Bull Flag</h3><p>The bulls have a gap between the August low and the top of the 2 year trading range. While the gap might lead to a measured move up, when a gap occurs after 20 bars in a trend, it is more likely an exhaustion gap. This gap is 7 years, or about 80 bars into the bull trend on the monthly chart. It is therefore more likely an exhaustion gap. Hence, the 2 year trading range is probably the Final Bull Flag before a TBTL Ten Bar Two Leg pullback. Ten bars on the monthly chart is about a year.<p>If the 2 year trading range does become the Final Flag, the reversal down will probably test its low. That is around 1800. From there, the bulls would want a double bottom bull flag and trend resumption up. The bears would want the reversal down from the Final Flag Top to lead to a bear trend. If it does, the next target is the 1500 area. That is the top of the double top.<h3>The bull case</h3><p>The Emini is in a bull trend. Most reversals fail and become bull flags. The odds are that bulls will buy the 1st reversal down. Because the odds favor closing the gap above the 2 year trading range, if there is a reversal down over the next month, it will probably fall below the June high. Yet, bulls will correctly see the selloff as a bull flag. They will therefore buy the reversal up.<p>The Emini in July broke above a trading range that was 300 points high. The target for the bulls is a measured move up to 2400. Once there, they will probably take profits. Hence, they would create another pullback or trading range.<p>The momentum up for the past 7 months and for the past 7 years has been strong. The bulls will keep buying strong reversals down until the bears begin to form lower highs. Until then, the odds are that the trend up will continue, even though the rally is already unusually long.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>1st bear trend bar in 8 weeks</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/08/w-3.png\"><img loading=\"lazy\" src=\"2016-8-20-1.png\" alt=\"weekly emini breakout of trading range. measured move target above 2200 resistance.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart finally had bear body this week after 7 consecutive bull bodies. This week was also an outside down candlestick pattern. Yet, it closed above last week’s low, and is therefore not very bearish.<br>The Measured Move target based on the height of the 6 month trading range is 2240.00. There is no top yet, but an overbought rally can reverse down at any time.<p>The weekly S&amp;P500 Emini futures candlestick chart had 7 consecutive bull trend bars. That is unusual and therefore unsustainable. It therefore is a type of buy climax. Yet, it is still forming higher highs every week and there is no clear top.<p>By trading below last week’s low, this week was the entry bar for a 2nd entry short for a failed breakout above the 2 year trading range. However, the past 4 weeks were dojis and in a tight channel. Also, they follow a strong bull breakout. This reduces the chances that a reversal down would become bear trend. Hence, bulls will look to buy the pullback. However, they are aware that the pullback might be deep and fall below 2100 and back into the 2 year trading range.<h3>Has the pullback begun?</h3><p>While there is a 60% chance of a 50 – 100 point pullback before a rally above the 2220 target on the daily chart, there is still no clear top. Furthermore, there is no strong bear breakout. Yet, the context is good for the pullback coming soon. Until there is a strong bear breakout, the odds still favor at least a little more up. However, because the context is so good, that bear breakout could come anytime, including next week.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Final Flag Top or Wedge Top?</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/08/d-6.png\"><img loading=\"lazy\" src=\"2016-8-20-2.png\" alt=\"daily emini candlestick chart has series of possible final bull flags. there is a resistance magnet above.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart is in a tight trading range, slightly above the July tight trading range. It is in Breakout Mode. This is a Final Flag Top. Yet, there are magnets above. If the Emini rallies to those magnets and then turns down, there will be a Wedge Top.<p>The daily S&amp;P500 Emini futures candlestick chart is the most interesting. The strong bear breakout in June followed by the strong reversal up in July resulted in a double top. The tops were June 23 and July 1. That reversal is the dominant feature on the daily chart. It therefore has the most influence. The bulls are looking for a measured move up from the breakout above that double top. The target is 2220.00.<p>There are also measured move targets around 2200 based on the July and based on the August. Also, 2200 is a big round number and therefore a magnet.<h3>One push up to wedge top at measured move targets?</h3><p>The Emini had a tight trading range in July and another one in August. A reversal down from here would be a Final Flag top where the July trading range was the Final flag.<p>The channel up from the July 6 pullback has been tight. Hence, the odds favor a 3rd push up. If there is a 3rd push up, it would create a wedge top. That top would probably be around the 2200 – 2220 targets. A reversal down from a wedge top usually lasts at least 10 bars and has at least 2 legs. This rally has lasted so long that the reversal down could last 10 bars on the weekly chart (10 weeks).<p>The rally on all time frames has been strong. Furthermore, there are magnets just above. The odds favor a test of those magnets before a reversal down begins. Yet, if a top is so obvious that everyone expects it, traders begins sell below resistance. They want to be sure to have at least a small position on before the expected big bear breakout comes. Because they believe a top will form now or soon, they think the risk of the early short is small. If enough traders start to sell below the target, the reversal down will begin without reaching the target.<h3>Black Swan rally?</h3><p>Everyone knows that the Emini needs a pullback after so many weeks up without one. The stops are far below. Bulls have big open profits. They have to reduce risk, and the easiest way is to take profits. That selling creates the pullback. Whenever anything is obvious, traders need to pay particular attention to the opposite.<p>When there is high probability one way, there is low probability the other way. Hence, everyone ignores the low probability direction. If the market begins to go in the low probability direction, traders are in denial. However, this results in bears trapped in as they sell new highs. Bulls don’t buy because they also think the rally will fail.<p>However, even a little rally can be enough to quickly make the bulls and bears worried. Both will begin to buy, and then buy in a panic. Hence, the low probability event can quickly turn into a rally that can continue up for a long time. Bears keep selling, picking tops, bulls keep scalping out. Yet, there is not enough selling to turn the market down. Bulls and bears therefore have to keep buying as the market goes up. Sometimes the buying is climactic. Other times it is a small pullback bull trend. If the Emini continues up above 2220, it might go up to 2400 before pulling back.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2016-8-20"
    }
  ],
  "27": [
    {
      "data": [
        "<article class=\"post-57071 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Weekly chart outside down bar sell signalEmini weekend update: August 27, 2016\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Weekly chart outside down bar sell signal<br>Emini weekend update: August 27, 2016</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2016-08-27T00:30:16-07:00\">August 27, 2016</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Probable bear month</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/08/m-4.png\"><img loading=\"lazy\" src=\"2016-8-27.png\" alt=\"monthly emini candlestick chart has doji near 2200 resistance\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has 3 days left before the bar closes on Wednesday. It is now a doji candlestick pattern in a 7 bar bull micro channel. That is a buy climax and the odds favor a 1 – 3 bar (month) pullback.<p>Because the Emini monthly chart has had 6 consecutive bull trend bars, which is unusual, it is in a buy climax. Therefore the odds are that August will have a bear body. That does not necessarily mean a big bear reversal bar. All that the Emini has to do is close below the 2168.00 open of on the month to create a bear body.<p>A bear close on the monthly S&amp;P500 Emini futures candlestick chart in August would then create a sell setup going into September. Yet, after a 7 bar bull micro channel, the reversal down will probably be minor. Hence, it probably will last a bar or two (month or two) before the bulls buy again. Due to a 2 month, 100 point pullback on the monthly chart, the daily chart might enter a brief bear trend.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>weekly chart outside down bar sell signal</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/08/w-4.png\"><img loading=\"lazy\" src=\"2016-8-27-1.png\" alt=\"weekly candlestick Emini chart has 2nd entry sell signal\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart traded above last week’s high and then below last week’s low. Hence, this is an outside down week and a sign of strong bears.<p>Because the weekly Emini candlestick chart had 7 consecutive bull trend bars until 2 weeks ago, it formed a buy climax. When something unusual happens, it is unsustainable and therefore climactic. The odds therefore favor an end to the unusual behavior and a regression toward the mean. This simply means that the Emini would probably begin to have more typical price action. The most common price action is a trading range. As a result, the weekly chart will probably form a trading range over the next several weeks.<p>When the Emini forms a trading range, it probes down to find the bottom. While the bulls hope to maintain the gap above the 2100 top of the 2 year trading range, the odds are that they will fail. This is because a big breakout late in a trend is more likely to be an exhaustion gap than a measuring gap.<h3>Trading range more likely than bear trend</h3><p>Yet, even if the Emini falls back into the 2 year trading range, the momentum up over the past 2 months makes a big trading range more likely than a bear trend. A 100 point selloff would create a Big Up (in July and August), Big Down candlestick pattern. That is a reversal on some high time frame. For example, if I could create a 6 or 7 week candlestick chart, I would probably see a reversal bar. Yet, it confuses traders.<p>When traders are confused, they are confident that rallies and selloffs will not go very far. As a result, they buy selloffs and scale in lower. Furthermore, they sell rallies and scale in higher. Finally, they take quick profits because they believe the swings won’t last. The result is a trading range.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Early bear trend reversal</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/08/d-7.png\"><img loading=\"lazy\" src=\"2016-8-27-2.png\" alt=\"daily emini candlestick chart has double top in tight trading range and final flag top.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart had a strong rally in July. It then formed a tight trading range that lasted about a month. Hence, that was a possible<a href=\"https://www.brookstradingcourse.com/price-action/10-best-price-action-trading-patterns/#final-flags\" target=\"_blank\">Final Bull Flag</a>. It then had a brief bull breakout in August, yet spent most of the month in another<a href=\"https://www.brookstradingcourse.com/how-to-trade-manual/trading-ranges/#tight-trading-ranges\" target=\"_blank\">tight trading range</a>. Because the context is good for a reversal (a Final Flag breakout just below resistance around 2200), the small double top of the past 2 weeks has special significance.<h3>Double top in tight trading range</h3><p>Most of the time, a double top in a tight trading range is meaningless. Because traders expect the range to continue, they scalp. Yet, when there is a reasonable top, a double top in the tight trading range has a 40% chance to lead to a big reversal. Usually the 1st leg down looks for for the bears. The bulls usually buy the selloff. The bulls are often able to create a bear channel that lasts 10 or more bars. Yet, the rally is a bear flag. If there then is another leg down, that leg is over surprisingly big and fast.<p>If there is a 40% chance that a 50 – 100 point swing down has begun, what happens during the other 60% fo the time? Most reversals fail. They usually lead to trading ranges. Yet, they sometimes quickly lead to trend resumption up. As a result, bears usually make a little or lose a little during this 60%, and they come out about breakeven. The reason they take the short is that the 40% that have swings down create big profits. That more than compensates them for all of the work required during the other 60% of trades.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2016-8-27"
    }
  ]
}