{
  "15": [
    {
      "data": [
        "<article class=\"post-51083 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini weekend update: April 16, 2016:  Candlestick pattern is a possible Final Flag\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weekend update: April 16, 2016:<br>Candlestick pattern is a possible Final Flag</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2016-04-15T13:40:43-07:00\">April 15, 2016</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart: Testing all-time high</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/03/m-3.png\"><img loading=\"lazy\" src=\"2016-4-15.png\" alt=\"S&amp;P Emini futures market analysis weekly report for April 16, 2016.  Those learning how to trade the markets see strong follow-through buying as the candlestick pattern for the price action on the monthly chart.\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has had 3 strong bull trend bars, but it has not yet broken above the top of the 2 year trading range.<p>On the monthly S&amp;P500 Emini futures candlestick chart, the Emini is still at the top of its 2 year trading range, but the current leg up has been strong. This increases the chances of a breakout to a new all-time high. The Emini came to within about 19 points of the July all-time high on Thursday. The cash index is still about 48 points below its high (see weekly charts below). This means that the Emini could hit a new high and the cash index could turn down from below its high.<p>Divergences are overrated and are much less important that what TV and websites make them sound. Like all reversal setups, even the best ones only have a 40% chance of leading to a reversal. The Emini is still in its trading range, and although the momentum up is enough to create about a 50% chance of a breakout over the next month, until there is a breakout, there is no breakout. The bears still have a 50% chance of a reversal down.<h2>Weekly S&amp;P500 Emini futures candlestick chart: Buy climax at resistance</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/03/w-4.png\"><img loading=\"lazy\" src=\"2016-4-15-1.png\" alt=\"S&amp;P Emini futures market analysis weekly report for April 16, 2016. Those who trade the markets for a living see micro wedge top and a buy climax as the candlestick patterns on the Emini weekly chart. \"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart has a micro wedge in a buy climax, but there are still magnets above and no sign of a reversal yet.<p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/03/cash-and-futures.png\"><img loading=\"lazy\" src=\"2016-4-15-2.png\" alt=\"The cash and futures candlestick charts have a divergence\"></a><p class=\"caption\">The weekly S&amp;P500 Cash Index came to within 48 points of its all-time high, but the Emini futures candlestick chart came to within 19 points of its all-time high. This is a divergence.<p>The weekly S&amp;P500 Emini futures candlestick chart has had alternating bull and bear bars for 5 weeks. This is the 3rd push up and therefore a micro wedge top in an overbought rally at the top of a trading range, but the channel up is tight. The first reversal down will probably be minor, which means it would probably result in a trading range instead of a reversal into a bear trend.<p>The bulls are testing the 3 highs in the October to November trading range. They want a breakout above all 3 and then a new all-time high.<p>The bears want a reversal down. They would then see the rally of the past 2 months as simply a test of the top of that trading range. The pattern would be a double top, just below the all-time high, and it would therefore be a double top lower high major trend reversal. Like all major trend reversals, the probability that it would lead to a reversal and not just a trading range is only 40%. However, if the reversal down begins to form big bear trend bars, the probability of further down would be 60%.<br>Everyone is aware of the conflicting forces. The momentum up has been unusually strong and therefore favors the bulls. However, the Emini is testing the top of a 2 year trading range, and the resistance so far has held. It is a 50-50 market at this point. Many traders are waiting for a breakout up or down, or for a small trading range. If there is a small trading range, the bulls will buy above a small bull reversal bar near the bottom of the range, and the bears will sell below a small bear reversal bar near the top.<h2>Daily S&amp;P500 Emini futures candlestick chart: Candlestick pattern is a possible Final Flag</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/03/d-4.png\"><img loading=\"lazy\" src=\"2016-4-15-3.png\" alt=\"S&amp;P Emini futures market analysis weekly report for April 16, 2016. Online day traders saw a potential final flag top as the candlestick pattern on the daily chart. \"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart is broke above a 3 week tight trading range that formed late in a bull trend. That increases the chances that the bull breakout will fail, and the trading range would then be the Final Bull Flag before a pullback.<p>The daily S&amp;P500 Emini futures candlestick chart had a gap up when it broke above a 3 week trading range. The follow-through so far has been weak, but that is what happens about 50% of the time when the market gaps up as it breaks out. The bears want a reversal down or a gap down, which would create an<a href=\"https://www.brookstradingcourse.com/how-to-trade-manual/trend-reversals/#island-top-and-island-bottom-trend-reversals\" target=\"_blank\">island top</a>. The bulls do not mind the bad follow-through as long as the rally resumes within a few days.<br>Because the 3 week trading range formed after the Emini rallied for 20 or more bars, it might be the https://www.brookstradingcourse.com/price-action/10-best-price-action-trading-patterns/#final-flags. This increases the chances that the Wednesday bull breakout will fail. However, there are magnets above. These are the November and December highs, and the all-time high, and all are within 20 points of this week’s high. They might be close enough so that the Emini will not be able to escape their magnetic field.<p>The next few weeks could be interesting because the bulls might finally get a new all-time high. However, they would be doing it in an overbought market, and that increases the chances the the breakout might not go far before it pulls back. The breakout might even fail because of the divergence with the cash index. The probability of higher prices was high in February and early March. The market is much less certain here, and that increases the chances of a trading range over the next month.<p>March and April are historically the most bullish consecutive months of the year. You often hear, “Sell in May and go away.” That is because<a href=\"https://www.brookstradingcourse.com/how-to-trade-manual/price-action-genetically-based/#seasonal-tendencies\" target=\"_blank\">May through early October is the weakest time of the year</a>. With the rally as climactic as it has been on the weekly and daily charts, the chance of a trading range in May than is the chance of a strong rally far above the all-time high.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>, and a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>is available.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.</p></div></article>"
      ],
      "dateId": "2016-4-15"
    }
  ],
  "22": [
    {
      "data": [
        "<article class=\"post-51071 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini weekend update: April 23, 2016:  Candlestick pattern is a Final Bull Flag\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weekend update: April 23, 2016:<br>Candlestick pattern is a Final Bull Flag</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2016-04-22T14:59:53-07:00\">April 22, 2016</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart: Small breakout to new all-time high</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/04/m.jpg\"><img loading=\"lazy\" src=\"2016-4-22.jpg\" alt=\"S&amp;P Emini futures market analysis weekly report for April 23, 2016.  Those learning how to trade the markets see a small breakout above the top of the 2 year trading range as the candlestick pattern for the price action on the monthly chart.\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart broke to a new all-time high this week, but pulled back. There is still a week left to the month. The month could become a big bull trend bar or a bear reversal bar. It probably will be something in between.<p>The monthly S&amp;P500 Emini futures candlestick chart broke above its 2 year trading range. The breakout is not yet big. In the final week of the month, the candlestick pattern could look very different from how it looks today. If there is a strong rally, this month’s bull trend bar could become very big. If so, it would increase the chances of higher prices over the next few weeks.<p>The Emini might also reverse down to below the open of the month. April would then be a sell signal bar for May. However, the March bar was so big that there probably will be buyers below April’s low, even if April is a bearish candlestick pattern when the month closes.<p>Until there is a bull strong breakout with strong follow-through, the odds are that the current breakout will be limited, and it will only slightly increase the height of the trading range.<p>If there is a strong breakout, it will probably fail within about 5 bars (months), and the 2 year trading range would then be the Final Bull Flag in the 7 year bull trend. There is a 60% chance of a 20% reversal beginning some time this year, whether or not there is a strong bull breakout first. That is what usually (60%) happens in a buy climax.<h2>Weekly S&amp;P500 Emini futures candlestick chart: 11 weeks without pullback so buy climax</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/04/w.jpg\"><img loading=\"lazy\" src=\"2016-4-22-1.jpg\" alt=\"S&amp;P Emini futures market analysis weekly report for April 23, 2016. Those who trade the markets for a living see a buy climax and a triple top as the candlestick patterns on the Emini weekly chart. \"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart added an 11th week to the bull micro channel. This is unusual and therefore unsustainable and climactic.<p>The weekly S&amp;P500 Emini futures candlestick chart has an 11 bar bull<a href=\"https://www.brookstradingcourse.com/how-to-trade-manual/trend-channels/#microchannels\" target=\"_blank\">micro channel</a>. That means that the low of every week is above the low of the prior week, which means that there was no pullback in 11 weeks.<p>If you scroll back over the past 10 years, you will see many micro channels that have lasted 7 – 10 bars. I only saw one that lasted 11 bars and one other that lasted 12 bars. I did not see any that lasted more than 12 bars. That tells traders that the odds of the current one lasting much longer are small.<p>Even though a micro channel that lasts 10 bars is climatic, it is also a sign of strong buying. Bulls are not not waiting to buy a dip below the low of the prior bar. Once they finally get the opportunity, they usually take it. This usually makes the pullback small. There is usually a few more bars up before there is a bigger pullback. This means that the downside risk over the next few weeks is small.<h2>Daily S&amp;P500 Emini futures candlestick chart: Candlestick pattern is a Final Bull Flag</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/04/d.jpg\"><img loading=\"lazy\" src=\"2016-4-22-2.jpg\" alt=\"S&amp;P Emini futures market analysis weekly report for April 23, 2016. Online day traders saw a potential final flag top as the candlestick pattern on the daily chart. \"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart broke above the July high, which was the all-time high. It reversed down on the next day.<p>The daily S&amp;P500 Emini futures candlestick chart broke above a trading range 2 weeks ago, and the trading range formed more than 20 bars into a bull trend. When there is a trading range late in bull trend, it often is the<a href=\"https://www.brookstradingcourse.com/price-action/10-best-price-action-trading-patterns/#final-flags\" target=\"_blank\">Final Bull Flag</a>. This means that the breakout usually fails within about 10 bars and the market then has at least a TBTL Ten Bar, Two Leg correction.<p>Wednesday was a sell signal bar for a failed breakout to a new all-time high. It was a doji and it had a bull body. Both make a reversal unlikely. This means that the 2 day pullback is probably a bull flag, and not the start of a bear trend. A top usually requires at least a micro double top or a strong bear reversal. Wednesday’s top will probably fail, and the Emini will probably test Wednesday’s high in the coming week.<p>Given that there is a buy climax on the weekly chart and a pullback is likely soon, the test of Wednesday’s high will probably form a micro double top and be followed by 5 – 10 bars sideways to down. The odds are that the Emini will pull back into the 2030 – 2070 trading range within a couple of weeks.<p>If the reversal down is strong, it will probably be followed by a 2nd leg down and then a bigger trading range will unfold. While a bear trend is possible at any time, it is unlikely until the Emini enters a trading range and begins to form more bear bars (signs of selling pressure).<p>A big bull trend from here is also unlikely, and bears will probably sell new highs. Bulls will sell new highs as well because they will believe that a trading range is becoming more likely than a continued bull trend. When they think that the Emini is entering a trading range, they sell out of longs at new highs, instead of buying breakouts above old highs. This transition will probably begin over the next week or two.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>, and a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>is available.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.</p></div></article>"
      ],
      "dateId": "2016-4-22"
    }
  ],
  "30": [
    {
      "data": [
        "<article class=\"post-51069 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini weekend update: April 30, 2016:  Learn how to trade a failed buy climax candlestick pattern\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weekend update: April 30, 2016:<br>Learn how to trade a failed buy climax candlestick pattern</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2016-04-30T00:01:34-07:00\">April 30, 2016</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart: Failed breakout above trading range</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/03/m-4.png\"><img loading=\"lazy\" src=\"2016-4-30.png\" alt=\"S&amp;P Emini futures market analysis weekly report for April 30, 2016.  Those learning how to trade the markets see a trend reversal down from small breakout above the top of the 2 year trading range as the candlestick pattern for the price action on the monthly chart.\"></a><p class=\"caption\">The bar on the monthly S&amp;P500 Emini futures candlestick chart closed today. It was a reversal bar, but the bar had a bull body and it followed a big bull trend bar.<p>The bar on the monthly S&amp;P500 Emini futures candlestick chart closed today, which was the last trading day of the week and of the month. The past 2 days of strong selling affected the appearance of the candlestick patterns on the weekly and monthly charts. They put a big tail on the top of the monthly bar, but it still had a bull body. The tail on top now makes it a sell signal bar for May. Since It is a reversal down from a breakout above the July all-time high, which is major resistance, the Emini might have to trade below the April low in May to trigger the sell to see if there are more buyers or sellers below. After such a strong 3-month rally and with a bull body, there will probably be buyers below April’s low and the reversal will likely become a bull flag.<p>There is still no strong breakout of the 2-year monthly trading range, so despite the strong 3 months up, the Emini is still within its range. The odds that any of these strong rallies or selloffs over the past 2 years will create a successful breakout are small. Even though eventually one will succeed, most trading range breakout attempts fail and trading ranges can grow to contain many bars.<h2>Weekly S&amp;P500 Emini futures candlestick chart: Learn how to trade a failed buy climax candlestick pattern</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/03/w-5.png\"><img loading=\"lazy\" src=\"2016-4-30-1.png\" alt=\"S&amp;P Emini futures market analysis weekly report for April 30, 2016. Those who trade the markets for a living see trend reversal down from a buy climax and a triple top as the candlestick patterns on the Emini weekly chart. \"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart had its 1st pullback after an 11 week bull micro channel.<p>The weekly S&amp;P500 Emini futures candlestick chart candlestick pattern was an 11 bar bull micro channel. Since there have only been 2 longer bull or bear micro channels in the past 10 years, and neither lasted more than 13 weeks, there was a 90% chance that there would be a pullback within the next couple of weeks. This week was the pullback once it traded below last week’s low.<p>While the 11 bar channel was climactic, it also represents strong bulls. The odds are that the pullback will only last 1 – 2 weeks before the bulls test the July high again. However, the bull trend resumption after a pullback from a climactic bull micro channel usually fails to go up very far. The Emini usually enters a trading range after a 2 – 3 bar rally. Therefore, although the downside is limited by the strength of the bulls, the upside is also probably limited, but by the exhaustion of the bulls. A trading range for the next few weeks is likely.<h2>Daily S&amp;P500 Emini futures candlestick chart: Pullback after Final Flag Top</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/03/d-5.png\"><img loading=\"lazy\" src=\"2016-4-30-2.png\" alt=\"S&amp;P Emini futures market analysis weekly report for April 30, 2016. Online day traders saw a trend reversal down from a final flag top as the candlestick pattern on the daily chart. \"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart had a 2 legged pullback from its test of the July all-time high.<p>Wednesday’s bull trend bar on the daily S&amp;P500 Emini futures candlestick chart turned out to be a sell signal bar, but it had a bull body and therefore was weak. Thursday was the entry bar, but it had a big tail below and a close above the moving average. This was a weak entry bar. Friday was the follow-through bar and it reversed up to close near its open. This was weak follow-through selling. This makes it likely that this selloff is probably a bear leg in what will become a trading range rather than a bear trend.<p>Because of the weak selling, the Emini might bounce before testing the 2030 bottom of the Final Bull Flag. A trading range is more likely than a bear trend. Although the Emini is still in a bull trend, it also has been in a trading for over a month. There is no sign of a breakout up or down, and it is likely that the trading range will continue.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>, and a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>is available.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.</p></div></article>"
      ],
      "dateId": "2016-4-30"
    }
  ]
}