{
  "4": [
    {
      "data": [
        "<article class=\"post-53475 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini weekend update: June 4, 2016:  Trade breakout mode price action\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weekend update: June 4, 2016:<br>Trade breakout mode price action</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2016-06-04T00:30:53-07:00\">June 4, 2016</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart: Bull breakout of small pullback</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/06/m.png\"><img loading=\"lazy\" src=\"2016-6-4.png\" alt=\"S&amp;P Emini futures market analysis weekly report for June 4, 2016.  Those learning how to trade the markets see that last month formed a buy signal bar, and this month’s candlestick pattern on the monthly chart is the entry bar.\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart is breaking above a small bull flag at the top of a 2 year trading range.<p>The monthly S&amp;P500 Emini futures candlestick chart had May as a buy signal bar on the because it was a pullback from April’s breakout to a new all-time high. The buy triggered when June went above the May high. However, it was also at the top of a 2 year trading range, and most trading range breakouts failed. There were more sellers than buyers, but Friday was only the 3rd day in the month, and the monthly candlestick pattern will be very different at the end of the month. The momentum up in February was strong. The past 4 months have had bull bodies. Buyers are still in control. If the month closes near its low, it might be a reasonable sell signal bar for a micro double top with the April high and a double top with the July 2015 former all-time high.<p>The bulls want June to be a big bull trend bar and a strong entry bar for the breakout above the May high and the all-time high. It is too early in the month to know if this will happen. The bull momentum is good, but the rally might simply be a buy vacuum test of the resistance at the top of the 2 year trading range.<h2>Weekly S&amp;P500 Emini futures candlestick chart: Weak follow-through buying at all-time high</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/06/w.png\"><img loading=\"lazy\" src=\"2016-6-4-1.png\" alt=\"S&amp;P Emini futures market analysis weekly report for June 4, 2016. Those who trade the markets for a living see weak follow-through price action by the bulls on the weekly chart. \"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart is stalled at the top of its trading range. The bulls see strong momentum up and the bears see a double top.<p>The weekly S&amp;P500 Emini futures candlestick chart had an 11 week bull micro channel that began in February. There is usually a 1 – 3 bar pullback, then a test of the top of the channel, and then a trading range. Here, there was a 4 bar pullback, and this week tested the top of the channel. It pulled back some today, and this might be the start of a trading range, just below the all-time high. The momentum up has been so strong that it is probably likely that the Emini will make a new all-time high next week.<p>Also, even though the Emini is at its all-time high, the cash index high this week was still 23 points below the cash index high, which is a magnet. If the cash index gets drawn closer to its high, the Emini will get a breakout to a new all-time high. This increases the odds of a new all-time high in the Emini soon.<p>The weekly Emini had a strong rally 2 weeks ago. This past week was a bear doji. This is weak follow-through buying, but expected since the Emini has been in a trading range for 2 years. Whenever the bulls or bears try for a breakout, the odds are that the follow-though will disappoint them because that is what happens when traders believe the market is in a trading range. They are quick to take profits whenever there is strength, and the result is that the follow-through is usually disappointing.<p>Can the sell signal lead to a reversal down? It might, but unless there is a big bear trend bar or several consecutive small trend bars over the next few weeks, traders expect any attempt to reverse down to fail and then form a bull flag.<p>The bears see this past week as forming a double top with the April high. However, since it was a doji bar, it is a weak sell signal bar, especially following the strong bull trend bar of the week before. If next week falls below last week’s low, there will probably be more buyers than sellers there, despite the triggering of the sell signal. More likely, the weekly chart will go sideways for another week or two. The odds are that the momentum up in the 11 bar bull micro channel will result in more of an attempt at trend resumption up. The odds favor at least a small new all-time high within the next couple of weeks.<h2>Daily S&amp;P500 Emini futures candlestick chart: Learn how to day trade breakout mode price action</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/06/d.png\"><img loading=\"lazy\" src=\"2016-6-4-2.png\" alt=\"S&amp;P Emini futures market analysis weekly report for June 4, 2016. Online day traders saw a 2nd entry sell signal at the top of the 2 year trading range, but the sell candlestick pattern was weak on the daily chart. \"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart is in a tight trading range at the all-time high after gapping up 2 weeks ago. Monday could gap up on the daily and weekly charts, or gap down and form an island top on the daily chart.<p>The daily S&amp;P500 Emini futures candlestick chart had Friday fall below Thursday’s low. This triggered a 2nd entry sell signal for a failed breakout attempt of the 2 year trading range. The 1st sell signal came when Tuesday fell below the prior Friday’s low. Neither sell signal had a strong sell signal bar. The momentum up from the February low was very strong. The odds are that these 2 attempts to reverse down will be bought, and the Emini daily chart is instead forming a bull flag.<p>The May 24 bull breakout of its high 2 bull flag was strong enough to make a 2nd leg up likely. This is especially true since there was follow-through buying over the next several days. Since the Emini is at the top of its 2 year trading range, any follow-through buying will result in a new all-time high. The new high is likely to come within the next couple of weeks. However, the pullback might continue lower first, like to around a 50% retracement of the 3 week rally.<p>The Emini has been in a<a href=\"https://www.brookstradingcourse.com/how-to-trade-manual/trading-ranges/#tight-trading-ranges\" target=\"_blank\">tight trading range</a>for 7 days after gapping up on May 25. The top of the range is just 1 point below the all-time high. The tight trading range has a micro double top and a micro double bottom. It is in<a href=\"https://www.brookstradingcourse.com/how-to-trade-manual/trading-ranges/#breakout-mode\" target=\"_blank\">breakout mode</a>.<p>While the breakout can simply come from a strong trend any day next week that begins within the tight trading range, it could also come from a gap. The Emini could gap up next week and this would create a gap up on the daily and weekly charts. The bulls would try to keep it open, hoping that it is a breakout gap and possibly a measuring gap. The nearest measured move would be based on the 75 point tall 2 month trading range. If the rally went beyond that, traders would look for a 300 point rally, based on the 2 year trading range.<p>If instead the Emini gapped down on Monday or any day next week and the gap stayed open, this would create an<a href=\"https://www.brookstradingcourse.com/how-to-trade-manual/trend-reversals/#island-top-and-island-bottom-trend-reversals\" target=\"_blank\">island top</a>. The 1st target for the bears would be a measured move down based on the height of the 3 week island.<p>Whenever the Emini is in breakout mode, traders have to be prepared for the breakout failing and reversing or simply failing and continuing sideways. This happens about 50% of the time. Because of the location on the chart at the all-time high, and the very long 2 year trading range, the context is good for a big move. The Fed interest rate hike this summer or the Brexit could provide the fuel needed for the breakout. No one knows if there are more buyers or sells above or below. The news could start the process, and we would then find out. There is a potential for a swing up or down or in both directions after such protracted sideways trading.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>, and a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>is available.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.</p></div></article>"
      ],
      "dateId": "2016-6-4"
    }
  ],
  "11": [
    {
      "data": [
        "<article class=\"post-53473 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini weekend update: June 11, 2016:  Learn how to trade candlestick patterns with weak price action\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weekend update: June 11, 2016:<br>Learn how to trade candlestick patterns with weak price action</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2016-06-11T00:30:26-07:00\">June 11, 2016</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart: Learn how to trade candlestick patterns with weak price action</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/06/m-1.png\"><img loading=\"lazy\" src=\"2016-6-11.png\" alt=\"S&amp;P Emini futures market analysis weekly report for June 11, 2016.  Those learning how to trade the markets see that this month’s candlestick pattern on the monthly chart is weak entry bar after a one month High 1 bull flag.Learn how to trade candlestick patterns with weak price action.\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart is breaking above the top of a 2 year trading range in an overbought bull trend.<p>The monthly S&amp;P500 Emini futures candlestick chart is breaking above a 2 year trading range.The odds of a measured move up based on the 300 point height of the trading range are 40%. If the breakout gets much stronger, the odds will go up. It is more likely that the breakout will fail before reaching the target. The Emini would then reverse back down into the 2 year range, which would be the Final Bull Flag after an 8 year buy climax. If the bears reverse the Emini to below the Final Flag, the target for the bears would be based on the 300 point height of the 3 year trading range, which means down to the 1500 area.<p>The range of this month is small and it follows 2 doji candlestick patters. This is not the way a strong bull breakout typically behaves, and it increases the chances that the breakout will fail.<h2>Weekly S&amp;P500 Emini futures candlestick chart: Failed breakout to a new all-time high</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/06/w-3.png\"><img loading=\"lazy\" src=\"2016-6-11-1.png\" alt=\"S&amp;P Emini futures market analysis weekly report for June 11, 2016. Those who trade the markets for a living see weak bear reversal bar and weak price action by the bulls on the weekly chart. \"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart had a weak sell signal bar this week after breaking out to a new all-time high. Because the wedge top does not have good proportions, most computers will ignore it.<p>The weekly S&amp;P500 Emini futures candlestick chart had an 11 week bull micro channel that began in February. A micro channel that is protracted like that is a buy climax, and it is usually followed by a 1 – 3 bar pullback, a 1 – 3 bar rally to a new high, and then a trading range. This week might be the top of the trading range.<p>A logical bottom is the low of the pullback from the micro channel. That is the May 19 low of 2013.00, which is almost 100 points below this week’s all-time high. There is a 60% chance that the bears will succeed in testing this target over then next month or two. Because the sell signal bar is not strong and trading range tops and bottoms are never clear, there might be another small leg up before the reversal down begins.<p>There is always a bull case, and bulls are hoping for a successful breakout above the 2 year trading range and a 300 point measured move up. The see the May pullback as a Cup and Handle pullback where the January selloff and February rally form the cup. Trading ranges always have bull and bear patterns, but are very resistant to breaking out. This means that this breakout will probably fail, just like all of the other strong bull and bear breakout attempts over the past 2 years.<p>As a breakout is underway in a trading range, it always looks like it will finally be the one that succeeds. CNBC puts on “experts” who are bullish when there is a breakout attempt near the top, and bearish when there is an attempt at a bear breakout. They are wrong 80% of the time, which is due to my inertia rule (80% of trading range breakouts fail, and 80% of trend reversal attempts fail). It is far easier to make money betting with the probabilities than with the well-dressed, highly credentialed idiots that you see on T.V.<p>This week’s bear reversal bar was small and had a tail below. This is not a strong sell signal bar, especially since it is the second doji bar in a row. Doji bars are one bar trading ranges and are a sign that the market is satisfied with the current price. They are not common at major reversals or breakouts. This is consistent with what I said about the micro channel buy climax. The odds are that the weekly chart will go sideways for at least several more weeks, even if it goes a little higher first.<p>The Emini can suddenly decide at any time that the price is grossly wrong. For example, next week’s FOMC announcement or any Fed announcement or major news event can lead to a rapid repricing up or down. It does so with a big trend bar and usually a series of trend bars, and the race to the new fair price can last for many bars.<p>There is no evidence that a breakout up or down is about to happen, but there is a FOMC meeting this week, and then another in July. I never care what the Fed says or does, and I absolutely never care about the pundits on TV who do not know how to trade. All I care about is whether the market goes up or down. I am in this to make money in an enjoyable way and the best way to do it is to watch the charts and do the obvious. If the Emini is going up strongly, I will buy. It can go up strongly whether the Fed raises interest rates or keeps them unchanged. It can also go down strongly in either case. I want to focus on the price action.<p>Listening to the experts on TV is usually an attempt to absolve yourself of your personal responsibility for making money. As a trader, you eat what you kill, and you are not going eat unless you hunt. Watching someone else hunt is not enough. You have to do the hard work yourself. You have to develop the skills and the confidence, and a pundit on TV is not going to help you once his 2 minutes of airtime are over.<p>When a market is in a trading range, nothing is ever very clear because neither the bulls nor the bears stay in control for long. This week’s top is not strong. The probability for the bears is higher if they wait for a second entry short or a strong bear breakout. If next week goes below last week’s low, that is a 1st entry. If the weekly chart reverses back up within a couple of week’s, but then reverses down again, that is a 2nd signal. Second signals at the top and bottom of a trading range have a higher probability of being profitable.<h2>Daily S&amp;P500 Emini futures candlestick chart: Minor reversal</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/06/d-1.png\"><img loading=\"lazy\" src=\"2016-6-11-2.png\" alt=\"S&amp;P Emini futures market analysis weekly report for June 11, 2016. Online day traders saw a break below a wedge higher high major trend reversal, but the entry bar Friday was a weak sell candlestick pattern on the daily chart. \"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart gapped below a bear trend line, but there was only one bear day in the prior 13 days. Sideways is more likely than down.<p>The daily S&amp;P500 Emini futures candlestick chart had a gap down on Friday. This triggered a sell signal on the daily chart for a failed breakout to a new all-time high, a break below a wedge<a href=\"https://www.brookstradingcourse.com/price-action/10-best-price-action-trading-patterns/#major-trend-reversals\" target=\"_blank\">higher high major trend reversal</a>, and a reversal down from an<a href=\"https://www.brookstradingcourse.com/price-action/10-best-price-action-trading-patterns/#expanding-triangle\" target=\"_blank\">expanding triangle top</a>. This sounds like a lot of reasons for a bear trend. However, this is an opportunity to earn how to trade candlestick patterns with weak price action.<p>However, prior to today, there was only one bear bar in the prior 13 days. This means that there is very little<a href=\"https://www.brookstradingcourse.com/how-to-trade-manual/market-cycle/#buying-pressure-and-selling-pressure\" target=\"_blank\">selling pressure</a>. A reversal down when there are so many bull bars is likely to not fall far. A big bear breakout can happen at any time, like with this coming week’s Fed announcement. However, the daily chart is telling traders that the bears probably need more evidence of a top.<p>If the Emini trades up on Monday or Tuesday, it might then form a micro double top with the all-time high of the past week. That would increase the chance of a reversal down. However, the odds are against a lot of follow-through selling on Monday or Tuesday. As you read above, there is a 60% chance of about a 100 point pullback over the next month or two. Next Wednesday’s Fed announcement might be the start of the selloff. At the moment, this top on the daily chart is coming in the presence of too many bull bars and that makes sideways more likely than down for at least a couple of days.<p>The cash index came to within 14 points of its all-time high this week. It might be close enough to the magnet of that resistance so that it will not be able to resist the magnetic pull. If the cash index rallies 14 points above the high of the past week, the Emini will as well. It does not matter if the cash index forms a perfect double top with last year’s all-time high or turns down from slightly above or below. What matters is whether it turns down or breaks strongly to the upside.<p>Since most trading range breakouts fail, and the current attempt over the past couple of weeks has been weak, the odds are that this attempt will fail. If it does, the Emini will then test support, like the May low or, less likely, the February low.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>, and a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>is available.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.</p></div></article>"
      ],
      "dateId": "2016-6-11"
    }
  ],
  "18": [
    {
      "data": [
        "<article class=\"post-53470 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini weekend update: June 18, 2016:  Day trading strategies in the middle of a 4 month trading range\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weekend update: June 18, 2016:<br>Day trading strategies in the middle of a 4 month trading range</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2016-06-18T00:30:58-07:00\">June 18, 2016</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart: Failed breakout</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/06/m-2.png\"><img loading=\"lazy\" src=\"2016-6-18.png\" alt=\"Day trading strategies in the middle of a 4 month trading range. S&amp;P Emini futures market analysis weekly report for June 18, 2016.  Those learning how to trade the markets see that this month’s candlestick pattern on the monthly chart is neutral. It is a weak buy entry bar and a weak sell signal bar after a failed breakout above a 2 year trading range.\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has a small candlestick bar. It is a weak breakout above the 2 year range and a weak sell signal bar .<p>The monthly S&amp;P500 Emini futures candlestick chart has a micro double top with the April high at the all-time high. Furthermore, it is a failed breakout above a 2 year trading range. So far, the bar is a small doji candlestick pattern. This is therefore both a weak bull breakout and a weak sell signal bar. The month might look very different when the bar closes in 2 weeks. The most noteworthy thing is that the breakout to a new high has not yet resulted in a big bull bar. This increases the chances that June will be a sell signal bar instead of a bull breakout bar.<h2>Weekly S&amp;P500 Emini futures candlestick chart: Trading range after buy climax</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/06/w-4.png\"><img loading=\"lazy\" src=\"2016-6-18-1.png\" alt=\"Day trading strategies in the middle of a 4 month trading range. S&amp;P Emini futures market analysis weekly report for June 18, 2016. Those who trade the markets for a living see a weak bear trend bar and weak price action by the bulls on the weekly chart. \"></a><p class=\"caption\">The bar on this week’s weekly S&amp;P500 Emini futures candlestick chart closed in the middle of its range. It also closed in the middle of the 3 month trading range. It is neutral.<p>The weekly S&amp;P500 Emini futures candlestick chart had an 11 week bull micro channel that ended on April 22. It has created the expected trading range. While this week’s candlestick pattern is a bear trend bar, the bar closed in its middle. In addition, it closed in the middle of the 3 month trading range. This is what was likely to happen following an 11 week buy climax. The Emini will still probably test the May low before it gets back to the all-time high. However, this week’s candlestick pattern is neutral. Therefore, next week will probably be neutral as well.<h2>Daily S&amp;P500 Emini futures candlestick chart: Day trading strategies in the middle of a 4 month trading range</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/06/d-3.png\"><img loading=\"lazy\" src=\"2016-6-18-2.png\" alt=\"Day trading strategies in the middle of a 4 month trading range. S&amp;P Emini futures market analysis weekly report for June 18, 2016. Online day traders a weak selloff after a higher high major trend reversal. There was a buy candlestick pattern that was not triggered on the daily chart.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart failed to go above Thursday’s high to trigger a buy signal. It is still in a bear leg in a trading range.<p>The Emini had a<a href=\"https://www.brookstradingcourse.com/price-action/10-best-price-action-trading-patterns/#wedges\" target=\"_blank\">wedge top</a>, which is a buy climax. Two legs down usually follow a buy climax. Although the current correction has had 2 small legs, the selloff has been in a tight bear channel. When that happens, the channel is usually the 1st of 2 larger legs sideways to down. Therefore, traders will look at any rally next week as a pullback from the first leg down. Hence, they will expect a<a href=\"https://www.brookstradingcourse.com/price-action/10-best-price-action-trading-patterns/#major-trend-reversals\" target=\"_blank\">lower high major trend reversal</a>and a 2nd leg down. A 2nd leg down often stops at around a<a href=\"https://www.brookstradingcourse.com/price-action/10-best-price-action-trading-patterns/#measured-moves\" target=\"_blank\">Leg 1 = Leg 2 measured move</a>. Since traders do not yet know how high the bear rally will be, they not know yet where the 2nd leg will end.<p>The daily S&amp;P500 Emini futures candlestick chart has been in a trading range for 4 months. As a result of the selloff of the past 2 weeks, the Emini is back in the middle of the range. Hence, it is neutral. Although Thursday was a strong buy signal bar, Friday was unable to break strongly above Thursday’s high. This inability to trigger the buy signal disappointed the bulls. Thursday’s bull reversal bar disappointed the bears.<p>As a result of both the bulls and bears being disappointed, the Emini is likely to go sideways next week. If there is a rally for 2 – 3 days, traders will probably sell it. Bears will sell due to their belief that the Emini will fall to the May low. Bulls will sell to take profits on scalps since they believe the Emini will fail to break above the June high.<h2>Brexit and the U.S. markets</h2><p>The most noteworthy news next week is England’s vote on Thursday to leave the EU. The Emini might stay sideways until the vote. While the news will cause a big move up or down, a move up will probably not last long. The odds still favor a test down to the bottom of the trading range.<p>In conclusion, there might be a rally next week, like after the Brexit news. However, the wedge top will probably have a 2nd leg down after the rally.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>, and a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>is available.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.</p></div></article>"
      ],
      "dateId": "2016-6-18"
    }
  ],
  "25": [
    {
      "data": [
        "<article class=\"post-53468 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini weekend update: June 25, 2016:  Online trading after the Brexit stock market crash\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weekend update: June 25, 2016:<br>Online trading after the Brexit stock market crash</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2016-06-25T00:30:20-07:00\">June 25, 2016</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart: Online trading after the Brexit stock market crash</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/06/m-3.png\"><img loading=\"lazy\" src=\"2016-6-25.png\" alt=\"Online trading after the Brexit stock market crash.S&amp;P Emini futures market analysis weekly report for June 25, 2016.  Those learning how to trade the markets see that this month’s candlestick pattern on the monthly chart is forming a bear reversal bar. Online trading after the Brexit stock market crash will be difficult until there is follow-through selling. \"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart is forming a sell signal bar and a micro double top with the April high.<p>Online trading after the Brexit stock market crash will be tricky until the charts provide more information. Friday’s big bear reversal turned the monthly S&amp;P500 Emini futures candlestick pattern into a bear reversal bar. However, there is still a week to go, and the candlestick pattern might look very different once it closes.<p>The bears see June as a sell signal bar and a micro double top with April. May traded below April to trigger a sell signal because of the failed breakout above the 2 year range. If July trades below June, that would be the 2nd signal. Consequently, like all 2nd signals, the probability for the bears would be higher. If July is a big bear bar closing on its low, the odds would favor lower prices.<h3>Is context more important than momentum?</h3><p>As much as Friday was&nbsp;good for the bears, there was a strong 4 month rally preceding this top. That bullish momentum reduces the probability that a swing down will fall far. The momentum up is good for the bulls. They have a 4 month rally within the 2 year trading range. The 2 year trading range is a bull flag in a 7 year bull trend. Hence, a trading range is almost as likely as a strong bear reversal at this point. Yet, the bears would not have to do much more to clearly take control.<p>The context is good for the bears. They have a 2nd entry sell signal at the top of a trading range. Because both the bulls and bears have reasonable arguments, the Emini might go sideways for more bars on the monthly chart.&nbsp;<p>The bears need a strong sell<a href=\"https://www.brookstradingcourse.com/how-to-trade-manual/candlestick-charts/#setups-and-signals\" target=\"_blank\">signal bar</a>. They want June to close near its low. In addition, they want July to be a strong entry bar. Most of all, they want July to be a very big bear trend bar that closes on its low.<p>The bulls always want the opposite of the bears. They want July to be a weak entry bar. Furthermore, they then want a reversal back up and then a new all-time high. July will be an important month because it will give traders information about what to expect this fall.&nbsp;<h3>Is the top in?</h3><p>I have been saying for 2 years that the Emini would probably test the 1500 area. That is the 2000 and 2007 double top. This is because the buy climax on the monthly chart would likely correct down. That buy climax reduced the chances that the bull trend would continue much longer. There was a chance of a bull breakout of the 2 year range. Had that happened, it probably would have failed. As a result, the 2 year range would have been the Final Bull Flag on the monthly chart.<p>Because this candlestick pattern is on the monthly chart, it can take a long time to unfold. Is this the start of a bear trend on the daily and then the monthly chart? Traders need more proof. They need closes below key support. Especially relevant is the May low, which is the bottom of the 3 month trading range. If the Emini gets 2 or more closes below that low, the odds of a measured move down will probably be more than 50%.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Big outside down candlestick pattern, but still within trading range</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/06/w-5.png\"><img loading=\"lazy\" src=\"2016-6-25-1.png\" alt=\"S&amp;P Emini futures market analysis weekly report for June 25, 2016. Those who trade the markets for a living see a big outside down bear trend bar on the weekly chart. \"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart had a big bear bar this week and&nbsp;was outside of last week. However, it is still within a 3 month trading range. There is no breakout until there is a breakout.<p>I have been saying since early April that the strong rally on the weekly S&amp;P500 Emini futures candlestick chart was a buy climax. It therefore was likely to pull back for a few weeks. Furthermore, the rally was likely to resume, test the micro channel high, and then reverse down and form a trading range. This is exactly what happened.<p>What is next? Trading ranges resist change. This week was a big outside down week, which is good for the bears. However, especially relevant is that the Emini is still above the May low, which is the bottom of the range. That is also the neck line of the April-June double top. To have higher probability of a swing down, they need a close far below that breakout point. They also need follow-through selling. Without that, the 3 month trading range will probably continue. In conclusion, although this has been a good week for the bears, they need to do more. Traders sill believe that Friday’s selloff might only be a bear leg in the 3 month&nbsp;trading range.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Strong bear reversal</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2016/06/d-4.png\"><img loading=\"lazy\" src=\"2016-6-25-2.png\" alt=\"S&amp;P Emini futures market analysis weekly report for June 25, 2016. Online day traders saw the biggest gap down in history. The sell candlestick pattern was not strong yet on the daily chart. \"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart had a huge gap down, but failed to close below the May low. That is the neck line of the April-June double top. It is therefore still within the 3 month trading range.<p>The daily S&amp;P500 Emini futures candlestick chart had a very unusual day Friday. It turned the daily chart into the most important time frame. It had a 24.25 point gap down, which is the biggest gap up or down that I can remember. The bigger a gap down is, the more likely it will lead to further selling.<p>After trying to reverse up Friday on the 5 minute chart, the Emini sold off again below the June 16 low. That low is the neck line for the June 8 and June 23&nbsp;double top. The bears got a daily close below that low.&nbsp;Most of all, the bears need a close far below the May low, or 2 – 3 closes just below the May low. If they get that, they will have a 60% chance of a measured move down.<p>There is a 40% chance of a gap below the May low on Monday. If the bears get it, there is a 50% chance of a rally that closes the gap, and a 50% chance that the gap will stay open. If there is a big bear trend bar that closes on its low on Monday, then a measured move below the 4 month trading range will probably follow. If there is weak follow-through selling, traders will look for the breakout to fail and for the Emini to reverse back up into the trading range.<h3>Possible 2nd leg trap in trading range</h3><p>If the bears do not get strong selling, this selloff might be just a 2nd leg trap in a 4 month trading range. If the Emini starts to form a bear flag over the next 10 days, traders will watch for a bull breakout above the flag. If they get it, there would be at least a 50% chance of a<a href=\"https://www.brookstradingcourse.com/how-to-trade-manual/support-and-resistance/#measured-moves\" target=\"_blank\">measured move</a>up and another test of the high.&nbsp;<p>In conclusion, just as I wrote weeks ago that the attempt to break above the trading range disappointed the bulls, this selloff is disappointing the bears. The bears got near the May low, but could not close below it. While next week might test 2000, it might hold above the May 2013.00 low. If it does, it could trade sideways to up for a couple of weeks and form a bear flag. At that point, there would be a 50% chance of a bull breakout above that bear flag and a measured move up. The bears need to do more to make traders believe that this is more than just a 2nd leg trap in a trading range.<h3>Last week of June is bullish</h3><p>One final point is that the last week of June is one of the most reliably bullish weeks of the year. This is consistent with the Emini going sideways to up this week after Friday’s sell climax. There is a 50% chance of a rally this week. The bears will see the rally as a bear flag. The bulls will see it as a bear trap and look for a bull breakout. Without a strong breakout below the May low, betting on the bears is not yet a high probability bet.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>, and a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>is available.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.</p></div></article>"
      ],
      "dateId": "2016-6-25"
    }
  ]
}