{
  "4": [
    {
      "data": [
        "<article class=\"post-64653 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Trump rally is exhaustive buy climax and parabolic wedge topEmini weekend update: March 4, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Trump rally is exhaustive buy climax and parabolic wedge top<br>Emini weekend update: March 4, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-03-04T01:00:01-08:00\">March 4, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Buy climax at measured move targets</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/03/m.png\"><img loading=\"lazy\" src=\"2017-3-4.png\" alt=\"emini trump speech buy climax at 2400 big round number\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart is in a strong bull trend, but it is climactic. The bulls need follow-through after last month’s strong rally. Yet, the absence of follow-through buying increases the risk of an exhaustion gap.<p>The monthly S&amp;P500 Emini futures candlestick chart rallied strongly for 4 months. In addition, last month was an especially big bull trend bar. Furthermore, it reached several measured move targets based on the 2 year trading range. Finally, it is at the 2400 Big Round Number. Whenever a rally is especially strong and hits resistance, traders need to be aware that it could be a buy vacuum test of resistance. Hence, it could be an exhaustive end of the trend.<h3>Buy climax at resistance</h3><p>Since so many sites equate buy climaxes with trend reversals, many traders assume that they are the same. Yet, they are not. Most buy climaxes lead to trading ranges, not bear trends. The bulls are exhausted and take surprisingly big profits. After 10 bars or so, they decide if the bears did enough to reverse the trend.<p>Because the bears usually are unable to reverse a strong trend, the bulls see the reversal attempt as a bull flag and buy again. Yet, the bears are often able to temporarily stop a strong bull trend. In addition, if the bears can create good selling pressure in the pullback, they can create a credible major trend reversal. Hence, the bears will probably need many months before they can create a major reversal. Therefore, bulls will probably buy the 1st selloff.<p>Since this is a monthly chart, that 1st selloff could be 200 points, but still be small. While a pullback is likely soon, the odds are that the bears will need at least a micro double top before they can create a major reversal. Hence, a major top needs at least a couple more months.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Buy climax at resistance</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/03/w.png\"><img loading=\"lazy\" src=\"2017-3-4-1.png\" alt=\"emini buy climax since 9 bull trend bars. should test 2016 close.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart had its 9th consecutive bull trend bar this week. Since that is unusual, it is unsustainable and climactic.<p>The weekly S&amp;P500 Emini futures candlestick chart had another bull trend bar this week. Yet, the bar had a big tail on top. Because 9 consecutive bull trend bars is very unusual, next week will probably be a bear trend bar. Hence, next Friday will probably close below Monday’s open. This is true even though March and April are, on average, the most bullish consecutive months of the year.<p>This week’s high was unusually far above the moving average. When the market is far above the average price, bulls stop buying. As a result, the market usually enters a trading range. Hence, the weekly chart will probably be sideways for the next month or two. The bottom of the range could be as low as last year’s close.<p>Can the market go much higher without first going sideways for at least a couple of weeks? I have been trading for 30 years. I rarely get to say, “I haven’t seen that before!” That is what I would say. It is not likely.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Trump rally is exhaustive buy climax and parabolic wedge top</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/03/d.png\"><img loading=\"lazy\" src=\"2017-3-4-2.png\" alt=\"Emini daily chart shows that Trump rally is exhaustive buy climax and parabolic wedge top.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart had 3 pushes up in a tight channel over the past 3 weeks. Thursday’s reversal down made this a parabolic wedge top.<p>The daily S&amp;P500 Emini futures candlestick chart has rallied strongly since the bull breakout in early February. Yet, it has had 3 pushes up, with the 1st push being the February 15 top of the breakout. While this is a parabolic wedge top, and Friday triggered the short, the bears need many more bars to reverse the trend. Furthermore, the shape of the wedge is not clear. Therefore many computers will not see it as a wedge top.<h3>Failure to create an island top</h3><p>The bears could have created a big gap down on Friday. They therefore could have created a dramatic 2 day island top. That would have increased the chances of a strong reversal down. If the bears were strong, they would have been able to do that. Therefore, the bears are not yet strong.<p>Yet, if they get a big gap down any day next week, it would create an island top. Hence, traders would again wonder if this was the start of the pullback to the December close.<h3>Parabolic wedge top</h3><p>When a parabolic wedge top reverses, it usually pulls back into a tight trading range for 10 or more bars. Furthermore, that range is usually sloped down somehwat. At that point, there is a 50% chance of trend resumption up and a 50% chance of a bear breakout. The bears usually need at least 2 big bear bars closing on their lows. Therefore, traders will watch for that if a tight trading range begins next week. If the bears get their 2 big bear bars, the odds are that the Emini will have a swing down on the daily chart.<h3>Close of last year</h3><p>The Emini never traded below last year’s close. Hence, it has been up all year. Because this is unusual, there is a 70% chance that the Emini will trade back below the December close at some point this year. Furthermore, there is a 60% chance that it will achieve the goal within the next couple of months.<h3>Is this buy climax the top?</h3><p>Bull trends are always reversing. But, my 80% rule says that 80% of reversal attempts fail. Therefore, as good as the current reversal is so far, it still will probably fail. However, Thursday’s big bear trend bar after Wednesday’s unusually big buy climax bar is important. This is especially true because the reversal was at the 2400 Big Round Number and several measured move targets. Hence, even of this week is not the final top before the 5% correction, the current rally will probably end within the next few weeks.<h3>Reversal will probably be minor</h3><p>Because the bull trend since November is in a tight channel, the 1st reversal down will probably be minor. Hence, bulls will probably buy it, even if it falls 5% to the 2016 close. Since the rally was so extreme, the bulls will probably wait for at least a 2 legged correction that lasts at least 10 bars before they will buy again.<p>If the bears get a deep correction, it will break below the tight bull channel that began in November. Hence, the bulls who bought at the high will be eager to exit on a rally back to where they bought. They will be disappointed by a deep pullback. They will therefore conclude that the Emini is no longer in a strong bull trend. Hence, they do not want to be long at the high.<h3>Major and minor reversals</h3><p>When bulls sell out of their longs on the test of the high, they might create a double top. Double tops are rarely perfect. However, a reversal down would be an attempt at a major trend reversal. This is unlike the upcoming 1st reversal down, which will probably be minor. A minor reversal leads to a bull flag or trading range. A major reversal leads to a bear trend.<p>It will probably take at least a couple of months for a selloff and then a test of the high. Therefore, any major reversal down is probably at least several months away. Hence, even though a 160 point selloff to the December close is a big move, it will probably not be the end of the bull trend.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-3-4"
    }
  ],
  "11": [
    {
      "data": [
        "<article class=\"post-64994 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"March FOMC Fed interest rate hike stopping Trump rallyEmini weekend update: March 11, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">March FOMC Fed interest rate hike stopping Trump rally<br>Emini weekend update: March 11, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-03-11T00:30:19-08:00\">March 11, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Buy climax at the Final Bull Flag measured move targets and the 2400 Big Round Number</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/03/m-1.png\"><img loading=\"lazy\" src=\"2017-3-11.png\" alt=\"Emini and stock market probably will give back all of 2017 gains after Fed FOMC interest rate hike to end trump rally\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has a doji bar so far this month. Last month was a buy climax at measured move targets and the 2400 Big Round Number.<p>The monthly S&amp;P500 Emini futures candlestick chart is in a strong bull trend. Yet, it is at important resistance. The 2014 – 2015 trading range came late in a bull trend. Hence, it is probably the Final Bull Flag. Therefore, bulls will take profits around a measured move up. Furthermore, bears will begin to sell. Because this is rollover week, the targets are a little different from last week.<h3>Measured move target around 2400 Big Round Number</h3><p>Since there are usually several possible lows and highs to use to create measured move projections, the final target is never clear. Because the highs of the 2 year trading range were close to one another, and the lows were close as well, the measured move targets are in a tight cluster. In addition, that cluster is around the 2400 Big Round Number.<h3>Minor or Major Reversal?</h3><p>The year long rally has been in a tight bull channel. In addition, the past 4 months have been a Buy The Close rally. These are therefore signs that the bulls are strong. Hence, they will probably correctly see the 1st reversal down as minor and a likely bull flag. Therefore, the 1st reversal will probably not last more than a bar or two before the bulls buy again.<h4>Double top or micro double top</h4><p>Yet, once the bull trend resumes, if is fails again, there would then be a double top. Furthermore, since it would be in a buy climax at major resistance, it would have a better chance of leading to a major reversal.<p>If the double top is only a few bars, then it would be a micro double top. If a major reversal follows a micro double top, the selloff is usually not sharp. Instead, the market often goes sideways to down for 5 – 10 bars. This allows the bears to create the selling pressure that they need to begin to take control.<p>If the 2 tops in a double top are 10 or more bars apart, the reversal down can be more abrupt. This is because the bears have already demonstrated strength during the 10 bars between the 2 tops.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Buy climax far above the moving average</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/03/w-1.png\"><img loading=\"lazy\" src=\"2017-3-11-1.png\" alt=\"Emini weekly chart had 1st bear bar in 10 weeks. it is a buy climax at 2400 big round number.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart is far above its moving average. In addition, it broke below a 6 bar bull micro channel this week. Even though this week had only a 2 tick tall bear body, it was the 1st bear bar in 10 weeks.<p>The weekly S&amp;P500 Emini futures candlestick chart is in a strong bull trend. Because a bull micro channel is a sign of strong bulls, bulls usually buy the 1st break below a bull micro channel. Yet, it is also often a buy vacuum test of resistance. Hence, it can be a climax and a temporary end of the buying.<p>In addition, this week was the 1st bear bar after 9 consecutive bull trend bars. Nine consecutive bull trend bars only come about every 5 years. Since it is unusual, it is unsustainable. It is therefore a type of buy climax.<h3>The bull case is weak near-term</h3><p>This week’s high was extremely far above the moving average. That is therefore another sign of a buy climax. Whenever the high is far above the moving average, there is typically regression to the mean. Hence, there is usually a deep pullback to the moving average. That is therefore what is likely here over the next 10 bars or so. Since this is a weekly chart, that could be a couple of months.<p>Can the bull trend simply continue without pulling back? That is unlikely. Yet, if the market goes sideways for 5 or more weeks, it will be close to the moving average. Hence, bulls might begin to buy again. But, there is still resistance at the 2400 area created my several measured move targets. In addition, the 2 year trading range late in the bull trend is probably the Final Bull Flag. This also makes a big rally from here unlikely without a pullback first.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Pullback to the moving average</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/03/d-1.png\"><img loading=\"lazy\" src=\"2017-3-11-2.png\" alt=\"Emini pullback to moving average. should correct down to Dow 20,000 and give back all of this year's gains.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart pulled back almost to the moving average this week. Yet, it did so with a seven bar bear micro channel. Therefore, the bears are strong. Hence, sideways is more likely than up for the next few days.<p>The daily S&amp;P500 Emini futures candlestick chart pulled back to just above the moving average on Thursday. Since a 20 Gap Bar buy signal requires a touch of the moving average, Friday’s break above Thursday’s high is a lower probability buy. In addition, it followed a 7 bar bear micro channel. That is a sign of strong bears. This therefore creates a Big Up, Big Down pattern. Hence, there is confusion. As a result, the market usually goes sideways.<h3>Island top still possible</h3><p>The gap up two weeks ago was huge and therefore significant. In addition, the strong reversal down on the next day and the 7 day bear micro channel are signs of strong bears. Yet, why haven’t the bears been able to create a big gap down? It is because they are not yet strong enough.<p>Island tops and bottoms sometimes have 20 or more bars. Therefore any gap down over the next week would create an island top with the gap up from 2 weeks ago. Wednesday’s likely Fed interest rate hike could be a catalyst that leads to a gap down on Thursday or Friday next week. If the gap is big and the gap down day is a big bear trend day, traders will begin to believe that the 5% correction has begun.<h3>March FOMC Fed interest rate hike stopping Trump rally</h3><p>The Fed meets on Wednesday and it will probably increase interest rates. Since traders already know this, that is already incorporated into the current price. What traders do not yet know is the statement that comes with the rate hike. If traders sense that the Fed might raise rates faster and more often than they previously assumed, they will reprice the stock market downward.<p>Low interest rates and heavy government borrowing were the major reasons for the rally over the past 10 years. If traders believe that the government will now raise interest rates, investors will then have good alternative investments, like CDs and even savings accounts. Traders will begin to reduce their stock portfolios and put some of their money into these safer choices once they know that they can make a reasonable return.<h3>Downside targets</h3><p>If money moves out of the stock market, stocks will reprice downward. No one knows how far the market will fall. The 1st obvious target is last year’s close, which is below the Dow 20,000 Big Round Number. There is a 70% chance that the market will test last year’s close at some point this year because that is what it typically does. Furthermore, because the weekly chart is so overbought, there is a 60% chance that the correction will be within the next couple of months.<h3>Minor reversal more likely on daily chart</h3><p>The daily chart does not have a major top, like a wedge or major trend reversal. Therefore, the 1st reversal down, even if it is 150 points, will probably be a pullback in the bull trend. Yet, a big pullback would break below the bull trend line. Hence, traders will watch what happens on the rally back up.<p>If there is a reversal down from the old high, especially if there is a good sell signal bar, traders will see that as a possible major trend reversal. They will then begin to sell, looking for a swing down.<p>Reversals have only a 40% chance of leading to an opposite trend. Yet, that is good enough for a swing trader. This is because he is looking for a reward that is several times greater than his risk. He therefore can win only 40% of the time and have a positive Trader’s Equation.<p>What happens during the other 60% of the time? Usually the trader makes or loses a little. The small wins and losses offset each other. The key to the strategy is the big wins that come 40% of the time.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-3-11"
    }
  ],
  "18": [
    {
      "data": [
        "<article class=\"post-65209 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"FOMC Fed interest rate hike will lead to 5% correctionEmini weekend update: March 18, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">FOMC Fed interest rate hike will lead to 5% correction<br>Emini weekend update: March 18, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-03-18T00:30:46-07:00\">March 18, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Small doji after buy climax at resistance</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/03/m-3.png\"><img loading=\"lazy\" src=\"2017-3-18.png\" alt=\"emini buy climax and end of trump rally after FOMC fed interest rate hike.\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart so far has a small doji bar this month.<p>The monthly S&amp;P500 Emini futures candlestick chart had a big bull trend bar last month. This month’s doji is therefore bad follow-through buying. In addition, the monthly chart is at resistance created by the measured move projection from the 2 year Final Flag of 2014 – 2015. Furthermore, it is at the 2400 Big Round number.<h3>Seasonally bullish but buy climax at resistance</h3><p>There are 2 weeks left to the month. Hence, the chart could be very different once the month closes. Furthermore, the final 2 weeks of March are usually bullish. In addition, March and April are the strongest consecutive 2 months of the year. Finally, the Emini is in a strong bull trend. Hence, the bulls could create a big bull trend bar by the end of the month.<p>Yet, the resistance is strong. In addition, the rally is climactic, especially on the weekly chart. Therefore, the odds of a strong rally from here over the next couple of months are small. More likely, the monthly chart will pull back for a month or two.<h3>Pullback more likely than reversal</h3><p>Since the monthly chart is in a strong bull trend, the bulls will probably buy the 1st reversal down. The monthly chart could pull back for 1 – 3 months and still be in a strong bull trend. Because the bars on the monthly chart contain a lot of points, a 2 month pullback could be 150 points.<p>This is therefore enough to create a bear trend on the daily chart. Yet, it would still only be a bull flag on the monthly chart. Hence, the downside is not great for the next several months. The bears will probably need at least a micro double top before they can create a reversal on the monthly chart.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Far above moving average to pullback likely</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/03/m-4.png\"><img loading=\"lazy\" src=\"2017-3-18-1.png\" alt=\"Stock market buy climax at S&amp;P500 2400 so should give back all of 2017 gains\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart is in a bull trend, but it is far above the moving average.<p>The weekly S&amp;P500 Emini futures candlestick chart’s high from two weeks ago is extremely far above the average price. When that happens, the odds are that the Emini will pull back to the moving average. Since the average is near the close of last year, which has not been tested, the odds are that a pullback to the moving average will probably fall to last year’s close.<h3>Bull micro channel and buy climax</h3><p>The weekly chart had a pullback below a 6 bar bull micro channel 2 weeks ago. Bulls usually buy that 1st pullback, and they did this time as well. Yet, they could only create a doji bar. Hence, that is a weak buy signal bar.<p>The measured move targets up from the 2 year Final Bull Flag are major resistance. Nine consecutive bull bars is extreme and therefore a buy climax. When there is a High 1 bull flag after a buy climax at resistance, the odds are that the rally will not last more than a few bars. While this week was the entry bar for the breakout above the bull flag, the odds are that the rally will not go far.<p>In addition, when there is a bear breakout below a bull micro channel, and the trend is climactic, the trend resumption up usually only lasts 1 – 3 bars before there is a bigger pullback. This therefore means that the weekly chart will probably begin to correct within the next 2 weeks.<h3>Minor reversal likely</h3><p>Because the weekly chart is in a tight bull channel, the odds are that the 1st reversal down will be minor. Even if the bears correct down to the December close, the bulls will probably buy the selloff.<p>When a bull trend is in a tight channel, like the yearlong rally, the bears usually need a major trend reversal before they can create a bear trend. Hence, the bears need a strong selloff. Furthermore, they need to see the bulls buy the strong selloff, but fail to break strongly above the old high. The rally would therefore create a double top. That failed rally then would be a major trend reversal. Hence, the best the bears probably can get over the next few months is a deep pullback and a trading range, not a bear trend.<p>Because even unlikely things happen at least 30 – 40% of the time, the bears have a chance of a major reversal that begins as a minor one. Yet, the odds are against it.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>FOMC Fed interest rate hike will lead to 5% correction</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/03/m-5.png\"><img loading=\"lazy\" src=\"2017-3-18-2.png\" alt=\"trump rally failing at 2400 so Dow should test 20,000\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart is in a 3 week trading range after a buy climax to monthly measured move targets.<p>The daily S&amp;P500 Emini futures candlestick chart has been in a tight trading range for 3 weeks. While the bulls want a strong break above 2400, that is unlikely because of the buy climax on the weekly chart. Yet, the bears do not yet have a top. However, when there is a tight trading range after a buy climax, traders watch for a small double top. Hence, if the bears create a small double top or wedge top within this range, especially of there is a good sell signal bar, traders will sell.<p>This is because traders know how extreme the buy climax is, especially on the weekly chart. They therefore expect a correction. In addition, the Emini never tested last year’s close. Because that is unusual, there is a 70% chance of the test at some point this year. Furthermore, there is a 60% chance that it will happen within the next 2 months. This is because the buy climax is now at major resistance. The December close is also below of Dow 20,000. A pullback to that close would therefore be a test of the breakout above the Big Round Number.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-3-18"
    }
  ],
  "25": [
    {
      "data": [
        "<article class=\"post-65430 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Obamacare Health Care Act repeal starting 5% correction Emini weekend update: March 25, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Obamacare Health Care Act repeal starting 5% correction<br>Emini weekend update: March 25, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-03-25T00:30:49-07:00\">March 25, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Obamacare Health Care Act repeal starting 5% correction</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/03/m-6.png\"><img loading=\"lazy\" src=\"2017-3-25.png\" alt=\"Obamacare Health Care Act repeal starting 5% correction \"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has a big bear bar so far this month. Yet, there is a week left. Hence, while unlikely, it could still end up with a bull body once it closes.<p>The monthly S&amp;P500 Emini futures candlestick chart has a bear body so far this month. Since last month was a big bull bar, it was a buy climax. If this month closes on its low, it would therefore be a sell signal for a minor reversal down. Because this is the last week of the month, it determines what the bar will be once it closes. The bears will try to get it to close on its low. Yet, the bulls always want the opposite and they will try to buy at the end of the week. They therefore want to weaken the bear case for a 1 – 3 month pullback.<p>The bulls have 4 strong bull bars and a 15 bar tight bull channel. Therefore, the bears will probably need at least a micro double top before they can create a major reversal. Hence, even if this month closes on its low, there will probably be buyers not far below. Therefore, the bears will probably only get a 1 – 3 bar selloff.<p>Since bulls will buy that selloff, the reversal down would be minor and probably become a bull flag. Yet, a 1 – 3 month selloff on the monthly chart could easily fall 5% and 150 points. Therefore, the monthly bull flag would probably be a bear trend on the daily chart.<p>Only about 25% of minor reversals lead to opposite trends. Therefore the odds favor buyers below.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Failed breakout above wedge bull channel</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/03/m-7.png\"><img loading=\"lazy\" src=\"2017-3-25-1.png\" alt=\"Emini failed breakout above wedge top so expect test of Dow 20,000.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart has a micro double top after a buy climax at the monthly measured move target. Furthermore, this week is a failed breakout above a bull channel. The target is therefore the bottom of the channel, which is around the close of last year.<p>The weekly S&amp;P500 Emini futures candlestick chart’s high from 4 week’s ago was exceptionally far above the moving average. When that happens, the odds are that the Emini will work down to the moving average. The moving average is just above the close of last year. Since there is a 70% chance that the Emini will test that close this year, a pullback to the moving average will probably fall to last year’s close. Hence, TV will report that the stock market gave back all of 2017’s gains.<p>Yet, the bull channel over the past 5 months is tight. Therefore the reversal will probably create a Big Up, Big Down, Big Confusion pattern. Since confusion is a hallmark of a trading range, the selloff will probably be a bear leg in a trading range. Because trading ranges have legs up and down, bulls will buy the selloff. They would therefore correctly be betting that a trading range would be more likely than a bear trend. Furthermore, they would swing trade part of their position, hoping that the bull trend was resuming.<h3>Failed breakout above bull channel</h3><p>The Emini has been in a wedge bull channel on the weekly chart for more than a year. The February rally broke above the bull channel. Yet, 75% of the time, a bull breakout above a bull channel fails within 5 bars. Furthermore, the reversal down usually reaches the bottom of the channel. Since that bottom would be around the December close, this reversal is another reason for a swing down to the December close.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Strong bear breakout needs follow-through selling</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/03/m-9.png\"><img loading=\"lazy\" src=\"2017-3-25-2.png\" alt=\"Emini 5% correction to dow 20,000 and close of 2016.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart had a big bear trend bar on Tuesday. Yet, the bears need more bear bars to confirm the breakout and convince traders that the 5% correction has begun.<p>The daily S&amp;P500 Emini futures candlestick chart reversed down strongly on Tuesday. Tuesday closed below the lows of the 20 bars. Furthermore, it did so after a lower high reversal. In addition, the reversal followed an extreme buy climax that tested a measured move target up from a 2 year trading range.<p>I have said that there has been a 60% chance of a test of last year’s close within the next 2 months. Since this was an unusually big bear bar, the odds are that this is the start of the selloff.<h3>Start of bear trend?</h3><p>When there is a strong reversal down in a new bear trend, there is often an immediate pullback. In about 20% of cases, the pullback goes up to and even above the top of the bear breakout bar. As long as the bulls do not strongly break above last week’s lower high, the bears are in control. Hence, the odds favor a swing down for a month or two. The minimum target is the December – January trading range. That trading range is therefore a likely Final Bull Flag.<p>A test of that range is also a test of the 2016 close. While the selloff would be a bear trend on the daily chart, it would be a minor reversal and a bull flag on the monthly chart. Therefore, traders will look to buy around last year’s close.<h3>Obamacare Health Care Act weekend politics</h3><p>The Stock market is deciding if the 5% correction has begun. The bulls are reluctant to give up and they therefore are still willing to buy. Hence, politics over the weekend could lead to a big gap on Monday.<p>If the gap is up, the Emini could rally up to last Tuesday’s sell climax high. Yet, unless the bulls break above the lower high, the odds still favor that the 5% correction began last week.<p>If there is a big gap down and if Monday then sells off more, traders will conclude that the move down to the December close has begun.<p>If the market believes Trump is losing the political battle, it will begin to doubt his ability to create tax reform. Tax reform is bullish and priced into the market. If traders suspect that it will fail, the market will then reprice down.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-3-25"
    }
  ]
}