{
  "9": [
    {
      "data": [
        "<article class=\"post-70485 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini awaiting September central bank interest rate announcementsEmini weekend update: September 9, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini awaiting September central bank interest rate announcements<br>Emini weekend update: September 9, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-09-09T00:30:09-07:00\">September 9, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Buy climax, Emini awaiting September central bank interest rate announcements</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/09/m.png\"><img loading=\"lazy\" src=\"2017-9-9.png\" alt=\"Monthly Emini in strong bull trend\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has not pulled back below the low of the prior bar for 10 months. This is therefore an 11 month bull micro channel.<p>The monthly S&amp;P500 Emini futures candlestick chart’s behavior is unsustainable and therefore climactic. Each of the past 10 months has had a low above the low of the prior month. This is therefore an 11 bar bull micro channel. It is a sign of strong bulls because it means they have been so eager to buy that they have not even waited for a pullback. Consequently, they will be eager to buy below the low of the prior bar when they finally get the opportunity. As a result, the odds are that there will be buyers below this month’s low.<p>However, because the rally is so extreme, the 1st pullback might last 2 – 3 bars instead of only 1. In either case, the chance that the 1st reversal down will lead to a trend reversal is small. The best the bears can probably get over the next several months is a pullback. This means a bull flag. The odds are that the bears will need at least a micro double top before they can get a pullback lasting more than a few bars.<h4>New parabolic wedge top</h4><p>The rally from the January 2016 low has had 3 legs up in a tight bull channel. It is therefore a parabolic wedge top. Yet, instead of reversing, the bull channels has continued to grow.<p>The 4 month rally through February was a breakout. It therefore might have reset the count for bears looking for 3 pushes up. As a result, it could be the 1st of 3 pushes up in a new parabolic wedge top. Because that rally was a breakout, the pattern would also be a Spike and Channel bull trend.<p>Yet, until there is a reversal, there is no reversal. Furthermore, because the channel is so tight, the 1st reversal down will probably become a bull flag. Consequently, the odds of a bear trend beginning within a few months are small. The most the bears will probably get is a test of the 1st pullback after the breakout. That means a test of the March low. This would therefore be about a 180 point correction. If it were to occur, it would probably lead to a trading range for 10 or more bars (a year). However, a 180 point correction would be a bear trend on the daily chart.<h4>Extreme behavior is climactic</h4><p>Whenever a market does something unusual, it is unsustainable. The odds favor a pause. Consequently, although the 11 bar bull micro channel is a sign of strong bulls, it is also a buy climax. While it can grow more, 11 bars is unusual enough to make a pullback likely within the next few bars (months).<p>Can the reversal down grow into a bear trend instead of a bull flag? There is only a 30% chance of that happening without at least a micro double top first. Since the bulls know that, they will buy the first selloff. However, once the bull trend resumes, traders will pay attention to what happens at the old high. Will there be a strong bull breakout, or a reversal down? If there is a strong breakout, it will probably only last 1 – 3 bars. This is because the extreme buy climax will probably need 5 – 10 bars of sideways trading before the bulls will aggressively buy again.<h4>Small chance of bear breakout below bull flag</h4><p>What about the 30% chance of an endless pullback that grows to so many bars that it converts into a bear trend? That usually takes 10 or more bars. In addition, the bear trend begins as a bull flag. Consequently, the 1st 10 bars are usually mostly sideways to slightly down. It is a bull flag! After about 10 – 20 bars, the bears become confident and the bulls start to worry. If the bulls give up, the bears can get a strong bear breakout below the bull flag. This therefore can become a bear trend without there ever being a small double top.<h2>Weekly S&amp;P500 Emini futures candlestick chart: Extreme buy climax, but no top yet</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/09/w.png\"><img loading=\"lazy\" src=\"2017-9-9-1.png\" alt=\"Weekly Emini in buy climax\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart has been above its 20 week exponential moving average for 43 weeks. The bears have been making money by selling above prior highs for 8 months. Consequently, the bull channel from the March low will probably soon evolve into a trading range.<p>While the weekly Emini chart has not touched its weekly moving average for 43 weeks, it got to within 1/2 point 2 weeks ago. This provided some relief from this extreme buy climax. However, that is probably not enough relief for the exhausted bulls to buy aggressively again soon. They usually want about 10 bars and 2 legs sideways to down before they will try to buy again for another leg up. The buy setup is usually a High 2 or wedge bull flag. They need to give the bears the chance to reverse the bull trend.<p>If the bears fail after a couple of attempts (2 legs sideways to down), the bulls will regain confidence and buy again. They will bet that the bears will step aside and not try for another top until after at least a couple of legs up.<h2>Daily S&amp;P500 Emini futures candlestick chart: Bull channel and trading range</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/09/d.png\"><img loading=\"lazy\" src=\"2017-9-9-2.png\" alt=\"Daily emini has head and shoulders top\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart is in a broad bull channel. However, it has also been in a trading range for 3 months. There is therefore also a sell setup. Here, there is a lower high major trend reversal. It is also a head and shoulders top.<p>The daily S&amp;P500 Emini futures candlestick chart has been sideways for 3 months. Several central banks are making interest rate announcements this month and the Emini might be waiting before breaking out.<p>Whenever a chart is in a trading range, there is always both a reasonable buy and sell setup. The bulls have a broad bull channel. In addition, last week’s rally was strong enough to make at least a small 2nd leg up likely. That would be a 3rd push up from the August low and therefore a wedge rally.<p>The bulls need a strong breakout above the September 1 major lower high. Without that, the odds are that the 3 month range will continue. Furthermore, even if they get the breakout, the rally has been in a broad bull channel since March. Consequently, the bulls are taking profits above prior highs. Furthermore, the bears have been making money by selling above prior highs. As a result, the odds are that there will be sellers above the September 1 high and the all time high. In addition, because the weekly and monthly charts have buy climaxes, the odds of a strong rally far above the high are small over the next several weeks.<h4>The bear setup</h4><p>The rally from the August 21 low has been weak. Furthermore, the selloff down to that low was strong enough so that bears will sell the current rally. If the bears get a reversal from here, they will have a double top bear flag with the August 16 lower high. In addition, the top would be a lower high major trend reversal. Furthermore, it would be a head and shoulders top.<p>If the bulls break to a new high, the bears will sell the new high. They would then be trying to create a higher high major trend reversal.<p>Whether the bears get a reversal from above or below the August high is irrelevant. They simply want a break below the 3 month trading range and then a measured move down. That would be a test of the March low, which is the target for the bears on the weekly and monthly charts as well. If the Emini gets there over the next several months, the weekly and monthly bulls will probably buy. This would then probably create at least a 50% bounce. In addition, the result will probably be a trading range that lasts 6 – 12 months.<p>At that point, the Emini would be back in Breakout Mode. This means that there would be about a 50% chance of either a bull or bear breakout. In addition, the target would be a measured move, based on the height of the 6 month range.<h3>What does all this mean?</h3><p>The odds are the the Emini rally is stalling on the weekly and monthly charts. This will probably result in a trading range over the next 6 – 12 months. While there is no convincing top yet, the odds are that the upside from here over the next several months is not great. In addition, because the monthly chart is so bullish, the downside from here is probably 150 – 200 points over the next few months. Furthermore, the bulls will probably buy the selloff. Consequently, the best the bears will probably get over the next 6 months is a 200 point selloff and then a trading range.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noopener\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-9-9"
    }
  ],
  "16": [
    {
      "data": [
        "<article class=\"post-70576 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Wednesday’s FOMC interest rate announcement is a catalystEmini weekend update: September 16, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Wednesday’s FOMC interest rate announcement is a catalyst<br>Emini weekend update: September 16, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-09-16T00:30:55-07:00\">September 16, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Parabolic wedge buy climax</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/09/m-1.png\"><img loading=\"lazy\" src=\"2017-9-16.png\" alt=\"The monthly Emini chart is in a strong bull trend, and a buy  climax.\"></a><p class=\"caption\">Every bar for the past 10 months on the monthly S&amp;P500 Emini futures candlestick chart has a low above the low of the prior bar. This is an 11 bar bull micro channel. The 4 month breakout through February is a spike in a spike and channel bull trend. The channel began with the bear doji in March, which was the 1st pause after the breakout.<p>The monthly S&amp;P500 Emini futures candlestick chart is in a strong bull trend. Yet, a micro channel (every bar has a low that is above the low of the prior bar) is unsustainable. It is therefore a buy climax. However, there is no top yet. Furthermore, when a bull trend is this strong, the bulls will be eager to buy below the low of the prior month. Consequently, the best the bears can probably get is a 1 – 3 month pullback, maybe to the March low where the channel began. While that 200 point reversal would be a bear trend on the daily chart, it would be a bull flag on the monthly chart. Hence, the reversal will be a pullback instead of a bear trend. As a result, the downside risk over the next few months is small.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Tight bull channel, but climactic</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/09/w-1.png\"><img loading=\"lazy\" src=\"2017-9-16-1.png\" alt=\"The weekly Emini chart closed at a new high, just below the 2500 bug round number.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart is in a tight bull channel. It is therefore in a strong bull trend. Furthermore, it might gap above the 2500 Big Round Number next week. However, it has not touched the 20 week exponential moving average in 44 weeks. This is extreme behavior and therefore unsustainable and climactic.<p>The weekly Emini chart this week closed on its high at a new high, just below the 2500 Big Round Number. This increases the chances that Monday will gap above the 2500 resistance, creating a gap up on the weekly chart as well. The bulls would then try to keep the gap open and create another strong bull trend bar next week. If they can then get a follow-through strong bull trend bar on the week after next, they might get at least 2 legs up over the next several weeks.<p>The weekly S&amp;P500 Emini futures candlestick chart has been in a tight bull channel for 44 weeks. That is a strong bull trend. Consequently, when the bears finally create a breakout below the bull trend line, the reversal will be minor. This means that is will become a bull flag or a trading range and not a bear trend.<p>Because the buy climax is so extreme, when there is a pullback, it might be deeper and last more bars than expected. For example, the Emini held above the weekly moving average for 50 bars in 2003. It then went sideways for about 10 months. In addition, the bottom of the trading range was about 10% below the high. If the current rally has a comparable pullback, the Emini could fall more than 200 points. Furthermore, the exhausted bulls might need 6 months or more before they would buy again for another leg up.<p>Whether or not the bulls get a gap up and strong bull trend next week, the bears will try to reverse the breakout down. However, they need to create either a big bear trend bar or a bear reversal bar over the next 2 weeks. Without that, the odds still favor higher prices.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Broad bull channel</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/09/d-1.png\"><img loading=\"lazy\" src=\"2017-9-16-2.png\" alt=\"Emini strong breakout to new high just below 2500 big round number.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart has been in a broad bull channel since the March low. After 5 days closing on their highs, the odds favor higher prices next week.<p>The daily S&amp;P500 Emini futures candlestick chart has been in a broad bull channel since March. While a channel can continue indefinitely, it usually evolves into a trading range after 3 – 5 legs up. The current rally is the 5th leg up. There is therefore an increased chance that the next leg down will break below the bottom of the channel.<p>Furthermore, once there is a break below a channel, the Emini usually eventually sells off to the start of the channel. That is the March low of 2314.00. Once there, the bulls usually return and the bears buy back their shorts. As a result of both the bulls and bears buying, the Emini usually rallies. At that point, traders will conclude that the bull channel had evolved into a trading range.<p>When a bull channel evolves into a trading range, the bear leg usually lasts at least half as long as the bull channel. Since the bull channel has lasted 7 months, once there is a selloff, it will probably last at least 3 months. This is consistent with the duration of the eventual pullbacks on the weekly and monthly charts.<h4>Wednesday’s FOMC interest rate announcement is a catalyst</h4><p>Most reversals begin with a news event. News surprises can come at any time, but some news events are predictable. For example, Wednesday’s FOMC meeting has the potential to surprise traders. If the Federal Reserve says something unexpected, that could lead to the start of a correction.<p>Since most reversals fail, the odds are that any reversal attempt over the next few weeks will lead to a small trading range and not the start of a 200 point correction. Yet, because the weekly and monthly charts are so extremely overbought, there is an increased risk of a correction at any time.<h4>Bull breakout above bull channel is unlikely</h4><p>Although most bull channels have bear breakouts, about 25% of them have strong bull breakouts. The most dramatic example is the monthly chart of the S&amp;P cash index in 1995. When that happens, the market cycle starts over. The breakout eventually has a pullback. At that point, the strong bull trend enters a bull channel. Eventually the bull channel transitions into a trading range. Then, traders get ready for a new breakout up or down, which would start the market cycle over again.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noopener\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-9-16"
    }
  ],
  "23": [
    {
      "data": [
        "<article class=\"post-70704 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini breakout above August high and 2500 big round number Emini weekend update: September 23, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini breakout above August high and 2500 big round number<br>Emini weekend update: September 23, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-09-23T00:30:23-07:00\">September 23, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Parabolic wedge buy climax</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/09/m-2.png\"><img loading=\"lazy\" src=\"2017-9-23.png\" alt=\"Monthly Emini chart is in a buy climax and will likely have a 100 point, 5% correction soon.\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has a bull body so far this month, and the trend is strong. Since every bar for the past 10 months has a low above the low of the prior bar, the rally is a bull micro channel. However, it is also a nested parabolic wedge bull channel and therefore a buy climax.<p>Every bar on the S&amp;P500 Emini monthly futures candlestick chart for the past 10 months had a low above the low of the prior month. This is an 11 bar bull micro channel, which is a sign of strong bulls. The bulls have been so eager to buy that they have been buying above the low of the prior month. Therefore, they will aggressively buy below the low of the prior month. Consequently, if next month falls below this month’s low, the bulls will buy the reversal down. As a result, the reversal down will probably only last 1 – 3 months and become a bull flag. Hence, the downside risk over the next several months is small.<p>Since the 11 month rally has had a series of big bull bars followed by pauses, it is a parabolic wedge bull channel. A parabolic wedge is a buy climax, and it usually leads to a pullback. Therefore, a pullback is likely within the next 3 months.<h4>Strong bull trends increase risk and lead to profit taking</h4><p>While a micro channel is a sign of strong bulls, it is also unsustainable. It therefore is a buy climax. The stop for the bulls is below the bottom of the micro channel. Hence, it is below the November low of 2066.75, which is about 20% down.<p>Since that is far, the risk is big and growing. Institutions always control risk. When risk becomes unacceptable, they take steps to reduce it. The easiest choice is to take some profits. As a result, an increasing number of firms will begin to sell out of some of their longs. Once enough do it, the month will fall below the low of the prior month.<p>While any reversal can lead to an opposite trend, the 1st reversal down in a bull micro channel has a 70% chance of being minor. This means it will likely become a bull flag. Since the trend is very strong, the bull flag will probably be brief. The bulls will probably aggressively buy the small selloff. The bull trend will therefore likely resume up within a few bars (months).<br><h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Extreme buy climax</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/09/w-4.png\"><img loading=\"lazy\" src=\"2017-9-23-1.png\" alt=\"weekly emini doji sell signal bar at 2500 big round number.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart has not touched its 20 week exponential moving average in 45 weeks. Furthermore, this week is a doji bar. It therefore represents bad follow-through buying after last week’s breakout above the 2500 Big Round Number and the August high. Consequently, it is a sell signal bar for next week for a failed breakout.<p>The weekly S&amp;P500 Emini futures candlestick chart formed a bear doji bar this week. This is therefore bad follow-through buying after last week’s breakout above the August high and the 2500 Big Round Number. It is therefore a sell signal bar for next week.<p>In addition, the weekly Emini chart has not touched its 20 week EMA in 45 weeks. Since that is extremely rare, it is unsustainable and climactic. Consequently, the odds are that it will fall at least a little below the average price soon. While theoretically it never has to come down to the average price, that has never happened. In fact, it has only been above the average price this long once before in its 18 year history. When it last happened in 2003, the Emini corrected 10% and stayed in a tight range for the next 10 months. Although a pullback now will probably not last 10 months, it is likely to last at least 10 weeks and have at least 2 legs. Furthermore, it will probably fall at least 5%. This is because this is what typically happens in a buy climax.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Emini breakout above August high and 2500 big round number</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/09/d-2.png\"><img loading=\"lazy\" src=\"2017-9-23-2.png\" alt=\"emini buy climax above 2500 big round number at top of channel\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart broke to a new high and above the 2500 Big Round Number. However, it is in its 5th leg up in a broad bull channel, and the breakout is stalling.<p>The daily S&amp;P500 Emini futures candlestick chart has been in a broad bull channel since March. Every breakout has pulled back below the breakout point. That is therefore likely to happen here over the next several weeks, even if the rally continues a little higher 1st. In addition, the selloff from the August 8 high was deep. It retraced most of the rally from the June 29 major higher low. Trends tend to become weaker over time, and eventually evolve into trading ranges. As a result, the upcoming selloff has an increased chance of being deep as well.<p>Furthermore, since channels usually evolve into trading ranges after 3 – 5 legs up, the Emini will probably soon enter a trading range. This means that the next selloff has an increased chance of falling below the last major higher low. That is the August 21 low, which is almost 100 points below the high.<p>If the selloff is strong, it will probably lead to a 2nd leg down after any bounce from the August 21 low’s support. If it sells off from a lower high, traders will begin to talk about a head and shoulders top (lower high major trend reversal). This entire process will probably require 20 – 50 bars. This is 1 – 3 months, and it is consistent with the likely depth and duration of the pullback on the weekly and monthly charts.<h4>Could the correction be 20% instead of 5%?</h4><p>One final note is that Nobel Prize economist Robert Shiller, whom I respect,<br>wrote on Thursday that he thinks there is an increased risk of a 20% correction. However, he said timing it is the problem, and that the current rally could last much longer before the 20% correction comes. He pointed out similarities between the current rally and the prior 13 corrections of 20% or more.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noopener\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-9-23"
    }
  ],
  "30": [
    {
      "data": [
        "<article class=\"post-70928 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini traders believe 2500 buy climax trumps republican tax cutsEmini weekend update: September 30, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini traders believe 2500 buy climax trumps republican tax cuts<br>Emini weekend update: September 30, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-09-30T00:30:22-07:00\">September 30, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Extreme buy climax</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/09/m-4.png\"><img loading=\"lazy\" src=\"2017-9-30.png\" alt=\"Monthly Emini has 11 month micro channel buy climax at 2500 big round number, despite trump's republican tax cut proposal\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart had a bull trend bar this month. However, it has had 11 months without a pullback. This bull micro channel is therefore unsustainable and climactic.<p>The protracted bull micro channel is extremely unusual and therefore climactic. I do not believe this has ever happened in the 18 years of the Emini. The longest micro channel in the S&amp;P cash or futures markets in my 30 years of trading was in 1995. That was at the start of the strongest and longest bull trend in maybe 50 years. This is unlike the present rally, which is 8 years into a bull trend. It is therefore more likely climactic than the start of a new, stronger leg up.<p>Hence, there is a 70% chance of a pullback by the end of the year. Otherwise, the micro channel would become the longest in at least 30 years, which is unlikely. Since the recent bars are almost 100 points tall and a pullback means that a bar goes below the low of the prior bar, the minimum goal would be about 100 points. When a buy climax is this extreme, the pullback is often bigger. Consequently, it might last 2 – 3 months and fall as much as 200 points.<h4>What can a reversal look like?</h4><p>Because last month was a big bull bar in a buy climax, there is an increased chance of a reversal down this month. The most common reversals are bear reversal bars and 2 bar reversals. If either forms this month, it would be a sell signal bar for November.<p>A bear reversal bar rallies above last month’s high, but then closes below the midpoint, and usually near the low of the bar. A two bar reversal is a bear bar following a bull bar, like September. It might go a little above last month’s high, but it does not have to. It can also be a bear inside bar. For example, October could form one with September if it opens near the September high and reverses down from around that high. It could trade a little above the high, but not much. Then, October would trade down and close near its low, and that low would be around the September’s low.<h4>Buy climax, but pullback more likely than trend reversal</h4><p>Despite being a buy climax, a protracted micro channel is also a sign of strong bulls. As a result, the 1st reversal down will probably only a pullback on the monthly chart. It will probably last 1 – 3 months. At that point, the bulls will buy again for a test of the high. If that rally fails, the bears will have a micro double top. This would increase their chances of a trend reversal.<p>However, the bull trend has been very strong. Therefore, the bears will probably need a trading range lasting 10 or more bars to create enough selling pressure to make traders believe they might be able to begin a bear trend. Hence, the risk of a 20% or more correction is small over the next several months.<p>However, the bull climax could easily lead to a trading range that could last 6 – 12 months. Even if it did, the 11 month rally has been strong enough to make at least one more leg up likely before the bears have a reasonable chance of a 20% or more correction.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Emini traders believe 2500 buy climax trumps republican tax cuts</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/09/w-6.png\"><img loading=\"lazy\" src=\"2017-9-30-1.png\" alt=\"extreme weekly Emini buy climax so odds favor a correction to below 2400\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart is in a buy climax. This week’s outside up bar will probably be part of a top and not the start of a new leg up.<p>The weekly S&amp;P500 Emini futures candlestick chart had a doji bar 2 weeks ago after a breakout to a new high. This past week triggered a sell signal by trading below that doji bar’s low. However, the week then reversed up to a new high, negating the sell. Yet, that outside up bar is not as bullish as it might otherwise be because of the buy climax on the weekly and monthly charts.<h4>20 week exponential moving average buy climax</h4><p>The weekly chart has been above its 20 week exponential moving average for 46 weeks. While that is a sign of strong bulls, it is also a problem. This is because the longest the Emini has ever stayed above its average was 50 weeks. That was in 2003 and it led to a 10% correction and a 10 month trading range.<p>There have been many other times when the weekly Emini held above its average for 20 weeks. However, there has been no other time when it stayed above for anything close to these 2 examples. Since what is going on is rare, it is likely to not become more rare. Instead, it will probably do what it did after all of the other buy climaxes. What usually happens is a reversal lasting 10 or more bars and having 2 or more legs sideways to down.<p>While there is no top yet, the odds are that it will form soon. Furthermore, a 10 week selloff that falls below the average would be 2 – 3 months. This is therefore consistent with what is likely on the monthly chart.<br><h2>Daily S&amp;P500 Emini futures candlestick chart:<br>5th leg up in a bull channel so overbought</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/09/d-5.png\"><img loading=\"lazy\" src=\"2017-9-30-2.png\" alt=\"Emini buy climax at top of bull channel at 2500 resistance so 100 - 200 point correction likely soon.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart had a bull inside bar on Thursday after another new high. It was a therefore a strong buy signal bar. Friday was a strong entry bar for the bulls. The odds therefore favor at least slightly higher prices next week.<p>This month-long rally is also the 5th leg up in the bull channel that began in March. That is climactic. Since a bull channel is a bear flag, there is a 75% chance of a break below the bull trend line and then a swing down. Furthermore, it will probably begin within a few weeks.<p>The daily S&amp;P500 Emini futures candlestick chart has been in a broad bull channel since March. From the<a href=\"https://www.brookstradingcourse.com/how-to-trade-manual/market-cycle/\" target=\"_blank\" rel=\"noopener\">Market Cycle</a>, traders know that channels usually lead to trading ranges. There is therefore only a 25% chance of a successful bull breakout above the channel. Furthermore, there is a 75% chance of a break below the bull channel and then an evolution into a trading range.<p>Each of the major higher lows in the bull channel are support. The bull trend is in effect as long as the Emini continues to make major higher lows. Therefore, if the selloff falls below August 21 most recent major higher low, the Emini would then no longer be in a bull trend. Traders would conclude that the bull channel had evolved into a trading range or possibly a bear trend.<h4>What happens once there is a trading range?</h4><p>Once it is in a trading range, the bulls will try to create a buy setup that will lead to a resumption of the bull trend. However, they might not aggressively buy until the swing down tests the beginning of the bull channel. That March 27 low is about 200 points down, which would be close to a 10% correction.<p>Since the weekly and monthly charts are in strong trends, even a 200 point selloff would not be a bear trend on those charts. It would be a bear leg in a trading range on the weekly chart. This means that the selloff would lead to a test of the top of the range, which is this week’s high. It would also simply be a bull flag on the monthly chart.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noopener\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-9-30"
    }
  ]
}