{
  "1": [
    {
      "data": [
        "<article class=\"post-68286 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Summer swoon 100 point 5% S&amp;P500 stock market correction Emini weekend update: July 1, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Summer swoon 100 point 5% S&amp;P500 stock market correction<br>Emini weekend update: July 1, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-07-01T00:30:30-07:00\">July 1, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Minor sell signal</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/07/m-2.png\"><img loading=\"lazy\" src=\"2017-7-1.png\" alt=\"monthly emini has sell signal for parabolic wedge top below 2500 big round number.\"></a><p class=\"caption\">June is a sell signal bar on the monthly S&amp;P500 Emini futures candlestick chart. The three pushes up in a tight bull channel is a parabolic wedge top. Because the channel is tight, the downside over the next few months is probably small.<p>The monthly S&amp;P500 Emini futures candlestick chart has a 2 month breakout above the April high. At the end of April, I said that April was a buy signal bar. But, I said that it was a doji bar, and therefore weak. In addition, I said that it followed a 4 bar buy climax. Furthermore, when the Emini was testing I wrote that it would probably fall to 2300 before rallying to 2500. Although the Emini’s rally to 2450 was more than I expected, I still think it will fall to around 2300 before reaching 2500. However, since it went so high, it might not quite reach 2300 on the 1st reversal down.<p>Finally, I mentioned that the rally was at a measured move up from the 2014 – 2015 trading range. Hence, it was at important resistance. I concluded by saying that the breakout above a High 1 bull flag after a buy climax and at resistance usually only lasts 1 – 3 bars. Furthermore, the market typically then pulls back for a few bars.<p>June is the 2nd month of the breakout. The odds are that either the pullback will begin in July or August. Yet, the 18 month bull trend has been in a tight bull channel. In fact, there has been no pullback in 8 months and this is therefore an 8 bar bull micro channel. As a result, it is strong. Hence, the 1st reversal down will probably be minor. Therefore the downside risk over the next few months is small and probably limited to 100 – 150 points. While that would be a bear trend on the daily chart, it would be a pullback on the monthly chart.<h4>Parabolic wedge top</h4><p>Because the 18 month tight channel has had 3 pushes up, it is a parabolic wedge top. Therefore, there is a 20% chance of an Endless Pullback. If the bears get a 10 – 20 bar endless pullback, there would then be a 40% chance a reversal down to the 2014 – 2015 final bull flag. The odds are that the Emini will test to the 1,800 bottom of that flag at some point in the next few years. Yet, the odds of the current parabolic wedge top being the start of the reversal are small at the moment.<p>However, if the Emini monthly chart pulls back in a tight bear channel for 10 or more bars, that would be an Endless Pullback. If the bears then got a pair of big bear bars breaking below that bear channel, then the odds would shift in favor of the bears. Hence, the Emini would probably test the 1,800 area without 1st testing this month’s all-time high.<p>I want to be clear about this being a low probability event at the moment. However, that is how a parabolic wedge top can lead to a reversal.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Start of pullback to moving average</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/07/w.png\"><img loading=\"lazy\" src=\"2017-7-1-1.png\" alt=\"Weekly Emini chart correction after extreme buy climax and parabolic wedge top.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart has been above its weekly exponential moving average for 33 weeks. Because this is so extreme, the odds are that it will go sideways to down to the average over the next 2 months. It should also test the May 18 low around 2350.<p>The weekly S&amp;P500 Emini futures candlestick chart is in its most extreme buy climax in its 18 year history. While climaxes can extend much longer than what seems logical, this one is already at a historic size. Therefore, a regression to the mean is likely. Hence, the odds are that it has begun its pullback to the weekly moving average.<p>It can get there by going sideways or down. Because this is so extremely overbought, the odds favor that it goes down at least a little. An obvious target is the May 18 major higher low. Since that is around 2350, that would be a 100 point pullback.<h4>Final Bull Flag</h4><p>The trading range in March and April is probably the final bull flag in the 18 month rally. When there is a final flag, its low is a magnet. Therefore the Emini might test the 2300 – 2320 area before the bulls will be willing to buy again.<p>If this selloff falls back to the flag, it will be strong enough to make traders wonder if the rally up from there might fail. Traders will watch that rally to see if it forms a lower high major trend reversal. That would also be a head and shoulders top. If that happens and there is a decent sell signal bar, there would be a 40% chance of a 2nd leg down. At that point, traders would begin to look for a test of the bottom of the monthly final flag at around 1,800.<p>Because the rally on the weekly and monthly charts has been strong, it is more likely that any pullback over the next few months will lead to a rally to a new all-time high. Yet, whenever the bears are able to control the market for a few months, traders become less confident in the bull trend. Consequently, they will then begin to consider the possibility of a bigger correction.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Summer swoon 100 point 5% S&amp;P500 stock market correction</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/07/d.png\"><img loading=\"lazy\" src=\"2017-7-1-2.png\" alt=\"Daily emini chart has consecutive closes below the EMA after wedge top and buy climax.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart is…<p>The daily S&amp;P500 Emini futures candlestick chart has been in a trading range for a month. However, it has had 3 pushes up from the March low. This rally is therefore a wedge top. The odds are that it will be a bull leg in a trading range that began in late February. A bull leg in a trading range leads to a bear leg in the range. Furthermore, a bull channel is a bear flag. There is therefore a 75% chance of a break below the bull trend line.<p>While the bulls might get one more minor new high, the odds are that the bears will begin a swing down soon. Since a swing means at least 20 bars, the reversal will probably last at least a month. Because the targets on the weekly chart are more than 100 points below, the reversal might need a few months to reach them. Consequently, the odds favor a 2 – 3 month pullback beginning soon.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-7-1"
    }
  ],
  "8": [
    {
      "data": [
        "<article class=\"post-68492 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Trump, Putin, North Korea are less important than buy climax Emini weekend update: July 8, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Trump, Putin, North Korea are less important than buy climax<br>Emini weekend update: July 8, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-07-08T00:30:42-07:00\">July 8, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Buy climax</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/07/m-3.png\"><img loading=\"lazy\" src=\"2017-7-8.png\" alt=\"Emini in parabolic wedge top at measured move below 2500 big round number.\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart is in a strong bull trend. However, it has a parabolic wedge rally. Last month is the sell signal bar.<p>The monthly S&amp;P500 Emini futures candlestick chart is in a strong bull trend, but it is climactic. The parabolic wedge top will trigger if July trades below the June low. Since the Emini is at a measured move up from the 2014 – 2015 trading range, it is as important resistance. It is therefore likely that July will trade below June at some point.<p>Also, April was a High 1 buy signal bar. Since it followed a 4 bar buy climax and it is at resistance, the bull breakout usually lasts a few months. The Emini then typically pulls back for a few months. Therefore, the odds are that it will pull back within the next month or two.<h4>Minor reversal only</h4><p>Since the 17 month bull trend is in a tight bull channel, the downside risk over the next few months is small. Any reversal would therefore probably be minor. This means that it will become either a bull flag or a bear leg in a small trading range. Probably the best the bears can get is a small pullback to around the April low. Yet, that is 100 – 150 points down. It would therefore be a bear trend on the daily chart.<p>There is a 40% chance that a pullback from a parabolic wedge top becomes endless. This means that it could last 10 or more bars in a tight bear channel. If that happens, then the bears would have a 40% chance of a bear break below that bull flag, and then a measured move down.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Trump, Putin, North Korea are less important than buy climax</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/07/w-1.png\"><img loading=\"lazy\" src=\"2017-7-8-1.png\" alt=\"Weekly emini buy climax correcting to below 2400 after trump met putin.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart has had 3 consecutive bear bars. It is probably pulling back to the weekly moving average.<p>The weekly S&amp;P500 Emini futures candlestick chart is the most overbought in its 18 year history. It has never been this far above the 20 week exponential moving average for this many bars before. Hence, this is unsustainable and climactic. The odds are that it has begun a pullback to below the moving average. When it pulls back to the moving average, it usually falls at least 20 – 40 points below. That would be around the 2350 area, and hence at least a 100 point pullback.<p>While it is possible that the Emini makes one more new high before testing the moving average, this is unlikely after 3 bear bars.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Increasing selling pressure</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/07/d-1.png\"><img loading=\"lazy\" src=\"2017-7-8-2.png\" alt=\"daily emini has increasing selling pressure in bear channel in correction down to 2350 or 2300.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart reversed up on Friday, but there were 10 bear bars in the past 13 days. While still in a trading range, this increasing selling pressure makes a bear breakout more likely.<p>The daily S&amp;P500 Emini futures candlestick chart has been in a trading range for a month. However, it has had 3 pushes up from the March – April trading range. This therefore has been a wedge rally. A wedge rally after a final flag is usually a bull leg in what will become a trading range. Hence, it usually leads to a bear leg in the developing range. Furthermore, that March- April trading range is a likely final bull flag. Consequently, the Emini will probably begin to pull back into that bull flag.<p>A logical target for the bears is a test of prior major lows. The first one is the May 18 low at 2349.25. If the Emini breaks below that, the next target is the bottom of the trading range in the 2300 – 2320 area.<p>If the Emini falls to that area, it will probably go sideways for a month or two. This is because it is support, and the weekly and monthly charts are so strongly bullish. The odds are that bulls will buy a 2 – 3 month selloff to that support level. Hence, the selloff will probably lead to at least one more attempt at a new high.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-7-8"
    }
  ],
  "15": [
    {
      "data": [
        "<article class=\"post-68718 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Trump’s healthcare and tax reform not obstacles to new high Emini weekend update: July 15, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Trump’s healthcare and tax reform not obstacles to new high<br>Emini weekend update: July 15, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-07-15T00:30:38-07:00\">July 15, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Strong rally, but parabolic wedge top likely</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/07/m-4.png\"><img loading=\"lazy\" src=\"2017-7-15.png\" alt=\"Monthly emini is parabolic wedge top buy climax\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart currently has 4 consecutive bull trend bars. However, the rally is also a parabolic wedge buy climax.<p>The monthly S&amp;P500 Emini futures candlestick chart is in a parabolic wedge buy climax. Yet, the momentum up is strong enough to reach the next major resistance of the 2500 Big Round Number.<p>April was a High 1 buy signal bar. In addition, it followed a 4 month buy climax. Furthermore, it was at the resistance of a measured move up from the 2014 – 2015 trading range. A rally from a High 1 after a buy climax and at resistance usually lasts 1 – 3 months and then leads to a pullback for several bars (here, months). Since July is the 3rd month of the rally, the odds are that the Emini will begin to pull back for a few months in July or August.<p>June is a sell signal bar because it closed below its midpoint. While the bears are running out of time in July, they still can trigger the sell this month by trading below the June low. If the Emini trades down from above June’s high to below June’s low, July would be an outside down month. This would increase the chances of a 3 month pullback.<h4>Exhaustion gap or measuring gap?</h4><p>What about the bulls? How long can this rally last without a pullback? This 17 month rally is the strongest leg in the 7 year bull trend. The current rally is a 9 bar bull micro channel. This means that the low of every month is at or above the low of the prior month. When a bull trend becomes especially strong late, the strength is more likely climactic than the start of an even stronger leg up. Hence, it is more likely an exhaustion gap that a measuring gap.<p>There is a gap between this month’s low and the breakout point above the August 2016 high. Therefore, the Emini will probably trade below that high with a year or two. Furthermore, the 2014 – 2015 trading range is probably the final bull flag in the 7 year bull trend. Consequently, the Emini will probably trade down to the 1800 bottom of that range within a few years.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Exceptional buy climax</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/07/w-2.png\"><img loading=\"lazy\" src=\"2017-7-15-1.png\" alt=\"Emini weekly chart in extreme buy  climax far above the 20 week EMA.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart had a big bull trend bar this week. However, it followed 3 strong bear bars in a 6 week tight trading range. In addition, it has not touched its 20 week exponential moving average in 35 weeks. Because that is an unusually long buy climax, any rally from here will probably not last long.<p>The weekly S&amp;P500 Emini futures candlestick chart has not touched its 20 week exponential moving average in 35 weeks. Therefore, this is the most exceptional buy climax in the 18 year history of the Emini. Hence, the rally is unlikely to continue without 1st pulling back to below the average price.<p>How many more weeks can the rally last? There is no theoretical limit. Yet, there is a practical one. Whenever a market deviates far from its normal behavior, it usually regresses back to the mean. This means that it usually soon begins to behave like it has done in the past. Consequently, betting that this rally will last much longer is a low probability bet.<p>As a result, all of the traders who have bought over the past 5 – 10 weeks know that they bought at a time when there is an increased risk of a deep pullback. Hence, if the Emini begins to pull back, these bulls will quickly sell out of their longs. The result can be a quick reversal down.<h4>Minor reversal</h4><p>The weekly chart is in a strong bull trend. Therefore, the selloff will probably be minor. This means that it will more likely lead to a trading range than a bear trend. An obvious target for the bears is the April triangle. That means a 100 – 150 point pullback.<p>Since the selloff will probably simply be a leg in a trading range, it will probably last 2 – 3 months. The bulls will then probably buy again. However, after a 10 bar selloff, the bears will look to sell a rally back up to around the prior high, hoping for a major trend reversal.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Trump’s healthcare and tax reform not obstacles to new high</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/07/d-2.png\"><img loading=\"lazy\" src=\"2017-7-15-2.png\" alt=\"Daily Emini chart is in wedge rally at all-time high.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart broke strongly above a 3 week bull channel this week. It also broke to a new all-time high.<p>The daily S&amp;P500 Emini futures candlestick chart gapped above a 3 week bear channel this week. In addition, the follow-through buying has been good enough to make at least a small 2nd leg up likely. As a result, the bulls will probably buy the 1st reversal down. For example, if the Emini sells off for a couple of days next week into Wednesday’s gap, the bulls will probably buy the selloff.<p>The bears will see any reversal down from around the June all-time high as a major trend reversal. However, the 3 day bull breakout was strong and the context is good for the bulls. Consequently, most bears will want at least a micro double top and a strong sell signal bar before they will be willing to sell for a swing trade.<h4>5 month bull leg in trading range</h4><p>The daily chart has rallied in a bull channel from the March low. This rally follows a pullback from a very strong rally in February. This is a Spike and Channel bull trend. February is the spike, or breakout. The rally from the March low is the channel.<p>From the Market Cycle, traders know that a breakout leads to a channel, which is a weaker trend. The channel has a bear breakout 75% of the time. It then evolves into a big trading range. The bottom of the range is usually around the bottom of the channel. This is the March low around 2320.<p>Furthermore, the selloff to that low is a bear leg in a trading range. Once a market is near a likely bottom of its range, bears take profits and bulls buy again. Both are buying low and selling high. As a result, the market usually rallies from the bottom of the trading range. This is usually around the bottom of the bull channel.<h4>Trading ranges contain reasonable buy and sell signals</h4><p>Once a channel evolves into a trading range, both the bulls and bears have setups for swing trades. The bulls and bears are balanced, and each has logical reasons to take swing trades. The bulls usually have a double bottom or triangle bull flag.<p>The bears, however, usually have a major trend reversal top. This is very different from the current attempt at a top, which would be minor. A top in a tight bull channel usually leads to a trading range. It is therefore minor. A top in a trading range can be major, and lead to an opposite trend, and not just a pullback. If the Emini goes sideways to down for a couple of months, it will form a trading range. The bears will therefore look to sell a rally up to around the old high, hoping for a major trend reversal.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-7-15"
    }
  ],
  "22": [
    {
      "data": [
        "<article class=\"post-68902 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Trump firing special prosecutor is possible catalyst for climactic reversal Emini weekend update: July 22, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Trump firing special prosecutor is possible catalyst for climactic reversal<br>Emini weekend update: July 22, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-07-22T00:30:51-07:00\">July 22, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Parabolic wedge buy climax</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/07/m-6.png\"><img loading=\"lazy\" src=\"2017-7-22.png\" alt=\"Emini parabolic wedge top despite trump firing mueller special counsel\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has 4 consecutive bull trend bars in a tight 18 month bull channel. Yet, this is the 3rd leg up. Therefore, this is a parabolic wedge rally. However, there is no reversal yet.<p>The monthly S&amp;P500 Emini futures candlestick chart is in a strong 7 year bull trend. In addition, it has been especially strong for 18 months. Because this 18 month rally is in a tight channel and has 3 legs, it is a parabolic wedge buy climax.<h4>The bears need a trend reversal</h4><p>However, the bears do not have a reversal yet. If this month reverses down in the final week and closes below the June low, July would be an outside down month. Since there is a parabolic wedge rally, this would increase the chances of a reversal down for several months.<p>If July closes near its high, but August is a big bear month, that would be a 2 bar reversal. Hence, that, too, would be good for the bears.<h4>Strong bull trend</h4><p>There is no sign yet that either of these will occur. Consequently, the bulls will keep buying until they see a sign that the bears are strong. The odds favor at least slightly higher prices. The 2500 Big Round Number is a magnet. There are also measured move targets a little higher, and just below 2600.<p>Finally, because the bull channel is tight, it tells traders that the bulls are buying even tiny pullbacks. Consequently, if there is a reversal down, the bulls will probably buy a 1 – 3 bar (month) pullback.<p>Since traders know that there are buyers below, they are willing to buy now at the high. This is because they are confident that any selloff will be brief and the Emini will soon be back to their entry price. Hence, they believe that there is little risk of a loss. If instead the Emini does not pull back, they make money.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Extreme buy climax</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/07/w-3.png\"><img loading=\"lazy\" src=\"2017-7-22-1.png\" alt=\"emini unusual buy climax in bull trend\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart is in a strong bull trend. However, it has never been this far above the weekly moving average for 36 weeks in the 18 year history of the Emini. Hence, this is an extreme buy climax. Last week was a big bull bar late in a bull trend. It therefore is more likely to be a climactic temporary end of the move than the start of a stronger leg up.<p>The weekly S&amp;P500 Emini futures candlestick chart is the most overbought that it has ever been in its 18 year history. While it held above its weekly moving average for 50 weeks in 2003, it got very close to the moving average twice in the middle of that stretch. The current rally has not gotten close even once. Hence, the buying is more climactic.<p>However, there is no top yet. In addition, climaxes can go much farther than what seems reasonable. Yet, the risk of a reversal down anytime soon is high.<h4>How big would a stock market correction be?</h4><br>This extreme buy climax therefore increases the odds of a pullback. When there is a reversal from a buy climax, the typical minimum reversal is TBTL Ten Bars, Two Legs sideways to down. Because the bull trend is in a tight bull channel, the odds are against a much bigger pullback. An obvious target is the April trading range, around 2350.<p>Ten bars is 10 weeks, which means 2 – 3 months. At that point, if the reversal down did not have a lot of momentum, the bulls will buy again. The odds are that the rally would test the prior high.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Parabolic wedge buy climax</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/07/d-3.png\"><img loading=\"lazy\" src=\"2017-7-22-2.png\" alt=\"emini nested wedge with parabolic wedge rally.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart has had 3 pushes up in a tight bull channel. This is therefore a parabolic wedge buy climax. The bears so far only have a one bar reversal. Friday is a buy signal bar and therefor the odds favor at least one more new high.<p>The daily S&amp;P500 Emini futures candlestick chart is at the top of a 5 month bull channel. In addition, it has had at least 3 legs up in the channel. Hence, it is a type of wedge top. Furthermore, the 2 week tight bull channel has had 3 legs up. This is therefore a parabolic wedge rally.<p>Friday is a strong buy signal bar in a bull trend. The odds are that the Emini will trade above Friday’s high early next week and trigger the buy signal. Consequently, there will probably be at least one more new high. However, if there is then a reversal down after a 1 – 2 bar new high, that would be a micro double top.<p>The parabolic wedge top would still be valid. That reversal would therefore be more likely to lead to at least a minor reversal down to test Wednesday’s buy climax low. In addition, that would be a test of the gap.<h4>Possible island top</h4><p>Whenever there is a gap up late in a trend, especially in a buy climax, there is an increased risk of that gap being an exhaustion gap. If there is a strong reversal down, that gap might represent the end of the bull trend. Furthermore, if there is a gap down next week and it stays open by the close of the day, that would create an island top with Wednesday’s gap up.<p>While most island tops and bottoms (and all types of reversals) are minor, some can lead to a major reversal. Since the weekly chart is extremely overbought and there are parabolic wedge tops on both the monthly and daily charts, there is an increased risk of a 100 – 150 point correction at any time. The bears need a big bear bar closing on its low and then a follow-through bear bar, or a series of 3 or more smaller bear bars, before traders will believe that the bears have a chance of a correction.<h4>Nested parabolic wedge tops</h4><p>By Friday trading below Thursday’s low, the bears triggered their sell signal. However, parabolic wedge tops rarely reverse into strong bear trends. They instead usually pull back and form a bull flag. Yet, if the bull flag grows to 10 or more bars, then the bears have a 40% chance of a bear breakout and a swing down.<p>This is exactly the same process that traders see on the monthly chart. Hence, this is a nested parabolic wedge top. Nested patterns have a slightly higher probability of being successful. Yet, until there is a reversal, the odds still favor higher prices.<p>When the bears finally get their reversal, the selloff will probably be about 5%. While that would be a bear trend on the daily chart, it would be a bull flag on the monthly chart. In addition, it would be either a bull flag or a trading range on the weekly chart, not a bear trend.<h4>FOMC meeting as an Emini catalyst</h4><p>The Fed will announce its interest rate decision at 11 a.m. at the end of its FOMC meeting. Before a couple of years ago, FOMC announcements usually resulted in big moves. Hence, it was a strong catalyst. Lately, the moves have been small, and there has been a lot of trading range price action. This is therefore what is likely this time.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-7-22"
    }
  ],
  "29": [
    {
      "data": [
        "<article class=\"post-69107 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Trump healthcare failure is catalyst in buy climax, but no top yet Emini weekend update: July 29, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Trump healthcare failure is catalyst in buy climax, but no top yet<br>Emini weekend update: July 29, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-07-29T00:30:39-07:00\">July 29, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Strong bull trend, but parabolic wedge buy climax</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/07/m-7.png\"><img loading=\"lazy\" src=\"2017-7-29.png\" alt=\"Emini in strong bull trend, despite Trump's failure on healthcare.\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart had its 3rd consecutive bull trend bar after the April High 1 buy signal bar. However, the 18 month rally is in a tight bull channel and has had 3 legs up. This is therefore a parabolic wedge.<p>The monthly S&amp;P500 Emini futures candlestick chart has been in a strong bull trend for 8 years. In addition, it has been especially strong over the past 18 months. Furthermore, it has been extremely strong for 4 months. Whenever a bull trend becomes unusually strong late in the trend, the breakout is more likely an exhaustion move than the start of a new, stronger leg up.<p>That is the case here. Yet, buy climaxes can last far longer than what seems reasonable. The bears have neither a top nor a reversal down. Hence, the odds still favor higher prices. But, only experienced bulls should buy here because the risk of a 3 month pullback is now high.<h4>Minor reversal likely</h4><p>Since the 18 month bull channel is tight, the odds are that the 1st reversal down will be minor. Hence, the bulls will probably buy it within about 3 bars. Consequently, the odds are against a trend reversal without the bears 1st getting at least a micro double top. That will require both a small selloff and a test back up. Since this is a monthly chart, the downside risk is small for at least several months.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Extreme buy climax</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/07/w-4.png\"><img loading=\"lazy\" src=\"2017-7-29-1.png\" alt=\"Emini extreme buy climax so 5 to 10% correction likely before end of year.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart has not come close to its 20 week exponential moving average for 37 weeks. This is both a strong bull trend and an extreme buy climax.<p>The weekly S&amp;P500 Emini futures candlestick chart has never been this overbought in its 18 year history. I say that based on how long it’s been far above its moving average. While there is no reversal down yet, this is a dangerous time and price to buy.<p>For several months, the odds favored a pullback to below the weekly moving average, which meant a 100 – 150 point pullback. However, as a buy climax becomes more extreme, the probability of a deeper correction increases. Consequently, the risk of a 200 point or 10% correction by the end of the year is increasing.<p>This week had a doji body, closing around the midpoint. It therefore is a signal bar for the bears next week. Yet, if next week ends up as a bull bar, it would erase the bearish potential. The bears therefore need a strong entry bar next week to convince traders that the correction has begun. Without it, the odds still favor sideways to up.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Parabolic wedge top trying to reverse down</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/07/d-4.png\"><img loading=\"lazy\" src=\"2017-7-29-2.png\" alt=\"The Emini is in a tight trading range below 2500 big round number.\"></a><p class=\"caption\">Friday is a bull inside bar in a bull trend. It is therefore a buy signal bar for Monday. However, the Emini is in an 8 bar tight trading range. Therefore the odds favor more sideways trading for at least several days, instead of a successful bull breakout.<p>The daily S&amp;P500 Emini futures candlestick chart is pulling back from a parabolic wedge rally. The odds are that it will continue mostly sideways this week. It might stay sideways for a month, like it did 4 other times this year (March, April, May, and June).<p>Since Friday was a bull inside bar, it is a buy signal bar for next week. Yet, because of the 8 bar tight trading range, the odds are that any move up or down next week will probably last only a few days.<p>Because the weekly and monthly charts also have buy climaxes, the odds of a 2 – 3 month correction are high before the trend continues much higher. The issue is when it will begin. Until there is a top and a reversal, the Emini is likely to continue sideways to up. Since most reversals fail, the probability is that this one will as well. Yet, the odds are getting better for the bears.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-7-29"
    }
  ]
}