{
  "4": [
    {
      "data": [
        "<article class=\"post-63663 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini island top and island bottom bull flag Emini weekend update: February 4, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini island top and island bottom bull flag<br>Emini weekend update: February 4, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-02-04T00:30:14-08:00\">February 4, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Bull breakout is losing momentum</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/02/m-1.png\"><img loading=\"lazy\" src=\"2017-2-4.png\" alt=\"monthly emini in bull trend, but daily has island bottom and island top\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has had 3 consecutive bull trend bars since the Trump rally began. Yet, the bodies are shrinking. Therefore, the rally is losing momentum. While there are still measured move targets between 2340 and 2375, there is still a gap above the August high.<p>The monthly S&amp;P500 Emini futures candlestick chart is in a bull trend. When a gap forms late in a bull trend, it usually closes before the rally gets too far. Since the odds are that those targets above are too far, the Emini will probably test down about 100 points in the next couple of months. While there is no credible top yet, traders will be quick to sell.<p>The 2 year trading range below is a magnet (hence, a potential Final Bull Flag). A reversal down will probably get there within a few bars (months). Because this 3 month breakout is strong and there are several targets above, the odds are that the reversal will create a bull flag. Hence, a bear trend probably will need at least a micro double top. That would take at least 2 – 3 more months to form. Therefore the downside risk over the next couple of months is about 5%, which would be a test of the August high.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Weak bull channel</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/02/w.png\"><img loading=\"lazy\" src=\"2017-2-4-1.png\" alt=\"weekly emini candlestick chart has exhaustion gap and island bottom\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart has had 5 consecutive bull trend bars. Yet, three were dojis, and all overlap one another. While the Emini is moving up, it is going up slowly.<p>The weekly S&amp;P500 Emini futures candlestick chart had a big bull breakout in December. It therefore made follow-through buying likely. Since the follow-through has been basically a tight trading range that is sloped up slightly, the buying is weak. Yet, there is no credible top. Furthermore, this week formed an ioi, and it had a bull body. While an ioi late in a trend is a breakout mode pattern, the probability for the bears is less because of this week’s bull close. Therefore, if the Emini triggers the sell next week by falling below this week’s low, the reversal will probably be minor. The bears need to do more before traders believe that they have taken control.<p>The ioi is also a small bull flag. Since the past 8 weeks have been mostly in a tight range, the odds of a strong bull breakout are small. Yet, the odds still favor at least a little more up until the bears either create s credible top or a big bear trend bar.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Emini island top and island bottom bull flag</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/02/d.png\"><img loading=\"lazy\" src=\"2017-2-4-2.png\" alt=\"emini island bottom after island top\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart gapped up Friday and therefore formed a 4 day island bottom. Until the Emini breaks above last week’s island top, some bears will continue to hold short.<p>The daily S&amp;P500 Emini futures candlestick chart has both an island top and an island bottom. Hence it is in breakout mode. Because the bulls keep buying pullbacks to the moving average, the odds favor a bull breakout.<p>Yet, as long as it does not rally above the island top, some bears will continue to bet that the 5% correction has begun. Hence, the bulls need a new high. However, the Emini has been in a tight trading range for 2 months. Therefore, bears will probably sell the new high, betting on a failed breakout. In addition, bulls will probably exit with a small profit.<p>This is because they correctly believe that the Emini will have a difficult time escaping the gravitational pull of the 2 month range. For 2 months, bulls and bears agreed that the Emini belonged around 2280. If it rallies above 2280, many bulls will take a quick profit and bears will scale into short. Therefore, the odds are that the bull breakout would fail within a few weeks.<h3>Exhaustion gap is more likely than measuring gap</h3><p>The Emini never tested the breakout point at the August trading range high. Since the Emini is late in a bull trend, the odds are that the gap between the low of 6 weeks ago and the August high is an exhaustion gap, not a measuring gap. Therefore, it is more likely that the Emini will fall about 100 points to close the gap than rally for a measured move up.<h3>Risk of cascading stop running</h3><p>The current tight trading range is similar to the one in July and August. There is therefore a risk of a huge bear trend day within the next several weeks. The Emini is at the top of a bull trend. In addition, it is in a tight channel with many small higher lows. Therefore, a small selloff that goes below the closest higher low will make some bulls give up. As the Emini falls below other higher lows, more bulls give up. As a result, most of the buyers over the past 2 months will quickly be holding losing positions. If enough bulls suddenly decide that the Emini will test the August high, a sudden exit could create a big bear trend bar. September 9 is an example of a similar situation.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-2-4"
    }
  ],
  "11": [
    {
      "data": [
        "<article class=\"post-63990 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini wedge top leading to 5% 130 point stock market correctionEmini weekend update: February 11, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini wedge top leading to 5% 130 point stock market correction<br>Emini weekend update: February 11, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-02-11T00:30:59-08:00\">February 11, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Bull trend losing momentum</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/02/m-2.png\"><img loading=\"lazy\" src=\"2017-2-11.png\" alt=\"emini monthly chart in bull trend but losing momentum so buy climax above 2300 and 5% correction soon\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart currently has 4 consecutive bull trend bars. Yet, the bodies are shrinking and it is at the top of a protracted tight bull channel. While it might reach the measured move targets before pulling back, the odds favor a pullback first.<p>The monthly S&amp;P500 Emini futures candlestick chart has been in a bull trend for 8 years. Because it is breaking above a 2 year trading range late in a bull trend, there is a risk of a Final Flag reversal. Yet, there is no credible top.<p>Since the 12 month channel is tight, the odds are that bulls will buy the 1st reversal down. Hence the downside risk is not big over the next few months. There is support at the August bull flag high. That is therefore also a magnet. Hence, the odds are that the Emini will pullback below that high within the next few months.<h3>Low 4 consecutive tops this spring?</h3><p>Since the 1st bear break below a tight bull channel usually leads to a bull flag, the odds are that traders will buy the pullback for at least one more leg up. Because there are measured move targets between 2340 and 2375, the odds are that there will not be a big correction before the Emini reaches those magnets. If it turns down at that point, it would be a Low 4 top. This would therefore be consecutive tops (low 2, then a breakout, and another Low 2). Since consecutive tops have a higher probability of reversing down, the odds of a pullback to 1800 would go up if the monthly chart creates a Low 4.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>6th consecutive bull trend bar</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/02/w-1.png\"><img loading=\"lazy\" src=\"2017-2-11-1.png\" alt=\"the weekly emini chart broke strongly above 2300, but the odds still favor a 5% correction down to 2150.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart had its 6th consecutive bull trend bar this week. Because that is unusual, the odds favor a bear trend bar within the next week or two. While there is no top yet, there is a gap between this week’s low and the January 6 high. When a rally lacks consecutive big bull trend bars, gaps usually close. Hence, the Emini will probably fall below that high within the next few weeks.<p>The weekly S&amp;P500 Emini futures candlestick chart is in a bull trend. Six consecutive bull trend bars is a sign of strong buying. Therefore, bulls will probably buy the 1st reversal down. Hence, they will probably buy around the support of the December 30 higher low.<p>Since there is also a gap above the August trading range high, the odds are that the Emini will fall below that high within a few months. When a bull trend has lasted 20 or more bars like this, gaps usually close before the Emini reaches its final targets. Hence, bulls will probably buy a 130 point pullback.<h3>Close of 2016 not tested</h3><p>In addition to testing the August trading range high, that would also test the close of last year. Whenever the Emini rallies from the start of the year, it usually pulls back to test the close of last year. Hence, that is another magnet that is pulling on the current rally.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Emini wedge top creating 5% 130 point stock market correction</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/02/d2.png\"><img loading=\"lazy\" src=\"2017-2-11-2.png\" alt=\"the daily emini has a wedge top above the 2300 big round number and it should correct 5% down to 2150 in March.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart had its 3rd leg up after the strong early December breakout. Hence, it has now completed a Spike and Channel pattern.<p>The daily S&amp;P500 Emini futures candlestick chart has a rally that is a wedge top. It broke slightly above the bull channel on Thursday. There is only a 25% chance that Thursday’s breakout will continue and begin a new market cycle. That would be a breakout, a channel, and then a trading range. Hence, there is a 75% chance that the breakout will fail within about 5 days. Once it reverses, the target is the bottom of the channel. Hence, around 2280.<h3>Wedge top</h3><p>A wedge top’s minimum goal it TBTL Ten Bars Two Legs sideways to down. It usually tests the bottom of the channel. Therefore, it probably will test the December 20 pullback low of 2228.<h3>5% correction to August high</h3><p>Finally, there is still a gap above the August trading range high. If the Emini falls for a measured move down based on the height of the wedge, it would close the gap.While there is a 60% chance of a drop to the December 30 low within the next 2 months, there is better than a 50% chance that the selloff will continue down to just below the August high as well. That would be about a 5% correction of at least 130 points.<h3>The bull case</h3><p>While the odds favor a correction before the Emini reaches its target of 2375, there is still a 40% chance that it will continue up without a significant pullback. About 25% of the breakouts above bull channels are strong and have at least 2 legs up. The bulls will need one or more big bull trend bars over the next few days to increase the odds of a sustained rally.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-2-11"
    }
  ],
  "18": [
    {
      "data": [
        "<article class=\"post-64187 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Trump rally buy climax near measured move targets Emini weekend update: February 18, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Trump rally buy climax near measured move targets<br>Emini weekend update: February 18, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-02-18T00:30:11-08:00\">February 18, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Trump rally buy climax near measured move targets</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/02/m-5.png\"><img loading=\"lazy\" src=\"2017-2-18.png\" alt=\"Trump rally buy climax near measured move targets on monthly chart\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has a bigger bull bar this month. It is therefore accelerating up in a buy climax.<p>The monthly S&amp;P500 Emini futures candlestick chart is in a bull trend. Furthermore, it broke slightly above a measured move up from the 2007 to 2009 selloff. Since this 4 month rally has 4 consecutive bull trend bars closing above their midpoints, it is strong. Therefore, the bulls will probably buy the 1st pullback. Hence, the bears will probably need at least a micro double top before they can get a reversal.<p>Furthermore, the 1st reversal will probably become a bull flag. As a result, the best the bears will probably get over the next couple of months is a small trading range.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>The weekly bull trend is becoming a parabolic buy climax</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/02/w-3.png\"><img loading=\"lazy\" src=\"2017-2-18-1.png\" alt=\"Emini weekly chart in buy climax in trump rally with exhaustion gap\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart’s rally accelerated this week. This week gapped above last week’s high.<p>The weekly S&amp;P500 Emini futures candlestick chart gapped up this week. While a gap up is a sign of strong buying, when it forms late in bull trend, it is more likely an exhaustion gap. Therefore, the Emini will probably close the gap within a month or two.<h3>Stock market buy climax</h3><p>A buy climax does not mean the start of a bear trend. Instead, it means that the rally has gone so high that many bulls will take profits. Yet, they correctly believe that the trend is still up. Hence, they will look to buy again at support, usually within 10 bars. Therefore, even if the Emini sells off 5% down to the December 30 low of 2228, the bulls will probably buy the selloff.<h3>Measured move targets around 2375</h3><p>Because there are several measured move targets around 2375, this rally might be a buy vacuum test of that resistance. Hence, bulls might take profits and bears might sell around 2375. Yet, when a rally has 7 consecutive bull trend bars like this, the odds are that the bulls will buy the 1st reversal down.<p>If they have been willing to buy above the high and low of the prior week, they will probably be eager to buy below last week’s low. Therefore, they will probably buy the 1st selloff. Furthermore, the bears will probably need at least a micro double top before they can create more than a one week pullback. Hence, the downside risk over the next couple of weeks is small.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Parabolic buy climax near resistance</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/02/d-2.png\"><img loading=\"lazy\" src=\"2017-2-18-2.png\" alt=\"ii bull flag in Emini trump rally near resistance of measured move targets\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart rallied strongly this week. Because Thursday and Friday were consecutive inside days, they formed an ii bull flag.<p>The daily S&amp;P500 Emini futures candlestick chart is in a strong bull breakout. After 6 strong bull bars, it went sideways on Thursday and Friday and formed an ii bull flag. While the bears see those days as a sell signal for a failed breakout, there are more likely buyers below. Yet, the buying is unsustainable. Hence, it is a buy climax. Therefore, the Emini probably began a trading range on Thursday.<h3>Trading range next week</h3><p>While this rally could continue up to the measured move targets around 2375, it probably will not go much higher. Therefore, although Thursday and Friday formed a small ii bull flag, the bull breakout will probably not get much above 2375. Furthermore, it probably will not last more than a few days. Hence, next week will probably be the start of a trading range that could last for several weeks.<h3>5% correction down to close of 2016</h3><p>As strong as the Trump rally has been, it is near measured move targets. For example, the Emini was in a trading range for 2 years on the monthly chart. A trading range late in a bull trend usually becomes the final bull flag. While there are different ways to draw the measured move projections, they are between 2375 and 2425.25. Hence, there is resistance just above.<p>Furthermore, a breakout from a final bull flag often reverses around a measured move up. In addition, the reversal down usually reaches the bottom of the flag. Therefore, the odds are that the Emini will test back down to 1800. Since this is a monthly chart and the reversal will probably last at least 10 bars, that would be a year. Because there is no top, and the top might not form for more than a year, the Emini might not get down to 1800 for 2 – 3 years. In the meantime, it could go much higher. More likely, it will probably form a top above 2400 before correcting down to 1800.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-2-18"
    }
  ],
  "25": [
    {
      "data": [
        "<article class=\"post-64440 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Trump rally reversing into 5% 100 point March correctionEmini weekend update: February 25, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Trump rally reversing into 5% 100 point March correction<br>Emini weekend update: February 25, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-02-25T00:30:12-08:00\">February 25, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Trump rally reversing into 5% 100 point March correction</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/02/m-6.png\"><img loading=\"lazy\" src=\"2017-2-25.png\" alt=\"Emini monthly chart of trump rally in buy climax near measured move targets and big round number of 2400\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has a big bull trend bar so far in February. In addition, the rally is testing measured move targets.<p>The monthly S&amp;P500 Emini futures candlestick chart has a big bull trend bar so far this month. The rally is close to the 2400 Big Round Number. While the rally has already reached several measured move targets, there is one target left at 2414.75. The November selloff barely overlapped the August high. It therefore created a negative gap. If the October 2014 low is the bottom of the trading range, then 2414.75 is the target. Yet, if more computers use the January low, then the target is 2384.25.<p>In either case, the odds are that this strong rally will probably not go much higher before the stock market pulls back. While the bottom of the buy climax at the November 2073.75 low is the ultimate target within a year or two, the current rally is strong. Therefore, bulls will probably buy the 1st reversal. Hence, the bears will likely need at least a micro double top before they will reach 2073.75.<p>Since the bulls want to buy at support, traders need to look for support. One good choice is the close of 2016, which is 2236.25. A correction to that level would be about 140 points and 5%. The odds are that the bears will reach that target within a few months.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Gap up, but probable exhaustion gap and possible island top</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/02/w-4.png\"><img loading=\"lazy\" src=\"2017-2-25-1.png\" alt=\"Emini weekly chart in buy climax with probable exhaustion gaps and possible island top\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart gapped up again for the 2nd consecutive week. This is unusual and therefore unsustainable and climactic. The gap will therefore probably close and become an exhaustion gap. If next week gaps down, this week will be an island top.<p>The weekly S&amp;P500 Emini futures candlestick chart gapped up for the 2nd week in a row. Because that is unusual, it is more likely a buy climax than the start of a stronger swing up. Hence, the Emini will probably close this week’s gap within the next few weeks. It would therefore become an exhaustion gap rather than a measuring gap.<p>Furthermore, if Monday gaps down, then this week would be a 1 bar island top. Most island tops lead to minor reversals. However, many major tops begin with gaps, such as a gap that forms an island top.<h3>Far above the average price</h3><p>The weekly chart is far above its average price (the moving average). That makes bulls hesitant to buy. They prefer to buy closer to the average price. Hence the rally will probably stall here. Furthermore, the Emini will probably go sideways to down until it gets closer to the moving average.<h3>Spike and Channel bull trend</h3><p>The December 9 breakout was a spike that led to a parabolic wedge bull channel. Since a spike and channel pattern usually leads to a trading range, that is what is likely over the next several weeks. Typically, the bottom of the trading range is around the bottom of the wedge bull channel. That is the December 30 low, which was the 1st pullback after the breakout. Furthermore, it is the close of 2016.<h3>Test of the 2016 close</h3><p>When a year rallies strongly from the start, it usually pulls back to test last year’s close. In addition, it usually dips below that close. As a result, the news will try to create panic by proclaiming that the correction gave back all of the year’s gains.<p>Therefore, the Emini will probably test 2236.25 at some point this year. Since the Emini is in a buy climax in a cluster of measured move targets, this is a likely price level for the correction to begin. If this week was the top of the rally, then the correction might be about 140 points, or about 5%.<h3>One more measured move target</h3><p>While a 5% correction might have begun, there is still one more measured move target above on the weekly chart. The December 2 pullback tested the August high and reversed up. That therefore created a possible measuring gap. Many bulls will use the July 1 bottom of the bull breakout to calculate the target. Hence, there is a magnet at 2389.75.<p>Since bulls will probably buy a test of last year’s close, the Emini might not reach the final target until after the correction.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Buy climax and possible island top at measured move targets</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/02/d-3.png\"><img loading=\"lazy\" src=\"2017-2-25-2.png\" alt=\"daily emini chart is far above its average price and therefore will probably correct sideways\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart probably entered a trading range with last week’s ii pattern. That ii is therefore probably the final bull flag. A gap down next week will create an island top. Because the Emini is so far above its average price (the moving average), the odds are against significantly higher prices near term.<p>The daily S&amp;P500 Emini futures candlestick chart went sideways this week after an ii 2 weeks ago. When an ii forms late in a bull trend, it often becomes the final bull flag. Hence, the bull breakout usually only lasts a few bar. Most final flags lead to trading ranges, and not bear trends.<p>Furthermore, since the February rally had 9 bull bars in 10 days, it was strong. Strong rallies usually do not reverse into bear trends without first transitioning into trading ranges. Therefore, the best the bears will probably get over the next week is more trading range price action. The pullback from an ii usually tests the bottom of the ii. Hence, the bottom of the developing trading range will probably be around 2336.<h3>Strong bull trend</h3><p>While the Emini has been very strong, the daily chart, like the weekly chart, is far above its moving average. As a result, many bulls do not want to buy too high. Hence, there is a relative lack of buyers. Therefore, the rally usually stalls until the Emini gets closer to the average price. As a result, the Emini will probably go sideways for at least another week. In addition, with the FOMC meeting 3 weeks away, the Emini might enter a tight trading range until the March 15 Fed announcement.<h3>March 15 FOMC Fed interest rate hike?</h3><p>Will the Fed raise interest rates in 3 weeks at its FOMC meeting? They have been talking about raising rates for a year. Furthermore, the stock market is very strong. It is therefore likely to withstand any surprise fairly well. As a result, traders expect a rate hike in March or soon afterwards.<h3>News reports after a catalyst</h3><p>Will a March rate hike be the catalyst for the 5% correction? It could be, but the correction can begin at anytime because the technical factors indicate that the correction is likely soon. This is true whether or not the Fed raises rates. In fact, if the Fed does not raise rates and the correction then begins, the news will report that the correction was because of the lack of a rate hike. They would explain that the Fed thought that the economy was weak, and traders concluded that it was therefore overpriced!<p>This double speak was very common 20 – 30 years ago. Whenever the market reacted to a news event, tv said the move was due to the news. If the news was the same next month, but the market went the opposite way, tv again said the move was due to the news, but they gave an opposite explanation. Furthermore, they did it with a straight face, oblivious to how stupid they sounded.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-2-25"
    }
  ]
}