{
  "7": [
    {
      "data": [
        "<article class=\"post-62939 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Stock market January Effect and Dow 20,000 Emini weekend update: January 7, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Stock market January Effect and Dow 20,000<br>Emini weekend update: January 7, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-01-07T00:30:32-08:00\">January 7, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Stock market January Effect and Dow 20,000</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/01/m.png\"><img loading=\"lazy\" src=\"2017-1-7.png\" alt=\"monthly emini buy climax at dow 20,000\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart broke to a new all-time high on Friday. Hence, this is more follow-through buying after 2 bull bars.<p>The monthly S&amp;P500 Emini futures candlestick chart this month is a bull bar so far. Yet, last month had a tail on top and a smaller body. December was therefore not strong buying after the November rally. Yet, the bulls are still in control. In addition, the 1 year channel is tight. As a result, bulls will probably buy the 1st reversal down.<p>Hence, the bears will probably need at least a micro double top before they can create a swing down. Since that would take at least another month or two, the downside risk is small in January.<p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/01/w-1.png\"><img loading=\"lazy\" src=\"2017-1-7-1.png\" alt=\"weekly emini having strong bull breakout to new all-time high at dow 20,000\"></a><h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Breakout of bull flag</h2><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart broke above a 3 week bull flag. Yet, last week’s buy signal bar was a bear bar. It therefore reduces the probability of a strong rally from here.<p>The weekly S&amp;P500 Emini futures candlestick chart broke to a new all-time high on Friday. In addition, it was the entry bar for a breakout above a 3 week tight trading range. Hence, it broke above a bull flag. Since the prior week was was the buy signal bar and it was a bear bar, the setup was weak. This therefore reduces the chances of a big breakout.<p>Yet, the 2 month bull trend is in a tight bull channel. Therefore, bulls will continue to buy every reversal down. The bears probably will need at least a few weeks of sideways to down trading before they will be able to create a reversal. As a result, the near-term downside risk is small.<h3>Gap above August trading range will get filled</h3><p>There is a gap below the lows of the past several weeks and the August 2179.75 top of a 4 month trading range. Because gaps usually get filled when they form late in a trend, the odds are that this one will as well. Therefore, the odds are that the Emini will trade down about 100 points within the next couple of months.<p>Since there is no sign of a top and the bull channel is tight, the bears will probably first have to halt the rally for a few weeks. They then can try for at least a micro double top. While the reversal down can come without a top, that is less likely. Yet, if there is a strong reversal down in the next week or two, traders will begin to believe that the selloff will fall to the August high.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Breakout to a new all-time high</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/01/d.png\"><img loading=\"lazy\" src=\"2017-1-7-2.png\" alt=\"emini new all-time high, but possible major trend reversal\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart broke to a new all-time high on Friday. It sold off slightly at the end of teh day after the Dow repeatedly failed to get above 20,000<p>The daily S&amp;P500 Emini futures candlestick chart broke to a new all-time high on Friday. Yet, breakouts need follow-through buying. Therefore, Monday and Tuesday are important. The bulls will try to make one or both become a bull bar. Hence, that follow-through buying would increase the odds of higher prices.<h3>Higher high major trend reversal?</h3><p>Because bears always want the opposite, their minimum goal is to create a bear bar on Monday or Tuesday. Hence, traders would then think that Friday’s breakout might fail. That bear bar would then be a sell signal bar for a failed breakout and for a higher high major trend reversal.<p>Because 60% of strong major tops lead to trading ranges or trend resumption up, the bears know that they probably will not make money. Yet, the Trader’s Equation is still positive. This is because a swing down would lead to a reward at least twice as big as the risk. That good risk/reward is more than enough to offset the low probability.<p>Bears wanting higher probability will wait for a strong reversal down before selling. The trade-off is that their stop is then far. Hence, when a trader wants high probability, he has to accept worse risk/reward. That always is the case because there has to be a reason for an institution to take the opposite side of the trade. If you get good probability, he gets good risk/reward.<h2>Dow 20,000</h2><p>The Dow got to within 4 cents of 20,000 on Friday. Every big round number is a psychological barrier. It makes the news and therefore everyone is aware of it. How strong is the resistance? Well, 8 years ago, the Dow was at 7,000. All of the big round numbers above it were resistance. This therefore includes 10,000, which is a very big round number, like 20,000. Yet, the Dow broke strongly above every one of them. Hence, the numbers belong more in cocktail party conversation than in a serious discussion about meaningful resistance.<h2>January effect and other seasonal tendencies</h2><p>There is a belief that January tends to rally because of people who receive year-end bonuses use the money to buy stock. Whenever something is obvious, it is priced in before the event. Therefore, the market is already where it needs to be to accommodate that buying before January begins. As a result, the January effect is fiction for traders because it cannot make them money.<h3>My notes about January and end of the year statistics</h3><p>The year is up 68% of the time and down 32% since 1927.<br>In any 5 day period, there is a 56% chance of the market being up.<br>The last 5 days of the year have a 77% chance of being up, and 10 times more than the average 5 day period.<br>If the 1st 5 days of January are up, January is up 76% of the time. However, all months are up 65% of the time, so this is only a small improvement.<br>When the first 5 days are negative, January is down 60% of the time, instead of only 35%.<br>If January is up, the year is up 82% of the time, and the average gain from February to December is 8.5%.<br>When January is down, the average gain from February to December is only 1.7%, and the year has a 58% chance of being down, instead of the usual 33%.<br>If January is down 6%, then the entire year is down 5%. As a result, the rest of year is up only 1%, so the gain is small.<br>In January over the past 90 years, small cap stocks are up 4% and large caps are up only 1.5%. so it is better to focus on small caps.<br>When the market is up 20% or more, many managers are behind and look to catch up by buying momentum stocks, like FB, TSLA. This can cause them to rally, even if the market is falling in December.<p>If the year is a small pullback bull, then most traders will hold in the final days of December to avoid taxes on their gains. The result is that many stocks will stay up.<br>The 4th quarter is up 2.6% on average for the past 100 years, and it is up 72% of the time. If the S&amp;P is negative year to date at the end of the 3rd quarter, it is down 0.7% in the 4th quarter, and it is down in the 4th quarter 47% of the time. Even though the average is down, the median is up 1.8%, which means the down years are bigger than the up years.<h3>What does this mean?</h3><p>For a trader, this is meaningless because you cannot make money from it. Obviously, if the 1st month is up, the odds are greater that the year will be up. This is because the bears now only have 11 months to take control. In addition, they now have to overcome one month that is already up (the bulls have a head start).<p>Furthermore, the difference between the most bullish month of the year and the average gain in any month is less that 1%. Since that size move can happen in any one day, the only difference between a bullish month and a bearish month is usually just a day or two. The other 20 days or so, on average, are therefore the same. Hence, knowing that December tends to be up and September tends to be down does not help a day trader.<p>If day traders cannot make money from these ideas, why publish them? Because they are part of the trading culture. They are secret hand shakes that all traders know. Furthermore, they often come up in conversation. Therefore is someone asks you about them and you have a blank face, you would be embarrassed. Finally, it is fun to think about the big picture and subtle underlying forces behind the market.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-1-7"
    }
  ],
  "14": [
    {
      "data": [
        "<article class=\"post-63131 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Stock Market Zero Sum Game and Eternal Bull Market: Weekend update: January 14, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Stock Market Zero Sum Game and Eternal Bull Market: Weekend update: January 14, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-01-14T00:30:36-08:00\">January 14, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Stock Market Zero Sum Game and Eternal Bull Market?</h2><p>The Dow will break strongly above 20,000, even if it falls to 10,000 first! That is because the world creates more workers in an increasingly efficient world economy every day. As a result, the world’s wealth is steadily increasing. Since the stock market contains a big part of the world’s wealth, it, too, will steadily increase. Yet, there will always be shockingly big bear trends along the way. For example, the Dow lost 89% after it crashed in 1929, but is now 500 times above the crash low.<h3>500 year long bear market?</h3><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/01/Dow-m.png\"><img loading=\"lazy\" src=\"2017-1-14.png\" alt=\"Dow Jones Industrial Average in bull trend for 100 years, so no zero sum game. Stock Market Zero Sum Game and Eternal Bull Market is a fallacy\"></a><p class=\"caption\">This is a monthly chart of the Dow Jones Industrial Average over the past 97 years. Despite losing 89% after 1929, it has been in a bull trend since its inception.<p>The world has 7 billion people. But, within a few hundred years, the population will begin to decline. I don’t know if the maximum number will be 15 or 50 billion people, but only so many can fit comfortably on the planet. A luxury car might comfortably fit 4 people, but no one would enjoy the luxury with 15 packed in.<p>As poverty decreases and education increases, family size decreases. In addition, there are many other demographic forces. In many countries in Europe, the birth rate is already too low to maintain the population. As a result, if not for immigration, these countries would be shrinking. Furthermore, if they shrank enough, their economies would shrink as well. The countries would have fewer dollars. At the extreme, if there was no one left, the countries would have no money.<h3>Governments will limit birth rates</h3><p>Too many people will reduce everyone’s quality of life. The world will therefore have to make too many bad choices over food, water, energy, wild spaces, and every other resource. Hence, governments, including ours, will limit population.<p>If 500 years from now, the world’s population falls from 15 billion to 10 billion over the following 500 years, the loss in the world’s earnings will probably be greater than the increase in productivity. As a result, the bull market that has gone on for thousands of years will eventually turn into a bear market. In addition, it could last hundreds of years, instead of just 3, as it did after the 1929 Crash. That bear market will probably end up as part of a trading range or broad bull channel that could last forever.<h3>Big gains need both improved productivity and more workers</h3><p>At some point, the population will stabilize or enter a range. Once that happens, increases in productivity will increase the world’s wealth and the stock market again. Yet, without an increasing number of workers adding to the added wealth, the growth will never be as high as it has been. Neither you nor I will be around to know if I am right, but I believe I am.<h3>Zero Sum Game</h3><p>Sometimes someone says, “Al, if trading is a zero sum game, then half of all firms lose money and go out of business.” While that statement is true, the “if” is a flawed premise. Over the course of a few months, the size of the world’s economy can stay the same or even shrink. During those times, trading is a zero sum game. Hence, every dollar made by one firm is lost by another. Yet, over the course of years, the stock market goes higher. That means that the total dollars increase.<p>The world’s wealth has relentless increased since the beginning of civilization. It is directly correlated to the number of people on the planet. The more people working, the more goods and services. As a result, the world’s wealth increases.<h3>Gross Domestic Product (GDP)</h3><p>On the news, you always hear about GDP being 1 – 3% in the US. That is misleading. When the news says that the GDP is 1%, what they mean is that the<em>growth</em>in the Gross Domestic Product is 1%. During a recession, there is no growth. In fact, the economy shrinks, which means that the GDP is negative. Yet, there are far more up years than down. Therefore, the total wealth of the world steadily increases.<p>The pie is growing. Hence, it is not a zero sum game. The fight is not over a fixed number of dollars. It is over who is going to get the biggest share of the new dollars that constantly appear.<p>Because the bull market will continue for another several hundred years, we never have to worry about a zero sum game. As traders, we simply have to work on being the best that we can be, knowing that there is more than enough money for everyone.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-1-14"
    }
  ],
  "21": [
    {
      "data": [
        "<article class=\"post-63254 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"President Trump and January Effect stock market rally Emini weekend update: January 21, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">President Trump and January Effect stock market rally<br>Emini weekend update: January 21, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-01-21T00:30:48-08:00\">January 21, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Breakout is losing momentum</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/01/m-1.png\"><img loading=\"lazy\" src=\"2017-1-21.png\" alt=\"President Trump and January Effect stock market rally on monthly emini chart.\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has a small bull doji bar so far this month. December was also small and had a tail on top. Therefore, the 3 month breakout is losing momentum.<p>The monthly S&amp;P500 Emini futures candlestick chart is in a bull trend. Yet, the 12 month rally lacks consecutive big bull trend bars. It therefore looks like a bull leg in what will become a trading range. While there is no top yet, and the rally can continue indefinitely, this loss of momentum increases the chances for a pullback.<p>In addition, there is a gap below this month’s low and the top of the August trading range. When gaps form late in bull trends, they usually close. Hence, the odds of a big rally from here are small. While the Emini might reach a new high this month, the odds are that it would soon reverse down to close the gap. Since the August high is about 100 points below, the pullback will probably be about 5%. In addition, it probably will begin in February or March.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Weak bull flag after buy climax</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/01/w-2.png\"><img loading=\"lazy\" src=\"2017-1-21-1.png\" alt=\"Weekliy emini bull breakout in bull trend\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart formed consecutive inside bars over the past 2 weeks. In addition, both were dojis. Furthermore, they are part of a 6 bar tight trading range. Hence, the weekly chart is in breakout mode.<p>The weekly S&amp;P500 Emini futures candlestick chart has been in a 6 week tight trading range after a strong bull breakout. The bull breakout in December was a big bull trend bar. It was therefore a buy climax. When a buy climax comes late in a bull trend, it is more likely an exhaustion gap than a measuring gap. Hence, the odds favor a closure of the gap between this week’s low and the August high.<h3>Low 4 and Consecutive Tops?</h3><p>The rally that began in November was strong. Therefore, even if the Emini closes the gap above the August high, the odds still favor one more leg up. Hence, bulls will buy the selloff. Yet, if there is a pullback and then one more leg up, the bears will look for a Low 4 sell signal.<p>The 1st 2 tops were the June and August highs. The bulls then broke strongly up. If this 6 week tight trading range is a 3rd top, then one more new high would be a fourth. That would create a Low 4 sell setup.<p>It would also be consecutive complex tops. This means that there were two legs up to a top attempt in August. Instead, there was a bull breakout above the top. If that breakout gets 2 legs up and the Emini tries to top again, that would therefore be a 2nd complex top. Hence, there would be a pair of consecutive top attempts. Because each would have had 2 legs, each is complex. Consecutive complex tops have a 60% chance of leading to a couple of legs down.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>President Trump and January Effect stock market rally</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/01/d-1.png\"><img loading=\"lazy\" src=\"2017-1-21-2.png\" alt=\"Emini double top and bull flag\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart is in a tight trading range. There is a double top with the December 13 high. In addition, there is a double bottom bull flag with the January 12 low.<p>The daily S&amp;P500 Emini futures candlestick chart has a bull flag. Furthermore, only one day in the past 60 has closed below the daily moving average. Hence, the probability is slightly higher for the bulls, despite the neutrality of the tight trading range.<h3>Dow 20,000 Big Round Number and psychological barrier</h3><p>The Dow is within about 1% of 20,000. It is a psychological target. While there is no doubt that the Dow will get there, no one knows when. As long as the Dow is staying close, the odds are that the bulls will break above 20,000 soon. If it instead drops 5% to close the gap above the August high, it would then probably rally to above 20,000 within a few months.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-1-21"
    }
  ],
  "28": [
    {
      "data": [
        "<article class=\"post-63438 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Possible Island Top and 5% stock market correction Emini weekend update: January 28, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Possible Island Top and 5% stock market correction<br>Emini weekend update: January 28, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-01-28T00:30:24-08:00\">January 28, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Trump rally and January Effect continues</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/01/m-2.png\"><img loading=\"lazy\" src=\"2017-1-28.png\" alt=\"Monthly Emini chart in bull breakout and Trump rally\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has a bull body this month. This is the 3rd month in the breakout and there is no sign of a top yet.Yet the bodies are shrinking and therefore represent some loss of momentum.<p>The monthly S&amp;P500 Emini futures candlestick chart is continuing up. In addition, the Dow broke strongly over the big round 20,000 number, which is an important psychological market. The bears will probably need at least a micro double top before they can create a reversal. Since that would take 2 – 3 months, the odds favor more sideways to up trading. Furthermore, there are measured move targets on the monthly chart between 2340 and 2370. Hence, there are mangets pulling the Emini higher.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Breakout above bull flag</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/01/w-3.png\"><img loading=\"lazy\" src=\"2017-1-28-1.png\" alt=\"Weekly Emini chart has measured move targets above\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart had a big bull trend bar this week. It therefore had a strong breakout above a bull flag. Yet it needs follow-through buying next week, or traders will wonder if the breakout will fail.<p>The weekly S&amp;P500 Emini futures candlestick chart broke above a bull flag this week. Because the breakout bar was a big bull bar that closed near its high, the bulls are strong. Therefore, the Emini will probably continue at least a little higher over the next few weeks.<p>Since any breakout can fail, the bears will try to reverse the breakout next week. Because the breakout was strong, the bears only have a 40% chance of success. More likely, the best they will be able to get is a pullback. Hence, that would be a bull flag.<p>There are targets above and the Emini will probably continue higher.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Possible Island Top and 5% stock market correction</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/01/d-2.png\"><img loading=\"lazy\" src=\"2017-1-28-2.png\" alt=\"IF the Emini gaps down next week, it will form an island top\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart gapped up this week to a new all-time high. Yet, it has been sideways for days. If the Emini gaps down next week, that gap would create an island top. If it simply trades down and closes the gap, the gap becomes an exhaustion gap. More likely, it will be a bull flag and lead to higher prices.<p>The daily S&amp;P500 Emini futures candlestick chart had been in a tight trading range for 6 weeks before this week’s breakout. Since the 6 week tight trading range is late in the bull trend, it might be the final bull flag. Hence, a reversal down next week could be the start of a selloff down to test support.<p>Last year closed near its high, which is now support. In addition, this year rallied from the beginning. The odds are that the Emini will test last year’s close at some point this year. That would be a 50 point correction from the current level.<p>Furthermore, the Emini broke strongly above the August high. Because it has not been tested by a pullback, there is a gap above that high and below the current price. Since gaps late in bull trends usually close, the odds are that the Emini will trade down to the August high within the next couple of months. That would be about a 5% or 100 point correction.<h3>Possible island top</h3><p>Whenever the Emini gaps up to a new high, traders watch for a gap down at any point over the next several weeks. If they see it, the bars between the gap up and then the gap down create an island top. Hence, the odds of a reversal down would increase. Most island tops and bottoms do not lead to reversals. They therefore are like all tops and bottoms. Most reversals fail and lead to trading ranges, and not opposite trends. Yet, they increase the probability of a reversal.<p>Bears will watch for several things next week. They want either a gap down or a series of big bear trend bars. Furthermore, if there is a gap down, they then want several bear bars. Since weak follow-through selling is a sign of weak bears, if the bears fail to create big bear bars, the odds would favor a pullback instead of a trend reversal.<p>While there is a 60% chance of a 50 – 100 point pullback over the next couple of months, there is no top yet. Yet, the selloff will probably come before the monthly chart reaches its targets between 2340 – 2375.<p>If the bears get their test of the August high, bulls will probably buy the test. Hence, there would probably be a rally that would last at least several weeks. The odds still favor at test of the monthly 2340- 2375 target area this year, whether or not the Emini falls 100 points first.<h3>FOMC Meeting creates uncertainty</h3><p>There is an important FOMC meeting on Wednesday. It is important because the Fed began increasing interest rates at the last meeting. Traders want an idea of how often the Fed will raise rates this year. The consensus is 2 more times. Therefore, if the wording makes traders think more is likely, they will be less willing to buy stocks, and more interested in safer alternatives, like CDs.<p>The meeting creates uncertainty, which is a hallmark of a trading range. Hence, the Emini might stay sideways into the report. Yet, the odds are that there will be a big move after the report. The move can be up, down, or in both directions.<p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-1-28"
    }
  ]
}