{
  "10": [
    {
      "data": [
        "<article class=\"post-67651 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Buy climax is more important than Trump, Comey, and MayEmini weekend update: June 10, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Buy climax is more important than Trump, Comey, and May<br>Emini weekend update: June 10, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-06-10T00:30:56-07:00\">June 10, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Buy climax is more important than Trump, Comey, and May</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/06/m.png\"><img loading=\"lazy\" src=\"2017-6-10.png\" alt=\"Emini High 1 bull flag at resistance\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has been in a strong bull trend for 18 months. Furthermore, there is an 8 bar bull micro channel (no pullbacks).<p>The monthly S&amp;P500 Emini futures candlestick chart had a High 1 bull flag in April. Yet, it was after a 4 month buy climax. In addition, it was at a measured move up from the 2014 – 2015 trading range. A breakout above High 1 bull flag after a buy climax at resistance usually only lasts a few bars. This is the 2nd month. Then, the chart typically pulls back for a few bars. That would be a few months on the monthly chart.<p>Because the 18 month bull channel is tight, the 1st reversal down will likely be minor. Therefore, bulls will probably buy a 2 – 3 bar pullback. A 3 month pullback on the monthly chart could fall 150 points from the high. While this would be a bear trend on the daily chart, it would simply be a bull flag on the monthly chart.<p>Some minor reversals lead to major opposite trends. However, most traders want to see either a very strong reversal down or a series of 3 or more bear bars before they will believe that the bears have taken control. Most tops typically need at least a micro double top. Therefore, bulls will buy the 1st reversal down, confident that the bears will not sell aggressively at least until there is a rally back up to test the old high.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Extreme buy climax</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/06/w.png\"><img loading=\"lazy\" src=\"2017-6-10-1.png\" alt=\"Weekly Emini buy climax above EMA exponential moving average.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart had a bear doji bar this week. That is therefore weak follow-through after 2 strong bull bars. While there is no top yet, this rally is forming a small parabolic wedge since the March 27 low.<p>The weekly S&amp;P500 Emini futures candlestick chart has been in a tight bull channel for 18 months. Yet, there have been 3 small pushes up from the March 27 low. Hence, this is a potential parabolic wedge top. However, this week is not a strong sell signal bar. While it had a bear body, it had a prominent tail below. Because the context is good for a reversal down to the weekly moving average, traders should be ready for a selloff. Furthermore, it might have begun on Friday.<h4>Extreme buy climax</h4><p>This was the 30th consecutive week above the 20 week exponential moving average. This is the longest stretch in the 8 year bull trend, and therefore extreme. Furthermore, it is the 2nd longest stretch in the 18 year history of the Emini.<p>The longest one was about 50 weeks. That was in 2003 and on a reversal up after a 50% collapse. A rally in that environment is often extremely strong. Yet, the current rally is late in a bull trend. When there is exceptional strength late in a trend, it is more likely exhaustive.<p>Since a trend can last much longer than what seems logical, it is too early to be looking for shorts. However, because a correction down to the weekly moving average will likely begin soon, buying here is risky for traders. A trader is someone looking to take profits within a week or two. They are buying because the momentum up is strong on the daily chart. However, they can only buy here if they are comfortable managing their trades if there is a sharp reversal down.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Probable bull leg in trading range</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/06/d.png\"><img loading=\"lazy\" src=\"2017-6-10-2.png\" alt=\"Emini wedge top rally in trading range. Buy climax is more important than Trump, Comey, and May. \"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart formed a big outside down day on Friday. Yet, it closed far above its low and back in the 5 day tight trading range. However, it has had 3 legs up from the March 27 low. This is therefore a wedge rally. Furthermore, it is nested. This is because there are 3 smaller legs up since the May 18 low.<p>The daily S&amp;P500 Emini futures candlestick chart has a nested wedge rally. In addition, the March – April trading range is a potential Final Bull Flag. While there is no clear sign of a top, the odds are that the upside is small from here.<p>While Friday was an outside down bar, it had prominent tails. Furthermore it is in a 5 day tight trading range. Therefore, the bears need more before traders will believe that the bears have taken control. Yet, the context is good for a selloff beginning anytime.<p>The rally from the March 27 low is probably a bull leg in what will become a trading range. Therefore, the odds are that the Emini will soon begin a bear leg down to the bottom of the trading range. Since that is the March 27 low of 2315.75, that would be a 100+ point correction.<p>This rally is similar to the one in the bank stocks that ended on March 1. It was followed by a selloff to the bottom of the January Final Bull Flag. The odds are that the rally in the Emini will lead to a similar selloff over the next several months.<p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/06/JPM.png\"><img loading=\"lazy\" src=\"2017-6-10-3.png\" alt=\"JPM final bull flag\"></a><p class=\"caption\">The wedge rally to the high on the daily chart of JPM is similar to the current rally in the S&amp;P500 and Emini. The odds are that the Emini will follow the same path down to the bottom of its final bull flag over the next several months.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-6-10"
    }
  ],
  "17": [
    {
      "data": [
        "<article class=\"post-67897 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Mueller’s Trump investigation and correction from buy climaxEmini weekend update: June 17, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Mueller’s Trump investigation and correction from buy climax<br>Emini weekend update: June 17, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-06-17T00:30:58-07:00\">June 17, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Strong bull trend</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/06/m-1.png\"><img loading=\"lazy\" src=\"2017-6-17.png\" alt=\"Emini strong bull trend after buy climax at measured move.\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart had a doji buy signal bar in April. Furthermore, it followed a 4 bar buy climax. Finally, it was around a measured move up from the 2014 – 2015 trading range. Consequently, the odds are against a strong rally. Typically, the breakout lasts 1 – 3 bars (months), and then corrects for a few bars. Since this is the 2nd month, bulls will be quick to take profits. In addition, bears will be looking to sell.<p>Since the 18 month rally is in a tight bull channel, the first reversal down will probably be minor. That means it will probably last only a few months before the bulls buy again. However, because the 2014 – 2015 trading range formed late in a bull trend, it will probably be the final bull flag.<p>Therefore, any rally from here will probably not get far. Instead, the Emini will probably correct down to the 1800 bottom of that final flag within the next few years.<p>In summary, there will probably be a 2 – 3 month correction that starts within the next month. It will probably fall to around the April low, which is more than 100 points below the high. While that will be a bear trend on the daily chart, it will be a bull flag on the monthly chart. Therefore, the odds are that the selloff will be followed by at least one more rally that tests the high.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Extreme buy climax so correction soon</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/06/w-1.png\"><img loading=\"lazy\" src=\"2017-6-17-1.png\" alt=\"Emini weekly chart in extreme buy climax after 31 weeks above the EMA.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart has been above its 20 week exponential moving average for 31 weeks. This is extremely unusual and therefore unsustainable and climactic. This week was a doji inside bar, and last week was a doji bar as well. Hence, this is a breakout mode setup.<p>This week was an inside bar in a bull trend. It is therefore a pullback and a buy signal bar for next week. Yet, it is a doji bar and last week was a doji as well. This is a weak buy setup. Furthermore, the weekly chart is in an extreme buy climax. Therefore if next week trades above this week’s high and triggers the buy signal, the odds are that the rally will be brief. In addition, the Emini will probably soon reverse down.<p>If instead next week trades below this week’s low, it would trigger a sell signal. Since the bull channel is tight and a doji is a weak signal bar, this is not a strong sell setup. But, because the weekly chart is so overbought, there is an increased chance that this could be the start of a 2 – 3 months selloff.<h4>Unusually extreme buy climax</h4><p>The weekly S&amp;P500 Emini futures candlestick chart is amazing! It has not touched its average for 31 weeks. The only other time in the 18 year history that this happened was in 2003. That is about 900 bars! At that time, the Emini reversed up from a 50% collapse. Therefore, traders expected an extremely strong rally.<p>Yet, while it stayed above the average for about 50 weeks in 2003, it twice pulled back very close to the average at around 20 weeks. The current rally has not gotten very close. Hence, there was no relief of the overbought condition. Furthermore, it is even more overbought.<p>The current buy climax is late in a bull trend. When there is exceptional strength late in a trend, it is more likely a climactic end of the trend instead of the start of a new, stronger leg up. Hence, the current rally since March is probably an exhaustive buy climax.<h4>Trading range likely for many months</h4><p>While it does yet evident, the Emini probably entered a trading range in March. The rally from the March low has had 3 pushes up. This is therefore a wedge bull channel. A bull channel functions as a bear flag. Hence, a bear breakout is more likely than a bull breakout. Furthermore, the target of the bears is the bottom of the channel, which is the March low. Consequently, the odds are that a bull channel evolves into a trading range.<p>Hence, the Emini will probably soon turn down and then work to the March low just above 2300. Since the selloff will be a bear leg in a trading range, it will probably not be sharp, although it will have some big bear days. It might take 2 – 3 months to reach its target. Once it is at the bottom of the trading range, bulls buy to scalp up and bears buy back their shorts. Consequently, the Emini will probably rally from around the March low.<h4>Extreme buy climax, but probably not climactic reversal</h4><p>When a market is extremely stretched one way, there is an increased chance of an extreme reversal. Because the monthly and weekly charts are in tight bull channels, the odds are against a violent selloff. Yet, it the Emini sells off for 100 points and then rallies back to the high, which is likely, traders will look for a reversal down from a double top. That would have a higher probability of a deep correction.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Nested wedge rally</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/06/d-1.png\"><img loading=\"lazy\" src=\"2017-6-17-2.png\" alt=\"The Emini daily chart has a nested wedge before Trump's possible firing of Mueller.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart has been in a tight trading range for 3 weeks. In addition, it has had a parabolic wedge rally within a larger wedge really.<p>The Emini has been in a trading range within a bull trend. This is therefore a bull flag. Since the weekly chart is so extremely overbought, the odds are against a strong bull breakout of the bull flag on the daily chart. If the bulls get their breakout, it probably would fail within a week. This trading range would then be the final bull flag.<h4>Nested wedge top</h4><p>The daily S&amp;P500 Emini futures candlestick chart has had a wedge rally up from the March 27 low. Furthermore, the 3rd leg up is a wedge in a tight bull channel. It is therefore a parabolic wedge rally. It began on May 18, and it has had 3 pushes up, beginning with the May 25 top. Nested patterns have a higher probability of success. However, there is no sell signal bar yet and no strong bear breakout. Hence, the bulls might get one more new high before there is a reversal down.<h4>Bull leg in a trading range</h4><p>The rally from the March 27 low has had 3 pushes up. The pullbacks were strong enough to make the rally look more like a bull leg in a trading range than a new leg up in a bull trend. From the Market Cycle, traders know that channels usually weaken and evolve into trading ranges.<p>While there is no top yet or strong reversal down, that will probably happen soon. The bottom of the range would probably be around the bottom of the channel. Since that is around 2300, a selloff to that level would probably be a bear trend on the daily chart. Yet, since the monthly chart is in a tight bull channel, the odds are that the Emini would bounce from that level and have another bull leg in the range.<p>If the trading range grow to 20 or more bars, which is likely, the bears will try to create a reasonable top. Typically, they will try to form a lower high major trend reversal. In this case, that would also be a head and shoulders top, where the March 1 high was the left shoulder.<p>The bull would see a rally up from the March 27 low as a double bottom bull flag with that low. Hence, the Emini would be in breakout mode, and the pattern will probably least for at least 2 months.<h4>Mueller’s Trump investigation and correction from buy climax</h4><p>The media always relate stock market breakouts to whatever is making the news. The current popular story is Mueller’s investigation of Trump. If the Emini sells off within a month, reporters will claim that it was cause by a news event like this. While a news event often causes an initial breakout that leads to a big move, the big move is usually the result of technical factors.<p>For example, the stock market usually has to go too far to know if it has gone far enough. As a result, once it reverses, it can go very far. It does not matter if the day of the reversal happens when there is news. Nor does it matter if some firms place trades based on the news.<p>If the market went too far and reverses, the reversal is usually much bigger than what the news would suggest. This is because the technical factors are more important over the course of a few months. The market gravitates toward support and resistance, even if it is farther than what seems possible based on the news that reporters claim is behind the move.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-6-17"
    }
  ],
  "23": [
    {
      "data": [
        "<article class=\"post-68077 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Trump tax cut and Obamacare repeal as stock market catalystsEmini weekend update: June 24, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Trump tax cut and Obamacare repeal as stock market catalysts<br>Emini weekend update: June 24, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-06-23T14:00:14-07:00\">June 23, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Trump tax cut and Obamacare repeal as stock market catalysts in already strong bull trend</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/06/m-2.png\"><img loading=\"lazy\" src=\"2017-6-23.png\" alt=\"Emini in strong bull trend, but at measured move target\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has been in a strong bull trend for 18 months. It is at a measured move up from the 2014 – 2015 trading range, which will probably be the final bull flag in the 8 year bull trend.<p>While there is no sign of a top, this is an unusually strong rally. When something is unusual, it is climactic. Hence, it is likely to pause soon.<p>The April doji buy signal bar came after a 4 month buy climax. April was a High 1 bull flag. The Emini is also at a measured move up from the 2014 – 2015 trading range. Since that is a likely final bull flag, the Emini is at important resistance. A breakout above a High 1 bull flag at resistance after a buy climax usually usually only lasts 1 – 3 bars and then pulls back for several bars.<p>Therefore, the Emini is likely to begin to pull back either this month or next. Since the 18 month rally is in a tight bull channel, it is very strong. Consequently, the bulls will be eager to buy a pullback. Hence, the pullback will probably only last a few months. However, a 3 month pullback on the monthly chart could be 100 – 150 points. While it would create a bull flag on the monthly chart, it would be a bear trend on the daily chart.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Unusually extreme buy climax</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/06/w-2.png\"><img loading=\"lazy\" src=\"2017-6-23-1.png\" alt=\"Emini weekly chart has extreme buy climax.\"></a><p class=\"caption\">The weekly chart is in a strong bull trend and has not touched its 20 week exponential moving average in 32 weeks. Because this week closed below its midpoint, it is a reversal bar. Since it has a bear body, it is a bear reversal bar. It is therefore a sell signal bar for next week. The rally from the March low is a parabolic wedge, which is a type of buy climax. Furthermore, the March – April trading range is probably the final bull flag.<p>The weekly S&amp;P500 Emini futures candlestick chart is in a strong bull trend. In fact, this is the strongest bull trend in the 18 year history of the Emini. When a market becomes especially strong after 20 or more bars in the trend, that strength usually is exhaustive. Consequently, it usually leads to a pullback and trading range. That is likely here.<h4>Historically extreme buy climax</h4><p>The weekly S&amp;P500 Emini futures candlestick chart has not come close to its 20 week exponential moving average in 32 weeks. This has happened only once in the 900 bars that the Emini has been in existence. Yet, when it stayed above for 50 weeks in 2003, it got very close to the average price twice. Those pullbacks therefore partially relieved the overbought condition, allowing the rally to extend.<p>Since the current rally has not come close to the moving average, there has been no relief. Consequently, this is the most extremely overbought weekly chart in 18 years, at least by this measure. However, it is a very important measure. Therefore the odds are that the Emini will begin to pull back to the moving average within weeks.<p>Since the bull trend is so strong, the selloff will likely be a minor reversal. Consequently, the best the bears will probably get is a bear leg in a trading range. If that trading range lasts 20 or more bars, the bears then will try to create a major trend reversal. Until then, the selloff will probably only test the March low and then bounce.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Bull channel, but wedge rally</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/06/d-2.png\"><img loading=\"lazy\" src=\"2017-6-23-2.png\" alt=\"Emini daily chart in wedge rally.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart pulled back from a breakout above its 3 week tight trading range. Because it has been forming higher highs and lows for 3 weeks, it is also in a bull channel. Since Friday was a bull bar, it is a buy signal bar for Monday. Because it followed 3 bear bars, the Emini might go sideways for a few bars before trying for a new high.<p>The Emini has been in a strong bull trend since the November low. There is no sign of a top. Therefore this rally can continue indefinitely. In fact, there is a 25% chance that the bulls will get a strong bull breakout above the bull channel that began in November.<p>However, there is a 75% chance that a bull channel will have a bear breakout. The breakout can come from the Emini simply going sideways. Channels usually evolve into trading ranges, and that is likely here. The Emini is now probing up to find the top of the range. There is no sign that the top is in yet.<h4>Bull channel is a bear flag</h4><p>The daily S&amp;P500 Emini futures candlestick chart has rallied in a bull channel from the March 27 low. Since that rally has 3 legs up, it is a wedge bull channel. It therefore will probably have a bear breakout.<p>Bull channels usually evolve into trading ranges. The 3 month rally is therefore probably a bull leg in what will become a trading range. A trading range has bear legs after bull legs. Therefore, the Emini will probably soon begin to swing down for a couple of months. The selloff typically tests the beginning of the wedge channel, which is the March 27 low.<p>Because the Emini was in a trading range in March and early April, and that trading range was late in the rally that began in November, it is a possible final bull flag. Hence, it is a magnet. That is therefore an additional reason for the Emini to pull back for 100 or more points over the next few months.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-6-23"
    }
  ]
}