{
  "1": [
    {
      "data": [
        "<article class=\"post-65604 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"April government shutdown crisis and 5 per cent correctionEmini weekend update: April 1, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">April government shutdown crisis and 5 per cent correction<br>Emini weekend update: April 1, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-04-01T00:30:27-07:00\">April 1, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Buy climax at Final Bull Flag measured move target</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/04/m.png\"><img loading=\"lazy\" src=\"2017-4-1.png\" alt=\"Emini buy climax after Brexit and before government shutdown at April continuing budget resolution.\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart had a bear body this month after last month’s big bull bar. Yet, the bar was a doji bar, and therefore a weak sell signal bar after a 4 bar rally.<p>The monthly S&amp;P500 Emini futures candlestick chart has rallied strongly for 15 months. In addition, it was especially strong for the past 4 months. This month was the 1st bear bar in 5 months. Because it closed near the middle and not near the low, it is a low probability sell signal bar. Hence, there are probably buyers below its low. Therefore, a reversal down would probably be minor, even if it lasted a few bars (months). As a result, the best the bears will probably get is a pullback into a bull flag.<h3>Final Bull Flag</h3><p>The Emini was in a trading range for more than 20 bars in 2014 and 2015. Since that was late in a bull trend, it was probably the Final Bull Flag. Bulls therefore take profits around a measured move up. The March high was at a measured move up. Therefore the location is good for a major top on the monthly chart.<p>Yet, a major top needs some selling pressure. A 15 bar tight bull channel usually has to transition into a trading range before it can reverse into a bear trend. Therefore, the bears will need at least a micro double top before they can create a major reversal. Hence, the downside risk is small over the next 2 or 3 months.<p>When there is a Final Bull Flag reversal, the target for the bears is the bottom of the Final Flag. That is around 1800. How long would it take to get there? It might take 10 – 20 bars, which is 1 – 2 years. There is no sign of a reversal yet. However, if the bears begin to create a strong reversal, 1800 would be their target.<h3>Bears need micro double top</h3><p>A micro double top on the monthly chart is a small double top on the weekly chart and a big double top on the daily chart. Hence, a micro double top can sometimes lead to a major reversal. Therefore, traders will watch what the market does after it pulls back and then tests the March high. If there is a strong sell signal bar in May or June, the bears will have a better chance of a major reversal.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Strong reversal up after last week’s bear breakout</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/04/w.png\"><img loading=\"lazy\" src=\"2017-4-1-1.png\" alt=\"Emini bull flag but after buy climax test of 2400 big round number.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart had a big bull trend bar this week after the prior week’s strong bear reversal down from measured move targets.<p>The weekly S&amp;P500 Emini futures candlestick chart reversed down strongly after a micro double top at the measured move up from a 2 year trading range. Yet, the bulls reversed the Emini up even stronger this week. This week is therefore a buy signal bar for a High 2 bull flag. Since the weekly chart is still Always In Long, bulls can buy above this week’s high.<p>But, this week’s bar was big. Therefore, the stop for the bulls is far below. Hence, the risk is big. In addition, the bulls are buying close to the top of a 5 week tight trading range. Furthermore, this is at the resistance of a measured move target.<p>As a result, this is a low probability buy setup. When the probability is low and the risk is big, there are usually more sellers than buyers above the buy signal bar. Therefore, sideways is more likely than up.<h3>Weekly buy climax</h3><p>The 5 month rally has been exceptionally strong. Yet, the March high was unusually far above the weekly moving average. That means that the rally is unsustainable and climactic. As a result, many bulls will wait to buy a pullback.<p>If you look back at the weekly chart to find times when it was far above the moving average, more than 70% pulled back to the moving average before going much higher. Therefore, even though this week is strongly bullish, the context is bad. The odds are that the Emini will work sideways to down to the moving average before it rallies much higher.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Bear rally?</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/04/d.png\"><img loading=\"lazy\" src=\"2017-4-1-2.png\" alt=\"Emini bear Trump rally, but 5% correction to give back all of 2017 gains likely. \"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart had 4 consecutive bull bars this week after reversing up from a failed bear breakout. Since it still has a lower high, it is also in a bear channel.<p>The daily S&amp;P500 Emini futures candlestick chart is in a bull flag and an early bear trend. Traders therefore need more bars to determine the direction of the next couple of months. The momentum up favors the bulls. Yet, the Emini reversed down from a measured move target on the monthly chart. Furthermore, there is a buy climax on the weekly chart. In addition, the reversal down has not yet reached the weekly moving average. Therefore, there is resistance above and a magnet below.<p>While the bulls got a strong reversal up this week, they need a strong breakout above the March all-time high. Without that, the odds favor sideways to down over the next few months.<h3>Broad bear channel</h3><p>The bears had a strong bear breakout 2 weeks ago. Since the rally is still below the high of 2 weeks ago, and the Emini also has a lower low, the Emini is in a bear channel. Yet, the bears were unable to create follow-through selling.<p>Most noteworthy is that the bulls reversed the market up strongly. When a market is in a bear trend, it often has rallies that are strong enough to reverse the market to Always In Long. However, if a rally fails to get above the most recent major lower high, it is still just a rally in a bear channel.<h3>Trading range so both bull and bear setups</h3><p>Since the Emini has been in a trading range for 2 months, it is neutral. There are always good reasons to buy and to sell when the market is in a trading range. As a result, the bulls and bears are balanced, and the market can continue sideways for a long time.<p>The buy climax on the weekly chart was unusually extreme. In addition, it was at a measured move target on the monthly chart. Furthermore, the Emini never tested the close of last year. Consequently, the probability slightly favors the bears.<h3>April government shutdown crisis and 5 per cent correction</h3><p>The next major catalyst for a breakout up or down is the congressional fight over the continuing resolution that expires on April 28. While news is only a catalyst, it can be the start of a big move. Since the odds favor a 5% correction, a fear of a government shutdown is a reasonable catalyst. Because March and April tend to be bullish, the stock market might stay in its trading range until the end of April.<h3>Black Swan rally?</h3><p>Whenever there are good reasons for a selloff, traders need to be aware of Black Swan events. This is a low probability outcome. Here, that would be a strong breakout to a new all-time high.<p>When a low probability event happens, traders are trapped. If there is a strong bull breakout, bulls will be trapped out because they see the market as too high to continue. Bears get trapped in because they are selling the breakout. If the rally continues, trapped bulls and bears are forced to buy. Bears continue in denial and keep selling, expecting a top. Bulls are in denial as well and keep scalping out. Both bulls and bears repeatedly have to buy. As a result, the rally can go much further up than what seems reasonable.<p>Will this happen? I said that this would be a Black Swan. Therefore, by definition, it is very unlikely. Yet, if it begins to happen, traders should not deny it. They should buy and hold for a swing up.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-4-1"
    }
  ],
  "8": [
    {
      "data": [
        "<article class=\"post-65792 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Likely five percent correction and retracement of 2017 gainsEmini weekend update: April 8, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Likely five percent correction and retracement of 2017 gains<br>Emini weekend update: April 8, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-04-08T00:30:04-07:00\">April 8, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Buy Climax at measured move target</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/04/m-4.png\"><img loading=\"lazy\" src=\"2017-4-8.png\" alt=\"Emini S&amp;P500 buy climax at 2400 big round number and measured move target should end the trump rally and start a 5% correction to below dow 20,000.\"></a><p class=\"caption\">This month’s bar on the monthly S&amp;P500 Emini futures candlestick chart this month is a small doji inside last month’s big doji. Consequently, both are weak follow-through after a 4 month buy climax. In addition, this rally is stalling at a measured move up from the 2 year trading range. Since that range was late in a bull trend, it will probably be the Final Bull Flag.<p>The monthly S&amp;P500 Emini futures candlestick chart has been in a bull trend for 9 years. Since that is unusual, it is unsustainable. Therefore the odds are that it pulls back before continuing much higher. Yet the 16 bar tight channel is a sign of eager bulls. Hence, the bulls will probably buy the 1st reversal down. Consequently, the first reversal down will probably be minor. It will therefore probably last only a few bars (months) and become a bull flag.<p>Since the Emini is at important resistance and in a buy climax, traders are ready for a possible correction. Yet, most corrections need at least a micro double top. Therefore, the downside risk over the next couple of months is small. The bulls will probably buy the 1st pullback. However, if the trend resumption up reverses down again, that would create a micro double top. It would therefore have a higher probability of a reversal back down into the 2014 – 2015 Final Bull Flag.<h4>Breakout above the 2000 and 2007 double top</h4><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/04/m-1.png\"><img loading=\"lazy\" src=\"2017-4-8-1.png\" alt=\"S&amp;P cash index is in a buy climax but not at its measured move target.\"></a><p class=\"caption\">The monthly Emini chart on the right reached one measured move target based on the 2000 and 2007 double top. Yet, the high of the S&amp;P500 cash index on the left is still about 100 points below its target.<p>Since the bull trend is at important resistance, late in a bull trend, the upside from here is probably small. The Emini is also at a measured move up from the breakout above the double top formed by the 2000 and 2007 highs. But, the measured move target on the cash index is about 100 points above the all-time high. Hence, the rally might continue a little higher before there is a correction on the monthly chart.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Weak entry after High 2 bull flag</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/04/m-2.png\"><img loading=\"lazy\" src=\"2017-4-8-2.png\" alt=\"Trump rally buy climax after Brexit and Fed interest rate hike\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart had a High 2 buy signal last week. This week’s rally above last week’s high therefore triggered the buy. Yet, this week week was a doji bar. It therefore represents weak buying. Most noteworthy is that a chart has two variables, price and time. Since the all-time high is far above the moving average, the price is climactic. Because the Emini has been above the average for a long time, time is climactic as well.<p>The weekly S&amp;P500 Emini futures candlestick chart’s high was unusually far above the moving average. Look back at every instance when the weekly chart rallied far above its moving average during the 9 year bull trend. In every instance, it traded down to below the moving average. Therefore, each was a buy climax that needed a pullback. Will this time be different? While the Emini might rally to a new high, it probably will not get much higher without a pullback below the moving average.<p>Furthermore, It has been above the moving average for 21 bars. Since that is unusual, it is another sign of unsustainable price action. Hence, it is another form of buy climax. Hence, the rally is climactic in terms of price and time. When there is a buy climax, the bulls are hesitant to buy for about 10 bars. They want to wait to see if the bears can create a reversal. If the bears fail after 10 or more bars and 2 or more legs, the bulls will buy again, and the bull trend will resume. The odds are that this 4 week pullback is not enough. Furthermore, all other buy climaxes in the past 9 years pulled back below the weekly moving average.<h4>Odds are against the bulls near-term, despite a bull trend</h4><p>As a result of buy climaxes based on price and time, the odds of much higher prices without a pullback below the average are small. Hence, the Emini is probably in a correction that will last another month or two. The Emini should test the close of 2016, and the Dow should fall below 20,000. Alternatively, it might rally to one more minor high and then begin the correction.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Likely five percent correction and retracement of 2017 gains</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/04/m-3.png\"><img loading=\"lazy\" src=\"2017-4-8-3.png\" alt=\"Trump rally failing so start of 5% correction down to December close and Dow 20,000. Likely five percent correction and retracement of 2017 gains.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart has been in a tight trading range for 2 weeks. Furthermore, that range is in the middle of a 2 month range. The bulls see a rally up from a High 2 bull flag. The bears see an early bear trend, with lower highs and a lower low.<p>The daily S&amp;P500 Emini futures candlestick chart is in an early bear trend. As long as the bears prevent a rally above the March 15 major lower high, the bears have lower highs and lows. Hence, it is a bear trend. Yet, if the bulls break strongly above that high, the rally will probably continue for a measured move up.<p>Because the weekly chart is in an extreme buy climax, it is more likely that the daily chart is in an early bear trend. Yet, the 2 month tight trading range make the probability only slightly better than 50% for the bears. Until the bears get a strong break below the March 27 major low, traders will not believe that the 5% correction is underway.<p>Furthermore, if the bears get that breakout, the odds would be 60% that the Emini has begun a 5% correction down to below the weekly moving average. Once there, the odds would favor a retracement of the entire 2017 rally and a test of the December close.<h4>Daily bear trend, but monthly bull flag</h4><p>While a 3 month, 5% correction on the daily chart is a bear trend, it is simply a pullback on the monthly chart. Therefore the odds are that the correction will be a bull flag on the monthly chart. Consequently, the bulls will buy it, correctly expecting a test of the all-time high. If the Emini reverses down from that test, the bears will have a major trend reversal. Hence, they will have a 40% chance of a test of the bottom of the Final Bull Flag on the monthly chart at around 1,800.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-4-8"
    }
  ],
  "15": [
    {
      "data": [
        "<article class=\"post-66008 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Trump, North Korea, and Syria catalysts for 5 percent correction Emini weekend update: April 15, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Trump, North Korea, and Syria catalysts for 5 percent correction<br>Emini weekend update: April 15, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-04-15T00:30:27-07:00\">April 15, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Trump, North Korea, and Syria catalysts for 5 percent correction</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/04/m-5.png\"><img loading=\"lazy\" src=\"2017-4-15.png\" alt=\"Trump, North Korea, and Syria catalysts for 5 percent correction in the Emini and stock market\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has a bear inside bar so far this month. It is stalling at a measured move up from the 2 year trading range.<p>The monthly chart has been in a strong bull trend for 8 years. While there is no top yet, the 2014 – 2015 trading range will probably be the final bull flag. Consequently, the rally will probably not continue much higher before there is a reversal down to the bottom of that final flag. Hence, 1800 is a target for the bears at some point in the next couple of years.<p>The monthly S&amp;P500 Emini futures candlestick chart has stalled for 2 months after a 4 month buy climax. Since the buy climax was a test of the measured move projection based on the 2 year trading range, this rally might be simply a buy vacuum test of resistance. Consequently, it has an increased chance of being an exhaustive end of the 8 year bull trend.<p>While it is possible the it is a breakout into a new, stronger bull trend, this is less likely after an 8 year bull trend. Hence, the gap between this month’s low and the August high is more likely an exhaustion gap than a measuring gap.<h4>Buy climax, but bull flag likely</h4><p>A climax at resistance is usually not enough to reverse a bull trend into a bear trend. Since this 16 month rally is in a tight bull channel, bulls have been willing to buy at the high of every bar. Hence, if the Emini trades below the low of the prior month, many bulls will see the reversal as an opportunity to buy at a discount. Therefore, bulls will buy the 1st reversal down. It will consequently likely become a bull flag and not a bear trend.<h4>A micro double top can lead to a major reversal</h4><p>If the bull trend resumes after a 1 – 3 month pullback, the bears will be more willing to sell. This is because they then would have a micro double top at major resistance. They therefore would have a higher probability of creating a major reversal.<p>A micro double top on the monthly chart is a double top major trend reversal on the daily chart. Since this would have a 40% chance of a swing down, the bears would have a reasonable chance of a test of the 1800 bottom of the 2 year final bull flag.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Price and time buy climaxes</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/04/w-1.png\"><img loading=\"lazy\" src=\"2017-4-15-1.png\" alt=\"Trump, North Korea, and Syria catalysts for 5 percent correction after weekly buy climaxes.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart is far above its moving average. Furthermore, it has not tested the average in 22 weeks. In addition, it is reversing down from a breakout above its bull channel. This week is the entry bar for a micro double top lower high. Since this week was not a big bear trend bar, is was not a strong entry bar. The odds therefore favor more bars in the tight trading range.<p>The weekly S&amp;P500 Emini futures chart rallied to far above the weekly moving average. This extreme behavior is a buy climax based on price.<a href=\"https://www.brookstradingcourse.com/analysis/likely-five-percent-correction-and-retracement-of-2017-gains/\" target=\"_blank\">I discussed last week</a>that the past 22 weeks have not touched the moving average. I also provided a chart. Since that is unsustainable, it, too, is climactic. Yet, it is a climax based on time. With buy climaxes based both on price and time, there is an increased chance of a pullback.<p>The first target is the weekly moving average. Since this reversal down is coming after a failed breakout above the 16 month weekly bull channel, another target is the bottom of the channel. Finally, the Emini has not tested the close of last year. Hence, that is also a target. As a result of the climaxes and targets, the Emini will probably pull back at least 5% over the next couple of months.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Bull flag, but more likely early bear trend</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/04/d-1.png\"><img loading=\"lazy\" src=\"2017-4-15-2.png\" alt=\"Emini testing neck line of double top with north korea nuclear test and putin in syria.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart has been in a trading range for 2 months. Until it breaks strongly below the March 27 low or above the March 15 high, most legs will continue to reverse.<p>The daily S&amp;P500 Emini futures candlestick chart has been in a bull trend for 16 months. The bulls correctly see the 2 month trading range as a bull flag. Yet, the weekly chart is probably in control. That chart is likely to correct 5% over the next couple of months. Therefore the weak bear channel on the daily chart that began at the all-time high will probably accelerate below the March 27 low within the next month or two.<p>As a result, that breakout will probably lead to a measured move down from the double top. Hence, the selloff will probably reach the targets below on the weekly chart.<p>Because of Friday’s bear close, there is an increased chance of a gap down on Monday. If there is a big gap down below the March 27 low and a big bear trend day, traders will conclude that the Emini will fall for a measured move.<p>This has about a 30% chance of happening. More likely, the trading range will continue. Consequently, the odds are that the Emini will reverse up over the next week or two, even though it will probably break strongly below the March 27 low at some point in the next couple of months.<h4>Wedge bull flag on 60 minute chart</h4><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/04/60-min.png\"><img loading=\"lazy\" src=\"2017-4-15-3.png\" alt=\"Emini wedge bull flag and spike and channel bear trend\"></a><p class=\"caption\">The 60 minute chart has a nested wedge bear channel. Since it is above the March 27 bottom of the bull trend, it is a wedge bull flag. It is also a spike and channel bear trend.<p>The bulls rallied from the March 27 High 2 bull flag on the daily chart. Yet, it has sold off since April 5. Because the selloff is still above the bottom of the bull reversal, the bulls see the selloff as a bull flag.<p>The daily chart had strong pushes down on April 5 and 11. On the 60 minute chart, April 5 is a strong bear breakout. Furthermore, the 60 minute chart has been in a bear spike and channel since then. Yet, it is still above the March 27 bottom of the bull trend. Consequently, the bulls see the selloff as a potential wedge bull flag. When a pattern is nested like the wedge on the 60 minute chart, the odds are higher that it will perform as expected. Hence, the odds of a bull breakout are higher than with other wedge bottoms.<p>While there are 3 legs down and a clear wedge on the 60 minute chart, there have only been 2 legs down on the daily chart. Furthermore, there is still room the the March 27 low. Some bulls will therefore wait for 1 more leg down next week before they will buy. In addition, legs in a trading range often fall below major support before reversing up. Hence, the bulls might not buy until after a dip below the March 27 low. If the bulls get their reversal up, they will want the rally to test the March 15 major lower high. The first targets in a wedge bottom reversal are the lower highs in the wedge bear channel.<h4>Wedge bottoms usually have bull breakouts</h4><p>In general, a wedge bottom has a 25% chance of a bear breakout and a measured move down. It therefore has a 75% chance of a bull breakout and then either a trading range or a reversal up. However, this depends on context. Since the weekly chart probably is in a pullback, the daily chart is therefore probably in an early bear trend. Hence, the probability of a bear breakout below the wedge bottom is higher. Yet, it is still probably not more than 40%.<p>Consequently, the odds are that the Emini will rally over the next few days even if it sells down to the March 27 low 1st. Yet, there is still a 60% chance that one of these selloffs will strongly break below the March 27 low at some point in the next month or so. Betting that any one will succeed is a low probability bet. This is because most trading range breakouts fail, even though one eventually succeeds.<h4>Weekly reversal</h4><p>Since the weekly chart is bearish, the odds are that a rally to the March 15 high will fail. Hence, the bears would then sell a reversal down from the double top. Alternatively, the rally could fail at a lower high. The bears would sell that reversal down as well. This is because they would see it as just another lower high in an early bear trend.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-4-15"
    }
  ],
  "22": [
    {
      "data": [
        "<article class=\"post-66249 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Sell in May and go away means 5 percent correction  Emini weekend update: April 22, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Sell in May and go away means 5 percent correction<br>Emini weekend update: April 22, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-04-22T00:30:46-07:00\">April 22, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Consecutive doji bars after buy climax</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/04/m-6.png\"><img loading=\"lazy\" src=\"2017-4-22.png\" alt=\"Stock market bull trend but French Le Pen vote will cause correction.\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has consecutive doji bars after a buy climax. Furthermore, it is at a measured move target based on the 2014 – 2015 trading range. In addition, that trading range was late in a bull trend. Hence, it will probably be the final bull flag.<p>The monthly S&amp;P500 Emini futures candlestick chart is currently subordinate in importance to the weekly chart. This is because the weekly chart has an unusual buy climax. It will therefore probably lead to a correction over the next 2 months.<p>Yet, a 150 point correction would be a 2 – 3 month bull flag on the monthly chart. Because the 16 month rally on the monthly chart is in a tight bull channel, the odds are that bulls will buy the 1st reversal down. Consequently, the odds are that any selloff will only last 2 – 3 months. Then, the odds are that the bull trend will resume and test the all-time high.<p>Since the monthly chart is so climactic and at a major resistance level, the odds are against much higher prices for the rest of the year. Even if the Emini reaches 2,500 within a year or two, the odds are that it will be unable to escape the magnetic pull of the 2 year final flag. Consequently, the odds are that the Emini will test the 1,800 bottom of that final bull flag within a couple of years.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>70% chance of a pullback below the moving average within 2 months</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/04/w-2.png\"><img loading=\"lazy\" src=\"2017-4-22-1.png\" alt=\"Emini weekly chart has extreme buy climax and will correct below 2300.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart had a high 2 bull flag 2 weeks ago. The bulls therefore see this week as a pullback from the breakout above that bull flag. The bears see that breakout as a failure. They therefore see a small double top over the past 6 weeks. In addition, they see an extreme buy climax.<p><a href=\"https://www.brookstradingcourse.com/analysis/likely-five-percent-correction-and-retracement-of-2017-gains/\" target=\"_blank\">The weekly S&amp;P500 Emini futures candlestick chart has an unusual and extreme buy climax</a>. It has not touched the moving average in 23 weeks. This has only happened twice before during the 8 years of the current bull trend. In addition, there have many many instances when the market stayed above the moving average for 15 or more bars (weeks). Yet, in every case, the Emini fell below its moving average before going much higher. Consequently, the odds are 70% or more that the Emini will pull back to that average within the next couple of months.<p>Furthermore, most of the prior buy climaxes led to reversals that fell 50 or more points below the average. Since the average is currently around 2,300, the odds are that the Emini will fall below 2,250 before going much higher. When I look at the weekly chart, I think of a line from my favorite movie about trading. It is the 1983 Eddie Murphy comedy,<em>Trading Places</em>. Randolph Duke (Ralph Bellamy) is begging his brother (Don Ameche) to “Sell, Mortimer, sell!”<h4>Should test last year’s close and give back all of 2017’s gains</h4><p>Since the Emini has not tested the close of last year, it is a magnet. Furthermore, since it is only about 20 points below the 2,250 target, the Emini probably will be unable to escape its magnetic pull. There is therefore about a 60% chance that the selloff will test last year’s close. In addition, that would result in the Dow falling back below 20,000.<h4>Minor reversal before attempt at major reversal</h4><p>Since the weekly chart is in a tight bull channel, even if it retraces 50% of the Trump election rally, the odds are that the reversal down will be minor. Consequently, bulls will buy the selloff. This is because they correctly believe that the selloff will more likely be a bull flag or a bear leg in a new trading range. In either case, the odds are that the Emini will rally back to test the old high.<p>However, if there is a strong selloff, the bears will look to sell at the prior high. This is because a reversal down after testing that high would create a major trend reversal setup. The bears would then have a 40% chance of a major reversal down. Yet, the risk would be small compared to their potential gain. Consequently, even a 40% chance of a swing down results in a strong<a href=\"https://www.brookstradingcourse.com/how-to-trade-manual/traders-equation/\" target=\"_blank\">Trader’s Equation</a>.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Maybe 1% up before 5% down so “Sell in May and go away” means 5 percent correction</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/04/2017-04-21_13-56-58.png\"><img loading=\"lazy\" src=\"2017-4-22-2.png\" alt=\"daily stock market in 5% correction down to December close, erasing all of 2017 gains. Sell in May and go away means 5 percent correction.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart is in a trading range. But, because the weekly chart will probably pullback to below 2,250, the daily chart is also in an early bear trend.<p>The daily S&amp;P500 Emini futures candlestick chart will probably fall below last year’s close before going much above the old high. Think about that. The risk to the old high is about 50 points. Last year’s close is more than 100 points below. Hence, the odds are that the bears will make a reward that is twice their risk. This creates an unusually strong Trader’s Equation.<h4>Unusually strong Trader’s Equation for put buyers</h4><p>A trader rarely has a high probability of making a reward that is twice his risk. This is therefore one of those rare times. Hence, the current level is good for traders buying puts or put spreads. Since the selloff might take a couple of months to reach its targets, traders wanting to take this trade should buy June or July puts or put spreads.<p>Is it okay to wait? Yes, because the odds still are the the Emini will test up to the top of the 60 minute wedge bear channel before breaking below the March 27 low. If a trader wants smaller risk, he will wait for more of a rally and then buy puts.<p>If a trader wants higher probability, he will wait for a strong break below the March 27 bottom of the 2 month trading range. When buying puts in a falling market, it is better to buy put spreads. This is because there is often a sharp pullback back up after a breakout. Consequently, put buyers who enter late should either buy put spreads, or a small put position, looking to add on during a rally.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-4-22"
    }
  ],
  "29": [
    {
      "data": [
        "<article class=\"post-66389 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini double top within 3 weeks, then 5 percent correction Emini weekend update: May 1, 2017\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini double top within 3 weeks, then 5 percent correction<br>Emini weekend update: May 1, 2017</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2017-04-29T00:30:11-07:00\">April 29, 2017</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Buy climax at measured move target</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/04/m-7.png\"><img loading=\"lazy\" src=\"2017-4-29.png\" alt=\"Emini monthly chart has bull flag but a buy climax. Traders expect an Emini double top within 3 weeks, then 5 percent correction.\"></a><p class=\"caption\">April was a pullback in a 16 bar bull trend. Yet, because it is a doji after a buy climax and at resistance, the odds are that there will be sellers not far above.<p>The monthly S&amp;P500 Emini futures candlestick chart has a High 1 bull flag after a buy climax and at resistance. While April is a buy signal bar, it is a doji. Furthermore, last month was also a doji. In addition, this pullback is at a measured move target based on the 2014 – 2015 trading range. Finally, the 16 month bull channel was tight. It is therefore a buy climax. Consequently, these factors make April a weak buy signal bar. As a result, a breakout above April’s high will probably fail to go very far before the Emini pulls back.<p>When a tight bull channel lasts a long time like this, bulls will buy the 1st reversal down. Therefore the reversal will probably become a bull flag and not a bear trend. Yet, the pullback could last several bars. A 3 month pullback on the monthly chart could easily fall 150 points. It would therefore create a bear trend on the daily chart.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Extreme buy climax and 60% chance of 5% correction soon</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/04/w-ch.png\"><img loading=\"lazy\" src=\"2017-4-29-1.png\" alt=\"Weekly emini breaking above bull channel, but buy climax.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart gapped above a 7 bar bull flag. Yet, last week’s breakout bar was a doji and it failed to break above the March high. Furthermore, the bull breakout above the bull channel should fail. Consequently, it should go sideways to down to test the bottom of the channel.<p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/04/w-3.png\"><img loading=\"lazy\" src=\"2017-4-29-2.png\" alt=\"weekly stock market has buy climax based on time and price.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart has not touched the 20 week exponential moving average for 24 weeks. This is therefore an extreme buy climax.<p>The weekly S&amp;P500 Emini futures candlestick chart now has 24 consecutive bars completely above the moving average. This has happened only twice in the 8 year bull trend, and not in 6 years. The weekly chart stayed above for 27 weeks in 2009 and 2010, and then 26 weeks in 2010 and 2011. These were the longest stretches in 14 years. In both cases, the pullback to the moving average began on the 23 or 24th week. It took a few weeks to reach the moving average.<h4>Correction will probably begin within 3 weeks</h4><p>There have been many times in the current 8 year bull trend when the Emini stayed above the moving average for 15 or more bars. In every instance, it pulled back at least 20 points below the average. Furthermore, it fell about 50 points below several times. Finally, there is always the possibility of a much bigger correction. Yet, this is unlikely because the bull channels on the weekly and monthly charts are tight.<p>Consequently, a trader looking at the 20 week exponential moving average has to conclude that a reversal will take place within a few weeks. The moving average is currently around 2,310, which is about 90 points down from the March all-time high. In addition, the correction will probably fall at least 20 – 50 points below the average. Furthermore, the Emini never tested the December close of 2,233.25. Finally, May and June have a bearish bias. Yale Hirsh reported in his Trader’s Almanac that, since 1950, the market fell 0.4% from May – October, but rallied 7.4% from November to April. If you invested $10,000 in 1949 from May – Oct, you would have $4,550. If you invested it from November to April, you would have $2,166,331. As a result of these factors, the Emini has at least a 60% chance of a 5% correction before it gets much above the all-time high.<h4>Good time to buy puts or put spreads</h4><p>Since there is at least a 60% chance of a 100 point or more selloff over the next couple of months, the<a href=\"https://www.brookstradingcourse.com/how-to-trade-manual/traders-equation/\" target=\"_blank\">Trader’s Equation</a>is unusually good for put buyers. For example, a trader could buy a June or July out of the money 235 SPY put for under $3. If the stock market falls 5%, that would be about 10 points in the SPY. The SPY might fall to 225. If so, each put would be worth more than $10. That would result in a $7 profit while the risk was only the $3 cost of the put.<p>It is unusual to have a 60% chance of making a reward that is twice as big as the risk. Therefore, this is a good opportunity for put buyers. Some traders would prefer to buy put spreads instead. That is also a good trade.<h4>Weekly charts of many stocks have buy climaxes</h4><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/04/amzn.png\"><img loading=\"lazy\" src=\"2017-4-29-3.png\" alt=\"Amazon buy climax and wedge top below 1,000.\"></a><p class=\"caption\">The weekly Amazon candlestick chart is forming a wedge top just below the 1,000 Big Round Number. The wedge has 3 climactic legs.<p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/04/FB-1.png\"><img loading=\"lazy\" src=\"2017-4-29-4.png\" alt=\"&quot;Facebook is in a buy climax at the top of its bull channel.\"></a><p class=\"caption\">The weekly Facebook candlestick chart is breaking above its bull channel. It therefore has a 75% chance of a reversal down within 5 weeks.<p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/04/LMT.png\"><img loading=\"lazy\" src=\"2017-4-29-5.png\" alt=\"Lockheed Martin wedge top\"></a><p class=\"caption\">The weekly Lockheed Martin candlestick chart is forming a wedge top. The odds favor a pullback and a trading range soon.<p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/04/xlf.png\"><img loading=\"lazy\" src=\"2017-4-29-6.png\" alt=\"The XLF has a head and shoulders top.\"></a><p class=\"caption\">The weekly XLF candlestick chart is in a strong bull trend, and is breaking above a bull channel. The odds favor a reversal. There is also a head and shoulders top and a double top bear flag on the daily chart.<p>Most major stocks are in strong bull trends on the weekly chart. Yet, many are breaking above bull channels. Since there is only a 25% chance that a bull breakout above a bull channel will have strong follow-through buying after 5 weeks, these breakouts will probably fail. In addition, the reversal down usually reaches the bottom of the bull channel.<p>Many other stocks have wedge tops. In addition, the legs are very strong, and some are parabolic. While most do not yet have a reversal down, the upside is limited.<h4>Risky to buy during buy climax</h4><p>It is important for a trader to understand his goals. If he is an investor, he can buy at any time because he is confident the stock will be higher 1 – 5 years later. It is still better to buy pullbacks and not at the top of a strong bull trend.<p>If he is a trader, he is looking for fast money. He is willing to buy stocks that are rallying strongly based on the Greater Fools Theory. He is buying because he believes that there will be someone more foolish who will buy his stock from him at a higher price. This would result in a profitable trade.<p>Yet, this approach is risky because a reversal down can be very fast. This is because momentum trades are “crowded trades.” Most of the late buyers are buying simply because of the momentum up. They believe there will be enough follow-through momentum so that they can exit higher with a profit.<p>Once the momentum stops, they rush to exit. The result can be a big, fast reversal down. Consequently, the math is not great for traders buying late in a buy climax. Their probability of a profit is falling, and their stop is far away. Therefore their risk/reward ratio is bad.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Emini double top within 3 weeks, then 5 percent correction</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2017/04/d-2.png\"><img loading=\"lazy\" src=\"2017-4-29-7.png\" alt=\"emini double top reversal at all-time high, despite trump tax cut and obamacare repeal and replace.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart turned down from just below the all-time high. This is a lower high major trend reversal.<p>The daily S&amp;P500 Emini futures candlestick chart broke strongly above a 2 month bull flag last week. Yet, it failed to break above the March high. A reversal down would therefore be a lower high major trend reversal.<p>The bulls hope that the Emini breaks strongly to a new all-time high. Yet, the buy climax on the weekly chart makes a sustained rally from here unlikely.<h4>Possible island top</h4><p>If the Emini gaps down any day this week, it would create an island top with last week’s gaps up. In addition, if it gaps down on Monday, it would create an island top on the weekly chart, which is rare. While most island tops do not lead to reversals, there is an increased chance when other factors are present.<p>Here, the most important factor is the unusual buy climax on the weekly chart. Since there is at least a 60% chance of a 100 point correction starting within 3 weeks, an island top now would have a higher probability of leading to a bear trend. Furthermore, if there is a very big gap down, and that day becomes a big bear trend day closing on its low, it would likely be the start of the correction.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2017-4-29"
    }
  ]
}