{
  "1": [
    {
      "data": [
        "<article class=\"post-81847 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini bull flag but limited upside without pullback Intraday market update: Monday October 1, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini bull flag but limited upside without pullback<br>Intraday market update: Monday October 1, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-10-01T06:20:37-07:00\">October 1, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini bull flag but limited upside without pullback</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Today is the 1st day of the month. Last month was a small bull doji bar on the monthly chart and therefore not a good sell signal bar. This is especially true due to the 7 bar bull micro channel. The odds are that traders will buy below the September low.<p>Last week was also a doji inside bar on the weekly chart, but it had a bear body. It is therefore both a weak buy and sell signal bar. There are probably buyers not far below and sellers not far above.<p>The daily chart has a 5 day tight trading range and a bull bar on Friday. Friday is a buy signal bar for today. Because the chart is in a bull trend, the odds favor at least slightly higher prices.<p>Traders are deciding if the September high is the start of a pullback to the 20 week EMA. If instead the Emini rallies above the September high, it would be the 3rd leg up from the August 15 low. That would create a potential wedge top on the daily chart.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 13 points on the Globex chart. It will therefore probably form a big gap up on the open. A big gap increases the chance of a trend day. A gap up makes a bull trend more likely than a bear trend.<p>Whenever there is a big gap up, there is 20% chance of a strong trend from the open. If one forms, a bull trend is more likely than a reversal down.<p>When a gap is big, the Emini is far above its average price. Many traders prefer to buy closer to the average price. Consequently, the chart usually has to get closer to the 20 bar EMA before the bulls can get a strong bull trend.<p>There is an 80% chance of at least a small trading range forming by the end of the 1st hour. If so, day traders will look to buy a double bottom or a wedge bottom around the 20 bar EMA. Furthermore, they will look to sell a wedge top or a double top. A trend usually starts by the end of the 2nd hour.<h2>Friday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-trading-day-in-3-day-triangle-at-end-of-quarter.png\"><img src=\"2018-10-1.png\" alt=\"Emini trading day in 3 day triangle at end of quarter\"></a><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/EURUSD-Forex-micro-double-bottom-but-September-10-low-is-support-1.png\"><img loading=\"lazy\" src=\"2018-10-1-1.png\" alt=\"EURUSD Forex micro double bottom but September 10 low is support\"></a><p class=\"caption\">The EURUSD daily Forex chart sold off sharply last week. But, after September’s strong reversal up, the odds favor a higher low around the September 10 low and 1.15.<p><br>While last week’s selloff from a double top on the EURUSD daily Forex chart was strong, the bulls will probably get a higher low. The September 10 higher low and 1.15 are support, and are near the 50% pullback. Support is a magnet. Therefore, the odds favor slightly lower prices within a couple of weeks.<p>Since the chart is now in an early bull trend, the bulls will try for form a higher low. They would like the bull trend to resume quickly. But, the chart typically will get a 2nd leg down after last week’s buy climax at resistance. Consequently, if there is a 2 – 3 day rally this week, the bears will probably get a lower high and then a test of 1.15.<p>Since the daily chart is in the middle of a 5 month trading range, it could stay here for months before successfully breaking out. Therefore, traders will look for reversals after ever 1 – 2 week leg, no matter how strong.<h4>Low 2 bear flag at 20 week EMA on weekly chart</h4><p>Last week is a Low 2 sell signal bar on the weekly chart. The bulls are buying its low to prevent the weekly sell signal from triggering.<p>The odds favor a move below last week’s low this week, which would trigger the sell signal. But, the daily chart is in a bull trend. In addition, the 8 month selloff is probably a bull flag on the weekly chart. As a result, the reversal down on the weekly chart will probably only last 1 – 2 weeks before the 6 month trading range resumes.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart rallied 50 pips overnight from just above last week’s low. Today is forming a micro double bottom with Friday’s low. Since last week’s selloff was strong, this rally will probably form a lower high between 1.1650 and 1.17. Therefore, the bulls will take profits after any 30 – 50 pip rally and the bears will begin to sell.<p>The bulls would like the week to reverse last week’s selloff. Although this is possible, after a parabolic wedge top, a 2nd leg down is likely. Therefore, day traders will bet that every move up or down will not get far. They will take quick profits. Since last week was a sell climax to a support zone, the bulls will buy reversals up. With the bulls buying low and the bears selling high, this week will have a lot of trading range trading.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-gap-up-and-then-bear-channel.png\"><img loading=\"lazy\" src=\"2018-10-1-2.png\" alt=\"Emini gap up and then bear channel\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>By breaking above last week’s high, the Emini triggered a weekly buy signal. Since last week was a bear bar in an overbought bull trend on the weekly chart, it was a low probability buy setup. I pointed this out over the weekend and this morning.<p>By falling below Friday’s high, the Emini turned today’s gap up on the intraday charts into an exhaustion gap. This is minor on the daily chart. If this week trades below last week’s low, the week would be outside down. That would increase the chance of a test down to the 20 week EMA.<p>The bulls need bull bars closing near their highs if they are to break successfully above the September high. At the moment, the odds favor a pullback to the 20 week EMA, whether or not there is a brief new high 1st.<p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-10-1"
    }
  ],
  "2": [
    {
      "data": [
        "<article class=\"post-82061 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini doji bar in tight trading range to begin OctoberIntraday market update: Tuesday October 2, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini doji bar in tight trading range to begin October<br>Intraday market update: Tuesday October 2, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-10-02T06:20:15-07:00\">October 2, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini doji bar in tight trading range to begin October</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>By going above last week’s high, yesterday triggered a buy signal on the weekly chart. The bulls need to begin to form bull bars closing near their highs on the daily chart. Without that, the September high will probably be the high for the next several weeks.<p>Since last week was a bear bar, it is a low probability buy signal bar. Therefore, there might be more sellers than buyers above its high.<p>Furthermore, last week’s range was small. Consequently, this week might eventually trade below last week’s low. That would create an outside down bar on the weekly chart. Since the weekly chart is overbought, that could be the start of a pullback to the 20 week EMA.<p>Although yesterday gapped up, it fell below Friday’s high. The gap therefore became an exhaustion gap on the 60 minute chart. But, most exhaustion gaps are minor reversal setups, especially on smaller time frames. The bears will need a series of bear bars on the daily chart to convince traders that a move down to the 20 week EMA is underway.<p>The majority of the days over the past several weeks have had mostly trading range trading. In addition, most closed near their opens. That increases the odds of more trading range trading today. Trend traders need a series of trend bars up or down on the daily chart.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 4 points in the Globex session. Even though yesterday was a bear channel on the 5 minute chart, a bear channel is a bull flag. This means that the odds favor a breakout above the channel today. Channels usually transition into trading ranges, and that is what is likely today.<p>While yesterday was a bear day, it held above Friday’s bull trend reversal low. Therefore, it is still more likely a pullback from the 2 day rally than the start of a bear trend.<p>The Emini has been sideways for 2 weeks. Day traders have been looking for reversals. The tails on the bars on the daily chart indicate reversals. That will probably continue today. This is especially true since yesterday was a doji bar on the daily chart, which is sign of a neutral market.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-gap-up-and-then-bear-channel.png\"><img src=\"2018-10-2.png\" alt=\"Emini gap up and then bear channel\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex minor bear trend reversal but head and shoulders bottom</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/EURUSD-Forex-minor-bear-trend-reversal-but-head-and-shoulders-bottom.png\"><img loading=\"lazy\" src=\"2018-10-2-1.png\" alt=\"EURUSD Forex minor bear trend reversal but head and shoulders bottom\"></a><p class=\"caption\">After 5 consecutive bear days, the bulls will need a micro double bottom. They want a double bottom with the September 10 higher low. This would also be the right shoulder of a head and shoulders bottom.<p><br>As strong as the 5 day selloff has been on the EURUSD daily Forex chart, it is probably just a pullback to the middle of the 6 month trading range. It is about a 50% pullback, a test below the September 10 higher low, and a test of the 1.15 Big Round Number. If the bulls can stop the selling and create a small trading range over the next week or two, they will create a credible right shoulder of a Head and Shoulders Bottom.<p>Even though the odds favor an eventual successful breakout above the 6 month range, trading ranges resist breaking out. Consequently, the trading range could continue for several more months. Traders who bet on reversals after every 5 – 10 day move have been making money. Until there is a clear, strong breakout out of the range, traders will buy low, sell high, and take profits within a few days.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart sold off 70 pips overnight, but reversed up 40 pips after falling below the September 10 low. Since 1.15 is a Big Round Number, the bears will probably get a test below it within a week.<p>The daily chart is in the buy zone since it is at the support on the daily chart. Therefore, despite 5 bear days, the bulls will buy reversals up. The 1st reversals up will be minor. This means that the bulls will mostly scalp for 10 – 20 pips today.<p>But, the daily chart is oversold and now at support. Consequently, the bears will sell rallies, not at new lows. In addition, they will take profits after 10 – 30 pip selloffs.<p>Because the daily chart is at support, the odds are that it will begin to enter a trading range for a week or more. This will limit the size of the swings on the 5 minute chart.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-inside-day-abd-bear-trend-reversal-day-at-last-weeks-high.png\"><img loading=\"lazy\" src=\"2018-10-2-2.png\" alt=\"Emini inside day abd bear trend reversal day at last week's high\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>The Emini reversed up from above yesterday’s low. However, it stayed below yesterday’s high. After reversing down, it stayed above yesterday’s low. Today was therefore an inside bar on the daily chart. It was also a doji day, which is a weak buy and sell signal bar for tomorrow. The 3 week trading range shows no sign of breaking out yet. The daily chart is still deciding on a new high or a test down to the 20 week EMA.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-10-2"
    }
  ],
  "3": [
    {
      "data": [
        "<article class=\"post-82063 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini weak buy signal ahead of October unemployment report Intraday market update: Wednesday October 3, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weak buy signal ahead of October unemployment report<br>Intraday market update: Wednesday October 3, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-10-03T06:20:48-07:00\">October 3, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini weak buy signal ahead of October unemployment report</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Last week was a bear inside bar in a bull trend on the weekly chart. It is therefore a weak buy signal.<p>Yesterday was a doji inside day on the daily chart. Consequently, it, too, is a weak buy and sell signal bar for today. This is especially true since the Emini is near the top of a 3 week trading range. The odds favor continued intraday trading range trading until there is a clear breakout up or down on the daily chart.<p>There is almost a 50% chance that the September high is the start of a move down to the 20 week EMA. While the odds slightly favor a new high, a new high would be the 3rd leg up from the August 15 low. Consequently, the bears will sell a reversal down, betting on a test of the 20 week EMA.<h3>Overnight Emini Globex trading</h3><p><br>The Emini had a big gap up open. That increases the chance of a trend day, and up is more likely. But, there is an 80% chance of a trading range for the 1st hour. The bulls do not want to pay much more than average. This usually results in a sideways market until the Emini tests the EMA. At that point, the bulls look for a wedge bottom or a double bottom. The bears want a double top or a trend from the open bear trend.<p>Since most of the days over the past several weeks have been trading range days, the odds are that today will be another one. But, if there is a series of strong trend bars up or down, traders will swing trade. At the moment, the Emini is pulling back to test last week’s high.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-inside-day-abd-bear-trend-reversal-day-at-last-weeks-high.png\"><img src=\"2018-10-3.png\" alt=\"Emini inside day abd bear trend reversal day at last week's high\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/EURUSD-daily-Forex-chart-has-sell-climax-at-support.png\"><img loading=\"lazy\" src=\"2018-10-3-1.png\" alt=\"EURUSD daily Forex chart has sell climax at support\"></a><p class=\"caption\">PLEASE INSERT FXCAPTION<p>After 5 bear days, traders today sold above yesterday’s high. In addition, many bulls do not want to buy until there is at least a micro double bottom and a test of the 1.15 Big Round Number. However, the daily chart is at support. Therefore, the odds are that the selling will stop around 1.15 and the chart will begin to go sideways for a few days.<br><h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart rallied and reversed down overnight. There were sellers above yesterday’s high, and there will probably be buyers below its low and around the 1.15 Big Round Number. The overnight reversal is probably the start of a trading range day. Since the daily chart is oversold and at support, the downside is probably small. After 5 bear days, the upside is small as well. Consequently, today will probably be a trading range day.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-bear-trend-resumption-day.png\"><img loading=\"lazy\" src=\"2018-10-3-2.png\" alt=\"Emini bear trend resumption day\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>The Emini gapped up, but reversed down from just below the September all-time high. It then twice tested last week’s high and reversed up. After a 4 hour triangle, the bears got their trend reversal down.<p>Today is a sell signal bar for tomorrow on the daily chart. But the Emini has been sideways for 3 weeks and there is no sign yet of a breakout in either direction. The weak late September rally increases the chances of a 2 – 3 week pullback beginning soon.<p>The bulls want a new all-time high. However, since that would be the 3rd leg up from the August 15 low, the bears would try to create a wedge reversal down if the bulls get their new high.<p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-10-3"
    }
  ],
  "4": [
    {
      "data": [
        "<article class=\"post-82065 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini testing September all time high before unemployment reportIntraday market update: Thursday October 4, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini testing September all time high before unemployment report<br>Intraday market update: Thursday October 4, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-10-04T06:20:50-07:00\">October 4, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini testing September all time high before unemployment report</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini gapped up yesterday, but then enter a triangle. There was a trend reversal down at the end of the day. While yesterday is a sell signal bar on the daily chart, it has a prominent tail below. Furthermore, the 2 week tight trading range reduces the chances of a bear trend today.<p>The Emini is deciding between a reversal down from below the September high or one more new high. If there is a new high, there will probably be a wedge top and then a reversal down.<p>The daily, weekly, and monthly charts are in bull trends. But, the weekly chart is overbought and the rally is stalling just above the January high resistance. This makes a pullback to the 20 week EMA increasingly likely. If the bears get their pullback, it will probably only last 2 – 3 weeks, like all of the other pullbacks in 2018.<p>Most of the days over the past 3 weeks have prominent tails on the daily chart. This means that they had reversals and were primarily trading range days. That is likely again today, especially ahead of tomorrow’s unemployment report.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 13 points in the Globex session. With each of the past 5 days having reversals, the odds favor at least one reversal today. This is especially true ahead of tomorrow’s unemployment report.<p>Today will probably gap down below the trend line from the June 28 and August 15 low. The bulls want it to be support and will try to create a reversal up.<p>When there is a big gap, there is only a 20% chance of a big trend day up or down. When the gap is down, like today, if there is a trend, down is more likely.<p>In 80% of days with big gaps, the Emini usually enters a trading range for the 1st 30 – 90 minutes. The bears typically try to create a wedge bear flag or double top at the EMA. The bulls want a double bottom or a wedge bottom.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-bear-trend-resumption-day.png\"><img src=\"2018-10-4.png\" alt=\"Emini bear trend resumption day\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/EURSUD-Forex-outside-down-sell-climax-at-support.png\"><img loading=\"lazy\" src=\"2018-10-4-1.png\" alt=\"EURSUD Forex outside down sell climax at support\"></a><p class=\"caption\">The EURUSD daily Forex chart sold off strong for 6 days and is now at the support of the September 10 low, the 1.15 Big Round Number, and a 50% pullback. Yesterday was a big outside down day and therefore a sell climax at support.<p><br>The EURUSD daily Forex chart is in a sell climax down to support. Yesterday’s huge outside down day is probably an exhaustive end of the selling for the next week or two. But, there might be one more minor low after tomorrow’s unemployment report.<p>The bears want the selloff to be a reversal down from a double top with the July 9 high. There is a 40% chance that a strong selloff from a double top will break below the neck line and fall for about a measured move down. Therefore, there is a 60% chance that it will not, even if there is a small break below the August 15 low, which is the neck line.<p>In this particular case where the market reversed up strongly from a Final Bear Flag on the weekly chart, there is a 60% chance that this selloff will form a higher low. But, if it begins to form lower highs, the probability of a successful breakout below the August low will go up.<h4>Sell climax at support</h4><p>Since yesterday was probably a sell vacuum down to support, the bears are exhausted. They will therefore take profits, and switch to selling rallies from selling at the market. This will probably create a 150 pip tall trading range over the next week. The 1st target for the bulls is always the top of the most recent sell climax, which is yesterday’s high.<p>When a selloff is strong like this one, the bulls typically need at least a small double bottom before they can get a big reversal up. Consequently, the daily chart will probably go sideways for at least a week.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart reversed up overnight from below yesterday’s low. The exhausted bears are taking profits and will look to sell higher. Furthermore, they know there is support around yesterday’s low. This will make them take profits on selloffs near that low.<p>The bulls also know that the bears will switch to selling rallies and buying around prior lows. They therefore will buy around prior minor lows and take profits on rallies. With both the bulls and bears buying low and selling high, the 5 and 60 minute charts will begin to form a trading range.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-breakout-test-of-January-high-in-outside-down-week.png\"><img loading=\"lazy\" src=\"2018-10-4-2.png\" alt=\"Emini breakout test of January high in outside down week\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>The Emini had a big bear trend day today. It finally broke below the 5 month bull trend line. However, it was a big enough bear today to make follow-through selling likely over the next 1 – 2 weeks. This is true even if tomorrow rallies after the unemployment report.<p>After the strong reversal up at the end of the day, the bulls are hoping that today was just a sell vacuum test of the January high. Tomorrow might even rally back above last week’s high. This week would then be both and outside down and an outside up week. That would be a sign of strong bulls. Since the weekly chart is overbought and this week is now an outside down week, the odds favor lower prices next week. But, tomorrow’s unemployment report could significantly change the appearance of the weekly chart.<p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-10-4"
    }
  ],
  "5": [
    {
      "data": [
        "<article class=\"post-82067 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini testing January high ahead of unemployment report Intraday market update: Friday October 5, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini testing January high ahead of unemployment report<br>Intraday market update: Friday October 5, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-10-05T06:20:09-07:00\">October 5, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini testing January high ahead of unemployment report</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini sold off strongly yesterday, but reversed up from a dip below the January high. In fact, it rallied back above last week’s low. Therefore the bulls are hoping that this is just a test of major support.<p>However, the week is now an outside down week and the weekly chart is overbought. Yesterday might be a Give Up bar on the daily chart. If the bulls are giving up, the bears will probably get a couple legs down to around the 20 week EMA.<p>When there is a breakout, traders watch for follow-through. If today is a bull bar closing on its high, the bulls will expect the breakout to fail. They will then buy next week.<p>There is even a 30% chance that today will rally back above last week’s high. That would make the week outside up after being outside down. This would be a sign of strong bulls.<p>Since the weekly chart is overbought, the odds are that there will be lower prices over the next 2 weeks. Day traders will look to sell rallies to resistance, like the 60 minute EMA and last week’s low.<p>Because yesterday was a sell climax, there is a 75% chance that today will have at least a couple hours of sideways to up trading, beginning by the end of the 2nd hour.<h3>Overnight Emini Globex trading</h3><p><br>The Emini had a brief rally and then a brief reversal down on the unemployment report. As was likely after yesterday’s sell climax, it traded sideways overnight. It is currently down 6 points in the Globex session.<p>Yesterday’s late rally began at the January high and ended at last week’s low. These are important prices and the Emini might trade sideways within this range today.<p>Because today is Friday, there is an increased chance of a trend up or down in the final hour. Since last week was a sell signal bar on the weekly chart, the bears want today to close below last week’s low. Additionally, they would like the week to close below the September high. If they get either or both, it would increase the odds of lower prices over the next 2 weeks.<p>The bulls always want the opposite. But, to erase yesterday’s damage, they would need today to close back above last week’s high.<p>Yesterday’s big late reversal up created confusion. That usually results in at least a couple trading range days.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-breakout-test-of-January-high-in-outside-down-week.png\"><img src=\"2018-10-5.png\" alt=\"Emini breakout test of January high in outside down week\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/EURUSD-Forex-sell-climax-down-to-support-as-US-interest-rates-rise.png\"><img loading=\"lazy\" src=\"2018-10-5-1.png\" alt=\"EURUSD Forex sell climax down to support as US interest rates rise\"></a><p class=\"caption\">Yesterday was a bull day after a 6 day selloff down to support on the EURUSD daily Forex chart. There will probably be a trading range between 1.15 and 1.1650 for over the next week or two.<p><br>The EURUSD daily Forex chart sold off for 6 days down to support. Wednesday was an especially big outside down day and therefore climactic. It and yesterday are at the support of a 50% pullback from the rally from August 15, the September 10 higher low, and the 1.15 Big Round Number. This will probably halt the selling for at least a week. Consequently, bulls will buy below the prior day’s low and on reversals up.<p>Since the selling was strong, the bears will sell the 1st reversal up. The high of a sell climax is a magnet because weak bears put their stops just above. This will probably result in a test of Wednesday’s high and 1.16 within a week.<p>But, when the selling is as strong as this has been, the bears know that the 1st reversal up is typically minor. They therefore will sell the 1st rally to resistance. Other resistance above is the 20 day EMA and a 50% pullback, which is around 1.1650<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart briefly bounced on the unemployment report. The report therefore so far appears unimportant. Because the daily chart has a sell climax down to support, day traders expect a trading range. They will therefore buy around the prior day’s low and on reversals up, and sell around the prior day’s high and on reversals down.<p>Furthermore, they expect that strong breakouts will not have strong follow-through as long as the 6 month range continues. This will make them look for reversal setups rather than strong trends. The developing small trading range will probably last for at least a week. The low will probably be around yesterday’s low or within about 50 pips below. Traders will look for a top above Wednesday’s high up to around 1.1650.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-strong-bear-trend-with-late-bull-trend-reversal.png\"><img loading=\"lazy\" src=\"2018-10-5-2.png\" alt=\"Emini strong bear trend with late bull trend reversal\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>The Emini sold off strongly to just above the September 7 low and the bull trend line. It reversed up sharply and closed back above the January high. The Emini is still deciding if the breakout above the January high will continue up to the measured move targets on the weekly chart. If the bull trend does not resume soon, the bulls will give up and wait to buy lower.<p>The 2 day selloff was surprisingly strong. That makes at least a small 2nd leg down likely over the next few weeks. However, today’s reversal up was strong enough so that the Emini might go sideways to up for a week or more before the 2nd leg down begins. The reversal up creates confusion, and confusion usually leads to at least a day or two of sideways trading.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-10-5"
    }
  ],
  "6": [
    {
      "data": [
        "<article class=\"post-82071 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini outside down week likely start of October pullback to 2800Emini weekend update: October 6, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini outside down week likely start of October pullback to 2800<br>Emini weekend update: October 6, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-10-06T00:30:55-07:00\">October 6, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Bear bar in 7 month bull micro channel</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-monthly-candlestick-chart-has-bear-bar-in-7-month-bull-micro-channel.png\"><img loading=\"lazy\" src=\"2018-10-6.png\" alt=\"Emini monthly candlestick chart has bear bar in 7 month bull micro channel\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has not had a pullback in 7 months. Last month was a doji bar, which is a sign of a loss of momentum. This month so far is a bear bar.<p>The monthly S&amp;P500 Emini futures candlestick chart rally is stalling just above the January high. Every low for the past 6 months is above the low of the prior month. This is now a 7 month bull micro channel. Since that is getting extreme, the odds of a pullback are increasing. Therefore, October is likely to trade below the September low, or November will pull back below October.<p>A micro channel is a climax, but it is also a sign of strong bulls. Consequently, the bulls will probably buy the 1st pullback. Traders should expect buyers below the September low.<p>Can the pullback instead be a higher high major trend reversal, compared to the January high? There is only a 30% chance of a bear trend without at least a micro double top. Therefore, as strong as the selling was this week, the downside will probably be limited to a month or two.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Emini outside down week likely start of October pullback to 2800</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-weekly-candlestick-chart-has-an-outside-down-week-and-a-micro-double-top.jpg\"><img loading=\"lazy\" src=\"2018-10-6-1.jpg\" alt=\"Emini weekly candlestick chart has an outside down week and a micro double top\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart reversed down from above last week’s high and traded below last week’s low. This week therefore is an outside down week.<p>The weekly S&amp;P500 Emini futures candlestick chart was overbought and it is beginning to form bear bars. This week was an outside down bar and it closed below last week’s low. It is probably the start of a pullback to the 20 week EMA. Even if the Emini tests back to the middle of the 2018 range, the odds still favor a rally to the measured move targets at around 3,100 and 3,200 before a break below the February low.<p>The bears need follow-through selling next week. If next week is a big bear bar closing near its low and below this week’s low, the selloff might retrace 50% of the 6 month rally. That is unlikely.<p>If instead next week is a big bull trend bar, it will erase this week’s bearishness. This is also unlikely. If it were to happen, traders would conclude that this week was simply a brief test of the January high and the September low, and the bull trend was intact.<p>Every pullback in 2018 ended by the 3rd week. Traders should expect this one to be brief as well. However, the weekly EMA is about 100 points below the September high. In addition, the pullback could test the March 13 high and the August 2 low at around 2800. Consequently, a 100 – 150 point pullback in 2 – 3 weeks means that the selloff might be fast.<h4>Outside bar increases chance of inside bar</h4><p>Whenever there is an outside bar, there is an increased chance of an inside bar for the next week. If next week is a bull inside bar, there would be an inside-outside-inside (ioi) pattern on the weekly chart. This is a Breakout Mode pattern. A bear inside bar is a good sell signal bar, while a bull inside bar would increase the odds of higher prices next week.<p>However, the selling was strong enough this week to make a pullback to the 20 week EMA likely, and a pullback to 2800 reasonable. This is true even if next week is an inside bar or mostly overlaps this week, or if the Emini stays sideways for a few weeks.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Break below 5 month bull trend line</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-daily-chart-has-double-bottom-but-2nd-leg-down-likely.png\"><img loading=\"lazy\" src=\"2018-10-6-2.png\" alt=\"Emini daily chart has double bottom, but 2nd leg down likely\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart sold off for 3 days to test the bull trendline from the May 3 and June 28 lows. It also broke below last week’s low, which is the neck line of a 3 week double top. However, the big tails at the bottom of the 2 big bear days increase the chance of a bounce from a double bottom with the September 7 low.<p>Over the past 3 weeks, I have been writing that the September rally lacked consecutive strong bull bars, and it was therefore probably a bull leg in a trading range and not a resumption of the bull trend. Furthermore, I said that a trading range has legs up and down, and therefore traders should expect a selloff to test the September 7 low at the bottom of the range. This week achieved that objective.<p>So, what happens next? The bulls see the big tails on the bottom of Thursday’s and Friday’s bars. They hope that the Emini will form a double bottom bull flag with the September 7 low. While those tails represent buying, the selloff was strong enough for traders to expect a break below the September low.<p>This is true even if the Emini rallies next week from the September 7 low. The odds favor either a breakout below early next week or a rally to a lower high, and then a bear breakout.<h4>Head and shoulders top major trend reversal unlikely</h4><p>If the Emini rallies to a lower high, it would be a lower high major trend reversal and the right shoulder of a head and shoulders top. But, even a perfect top only has a 40% chance of leading to a bear trend. As a result, whatever selloff that comes over the next few weeks will still probably only be a deep pullback in a bull trend.<p>If the bears get consecutive closes below the September 7 low, traders will look for a measured move down based on the height of the September trading range. That would be around 2800, the August 2 low, and the March 13 high. Since it is a confluence of support, it is a reasonable target for the pullback.<p>I haven’t seen any TV pundit talk above a break below the February low. That is because it is currently a low probability bet. However, traders should constantly be aware of the opposite of what they think is likely. It is always more likely that you think.<p>Yes, the odds favor a new all-time high, even if this selloff falls to 2800. However, there is still a 30% chance of a break below the February low before the Emini reaches the measured move targets on the weekly chart. If there is a strong selloff over the next few weeks, that probability will increase to 40%, and even 50% if the Emini quickly falls to 2700.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-10-6"
    }
  ],
  "8": [
    {
      "data": [
        "<article class=\"post-82069 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini October correction testing January highIntraday market update: Monday October 8, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini October correction testing January high<br>Intraday market update: Monday October 8, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-10-08T06:20:09-07:00\">October 8, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini October correction testing January high</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini broke far below the 5 month bull trend line on Thursday and tested the 6 month bull trend line on Friday. It reversed up strongly from just above the trend line and the September 7 low. The reversal up was strong enough to have follow-through buying early this week.<p>Last week was an outside down week on the weekly chart. That increases the odds of an inside week this week. This is especially true because Friday’s reversal up was strong and it came from major support. In addition, the daily chart is in a bull trend. Therefore, the odds are against a series of 3 – 5 consecutive big bear days.<p>However, last week was an outside down week on the weekly chart, and the weekly chart was overbought. Traders should expect more selling for at least another 2 – 3 weeks, even if the Emini goes sideways to up this week. It might even test above a 50% retracement before it has a 2nd leg down.<p>A reasonable 1st target for the bears is the 20 week EMA, which is just below 2850. Therefore, traders will sell 1 – 5 day rallies.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 7 points in the Globex market. After 2 exhaustive sell climax days, the odds are against a big bear day today. The Emini will try to rally from the support of the September 7 low. Traders will buy selloffs.<p>But, after 2 big days down, they will also sell rallies, betting that the 1st reversal up will be minor. Traders buying low, selling high, and taking quick profits should create a trading range for the next 2 – 5 days. Because last week had big swings, today will probably have big swings as well, even if it is in a trading range.<h2>Friday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-strong-bear-trend-with-late-bull-trend-reversal.png\"><img src=\"2018-10-8.png\" alt=\"Emini strong bear trend with late bull trend reversal\"></a><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex possible micro double bottom at support in sell climax</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/EURUSD-Forex-possible-micro-double-bottom-at-support-in-sell-climax.png\"><img loading=\"lazy\" src=\"2018-10-8-1.png\" alt=\"EURUSD Forex possible micro double bottom at support in sell climax\"></a><p class=\"caption\">The EURUSD daily Forex chart so far has another bear trend day today. But, it is testing the support of the September 10 double bottom, the 1.15 Big Round Number, and about a 50% retracement of the September rally. The bulls will try to create a micro double bottom today or tomorrow with Thursday’s low.<p><br>The EURUSD daily Forex chart sold off strongly over the past 2 weeks. So far, today is another bear day.<p>But, as strong as the selling has been, it is still only about a 50% retracement of the September rally. Furthermore, it is at support. Consequently, the daily chart will probably form a micro double bottom today or tomorrow with Thursday’s low. In addition, the bulls will probably create a 150 pip rally up to the high of Wednesday’s outside down sell climax. That high is 1.1596, so the 1st target is around 1.1600, which is also around the 20 day EMA.<p>The bears want relentless selling to far below the August 15 low of 1.1301. They have a 30% chance of success. Today is in the middle of a 6 month trading range. The odds are that the selling will stop this week. In addition, the bulls will probably get a 150 pip bounce.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart sold off 70 pips overnight. Since the selloff is testing last week’s low, it is at support.<p>The 5 minute chart has been in a 25 pip range for the past 5 hours. The bears are beginning to take profits and the bulls are beginning to buy at support on the daily chart.<p>Even though the overnight bear channel was tight, most of the bodies were small. In addition, most bars had prominent tails and overlapped the prior 2 – 5 bars. This looks more like a bear leg in a trading range than a bear trend.<p>Since the daily chart has begun to form a trading range over the past 4 days at support, the odds are that the 5 minute chart will begin to spend more time in trading ranges this week.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-bull-trend-reversal-at-confluence-of-support.png\"><img loading=\"lazy\" src=\"2018-10-8-2.png\" alt=\"Emini bull trend reversal at confluence of support\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>The Emini reversed down on the open from a lower high and a test of Friday’s close. It broke below Friday’s low, which was the low of last week. However, it found support at the September 7 low and entered a trading range. Since the open of the day was in the middle 3rd of the day’s range, it was a magnet at the end of the day.<p>Yet, it did not stop the rally. The reversal reached a new high of the day and the 60 minute EMA. Today is a buy signal bar for tomorrow. But, after 2 big bear days, any reversal up will probably be minor.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-10-8"
    }
  ],
  "9": [
    {
      "data": [
        "<article class=\"post-82279 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini sell climax at September low for minor reversal up Intraday market update: Tuesday October 9, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini sell climax at September low for minor reversal up<br>Intraday market update: Tuesday October 9, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-10-09T06:20:35-07:00\">October 9, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini sell climax at September low for minor reversal up</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Yesterday was a bull trend reversal day at support. It reversed up after breaking below the September low, the bottom of the bull channel, and last week’s low, which was also Friday’s low. It closed on its high and is a buy signal bar for today. However, last week’s selloff was strong. There, the odds favor a minor reversal up to a lower high instead of a resumption of the bull trend on the daily chart.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 13 points in the Globex session. It will therefore probably open in the middle of yesterday’s range. Since yesterday was a buy climax, there is a 75% chance of at least a couple hours of sideways to up trading today starting by the end of the 2nd hour. With the big gap down, it will probably begin on the open.<p>The past 3 days had early big selloffs and then reversals up. They formed a wedge bottom, and yesterday’s midday rally might be the start of 2 legs sideways to up. Consequently, the bulls will be looking for an early low of the day and a swing up.<p>Since the Emini has probably begun a move down to 2800 on the daily chart, day traders need to expect big downside surprises. Therefore, if today breaks strongly below yesterday’s low, it might create a failed break below the 3 day wedge bottom. The result could be a big bear day. However, the odds favor sideways to up today.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-bull-trend-reversal-at-confluence-of-support.png\"><img src=\"2018-10-9.png\" alt=\"Emini bull trend reversal at confluence of support\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex strong bear leg in 6 month trading range</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/EURUSD-Forex-final-bear-flag-but-needs-buy-signal-bar.png\"><img loading=\"lazy\" src=\"2018-10-9-1.png\" alt=\"EURUSD Forex final bear flag but needs buy signal bar\"></a><p class=\"caption\">The EURUSD daily Forex chart broke below a 2 day bear flag. However, the selloff is still probably a strong bear leg in the 6 month trading range.<p><br>The EURUSD daily Forex chart has been selling off for 3 weeks after forming a double top with the July 9 high. There is a 40% chance of a strong breakout below the August 15 low. Trading ranges have strong breakout attempts up and down, and this one has had many. While ultimately there will be a breakout, betting that any one leg will be the one that succeeds is a low probability trade. It is easier to make money looking for reversals near the top and bottom.<p>The daily chart is now in the bottom third of the 6 month range. There still is room to the bottom at 1.13. Therefore, the bears will continue to sell as long as the momentum down is strong. However, the chart is in the buy zone. The bulls are looking for a reversal up. They need a strong buy signal bar for a Final Bear Flag reversal up. The 2 day pullback last week is a potential Final Flag. Alternatively, they will need a micro double bottom. They will wait for a bull day and then look to buy.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute chart had another leg down overnight. It fell in a channel that had 3 legs. This is therefore a Spike and Channel bear trend. Typically, there is a reversal up and a transition into a trading range. Day traders will look for that today.<p>Since the daily and 60 minute charts are oversold and the daily chart is in the buy zone, the 5 minute chart will probably not fall much further today. But, the overnight bear channel is tight. That typically limits rallies. The odds therefore favor a 50 pip trading range today.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-trading-range-day-after-wedge-bottom.png\"><img loading=\"lazy\" src=\"2018-10-9-2.png\" alt=\"Emini trading range day after wedge bottom\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>The Emini rallied from a higher lower major trend reversal. It triggered the buy signal on the daily chart by going above yesterday’s high. But, it spent the day in a trading range and failed to close above yesterday’s high.<p>The bulls might get another day or two of higher prices, but last week’s selloff was strong. Furthermore, the 20 week EMA is not far below and it is an important magnet. Therefore, the odds are that any rally this week will form a lower high. The Emini has probably begun a test of 2800.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-10-9"
    }
  ],
  "10": [
    {
      "data": [
        "<article class=\"post-82281 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini pullback to bear flag after last week’s strong selloffIntraday market update: Wednesday October 10, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini pullback to bear flag after last week’s strong selloff<br>Intraday market update: Wednesday October 10, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-10-10T06:20:00-07:00\">October 10, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini pullback to bear flag after last week’s strong selloff</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>On Monday, the Emini reversed up from the bottom of the bull channel on the daily chart and from the September 7 low. It was a good buy signal bar at this support. Yesterday triggered the buy signal on the daily chart by going above Monday’s high. However, since it was only a doji bar, it was a weak entry bar.<p>Yesterday is also a Low 1 bear flag sell signal bar. But, it has a bull body and it followed a strong buy signal bar. This makes it likely that there will be more buyers than sellers below yesterday’s low.<p>Yet, the 3 day selloff was strong. Therefore, any rally this week will probably form a lower high. Although the daily chart is still in a bull trend, it is now in a bear leg. Since the weekly chart is overbought and the 20 week EMA is not far below, a rally on the daily chart will probably form a lower high. The odds favor a test of the 20 week EMA. Furthermore, there is other support at the June high and August low at around 2800. Consequently, that is a reasonable target for the bears over the next few weeks.<p>The 5 minute chart reversed up yesterday from a 3 day wedge bottom. It therefore might rally more today. But, the rally will probably be limited to a few days. The Emini is probably working its way down to 2800.<h4>The importance of this week on the weekly chart</h4><p>Yesterday formed a triangle on the 5 minute chart after 3 days will big swings. Today will probably again be mostly sideways. The Emini might wait until the end of Friday to decide on how bearish this week will be.<p>The bears want a big bear trend bar on the weekly chart. That is unlikely at this point. At a minimum, they want the week to have a bear body and close near the low of the week. That would be below the January high and the September 7 low. It would therefore increase the chance of a move down to 2800.<p>The bulls always want the opposite. However, since the 20 week EMA is a magnet just below, the Emini will probably get there over the next few weeks by going sideways to down. Consequently, even if this week closes on its high, the upside is probably limited next week.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 10 points in the Globex market. It therefore might gap below yesterday’s low. While that would trigger a Low 1 sell signal on the daily chart, the consecutive bull days at support make it likely that the Emini will rally up from below yesterday’s low.<p>The 3 days of strong selling transitioned yesterday into a trading range. The sideways trading will probably continue for the rest of the week.<p>But, since this selloff will probably continue down to 2800 over the next few weeks, big bear trend days are more likely to occur. That means that day traders always need to be ready for relentless selling, even when after consecutive bull days at support.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-trading-range-day-after-wedge-bottom.png\"><img src=\"2018-10-10.png\" alt=\"Emini trading range day after wedge bottom\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD daily Forex chart forming higher low in 6 month trading range</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/EURUSD-daily-Forex-chart-forming-higher-low-in-6-month-trading-range.png\"><img loading=\"lazy\" src=\"2018-10-10-1.png\" alt=\"EURUSD daily Forex chart forming higher low in 6 month trading range\"></a><p class=\"caption\">The EURUSD daily Forex chart reversed up yesterday after a 2 day bear flag. Since yesterday was only a doji bar, it is a weak buy signal bar. Additionally, the bear channel is tight. Therefore, there might be one more small leg down before a rally up to the October 3 sell climax high.<p><br>The EURUSD daily Forex chart reversed up yesterday from a higher low. But, yesterday was only a doji bar and the 3 week bear channel is tight. This is not a strong buy setup. It increases the chance of one more brief new low and then a wedge bottom.<p>Whether the rally began yesterday or will begin later this week, the tight bear channel makes a minor reversal up likely. This means a week or two up to resistance, and then a test back down. Tight bear channels usually need some type of double bottom before the bulls can take control.<p>Since the reversal up from the August 15 low was strong and the monthly chart is still likely to have a 2nd leg up, there is a 60% chance of a breakout above the 6 month trading range before there is a breakout below. But, trading ranges resist breaking out, as anyone can see by looking at all of the reversals over the past 6 months. There is no reason to believe that the range is about to break out up or down.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart has been in a 40 pip range overnight. Traders are deciding if there will be a 3rd push down to a wedge bottom before a 2 week rally. Since the 3 week selloff was climactic, but is now losing momentum, the market will probably transition more into a trading range for several days. Day traders will look for reversals and 10 – 20 pip scalps.<p>If there is a selloff below Monday’s low down to 1.14, the bulls will buy it, betting on a small wedge bottom. The bears will look for swing trades if there is a rally up to the October 3 sell climax high at around 1.16. The result will be a 200 pip trading range for the next couple of weeks.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-bear-trend-from-the-open.png\"><img loading=\"lazy\" src=\"2018-10-10-2.png\" alt=\"Emini bear trend from the open\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>The Emini broke strongly below the 3 day wedge on the 60 minute chart. For the past several weeks, I have said that the September rally looked weak. Furthermore, I said that the Emini would therefore have a bear leg, and that it would probably fall to the 20 week EMA. It reached that target today. Finally, I said that it was close enough to a confluence of support around 2800 to make 2800 a likely target. The Emini reached that target at the end of the day today.<p>Tomorrow is the follow-through day after a big bear breakout. If tomorrow is a big bear day, the odds will favor a to the next major higher low on the weekly chart at around 2700. That is close enough to last year’s close of 2689.75 to make a dip below that price increasingly likely.<p>On the other hand, if tomorrow is a bull day, there would be a small chance of a quick reversal up next week. At the moment, the odds favor at least slightly lower prices, even if there is a bounce for a day or two. Today was such a strong bear day that there is now a 40% chance of a test of the February low.<p>About half of today’s selling was related to the gamma of options and the resultant hedging by options selling firms. However, today violated many technical levels, and that makes lower prices likely over the next couple of weeks.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-10-10"
    }
  ],
  "11": [
    {
      "data": [
        "<article class=\"post-82283 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini correction could give back all of 2018 gains Intraday market update: Thursday October 11, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini correction could give back all of 2018 gains<br>Intraday market update: Thursday October 11, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-10-11T06:20:00-07:00\">October 11, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini correction could give back all of 2018 gains</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>For the past month, I said that the Emini looked weak and that it would probably pull back to the 20 week EMA. The bears accomplished that goal yesterday. Furthermore, I said that it probably test 2800. Yesterday closed below 2800. If there is strong follow-through selling within the next few days, the Emini might test last year’s close of 2689.75. This would give back all of 2018’s gains.<p>After yesterday’s sell climax, there is a 25% chance of another big bear trend day today. However, there is a 75% chance of at least a couple hours of sideways to up trading starting by the end of the 2nd hour.<p>Yesterday was a surprisingly big day. A huge Surprise Day has a 75% chance of at least a 2nd small leg sideways to down within the next 5 bars. The bulls and bears will sell the 1st 1 – 3 day rally. However, traders might buy a 1 – 3 day test down to yesterday’s low. This could create a micro double bottom and end the October selloff. This is what we will find out over the next week.<h4>Option selling firms sell stocks to hedge their short puts</h4><p>Yesterday was not as bearish as it appears. About half of the selling was caused by options selling firms who were hedging their short puts. As the Emini falls, those short puts gain in value at an increasing rate (option gamma). The selling firms have to sell stocks and futures to hedge their short puts. Their selling accounts for about half of the selling on a day like yesterday.<p>By the close, they are fully hedged. Therefore, half of the reason for the selling no longer exists. In addition, since half of the selling was not due to fundamentals, the price ended up lower than what the fundamentals would dictate. That is why bull days so often follow big bear days.<p>Will today be a big bull day? There is only a 25% chance. Even though option selling firms were hedging, the selloff violated many technical levels. That will make other traders sell. The odds are that the Emini will go at least a little low lower and possibly test last year’s close within a couple weeks.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 4 points in the Globex session. While today’s range will probably be much smaller than yesterday’s, it will likely be much bigger than the average range of the past several months. Therefore, even though today will probably have a lot of trading range trading, the legs up and down will be big. Day traders should therefore look for bigger profits on swings and scalps until the bars and the legs get back to normal size.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-bear-trend-from-the-open.png\"><img src=\"2018-10-11.png\" alt=\"Emini bear trend from the open\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex head and shoulders bottom</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/EURUSD-Forex-higher-low-major-trend-reversal.png\"><img loading=\"lazy\" src=\"2018-10-11-1.png\" alt=\"EURUSD Forex higher low major trend reversal\"></a><p class=\"caption\">The EURUSD daily Forex chart reversed up strongly for 3 days. This is a higher low major trend reversal and a head and shoulders bottom.<p><br>Despite the 3 day rally from a higher low major trend reversal bottom, only 40% of major reversal setups lead to strong trends. Therefore, this 3 day rally will probably be minor, which means another leg in the 6 month trading range. It is near a 50% retracement of the 3 week selloff.<p>Also, I have been saying that the chart would probably enter a trading range between 1.14 and 1.16 for a couple of weeks. The momentum up is strong and therefore the bears will likely need a micro double top before they can create a leg down.<p>If there is a selloff within a couple of weeks, it probably will reverse up from around this week’s low. That would create a double bottom higher low major trend reversal. It would have a better chance of leading to a breakout above the 6 month trading range.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart rallied 80 pips over night. However, it is now around the top of the October 3 sell climax, which is resistance. It is the target I have mentioned several times over the past week. In addition, the day’s range is already big compared to other days on the daily chart. Furthermore, the overnight rally had a series of brief breakouts followed by tight trading ranges. This is a series of buy climaxes. It typically evolves into a trading range. Therefore, the upside from here is probably small today. The overnight bull trend will likely evolve into a 40 – 50 pip trading range soon. Day traders will probably scalp for 10 – 20 pips, betting on reversals.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-correction-giving-back-all-of-2018-gains.png\"><img loading=\"lazy\" src=\"2018-10-11-2.png\" alt=\"Emini correction giving back all of 2018 gains\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>The Emini had a big bear body today, despite the late reversal. Look back at the 1st half of the year. You will see that the year oscillated around last year’s close. The odds now are that the Emini will fall below 2700 and test that level again.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-10-11"
    }
  ],
  "12": [
    {
      "data": [
        "<article class=\"post-82285 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini giving back all of 2018 gains on test of 2700 Intraday market update: Friday October 12, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini giving back all of 2018 gains on test of 2700<br>Intraday market update: Friday October 12, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-10-12T06:20:57-07:00\">October 12, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini giving back all of 2018 gains on test of 2700</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Since yesterday was another big bear day on the daily chart, the Emini will probably test the next major support at 2700 within a few weeks. Look at the 1st half of the year. What was the most important price? It was last year’s close at 2689.75. I say that because the Emini repeated oscillated around it for 6 months. After 2 strong down days, lower prices are likely. But, because the selling was climactic, the odds favor a bounce for a week or two.<p>Note, last year’s close is within reach. Since it was so important for half of the year and the Emini is almost there again, it will probably get there again within a few weeks. Traders will sell rallies until then. Because it was such a strong magnet, it will probably stop the selling for at least a few days. The bulls will need a micro double bottom there if this selloff is just a higher low in a bull trend.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 34 points in the Globex session. While that is a huge number, it is modest compared to the range of the past two days. After 2 climactic bear days, the Emini will probably trade sideways to up for several days especially after yesterday’s late strong reversal up.<p>The daily ranges will begin to shrink, but the swings up and down will still be much bigger than normal. Along with smaller ranges, the Emini will become more two sided. The exhausted bears will probably begin to take profits, and value oriented bulls as well as traders will begin to buy. The result will probably be a retracement of this week’s selloff.<p>Today is Friday so weekly support and resistance can be important, especially late in the day. Targets include the August 2 low of 2800, which is also a Big Round Number. While the bears want the week to close on its low, that is unlikely because 2 climactic days will make bulls and bears buy (bears buy back surprisingly profitable shorts). The result will probably be a sideways to up day. Because the selling has been extreme, there is an increased chance of a bull trend day today.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-correction-giving-back-all-of-2018-gains.png\"><img src=\"2018-10-12.png\" alt=\"Emini correction giving back all of 2018 gains\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex minor bull leg in early bull trend</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/EURUSD-Forex-minor-bull-leg-in-early-bull-trend.png\"><img loading=\"lazy\" src=\"2018-10-12-1.png\" alt=\"EURUSD Forex minor bull leg in early bull trend\"></a><p class=\"caption\">While the EURUSD daily Forex chart rallied strongly this week, the rally followed a tight bear channel. Therefore, the bulls will probably need a test down next week. The day so far is a small bear trend day at the resistance of the October 3 high, the 20 day EMA, and a 50% retracement. The buying is drying up at this resistance.<p><br>The EURUSD daily Forex chart retraced half of he October 9 selloff. While the bears want this rally to be a bear flag, it is more likely the first of at least 2 legs up in the 6 month trading range.<p>A trading range is a neutral environment, which means that the direction of the eventual breakout is as likely to be up as it is to be down. There are factors that change the odds. Here, the monthly chart is in a bull trend. Additionally, the bulls got a dramatically strong reversal up from a breakout below the range. Both of these features make it more likely that the eventual breakout will be up.<p>However, trading ranges have many strong legs up and down that look like they will successfully break out. But, 80% of trading range breakouts fail. Therefore, a trader will make more money betting on reversals than on trends until after there is a clear breakout.<p>The daily chart is in the middle of the range. When that is the case, the legs often are brief. At the moment, the bulls will probably need some kind of double bottom with this week’s low before they will be able to test the top of the range at 1.18.<p>Traders understand the implication of the August bull trend reversal. They therefore will buy strong selloffs to just below the middle of the trading range instead of waiting to buy at the bottom. This will probably result in buyers around this week’s low.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart drifted down 40 pips in a weak bear channel overnight. Most of the bars were small, had prominent tails, and overlapped several prior bars. This is trading range trading. Day traders have been scalping for 10 pips. There is no sign that this is about to change today.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-bull-trend-reversal-after-sell-climax.png\"><img loading=\"lazy\" src=\"2018-10-12-2.png\" alt=\"Emini bull trend reversal after sell climax\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>The Emini sold off in a broad bear channel today, but held above yesterday’s low. It reversed up to close near the high. Today will then be a buy signal bar for Monday. Because it is a doji bar after 2 big bear bars, it is a weak setup. It will probably led to a 1 – 3 day minor reversal up. The odds favor a test below last year’s 2689.75 close within a couple of weeks.<p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-10-12"
    }
  ],
  "13": [
    {
      "data": [
        "<article class=\"post-82289 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini October correction to 2017 close and maybe February lowEmini weekend update: October 13, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini October correction to 2017 close and maybe February low<br>Emini weekend update: October 13, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-10-13T00:30:00-07:00\">October 13, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Big bear trend bar in yearlong trading range</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-monthly-candlestick-chart-has-big-bear-trend-bar-for-October.png\"><img loading=\"lazy\" src=\"2018-10-13.png\" alt=\"Emini monthly candlestick chart has big bear trend bar for October\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart so far has a big bear trend bar in October. It is testing a 2 year bull trend line. There is support below at the 20 month EMA and the February low. Despite the size of the bar, October is likely to be either a pullback in a bull trend or a leg in the yearlong trading range.<p>The monthly S&amp;P500 Emini futures candlestick chart reversed down from above the January high this month. However, it is the first bar to trade below the low of the prior month in 7 months. This means that the bulls have been strong, just as there were in 2016 and 2017. Therefore, the selloff will probably lead to a trading range instead of a bear trend.<p>Because the October bar is surprisingly big, there is an increased chance of a test down to the 20 month EMA, and possibly the February low. But, even if the bears achieve those objectives, the selloff will still more likely be a bear leg in a trading range than the start of a bear trend on the monthly chart.<p>For traders to conclude that the monthly chart has converted into a bear trend, they will want to see several months down to below the February low, and at least a couple closes below that low. Since that is unlikely without the monthly chart going sideways for 10 or more bars, a trading range over the next 6 months is more likely than a bear trend.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Bear Surprise Bar so at least small 2nd leg sideways to down likely</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-weekly-candlestick-chart-has-bear-surprise-bar-so-2nd-leg-down-likely.png\"><img loading=\"lazy\" src=\"2018-10-13-1.png\" alt=\"Emini weekly candlestick chart has bear surprise bar so 2nd leg down likely\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart formed a big bear trend bar this week. Since it was surprisingly big, the odds favor at least a small 2nd leg sideways to down within the next few weeks.<p>The weekly S&amp;P500 Emini futures candlestick chart formed a big bear bar this week. Although the bar did not close on its low, it closed well below the midpoint. This is a surprisingly big bar. When there is a Bear Surprise Bar, there is usually at least a small 2nd leg down after the 1st reversal up. Consequently, even if next week rallies, there will then be at least one more week back down. As a result, this selloff will probably last at least 2 more weeks.<p>What if next week is a big bull bar? That would reduce some of this week’s bearishness. While it would be a buy signal bar for a failed bear breakout, a big bear Surprise Bar will still typically have at least a small 2nd leg sideways to down. Consequently, the bulls will need more that a buy signal bar and a 2 – 3 week rally. They need a strong breakout above this week’s high before traders will conclude that the selling has ended and that the bull trend has resumed.<h4>Is the weekly chart in a bear trend?</h4><p>No, but if there is strong follow-through selling over the next couple of weeks, then it will be. At the moment, the selling has converted the bull trend into a trading range. The bottom of the range might be the February low.<p>Is it still in a bull trend? Well, a trading range is always additionally in both a bull and a bear trend.<p>How can that be? Let’s say the Emini goes sideways for 3 months, but then breaks strongly below the February low. Traders will say that the bear trend began with the September high. That means that this week will have been part of that bear trend.<p>Alternatively, if the Emini goes sideways to down for months and then rallies to a new high, this week will have formed a higher low compared to the February major higher low. Traders will conclude that the October selloff was simply a deep pullback in the bull trend. Therefore, as strong as this selloff has been, it would still be a bear leg in a bull trend.<p>Eventually we will find out whether the bull trend resumed and the early bear trend failed, or if the bull trend ended and the bear trend succeeded. September’s big rally and October’s selloff create a Big Up, Big Down pattern. That generates Big Confusion, which typically leads to a trading range.<p>From a trader’s perspective, the weekly chart has entered a trading range. Traders will buy low, sell high, and take quick profits over the next several weeks.<h4>Is the micro double top enough to create a bear trend?</h4><p>I said many times over the past 2 months that the bears would probably need a double top and not a micro double top before they could get a bear trend. Each time, I additionally said that a huge bear bar or two could also begin a bear trend, but that was a less likely possibility.<p>Well, that less likely possibility happened this week. Therefore, even without a double top, the 6 month tight bull channel sold off enough this week to be a legitimate candidate for the start of a bear trend. However, without strong follow-through selling over the next several weeks, it is more likely that the selloff will convert the bull trend into a trading range and not a bear trend.<p>After 5 – 10 bars in the trading range, then the bears will try to create a lower high major trend reversal. Even then, they would have only a 40% chance of getting a bear trend, which means a break far below the February low. Therefore, the odds still favor sideways to up over the next several months. This is true even if the Emini falls to the February low. If that were to happen, then sideways would be the likely outcome.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Emini October correction to 2017 close and maybe February low</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-daily-candlestick-chart-has-huge-bear-breakout-with-likely-erasure-of-2018-gains.jpg\"><img loading=\"lazy\" src=\"2018-10-13-2.jpg\" alt=\"Emini daily candlestick chart has huge bear breakout with likely erasure of 2018 gains\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart had 2 huge bear trend bars this week. They broke far below the 6 month bull channel. Since they are climactic, the odds favor a bounce early next week. Today formed a doji reversal day. That increases the chance of a rally next week. The minor rally might lead to 1 – 3 weeks of sideways to up trading.<p>The daily S&amp;P500 Emini futures candlestick chart sold off strongly this week. The 2 big bear bars were bear Surprise Bars. They represent bulls giving up. Some of the bulls who did not exit now wished they had. Consequently, they will sell out on a rally.<p>Many bears did not sell because the selling was so big that their stops would have been so far above. This would create unacceptable risk. Others simply missed the move because it was so fast. However, they are looking to sell the 1st rally, expecting at least a small 2nd leg down.<p>With both the bulls and bears looking to sell the 1st rally, the odds favor at least a small 2nd leg sideways to down.<p>Because today reversed up to close on the day’s high, it is a buy signal bar for next week. In addition, it rallied back to the 200 day moving average (not shown). But, today was only a doji and it followed 2 big bear bars. It is therefore a weak buy setup. A minor reversal up is more likely that a failed bear breakout and immediate bull trend resumption. Traders will sell the 1st rally.<h4>Sell climaxes are unsustainable</h4><p>This week’s selling was extreme and therefore unsustainable and climactic. Can it continue strongly next week? That would create a crash, and crashes on the daily chart are rare. Consequently, the odds are that the selling will pause for a week or two.<p>There might even be a strong rally over the next 1 – 3 weeks that retraces most of this week’s selling. However, the odds favor at least a small 2nd leg sideways to down.<p>I say “sideways” because that is what often happens. If this week turns out to be simply a 2nd Leg Bear Trap (the 1st leg ended with the October 8 low), the 2nd leg down from this week’s selling might not fall below this week’s low. It would therefore be a higher low micro double bottom, which would be a sideways 2nd leg.<p>The bulls would then conclude that the 2nd leg was an adequate test of this week’s low. If that is the case, the Emini could reverse up in a bull channel over the next couple of months to a new all-time high.<h4>The importance of the 2017 close of 2689.75</h4><p>After the February collapse, the Emini oscillated around last year’s close of 2689.75 for 5 months. It was therefore clearly an important price.<p>But, so was the January high. After a weak breakout above that high, the Emini reversed down strongly this week. It is now close enough to giving back all of this year’s gains that it will probably have to test last year’s close.<p>The year does not have to get “into the red” again, but it probably will, at least briefly. Traders will begin to notice that this selloff almost erased all of the year’s gains. They will conclude that the Emini will probably test below last year’s close. The result will be that many bulls will not buy until after it happens. With fewer bulls buying, it makes the test likely.<p>Traders will begin to reflect on this thought. When the market is aware of an important price and it gets close, it usually has to get very close or even beyond the price before traders will be confident that the selloff has ended.<p>Consequently, the Emini will probably test the 2017 close within a few weeks. It will probably oscillate around it for at least a couple of weeks, like it did for the 1st half of the year. It will then decide if it also has to test the February low. More likely, the year will close above last year’s close and be at least modestly positive.<h4>What about the February low?</h4><p>For the past several months when the Emini was rallying strongly, I repeatedly said that the bears had a 30% chance of a break below the February low, despite the strong rally. In addition, I said that if there was a strong selloff, the probability would increase.<p>There is now a 50% chance of the selloff continuing down to the February low. If there is strong follow-through selling next week, the probability will increase further. Finally, there is now a 40% chance of a strong break below the February low.<h4>Possible 2nd Leg Bear Trap caused by options gamma</h4><p>I said there is a 50% chance of a test of the February low. That means there is a 50% chance of a rally back to the high. How could the Emini possibly rally after a huge selloff like this? I call it a 2nd Leg Bear Trap. The bulls had a bull flag as of October 8. That was the 1st leg down. This week was the 2nd leg down, and it was a huge bear breakout.<p>I need to say a few things about how options selling firms could be behind this week’s selling. If so, the selloff could be a bear trap, which means that the bear breakout will fail and the bull trend will soon resume.<h4>What is options related selling?</h4><p>Most traders do not need to understand the “Greeks,” but in case you are interested, I want to talk a little about them. These are terms applied to options activity. The delta is a measure of how fast an option moves when the underlying moves. For example, if the SPY is at 280 and you buy a 280 put, it moves about half as much as the SPY. That means if the SPY falls 1 point, the put increases in value by about 0.5, and its delta is 0.5.<p>However, if the SPY falls to 270, the put begins to move almost as much as the SPY. Consequently, if the SPY falls one more point, the put might increase in value by 0.8. Its delta is now 0.8. The delta increased from 0.5 to 0.8.<p>The speed at which it increased is the gamma. If the gamma goes up quickly, the firms that sold those puts are rapidly losing money. They need to hedge, and they do so by selling stocks and futures. Their selling causes the SPY to fall even further and faster.<p>By the end of the day, the option selling firms are mostly fully hedged and will not lose money if the SPY falls further. Sometimes the same process repeats for a day or two more. That is what we do not yet know. Is a lot of the selling this week due to options selling firms hedging their short puts or is it mostly due to some fundamental change in the markets that is not yet clear? We should find out over the next 2 weeks.<h4>From my comment after my post from Friday, October 12</h4><h4><p>In response to a comment this week, I wrote a variation of the following.<p>All of the institutions and hedge funds buy puts for protection. That means there is huge put selling by option firms who are basically insuring every stock trading institution on Wall St.<p>When the market goes down, the option gamma has to go up, and these put sellers have to hedge if they don’t want to go under. Their obvious choice is to sell stock and futures. They are essentially the insurance companies for all of the firms on Wall St. Since there are many very big firms on Wall St., these options selling firms potentially have a huge risk.<p>Their hedging (to protect themselves in their effort to protect everyone else) therefore requires tremendous selling of stocks and futures. Is it exactly 50% of the selling that came during the big bear days this week? Who knows, but I do know it has to be about that much because they are insuring all of those institutions who are losing money as the market falls. It sounds reasonable that about the same amount of selling has to come from the insurers (option selling firms), and that means about half of the total selling.<p>I’ve been doing this for over 30 years and I know that this is how the selloff could be a bear trap. We will get information over the next 2 weeks that will let us know whether the selloff continues down to the February low or reverses up to an all-time high over the next few months. If it reverses up, then we will know that this selloff was just a 2nd Leg Bear Trap that was caused mostly by options related selling. Traders need to be ready for a big move up or down starting within the next 2 weeks. Do not be in denial if this big bear breakout reverses back up.<hr></h4><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-10-13"
    }
  ],
  "15": [
    {
      "data": [
        "<article class=\"post-82287 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini October sell climax erasing the 2018 gains Intraday market update: Monday October 15, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini October sell climax erasing the 2018 gains<br>Intraday market update: Monday October 15, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-10-15T06:20:54-07:00\">October 15, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini October sell climax erasing the 2018 gains</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini sold off strongly last week. It will probably soon give back all of 2018’s gains by falling below last year’s close. However, because the selling has been so extreme, the bears might take partial profits first. Even if they do, the odds are that the Emini will fall below the 2017 close this month. The momentum down is strong and the Emini oscillated around it for the 1st half of the year. Therefore, it clearly is important.<p>Will today be another big bear trend day? Since Friday closed near its high after a 2 day sell climax, it is more likely that today will trigger a buy signal by going above Friday’s high. That increases the chances of a 1 – 3 day rally this week.<p>Traders will find out over the next 2 weeks if something is fundamentally different, which would result in more selling, possibly down to the February low. Or, was the selling mostly options related, which should lead to a new high by year end. And, the reversal up could be abrupt. Therefore, there is a 30% chance of a very strong rally this week.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 4 points in the Globex market. The 2 day head and shoulders bottom could lead to sideways to up trading this week. However, since Friday had a bear body, there will probably be sellers above its high.<p>In addition, it was a doji. That makes it a weak sell signal bar. That means there are probably buyers below its low.<p>With sellers above and buyers below, the Emini is transitioning into trading range price action. Day traders will look for reversals. Because the daily ranges have been big for 3 days, today’s range will also be big. Even though it might be smaller than Friday, a big range will allow day traders to swing trade the legs in the developing range.<p>There is a 2 day head and shoulders bottom. But, because last week’s selloff was so strong, a reversal up will probably stall within a couple of days.<h2>Friday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-bull-trend-reversal-after-sell-climax.png\"><img src=\"2018-10-15.png\" alt=\"Emini bull trend reversal after sell climax\"></a><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/EURUSD-Forex-parabolic-wedge-rally-so-minor-reversal-up.png\"><img loading=\"lazy\" src=\"2018-10-15-1.png\" alt=\"EURUSD Forex parabolic wedge rally so minor reversal up\"></a><p class=\"caption\">The Emini rallied overnight, but this would be the 3rd leg ip from the October 3 high. Furthermore, the bear channel down to the October 9 low was tight. Therefore, there will probably be sellers above last week’s high.<p><br>The EURUSD daily Forex chart has been in a trading range for 6 months. There have been many strong legs up and down, and every one of them reversed. Traders will continue to bet on reversals instead of a breakout of the 6 month range.<p>The current 5 day rally looks like a parabolic wedge. Therefore, the are probably sellers above the October 12 high, creating the final 3rd small leg up. If so, the bears will create a couple small legs sideways to down over the next week or two.<p>Less likely, this rally will continue above the September 24 high without a test down. Or, it will form a head and shoulders top where the September 24 high is the top. Then, the bears will get a break below the August low.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart rallied 60 pips overnight. It is now testing Friday’s high. But, the 5 day bull channel is tight. In addition, this is now the 3rd leg up (the 1st was October 3). Therefore, this is a parabolic wedge rally. That usually leads to a couple legs sideways to down. Consequently, despite the overnight rally, the odds favor sellers above Friday’s high and then a couple small legs down on the daily chart.<p>Day traders will buy pullbacks today and tomorrow. This is because a small 3rd leg up is likely early this week. But, they will begin to sell once the rally goes above Friday’s high. There will then probably be a test back down to 1.15 and the October 9 high.<p>Since October 9 was only a doji, it was not a strong buy signal bar. The high of a weak buy signal bar usually gets tested.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-2nd-leg-bull-trap-and-ii-sell-signal.png\"><img loading=\"lazy\" src=\"2018-10-15-2.png\" alt=\"Emini 2nd leg bull trap and ii sell signal\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>The Emini continued its trading range for a 3rd day. Today was the 2nd consecutive inside day. There is therefore now an ii Breakout Mode pattern for tomorrow. Since today closed near its low, the past 4 days were bear days, and the close of last year is a major magnet below, today is a reasonable sell setup for tomorrow.<p>The odds favor a test of the 2017 close whether or not there is a rally for a few days 1st. However, how the Emini reacts to that test is important. If it reverses up, the year will probably close near the high or at least above the midpoint of the October selloff. If it continues down, the Emini might test the February low.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-10-15"
    }
  ],
  "16": [
    {
      "data": [
        "<article class=\"post-82426 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini consolidating after either October bear breakout or bear trapIntraday market update: Tuesday October 16, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini consolidating after either October bear breakout or bear trap<br>Intraday market update: Tuesday October 16, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-10-16T06:20:32-07:00\">October 16, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini consolidating after either October bear breakout or bear trap</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini continued its 3 day trading range yesterday. But, it closed near its low and it was the 2nd consecutive bear inside bar. This is an ii sell signal for today.<p>The market is near last year’s close and that was a magnet for the 1st 6 months. Therefore, there will probably be at least a small 2nd leg down to test that level. Today might be the start of that test.<p>What follows the test will be important. It will tell us if last week’s selloff was a spike in a spike and channel bear trend, or simply a sharp pullback to support. Will the Emini test the February low or the September high?<p>We should find out within a couple of weeks. If there is a selloff that reverses up from last year’s close, the odds will favor a new all-time high or at least a retracement of half of last week’s selloff. Alternatively, if the selloff just keeps dropping, then the Emini might test the February low.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 17 points in the Globex market. While yesterday closed on its low and is a good sell signal bar, traders still do not know if last week’s selloff was a bear trap. They therefore are willing to buy a strong breakout above a 2 day bear flag.<p>The past 3 days have been sideways. This is a breakout mode pattern. Day traders will continue to look for reversals, even knowing that a breakout is likely within a few days. Until there is a breakout, there is no breakout.<p>Because the daily range is still big, the legs up and down have been swing trades. Today will probably be similar to the past few days and have several swings up and down.<p>Since the past 4 days have been bear days on the daily chart, if today trades above yesterday’s high, traders will expect the breakout to fail. They will therefore look for a reversal down. However, experienced traders know that the 4 day selloff might be a bear trap. Consequently, they will not hesitate to swing trade their longs if there is a strong rally.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-2nd-leg-bull-trap-and-ii-sell-signal.png\"><img src=\"2018-10-16.png\" alt=\"Emini 2nd leg bull trap and ii sell signal\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/EURUSD-4-day-bull-flag-in-minor-bull-trend-reversal.png\"><img loading=\"lazy\" src=\"2018-10-16-1.png\" alt=\"EURUSD 4 day bull flag in minor bull trend reversal\"></a><p class=\"caption\">The EURUSD daily Forex chart has consecutive inside days after a modest 3 day bull trend reversal. This is an ii breakout mode pattern.<p><br>The EURUSD daily Forex chart so far today is within yesterday’s range. Yesterday was also an inside day. Consecutive inside days is an ii pattern, which is a Breakout Mode setup.<p>Because it follows a 4 day rally, the breakout is more likely to be up. However, if the bull breakout reverses down after a day or two, there would be a parabolic wedge lower high. This would probably lead to a 100 – 150 pip test down to the October 9 high or low.<p>The daily chart has been in a trading range for 6 months. The legs up and down reversed every 2 – 3 weeks. This rally will therefore probably end within a week.<p>August reversed up strongly after a strong breakout below the range. Furthermore, the weekly and monthly charts are bullish. Consequently, there will probably ultimately be a successful breakout above the range within a few months.<p>But, traders make more money betting on reversals than on breakouts until there is a clear strong breakout. As a result, they will begin to look for a 1 – 2 week selloff. The current leg up has lasted only 6 days, which is brief. Traders expect another few days up to around 1.1650.<p>They will then look for a reversal bar. If they get one, it would be a sell signal bar for a parabolic wedge rally. They would then sell, looking for a week or two down.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart has been in a 40 pip range for 4 days. That is a long time for this tight of a range. Therefore, traders expect a breakout this week. Up is more likely than down. However, longer the trading range lasts, the more neutral it becomes.<p>Until there is a breakout, day traders will continue to scalp for 10 – 20 pips. Because a breakout up or down is likely today or tomorrow, they will be ready to switch to taking bigger profits. Since a breakout up or down will probably reverse within a few days, day traders will have a hard time making more than 20 – 40 pips on the breakout.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-Small-Pullback-Bull-Trend-and-bull-trend-reversal.png\"><img loading=\"lazy\" src=\"2018-10-16-2.png\" alt=\"Emini Small Pullback Bull Trend and bull trend reversal\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>The Emini broke above the bear ii today and formed a strong Bull Trend From The Open. This is unsustainable and therefore climactic. Consequently, the odds favor at least a couple hours of sideways to down trading that starts by the end of the 2nd hour tomorrow.<p>That does not mean a bear trend. It simply means a pause in the bull trend that started today. Since today was so strong and closed on its high, there is an increased chance of a gap up tomorrow and at least a moderate bull trend day. While a bear trend day is always possible, it is unlikely after today’s tight bull channel. The best the bears can probably get tomorrow is a swing down and a trading range.<p>As strong as today was, the bulls need several strong trend days before traders conclude that there will not be a 2nd leg down from last week’s selloff.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-10-16"
    }
  ],
  "17": [
    {
      "data": [
        "<article class=\"post-82428 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Possible Emini October bear trap Intraday market update: Wednesday October 17, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Possible Emini October bear trap<br>Intraday market update: Wednesday October 17, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-10-17T06:20:49-07:00\">October 17, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Possible Emini October bear trap</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini broke above the bear ii on the daily chart yesterday and formed a big bull trend from the open. While good for the bulls, they need follow-through buying for at least 1 – 2 more days before traders conclude that last week was a bear trap. Without that, the odds still favor at least a small 2nd leg down to test the close of last year.<p>Confusion usually leads to a trading range. If there is no sustained buying or selling soon, the Emini will enter a trading range for the next couple of weeks.<p>Because yesterday was climactic, there is only a 25% chance of a strong bull day today. However, there is a 50% chance of some follow-through buying within the 1st 2 hours. It could start on the open.<p>Finally, a climax means that the bulls get exhausted. There is therefore a 75% chance of at least 2 hours of sideways to down trading that starts by the end of the 2nd hour.<p>That does not necessarily mean a bear trend. It only means at least a couple of hours of trading range trading. Yesterday was so strongly bullish that there is an increased chance of at least a modest bull trend today.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 12 points in the Globex session. This increases the chance of an early trading range after yesterday’s buy climax. Even if today is a bear day, yesterday was in a tight bull channel and that will limit the downside for the rest ot the week.<p>It is unlikely that today will gap up and then rally in a strong bull trend day. More likely, yesterday was exhaustive. The bulls will take profits and wait to see how far down the bears can go. Once the bulls sense that the bears are taking profits and will not sell at the low, the bulls will begin to buy. This should result in at least a couple hours of trading range trading today.<p>The final hour is important. If last week was a bear trap and yesterday was the start of a bull trend, the bulls will do bullish things. One thing they can do is buy into the close so that today will form a consecutive bull trend day. If the Emini is off the high after 11 a.m. PST, day traders should look for a buy setup that could lead to a rally into the close.<p>Alternatively, if yesterday was just a relief rally in a bear trend, there should be bad follow-through buying today. Therefore, if the Emini is near the high after 11 a.m. PST, day traders will look for a sell setup that could lead to a reversal down to below the open. That would create a bear body on the daily chart. Today then would be a bad follow-through day and it would reduce the chance of a continued strong reversal up on the daily chart.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-Small-Pullback-Bull-Trend-and-bull-trend-reversal.png\"><img src=\"2018-10-17.png\" alt=\"Emini Small Pullback Bull Trend and bull trend reversal\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex parabolic wedge rally to minor lower high</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/EURUSD-Forex-parabolic-wedge-rally-to-minor-lower-high.png\"><img loading=\"lazy\" src=\"2018-10-17-1.png\" alt=\"EURUSD Forex parabolic wedge rally to minor lower high\"></a><p class=\"caption\">The EURUSD daily Forex chart is turning down from a parabolic wedge lower high. It should find support around the October 9 higher low.<p><br>For the past 4 days, I said that there would probably be a parabolic wedge lower high. Furthermore, it would lead to a 3 – 5 day pullback to test the October 9 high or low. The EURUSD is turning down, as expected. But, the odds are that it will form a double bottom with the October 9 low.<p>The bears see a head and shoulders top where August 28 formed the left shoulder. They currently have a 30% chance of a measured move down to below the August 15 low. However, there will probably be a 2 legged, 3 – 5 day selloff to below 1.15.<p>There is no sign that the 6 month trading range is about to break out. Traders expect reversals after every 5 – 10 day leg up or down.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart sold off 100 pips from yesterday’s high. In addition, the selloff over the past 2 hours has been strong. But, there is support around the October high at around 1.15.<p>After a wedge rally, the selloff will probably have 2 legs down. That means that there will soon be a bounce. The 1st leg down should end this week. Consequently, today will probably transition into a trading range as the 1st leg down looks for a bottom. Traders will stop swing trading their short positions and begin to scalp up and down.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-bull-trend-reversal-day.png\"><img loading=\"lazy\" src=\"2018-10-17-2.png\" alt=\"Emini bull trend reversal day\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>After a strong selloff to the 60 minute EMA, the bulls reversed the day up to above yesterday’s high. The Emini then stalled. It was not yet strong follow-through buying after yesterday’s big bull day. This failure increases the odds of more sideways trading tomorrow.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-10-17"
    }
  ],
  "18": [
    {
      "data": [
        "<article class=\"post-82430 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini bulls need follow-through buying after October bear trapIntraday market update: Thursday October 18, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini bulls need follow-through buying after October bear trap<br>Intraday market update: Thursday October 18, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-10-18T06:20:56-07:00\">October 18, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini bulls need follow-through buying after October bear trap</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Yesterday sold off to the 60 minute EMA and reversed up to above Tuesday’s high. The 2nd half of the day was a trading range and the day closed just above the open. While bullish, it increases the chance of more trading range trading today.<p>The bulls still need strong follow-through buying after Tuesday’s reversal before traders will believe that the bull trend has resumed.<p>Since the reversal up was strong, the bears will probably need a micro double top before they can resume last week’s selloff.<p>The big reversal up created confusion, which usually leads to a trading range for a few days. The bulls will probably get at least some follow-through buying today or tomorrow.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 11 points in the Globex session. Since the dominant recent feature is Tuesday’s strong reversal up, the odds favor at least a small 2nd leg up. The rally might reach the 20 day EMA at around 2850.<p>Trading ranges usually continue longer than what seems reasonable. Therefore, today might continue yesterday’s trading range. Traders will look for reversals until there is a sustained breakout up or down.<p>Yesterday’s range had lower highs and higher lows. Consequently, it was a triangle. The 1st breakout of a triangle has a 50% chance of failing and reversing. In general, there is a 50% chance that the successful breakout will be up or down. Since Tuesday’s bull trend was strong, there is a 60% chance of a bull breakout in this case. But, that probability will drift down to 50% if the trading range continues sideways for another day or two.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-bull-trend-reversal-day.png\"><img src=\"2018-10-18.png\" alt=\"Emini bull trend reversal day\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex higher low in 3 week trading range</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/EURUSD-Forex-higher-low-in-3-week-trading-range.png\"><img loading=\"lazy\" src=\"2018-10-18-1.png\" alt=\"EURUSD Forex higher low in 3 week trading range\"></a><p class=\"caption\">The EURUSD daily Forex chart is in the bottom half of a 3 week, 200 pip tall trading range. This is in the middle of its 6 month trading range.<p><br>The EURUSD daily Forex chart has been in a 200 pip trading range for 3 weeks. It is now testing support at the October 9 high and 1.15. However, after last week’s parabolic wedge rally, there might be one more brief leg down to the October 9 low. There will then probably be a bull leg lasting at least a couple of weeks.<p>While eventually this 6 month range will break into a trend, there is no indication that the is about to happen. Consequently, traders will continue to look for reversals every 2 – 3 weeks.<p>The dominant feature is the strong August reversal up from below the bottom of a 4 month trading range. Therefore, as long as pullbacks stay above the August 15 low at 1.13, the odds favor an eventual breakout above the top of the now 6 month range.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart reversed up overnight after testing the October 9 high and the 1.15 Big Round Number. Since Monday’s selloff was strong, the bulls might need a micro double bottom before they get a rally to last week’s high. This is especially true after the October 16 wedge top. A selloff from a wedge top typically has at least 2 small legs down.<p>Because the daily chart is at support, day traders will look to buy reversals up. The overnight rally is likely to have at least a small 2nd leg up. Consequently, the bulls will look to buy the current pullback to around 1.15.<p>Since a big rally is unlikely after yesterday’s strong selloff, the bears will sell rallies. They, too, will only scalp because the overnight rally was strong and the chart is at support.<p>With both the bulls and bears scalping, today will probably form a small trading range.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-wedge-bear-channel.png\"><img loading=\"lazy\" src=\"2018-10-18-2.png\" alt=\"Emini wedge bear channel\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>By trading below yesterday’s low, the Emini triggered a Low 1 bear flag sell signal. But, yesterday was a bull doji and it followed a big bull day. This is a low probability sell setup. Consequently, the Emini is more likely to go sideways for at least a few days rather than down. The odds are the that 5 day developing trading range will last another week or more.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-10-18"
    }
  ],
  "19": [
    {
      "data": [
        "<article class=\"post-82432 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini weekly doji inside bar after last week’s sell climax Intraday market update: Friday October 19, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weekly doji inside bar after last week’s sell climax<br>Intraday market update: Friday October 19, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-10-19T06:20:01-07:00\">October 19, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini weekly doji inside bar after last week’s sell climax</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini triggered a weak sell signal yesterday buy trading below Wednesday’s low. Therefore, the odds are that the Emini will continue the 6 day developing trading range before deciding on the direction of its next leg. The odds still favor a test below the 2017 close before a new high.<p>Today is Friday and therefore today’s close will affect the appearance of the weekly chart. While the bears want the week to close on its low and the bulls want it to close on its high, Tuesday’s reversal up after a sell climax creates confusion. Confusion typically leads to a trading range. Yesterday’s close was near the 2763.50 open of the week. The odds are that today will close around there as well. The week then would be a doji bar, which is a sign of a neutral market.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 10 points in the Globex session. Since yesterday reversed up from a wedge bottom, there is an increased chance of a trend day today. Day traders will be ready for either a reversal up or a break below the wedge bottom.<p>However, the Emini might continue in it 4 hour trading range for many more hours before there is a breakout up or down. This is especially true since it is near the open of the week and today is Friday. On Friday’s, especially in the final hour, weekly magnets often pull the market. Consequently, if the Emini is within about 10 points of the open of the week after 11 or 12 o’clock today, day traders will look for a reversal to the open. Furthermore, once at the open, there is often either a strong break beyond it or another reversal.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-wedge-bear-channel.png\"><img src=\"2018-10-19.png\" alt=\"Emini wedge bear channel\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex double bottom in bottom of 3 week trading range</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/EURUSD-Forex-double-bottom-in-bottom-of-3-week-trading-range.png\"><img loading=\"lazy\" src=\"2018-10-19-1.png\" alt=\"EURUSD Forex double bottom in bottom of 3 week trading range\"></a><p class=\"caption\">The EURUSD daily Forex sold off for 3 days and is trying to form a double bottom with the October 9 low.<p><br>After 2 big bear days down from a small wedge higher low, the EURUSD daily Forex chart is testing the October 9 low. While it might briefly break below that low over the next week, the odds are against a break below the April 15 low. Therefore, traders will begin to look for a 1 – 2 week leg up in the 3 week trading range. That trading range is in the middle of a 6 month trading range. Since trading ranges resist breaking out, traders will continue to look for reversals after every strong 1 – 3 week move up or down.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart has been in a 40 pip range overnight. It reversed up from 1 pip above the October 9 low.<p>The 4 day selloff has been climactic and in a parabolic wedge on the 240 minute chart. Traders will look for the selling to dry up within a few days. They then expect a base and a rally that retraces about half of this week’s selloff.<p>There is no sign that the 3 week range or the 6 month range is about to convert into a trend. After a sell climax this week down to support, day traders expect a trading range day and then a bounce. The bulls might need a micro double bottom on the daily chart before the next leg up.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-wedge-bear-channel-1.png\"><img loading=\"lazy\" src=\"2018-10-19-2.png\" alt=\"Emini wedge bear channel\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>After an early buy climax, the Emini traded down in a wedge bear channel. It spent the 2nd half of the day between the open of the day and the open of the week. Since today closed near both, today was a doji bar on the daily chart and this week was a doji bar on the weekly chart. This is a sign of a neutral market. Traders are still deciding if last week’s selloff was a bear trap or the start of a swing down.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-10-19"
    }
  ],
  "20": [
    {
      "data": [
        "<article class=\"post-82436 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini October exhaustive sell climax should test 2017 close of 2689.75 Emini weekend update: October 20, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini October exhaustive sell climax should test 2017 close of 2689.75<br>Emini weekend update: October 20, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-10-20T00:30:39-07:00\">October 20, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Big bear bar, but trading range more likely than bear trend</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-monthly-candlestick-chart-has-a-big-bear-bar-testing-the-20-week-EMA.png\"><img loading=\"lazy\" src=\"2018-10-20.png\" alt=\"Emini monthly candlestick chart has a big bear bar testing the 20 week EMA\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has a big bear bar so far for October. However, it followed a 6 bar bull micro channel. Furthermore, the double top with the January high only has 9 bars. That is probably too small to reverse the 2 year tight bull channel.<p>Since the double top is small compared to the strong 2 year bull trend, this month’s selloff is probably a minor reversal. Therefore, a trading range or bull flag is more likely than a bear trend. The minimum 1st target is a test of the 20 month EMA at 2638. If the Emini gets there this year, it will also fall below the 2689.75 close of last year.<p>Because the bear bar so far is surprisingly big and it followed a strong 6 month rally, traders are confused. Big Up, Big Down, creates Big Confusion. The only thing that traders believe is likely is that the next couple of months will not go far up or down. Traders will take quick profits and bet on reversals. This will probably result in at least a few more sideways months.<p>If instead this month is a bear trap and the market quickly rallies to a new high, the high will probably be brief. The strong selling in February and again in October represent a market in transition. Instead of a strong bull trend, the monthly chart is evolving into a trading range. There will probably be sellers above the September high. This would create a small wedge top.<p>In addition, there will be buyers below the February low. The result of buying low, selling high, and taking quick profits will be a trading range. This could last for a year or more, like the one from late 2014 to early 2016.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>No follow-through selling after last week’s bear breakout</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-weekly-candlestick-chart-has-a-doji-bar-after-a-sell-climax.png\"><img loading=\"lazy\" src=\"2018-10-20-1.png\" alt=\"Emini weekly candlestick chart has a doji bar after a sell climax\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart formed a doji inside bar this week after last week’s big bear breakout.<p>This week’s doji inside bar represents an absence of follow-through selling after last week’s bear Surprise Bar. Because there was no follow-through selling, traders will conclude that the selloff will probably be a bear leg in a trading range and not the start of a bear trend. However, the bottom of the range might be all the way down at the February low.<p>This is what traders will discover over the next few weeks. If the bears get more big bear bars, and especially consecutive big bear bars, the odds will favor a test of the February low.<p>Alternatively, if the Emini reverses up strongly next week or from below last year’s close, traders will conclude that last week’s selloff was a bear trap. Traders would conclude that the selling was caused by options selling firms having to hedge in a falling market<a href=\"https://www.brookstradingcourse.com/analysis/emini-october-correction-2017-close-february-low/\" rel=\"noopener\" target=\"_blank\">(see last week’s post)</a>. This is in contrast to some fundamental change in the market, which would result in protracted selling over the next several months.<p>But, the prospect over the next year is unchanged. This is more likely a trading range than the start of a bear trend. Therefore, even if the Emini falls to the February low, it will probably not fall much further. In addition, the odds still favor a move above 3,000, and possibly to the measured move targets around 3100 and 3200, before the weekly chart will enter a bear trend.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Emini October exhaustive sell climax should test 2017 close of 2689.75</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-daily-candlestick-chart-is-in-a-selll-vacuum-test-of-the-close-of-last-year.png\"><img loading=\"lazy\" src=\"2018-10-20-2.png\" alt=\"Emini daily candlestick chart is in a selll vacuum test of the close of last year\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart has been sideways this week after last week’s huge bear bars.<p>The daily S&amp;P500 Emini futures candlestick chart has entered a trading range after last week’s strong bear breakout. This represents balance and uncertainty. Traders are taking quick profits because they do not believe the Emini is going to go very far near term. The Emini is deciding between a swing down and a reversal back up. Will last week’s bear breakout succeed or fail?<p>Traders will find out over the next few week’s. If there are consecutive big bull bars or a series of 4 or more unremarkable bull bars, the odds will favor a new high.<p>Conversely, if there are consecutive big bear bars or a series of ordinary bear bars, the Emini will probably fall below last week’s low and last year’s close. Even if it does, the odds are that there will be buyers below. There is currently only a 40% chance of a test of the February low before a test of the September high.<h4>The importance of last year’s close of 2689.75</h4><p>Last year’s close is a very important price going into the end of this year. If the Emini finishes the year below last year’s close, traders will say that 2018 was a down year.<p>Since most years are up, a down year is particularly newsworthy. Clearly, the bulls do not want that to happen. This is especially true after a strong 6 month rally. The year would then be a reversal bar on the yearly chart. If the year were to close near its low, there would be a significantly increased the chance of at least slightly lower prices next year.<p>Every support and resistance level is a magnet. The Emini is near enough to last year’s close so that it probably cannot escape the gravitational pull of that magnet. Traders should expect a drop below last year’s close within the next few weeks. The bulls will look for a reversal up into the end of the year. That is more likely than a sustained selloff and a close below last year’s close.<p>In hindsight, traders will probably discover that this strong selloff is simply a test of last year’s close. The market is getting vacuumed down there one final time after oscillating around it for the 1st 6 months of 2018.<p>Because last year’s close is nearby and the momentum down is good, the Emini will probably fall below last year’s close in the coming weeks. The big story on the news will be that the selloff erased all of 2018’s gains. Why hasn’t anyone on TV mentioned this yet? They haven’t been doing this for over 30 years. I have learned that elephants don’t always look the same. There is now one in the room and they just don’t realize it yet.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-10-20"
    }
  ],
  "22": [
    {
      "data": [
        "<article class=\"post-82434 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini daily and weekly doji bars after October sell climaxIntraday market update: Monday October 22, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini daily and weekly doji bars after October sell climax<br>Intraday market update: Monday October 22, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-10-22T06:20:12-07:00\">October 22, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini daily and weekly doji bars after October sell climax</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini formed a doji bar on the daily chart on Friday, and on the weekly chart as well. This is a sign that the bears were exhausted after the big selloff from 2 weeks ago. Traders are deciding whether the bear breakout was a trap or the start of a bear trend on the daily chart.<p>Since last year’s close is not far below and it is an important magnet, the odds are that the Emini will trade below that price within the next week weeks.<p>Will it get there today? While it is possible, the Emini has been in a trading range for 7 days. Since trading ranges resist breaking out, the odds favor more sideways days this week.<h3>Overnight Emini Globex trading</h3><p><br>The Emini reversed up 30 points in the Globex session and is currently 10 points above Friday’s close. Since the daily chart has been in a trading range for 7 days, the odds are that the trading range will continue today. However, every day has had big ranges and big swings. There is no sign that this is about to end.<p>Friday was an inside day with a fairly big range. Since today will open in the middle of Friday’s range and the daily chart has been sideways for 8 days, there is an increased chance of an inside day today, or at least a day that largely overlaps Friday. Consequently, day traders will look for reversals up from around Friday’s low and for reversals down from around its high.<p>While any day can be a trend day, today will probably be a trading range day, and possibly an inside day.<h2>Friday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-wedge-bear-channel-1.png\"><img src=\"2018-10-22.png\" alt=\"Emini wedge bear channel\"></a><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex trading range might for wedge bottom</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/EURUSD-Forex-trading-range-might-for-wedge-bottom.png\"><img loading=\"lazy\" src=\"2018-10-22-1.png\" alt=\"EURUSD Forex trading range might for wedge bottom\"></a><p class=\"caption\">The EURUSD daily Forex chart is in a 4 week trading range. That range is in the middle of a 6 month trading range. There is currently a double bottom, but last week’s selloff was strong. Therefore the bulls will need a micro double bottom. Alternatively, a reversal up from below the October 9 low would create a 2 month wedge higher low major trend reversal.<p><br>The EURUSD daily Forex chart has been selling off for the past month. But, the reversal up from the failed August bear breakout was strong. In addition, both the weekly and monthly charts are slightly bullish. As a result, the current selloff will probably reverse up from above the August 15 low.<p>If Friday’s reversal up is successful, the bulls will have a double bottom higher low major trend reversal. The bears only have a 40% chance of a break below the August 15 low before there is a break above the September high. However, they have a 50% chance of a breakout below the October 9 low. If they get that, but there is then a reversal up, the bulls will have a wedge higher low major trend reversal.<p>Today so far is a Low 1 bear flag. If today closes near its low, today will be a stronger sell signal bar. That would increase the chance of a selloff to 1.14 this week. Alternatively, if today has a big tail below, the daily chart will probably go sideways for at least a couple more days before deciding whether to test 1.14 or reverse up from the double bottom with the October 9 low.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart sold off 70 pips in a tight bear channel overnight. Over the past 3 hours, the bars have been getting bigger, overlapping more, and forming big tails. These are signs of more two-sided trading. They reduce the likelihood of much lower prices today. Therefore, the bears will switch to selling rallies and scalping.<p>In addition, they increase the probability that the overnight bear trend will transition into a trading range. Because the bear trend has been in a tight bear channel, the bulls will only scalp. They know the odds of a big reversal up are small without at least 2 – 3 hours of sideways trading first.<p>With both bulls and bears scalping, the chart should turn into a 30 – 50 pip tall trading range today.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-triangle-and-expanding-triangle-after-Low-1-bear-flag.png\"><img loading=\"lazy\" src=\"2018-10-22-2.png\" alt=\"Emini triangle and expanding triangle after Low 1 bear flag\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>By trading below Friday’s low, the Emini triggered a minor sell signal on the daily chart. Since it closed below Friday’s low, there is an increased chance of at least slightly lower prices tomorrow. It is in the middle of an 8 day tight trading range and therefore in breakout mode.<p>The bulls might get one more leg up before the bears get a 2nd leg down from the selloff of 2 weeks ago. Because the selloff is probably a sell vacuum test of last year’s close and there is room to that target, the odds favor at least one more leg down within a few weeks.<p>The 8 day trading range and today’s trading range price action increase the chance of more trading range trading tomorrow.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-10-22"
    }
  ],
  "23": [
    {
      "data": [
        "<article class=\"post-82617 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini minor sell signal for test of last year’s close Intraday market update: Tuesday October 23, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini minor sell signal for test of last year’s close<br>Intraday market update: Tuesday October 23, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-10-23T06:20:07-07:00\">October 23, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini minor sell signal in middle of October trading range</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Friday was an inside day on the daily chart and last week was an inside bar on the weekly chart. By trading below Friday’s low, the bears triggered a minor sell signal on the daily chart yesterday. The bulls still might get one more leg up on the daily chart before the Emini gets a 2nd leg down to the close of 2017.<p>Because the October selloff is probably a sell vacuum test of last year’s close, the Emini will probably have to fall below 2689.75 within the next few weeks. It will probably gap down big today, which would trigger the minor weekly sell signal. It therefore might then get to the target within a week or two, and possibly today.<p>Since the Emini has been in a trading range for 8 days, traders are being quick to take profits. This creates reversals every few days. The bulls want a reversal up from the low of 2 weeks ago. However, as I have been saying, this selloff probably cannot escape the magnetic pull of the close of 2017. Therefore, any reversal up before reaching that target will probably be minor.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 38 points in the Globex session. A big gap down increases the chance of a trend day. If there is a trend, a bear trend is more likely. This is especially true because of the important magnetic pull of the 2017 close. It is now only about 20 points below the Globex low.<p>The bulls want a double bottom with the low of 2 weeks ago. If the Emini falls to the 2017 close, the bulls will want a reversal up from there. The bears want a strong break below those support levels and a test of the February low.<p>Traders should find out over the next 2 weeks which is more likely. If the bulls get a series of bull trend days, then the support will hold. If instead the bears get a couple big bear days closing on their lows, the Emini will probably fall further. The next support is the May low and then the February low.<p>In either case, there is an increased chance of a trend day. In addition, the daily ranges will continue to be big. Therefore, even trading range days will have big swings.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-triangle-and-expanding-triangle-after-Low-1-bear-flag.png\"><img src=\"2018-10-23.png\" alt=\"Emini triangle and expanding triangle after Low 1 bear flag\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex double bottom and micro double bottom</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/EURUSD-Forex-double-bottom-and-micro-double-bottom.png\"><img loading=\"lazy\" src=\"2018-10-23-1.png\" alt=\"EURUSD Forex double bottom and micro double bottom\"></a><p class=\"caption\">The EURUSD daily Forex chart still has a double bottom with the October 9 low. It is now trying to create a micro double bottom with Friday’s low.<p><br>The 6 day selloff from the October 16 lower high will probably form a higher low. The bulls are looking for a bottom. I said that they would probably need a micro double bottom because last week had 2 big bear days. If today closes near its high and has a average size body, today would be a credible buy signal bar on the daily chart. There would be a double bottom with the October 9 low and a micro double bottom with Friday’s low.<p>Alternatively, if today only has a small bull body or a bear body, then the daily chart will probably fall below last week’s low. If it does, the bear breakout will probably last only 1 – 3 days. A reversal up at that point would create a wedge higher low major trend reversal. The 1st 2 points in the wedge are the September 10 and the October 9 lows.<p>Until there is a strong reversal up, the bears still have a 40% chance of a break below the August 15 low. But, the month long selloff might get almost all of the way down to that low before the bulls take control.<p>Even when the bulls get their rally, it will probably only last a few weeks. This is because the daily chart is in a 6 month trading range. Every leg up or down, no matter how strong, has reversed within a few weeks.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart reversed up 50 pips overnight. However, the rally has had deep pullbacks and many big bear bars. This is not how a swing up on the daily chart typically begins. Day traders are still taking quick profits on longs and they are selling rallies. This usually results in a trading range day.<p>Because of the possible bottom on the daily chart, there is an increased chance of a trend day up or down. At the moment, the odds favor a continuation of the overnight trading range price action.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-bull-trend-reversal-day-after-test-of-close-of-2017-1.png\"><img loading=\"lazy\" src=\"2018-10-23-2.png\" alt=\"Emini bull trend reversal day after test of close of 2017\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>This is a very good day and an important day for the bulls. It is a credible possible low for the rest of the year.<p>The Emini had a big gap down, but reversed up from 2.5 points above the close of 2017. Traders are therefore deciding if this 2nd leg down from the selloff of 2 weeks ago has ended. Will the Emini rally into the end of the year, or does the selloff have to fall below last year’s close?<p>Since the 2017 close on the cash index is about 10 points below today’s low, it might not have been adequately tested. But, today is a good buy signal bar for tomorrow. If there is a big bull trend day tomorrow and again on Thursday, then this will probably be the low for the rest of the year. Without a strong reversal up this week, the odds will favor at least slightly lower prices.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-10-23"
    }
  ],
  "24": [
    {
      "data": [
        "<article class=\"post-82619 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini weak reversal up from close of 2017Intraday market update: Wednesday October 24, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weak reversal up from close of 2017<br>Intraday market update: Wednesday October 24, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-10-24T06:20:34-07:00\">October 24, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini weak reversal up from close of 2017</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Yesterday formed a good buy signal bar on the daily chart. It reversed up from below the sell climax low from 2 weeks ago. This is a lower low double bottom.<p>After a big gap down and early selloff, the Emini reversed up from within 2.5 points of last year’s close. Is that close enough for a sustainable rally? We’ll see. The cash index came within 10 points, which is probably not close enough. Therefore, there might be one more leg down.<p>A reversal up at that point would be from a wedge. Furthermore, the selloff would have accomplished its major goal of testing below last year’s close. There would be a higher probability of a trend up from there for the rest of the year.<p>The rally on the 5 minute chart did not have the urgency or relentlessness that typically happens at major bottoms. It can always come in the next few days, but its absence yesterday reduces the odds that this is going to be the final bottom.<p>The next few days will therefore give traders important information. If the Emini begins to form a series of bull bars closing on their highs, then the low will probably hold. The bulls will try to get a yearend rally.<p>But, if the bulls fail to show strength, the odds will favor a test of the close of last year on the cash index. Furthermore, there is still a 40% chance of a test of the February low.<h4>Buy signal for double bottom at support</h4><p>Yesterday was a good buy signal bar for a double bottom reversal up from support on the daily chart. Therefore, there is an increased chance of a bull trend day today. Additionally, today will probably have to go above yesterday’s high to see what is there.<p>If the buy signal triggers on the daily chart, will there be strong follow-through buying and then a big bull trend day? If so, the odds will be better for a reversal up on the daily chart. Alternatively, if the Emini triggers the buy, but forms a doji day or a bear day, traders will suspect that the bottom is not in. That would increase the chances of at least one more new low after 1 – 3 days of sideways to up trading.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 5 points in the Globex market. Yesterday was in a bull channel on the 5 minute chart. A bull channel typically has a bear breakout and then transitions into a trading range. That is what is likely today.<p>Because yesterday was a good buy signal bar at support on the daily chart, there is an increased chance of a strong bull trend day today. But, because the 5 minute chart lacked consecutive big bull bars closing on their highs, the rally was not as strong as it could have been.<p>A rally from major support usually is very strong. While yesterday’s range was big, the appearance of the bars showed that there was not the urgency that typically comes at a major low. The bulls might try again to create those bars today. However, because they failed yesterday, the probability of a major low is less.<h2>Yesterday’s setups</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-bull-trend-reversal-day-after-test-of-close-of-2017-1.png\"><img src=\"2018-10-24.png\" alt=\"Emini bull trend reversal day after test of close of 2017\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/EURUSD-Forex-Bear-Surprise-Bar-but-possible-nested-wedge-bottom.png\"><img loading=\"lazy\" src=\"2018-10-24-1.png\" alt=\"EURUSD Forex Bear Surprise Bar but possible nested wedge bottom\"></a><p class=\"caption\">The EURUSD daily Forex chart broke strongly below last week’s bottom attempt. But, a reversal up from here would be a nested wedge bottom.<p><br>The EURUSD daily Forex chart is forming a big bear bar today when a reversal up was more likely. This is a Bear Surprise Bar. Surprise Bars trap bulls into bad longs and bears out of good shorts because traders tend to bet in the direction of higher probability. Consequently, many bulls will sell out and bears will short on the 1st bounce. This typically results in at least a small 2nd leg sideways to down.<p>While the probability is still that the bulls will get a reversal up from above the August 15 low, it is now close to 50%. If the bears break below that low, there is a 60% chance of a failed breakout and another reversal up.<p>The bears need consecutive big bear bars closing below that low before traders will believe the the breakout will lead to a swing down. They would see the chart as having a double top with the July 9 and September 26 highs. Because that pattern is 500 pips tall, the target would be 1.08.<h4>Nested wedge bottom</h4><p>There is a wedge bottom with the September 10 and October 9 lows. In addition, there is an 8 day wedge in the 3rd leg down. This is a nested wedge, which has a slightly higher chance of a reversal up. But, the bulls will probably need a micro double bottom and a good buy signal bar within the next few days before they can get their reversal up.<p>The bears want today to create a measuring gap for a 200 pip measured move down. That would result in a breakout below the August 15 low. Since the chart is near the bottom of a 6 month trading range, reversals are more common than successful breakouts. Consequently, the odds are that the month-long selloff will reverse up. This is true even if the bears get a break below the August 15 bottom of the 6 month range.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart sold off 100 pips overnight. Since the chart has a wedge bottom, it will try to reverse up for a couple of legs over the next 2 hours. But, since the selloff was surprisingly strong, the best the bulls will probably get today is a 50 pip tall trading range.<p>The selloff has been in a wedge channel on the 5 minute chart over the past 5 hours. In addition, the low is at the bottom of wedges on the daily chart. This reduces the chances of much lower prices today. Therefore, the 5 minute chart will likely transition into a trading range today.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-closed-below-close-of-2017-in-bear-trend-day.png\"><img loading=\"lazy\" src=\"2018-10-24-2.png\" alt=\"Emini closed below close of 2017 in bear trend day\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>I said yesterday and this morning that yesterday’s rally lacked the consecutive big bull bars that are typical at a major low on the daily chart. Furthermore, I said that the cash index turned up from about 10 points above the close of last year. That is not close enough.<p>As a result of these problems, the Emini and S&amp;P500 cash index today sold off and closed below last year’s close. The selloff therefore erased all of the gains of the year.<p>Because the Emini oscillated around last year’s close for the 1st half of the year, it might do that again. This is especially true going into the election in 2 weeks. There is no sign of a bottom yet, and the next support is the May low at around 2600.<p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-10-24"
    }
  ],
  "25": [
    {
      "data": [
        "<article class=\"post-82621 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini October selloff erased all of 2018 gains Intraday market update: Thursday October 25, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini October selloff erased all of 2018 gains<br>Intraday market update: Thursday October 25, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-10-25T06:20:29-07:00\">October 25, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini October selloff erased all of 2018 gains</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>I said at the close of Tuesday and again on yesterday morning that there were 2 problems with Tuesday’s rally. First, the 5 minute chart lacked consecutive big bull bars closing on their highs. Second, the reversal up on the cash index daily chart was from about 10 points above last year’s close. Yesterday showed that those problems were significant.<p>Yesterday closed below the 2017 close in both the Emini and S&amp;P500 cash index. Both are now down on the year. Since the Emini oscillated in a big range around last year’s close for the 1st half of this year, it might do that again for the next couple of weeks. This is especially true with the uncertainty of the election in 2 weeks.<p>There is no sign of a bottom yet. The next support is the May low at around 2600.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 17 points in the Globex session. While that sounds like a lot, it is not when compared to the size of yesterday’s sell off.<p>A sell climax like yesterday only has a 25% chance of strong follow-through selling today. There is a 50% chance of at least 2 hours of sideways to up trading that starts by the end of the 2nd hour. This is especially true since the October selloff has been simply a sell vacuum test of the close of last year. Since it accomplished its goal yesterday, there is no need to fall much further today.<p>Because the 2686.75 close of 2017 has been the most important price on the daily chart all year, it is a magnet. The Emini rallied above it overnight and then pulled back. Today might oscillate around it in a trading range day. If the Emini within 20 points of it after 11 a.m. PST, it will probably get drawn to it to test it again.<p>The bears want consecutive closes below it. That would be a sign of strong bears and increase the chances of a move down to the next support at around 2600. Since the bulls always want the opposite, they will try to get today to close above 2689.75. They would then hope for a reversal up from a lower low double bottom with the October 11 low.<p>The Emini is in the middle 3rd of the 2018 trading range. Therefore, the odds are that it will begin to enter a trading a smaller trading range. That would increase the odds for more trading range days over the next couple of weeks.<h2>Yesterday’s setups</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-closed-below-close-of-2017-in-bear-trend-day.png\"><img src=\"2018-10-25.png\" alt=\"Emini closed below close of 2017 in bear trend day\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD weekly Forex chart has a double top bear flag</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/EURUSD-weekly-Forex-chart-has-a-double-top-bear-flag-1.png\"><img loading=\"lazy\" src=\"2018-10-25-1.png\" alt=\"EURUSD weekly Forex chart has a double top bear flag\"></a><p class=\"caption\">The EURUSD weekly Forex chart has sold off for 5 weeks from a double top bear flag with the July 9 high. There is only a 40% chance of a break below the August 15 low and a measured move down to 1.08 (pink lines).<p>The EURUSD weekly Forex chart has been in a tight trading range for 6 months. Trading ranges always have both a reasonable buy and a reasonable sell setup. However, they resist breaking out.<p>The bears have a double top bear flag with the July and September highs. There is a 40% chance of a breakout below the August 15 low neckline and then a measured move down to 1.08. That means that there is a 60% chance of a higher low above the August low or of a break below that quickly reverses up. break below that reverses up would form a wedge bull flag with the November 7 and August 15 lows on the weekly chart.<p>The 5 week selloff lacks consecutive big bear bars closing on their lows. Most of the bars overlap the prior bar. Consequently, the momentum down is weak and the selloff is more likely a bear leg in the 6 month trading range than the start of a resumption of the selloff in April and May.<p>I mentioned yesterday that there could be a nested parabolic wedge forming on the daily chart. Since yesterday’s selloff was strong, the bulls will probably need a micro double bottom before they can get a 2 week, 200 pip reversal back up to the October 16 high.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 30 pip range overnight. This is what typically happens after a sell climax like the one from yesterday. The selling stops for a day or so, and then traders decide if there will be a reversal or another leg down. Since the bulls probably will need a micro double bottom, the odds favor at least a small 2nd leg down within a few days.<p>If today is a bull trend day, which it is so far, it would represent bad follow-through selling on the daily chart. The bulls would then have a 40% chance of the 2 week rally beginning without a micro double bottom.<p>For the bears, today is a pullback from yesterday’s selloff. Today therefore will be a sell signal bar for tomorrow. But, if today closes above its open, the bar on the daily chart will have a bull body. There would then probably be more buyers than sellers tomorrow below today’s low.<p>Consequently, the fight today will be over the close. If it is above the open, the odds are that there will be a parabolic wedge reversal beginning within a few days. If it closes on the low, the bears will have a 60% chance of at least another day or two down.<p>Remember, there is only a 40% chance of a strong break below the August 15 low. As strong as the 2 week selloff has been, it is no stronger than any other selloff or rally for the past 6 months. During every one of them, I said that a reversal was more likely than a breakout. That is always the case in a trading range.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-late-bear-reversal-down-to-below-close-of-last-year.jpg\"><img loading=\"lazy\" src=\"2018-10-25-2.jpg\" alt=\"Emini late bear reversal down to below close of last year\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>The Emini gapped up and rallied in a bull channel. However, it reversed down in the final hour and closed below last year’s close. Since this is the 2nd consecutive day closing below that price, it increases the chances of lower prices over the next few weeks.<p>Because today was a bull inside bar, it is a buy signal bar for tomorrow. However after 3 mostly sideways days, a doji bar, and a 7 bar bear micro channel of the daily chart, sideways for a few days is more likely than a strong bull trend.<p>It is also a sell signal bar for tomorrow. Since it is a bull doji, it is a weak sell setup. Also, the daily chart is in a 7 day bear micro channel and therefore in a sell climax. This lowers the chance of much more selling this week.<p>Tomorrow is Friday and weekly magnets will be important. These include the low of 2 week’s ago, this week’s low, and, most importantly, the 2017 close.<p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\" rel=\"noopener\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noopener\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-10-25"
    }
  ],
  "26": [
    {
      "data": [
        "<article class=\"post-82623 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini sell climax with consecutive closes below the 2017 close Intraday market update: Friday October 26, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini sell climax with consecutive closes below the 2017 close<br>Intraday market update: Friday October 26, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-10-26T06:20:44-07:00\">October 26, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini sell climax with consecutive closes below the 2017 close</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini reversed up in a bull channel yesterday, but collapsed late to end the day again below last year’s close. This is the 2nd consecutive close below that key price and it increases the chance for more sideways to down trading over the next couple weeks.<p>Since yesterday was a bull doji inside bar on the daily chart, it is a weak sell signal bar for today. Furthermore, it was the 7th day in a bear micro channel. That is unsustainable and therefore climactic. The odds are that The Emini will soon begin to go sideways for a few days.<p>Today is Friday and weekly support and resistance can be important, particularly in the final hour. The most important price all year has been last year’s close. Other magnets are the low from 2 weeks ago and this week’s low.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 24 points in the Globex session. It might therefore gap down. Whether or not it does, yesterday was a bull doji inside bar on the daily chart. It is therefore a weak sell signal bar for today. Consequently, there will probably be buyers not far below.<p>There is a wedge bottom with the October 11 (or 18), 23, and 24 lows. This represents a series of sell climaxes. It therefore increases the chance of exhausted bears. If the bears are exhausted, they will begin to take some profits and look to sell rallies at resistance. This would result in a 1 – 3 day bounce early next week. The bulls hope that yesterday’s rally was the 1st leg up and that the selloff was the pullback from that 1st leg. They will try to begin a 2nd leg up today.<p>The bears are aware of the exhaustive selling and know that a 1 – 3 day bounce is likely. However, they will continue to try to create new lows until they are unable. Once a critical mass of bears begins to take profits on selloffs, the bounce will begin.<p>This bounce will probably start today or Monday. If so, the reversal up could be abrupt, or begin with a several hour trading range and then a bull breakout.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-late-bear-reversal-down-to-below-close-of-last-year.jpg\"><img src=\"2018-10-26.jpg\" alt=\"Emini late bear reversal down to below close of last year\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD daily Forex nested parabolic wedge after big double top</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/EURUSD-daily-Forex-nested-parabolic-wedge-after-big-double-top.png\"><img loading=\"lazy\" src=\"2018-10-26-1.png\" alt=\"EURUSD daily Forex nested parabolic wedge after big double top\"></a><p class=\"caption\">The EURUSD daily Forex chart gapped down on Wednesday. The bears want a 500 pip measured move down below the August 15 neck line of the big double top. However, the bulls want a reversal up from above that low.<p><br>After the strong rally to the September 24 high, the EURUSD daily Forex chart had only a 40% chance of a break below the August 15 low and a 500 pip measured move down. The probability of a strong breakout below that low is now about 50%. However, yesterday had a prominent tails and today so far is small. Therefore, the selloff is losing momentum as it approaches the bottom of the 6 month trading range.<p>But, the 5 day selloff is in a bear micro channel. Consequently, the bulls will need a micro double bottom before they can get a 2 week rally back to the most recent lower highs.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart sold off 50 pips overnight. The bear runs over the past 6 days are getting smaller, which is consistent with the parabolic wedge on the daily and 240 minute charts. This increases the chance of a day or two rally early next week.<p>Also, the overnight selloff was in a Spike and Bear Channel on the 5 minute chart. That typically evolves into a trading range. The 1st target is the start of the wedge bear channel, which is the lower high from 4 hours ago at 1.3665.<p>Because today is Friday, its behavior affects the weekly chart. While the bears want the week to close below the August 15 low, that is unlikely. This is because the momentum down is waning and the 5 minute chart is in a Spike and Channel bottom pattern.<p>The bulls will not be able to do anything to erase the bearishness of the 1st 4 days of the week. Even if there is a reversal up on the 5 minute chart, it will be small relative to this week’s selloff.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-wedge-bottom-and-bull-trend-reversal.png\"><img loading=\"lazy\" src=\"2018-10-26-2.png\" alt=\"Emini wedge bottom and bull trend reversal\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>The Emini reversed up today from a wedge bottom. There is an 8 bar bear micro channel on the daily chart. Since that it rare, it is unsustainable and climactic. The odds are that Monday will trade above today’s high or that Tuesday will trade above Monday’s high. That would trigger a wedge bottom buy signal. A reversal up from a sell climax typically has at least 2 legs up.<p>But, the 8 day bear micro channel is also a sign of strong bears. Therefore, the initial reversal up will probably have a pullback within a couple of days. The downside risk next week is not great after the 4 week sell climax down to the close of last year. The odds favor a 1 – 2 week rally.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-10-26"
    }
  ],
  "27": [
    {
      "data": [
        "<article class=\"post-82627 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"October sell climax finding support at 2017 close Emini weekend update: October 27, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">October sell climax finding support at 2017 close<br>Emini weekend update: October 27, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-10-27T00:30:04-07:00\">October 27, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>October selloff more likely leg in trading range than start of bear trend</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-monthly-chart-strong-minor-reversal-down-to-EMA.png\"><img loading=\"lazy\" src=\"2018-10-27.png\" alt=\"Emini monthly chart strong minor reversal down to EMA\"></a><p class=\"caption\">The candlestick on the monthly S&amp;P500 Emini futures candlestick chart is a big bear trend bar with 3 days remaining in October. This is the 1st touch of the 20 month EMA since February 2016.<p>The monthly S&amp;P500 Emini futures candlestick chart is still in a bull trend. It is now touching the 20 month EMA for the 1st time in more than 20 months. This is therefore a 20 Gap Bar buy setup. However, the bear bar is so big that the chart might have to go sideways for a few months before the bulls will be confident of support.<p>At the end of last year, I repeatedly wrote that the monthly, weekly, and daily charts were the most overbought in the 100 year history of the stock market. I further said that the trend was therefore unsustainable and it was likely to end soon.<p>A bull trend usually does not become a bear trend without first entering a trading range. I therefore wrote that the Emini would probably enter a trading range that would last 1 – 2 years, like in 2014 – 2016. So far, what has unfolded in 2018 is consistent with all of the above.<h4>Double top, but minor reversal likely</h4><p>The bears are hoping that the January-September double top will lead to a measured move down below the February low and create a bear trend. That would be unusual. This is because the double top only has 9 bars and the bull trend has lasted about 100 bars on the monthly chart. In addition, the bull trend has been in a tight bull channel. This small of a top is unlikely to be enough to turn a bull trend into a bear trend. A trading range is therefore more likely.<p>In fact, as strong as the October selling has been, the monthly chart has this week barely pulled back to the 20 month EMA. Since it has been above that average for a long time, the bulls have been willing to pay an above average price. Many will be eager to buy at the average price, especially if there is not strong follow-through selling in November.<h4>Last year’s buy climax likely to lead to trading range, not bear trend</h4><p>In February, I said that there would probably only be 1 – 3 month pullback and then a rally to a new high. I wrote that the new high typically lasts only 1 – 3 months before there is another reversal down. Finally, I wrote that at that point, the market usually forms a trading range. This is what is happening now.<p>October is a surprisingly big bear bar. Surprise Bars typically have at least a small 2nd leg down. As a result, even if there is a reversal up next month, it will probably only last for 1 – 2 months. Traders will sell the rally and the Emini will likely have to test the October low 2 or 3 months from now.<p>If it reverses up at that point, there will be a micro double bottom in addition to a double bottom with the February low. Then, the bulls would have a reasonable chance to reach the measured move target at around 3200, based on the 300 point tall yearlong trading range.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>2nd leg down after early October selloff</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-weekly-chart-has-consecutive-sell-climaxes-at-support.png\"><img loading=\"lazy\" src=\"2018-10-27-1.png\" alt=\"Emini weekly chart has consecutive sell climaxes at support\"></a><p class=\"caption\">The selloff from 2 weeks ago on the weekly S&amp;P500 Emini futures candlestick chart was strong enough to make at least a small 2nd leg down likely. This week fulfills that goal. The Emini is now in the middle of the 2018 trading range and testing the close of 2017.<p>The weekly S&amp;P500 Emini futures candlestick chart sold off again this week. Since last week was a bull doji inside bar, it was a weak sell signal bar. That means that a protracted selloff was not likely.<p>Although this week fell for a lot of points, it closed well above the low of the week. That reduces the chance of a big move down from here, and it increases the chance of a rally next week.<p>Furthermore, after the big bear bar 2 weeks ago, last week was a doji. That is bad follow-through. It increases the chance of bad follow-through for the bears next week as well. This makes sideways to up likely next week.<p>The current selloff has a 50% chance of a break below the February low. In addition, there is a 40% chance of a 300 point measured move down below the February low, based on the height of the yearlong trading range.<p>However, the yearlong trading range will probably continue for many weeks before there is a breakout of the range. Trading ranges resist breaking out and they last longer than what seems reasonable.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>October sell climax finding support at 2017 close</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-daily-chart-parabolic-wedge-sell-vacuum-test-of-2017-close.png\"><img loading=\"lazy\" src=\"2018-10-27-2.png\" alt=\"Emini daily chart parabolic wedge sell vacuum test of 2017 close\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart had a 2nd strong leg down this week and closed below the close of 2017 on 3 consecutive days.<p>The daily S&amp;P500 Emini futures candlestick chart is back to last year’s close. Since it oscillated around that price for the 1st half of the year and it is now back there, the price is still important. The Emini might trade around it again for a couple of weeks before deciding whether to test the February low or the September high.<p>With the election in 2 weeks, there is an increased chance of a sideways market until then. This is especially true after 2 climactic selloffs down to support.<h4>Bear micro channel sell climax</h4><p>Every bar for the past 7 days had a high below the high of the prior day. This is an 8 bar bear micro channel. Look at the daily chart and see how often there is an 8 bar micro channel up or down. It is rare. Therefore it is unsustainable and a sell climax. Consequently, it will probably end on Monday or Tuesday. That means that traders will expect Monday to rally above Friday’s high or Tuesday to rally above Monday’s high.<p>An 8 bar bear micro channel is a sell climax, but it is also a sign of strong bears. Consequently, the 1st reversal up in minor. Therefore the Emini will probably only rally for 1 – 3 days before there is a pullback below the low of the prior day.<h4>Wedge bottoms</h4><p>There is a wedge bottom on the daily chart using the October 11, 24, and 26 lows. That increases the chance of a couple legs sideways to up. Also, October 26 to November 6 is seasonally bullish. In addition, the Emini oscillated around last year’s close repeatedly for the 1st half of the year. Finally, big selloffs in October often lead to rallies for the rest of the year. All of these factors reduce the downside risk over the next couple of weeks.<p>It is important to note that the early October selloff was strong enough to have a 3rd leg down. Therefore, traders will look to sell a rally next week if it looks weak. If there is then a new low and a reversal up, there would be a bigger wedge bottom. The October 11 and 26 lows would be the 1st 2 legs down.<p>Wedge bottoms contain sell climaxes, which exhaust the bears. They begin to take profits and then wait for a couple legs up before selling again. The bulls know this and they buy. The result is that the wedge bear channel reverses up and typically evolves into a trading range. That is what is likely over the next month.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-10-27"
    }
  ],
  "29": [
    {
      "data": [
        "<article class=\"post-82625 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini wedge bottom and bear micro channel sell climax Intraday market update: Monday October 29, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini wedge bottom and bear micro channel sell climax<br>Intraday market update: Monday October 29, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-10-29T06:20:39-07:00\">October 29, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini wedge bottom and bear micro channel sell climax</h2><p class=\"caption\">I will update again at the end of the day.<h4>Financial Market Overview</h4><p>Everything is short-term overdone. I wrote in my weekend blog that the odds are that a rally would probably begin early this week. The high of every day for the past 7 days in the S&amp;P500 cash index has had a high below the prior day’s high. This is extreme and will likely end today or tomorrow.<p>Furthermore, the cash index has a 2 week parabolic wedge bottom that began with the October 10 low. That typically leads to a couple of legs sideways to up trading. There might be one more small new low, but there should be buyers around last week’s low. Furthermore, the 1st week of November is seasonally bullish.<p>There is a similar picture with the EURUSD daily Forex chart, and an opposite situation with the US dollar. The dollar has a wedge top where the 1st leg up was September 4 and the 2nd was October 9. Friday’s reversal probably ended the final leg in the wedge. While there is a chance of one more brief leg up, the odds are that the dollar will pull back over the next 2 weeks.<p>This will take pressure off the stock market, which should rally. The October selloff was in a bear spike and channel pattern. Traders will look for a test of the start of the channel over the next month. That is the October 17 high of 2817.<p>The selloffs in AAPL and MSFT were minimal, and AMZN and GOOGL started to reverse up on Friday. They should work higher within a week, and that will bolster the market. AAPL’s earnings are on Thursday. With AAPL in a bull flag on the daily chart and the overall market in a sell climax, the odds favor a test of all-time high within a couple of weeks.<p>Will the S&amp;P test the February low? There is a lot of talk of that. At the moment, the odds favor a short term rally beginning early this week.<h2>Pre-Open market analysis</h2><p><br>The Emini reversed up on Friday, but closed near its open and formed a doji day. There is an 8 day bear micro channel, which is a sell climax. The odds therefore are that today will trade above Friday’s high or tomorrow will trade above today’s high.<p>There is also a wedge bottom on the daily chart. Furthermore, the Emini is seasonally bullish over the next week. These factors make it likely that today will trade above Friday’s high and trigger a minor buy signal.<p>However, while the 8 bar bear micro channel is unsustainable and therefore sell climax, it is also a sign of strong bears. Typically the 1st reversal up only lasts 1 – 2 bars before there is a pullback. Despite that, the odds favor a 1 – 2 week rally soon.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 27 points in the Globex session. As I wrote after the close on Friday and on the weekend, the odds are that today will trade above Friday’s high or that tomorrow will trade above today’s high. Furthermore, Friday is a reasonable candidate for the end of the selling for the rest of the year. We’ll see.<p>Today will probably open around Friday’s high. Remember, the minimum goal is for today to trade 1 tick above that high. If it does, it will end the 8 day bear micro channel. Will the Emini only do the minimum or will it do much more over the next few weeks? We will find out.<h4>What to expect if there is a rally after a sell climax</h4><p>A parabolic wedge bottom typically lead to rally that has at least 2 legs and lasts about half as long as the wedge. Because the wedge lasted 3 weeks, the rally might last at least a week. The next objective is a test of the top of the wedge, which is around 2820.<p>Since the selling was so strong, if there is a rally, it will probably be tentative, in a channel, with many pullbacks. That means it will look uncertain, and traders will constantly wonder if it is a bear flag and if the bear trend will soon resume. This is in contrast to a relentless, clear, strong bull breakout for several days.<p>Bear channels and sell climaxes usually evolve into trading ranges. That is what is likely here. While the initial rally over the next few days can be strong on the 5 minute chart, it probably will not generate a series of big bull trend days on the daily chart. A trading range on the daily chart typically creates a lot of trading range price action on the smaller time frames.<h2>Friday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-wedge-bottom-and-bull-trend-reversal.png\"><img src=\"2018-10-29.png\" alt=\"Emini wedge bottom and bull trend reversal\"></a><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD daily Forex chart has parabolic wedge bottom</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/EURUSD-daily-Forex-chart-has-parabolic-wedge-bottom.png\"><img loading=\"lazy\" src=\"2018-10-29-1.png\" alt=\"EURUSD daily Forex chart has parabolic wedge bottom\"></a><p class=\"caption\">The EURUSD daily Forex chart formed a bull reversal day on Friday. There is a nested parabolic wedge and it is above the August 15 bull trend reversal low.<p><br>The EURUSD daily Forex chart has sold off for 5 weeks. Yet, the low is still above the August 15 bull trend reversal low. The selloff therefore can still simply be a deep pullback in a bull trend.<p>It is clearly a strong bear leg in the 6 month trading range. Trading ranges have many strong bull and bear legs, but 80% of them lead to reversals and not successful breakouts. Consequently, this one will probably reverse up as well. That is true even if it falls below the August low for a few days.<p>Because there is a 6 day parabolic wedge withing an 8 week parabolic wedge, there is a nested sell climax bottom. The odds favor a 2 week rally back to the middle of the 6 week range. A reasonable target is the October 16 top of the 5 week bear channel.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart has been in a 60 pip trading range overnight. Traders are deciding if Friday is the start of a 2 week rally. Alternatively, the selloff will continue for a few more days. It might even break below the August low. However, there is only a 40% chance of a successful bear breakout, meaning a swing down.<p>Sell climaxes result in exhausted bears. The bears begin to prefer to sell rallies and take profits at prior lows. The bulls know this and they do the opposite. They buy near prior lows and take quick profits on tests of resistance. This typically transforms the bear trend into a trading range. That is likely to begin early this week.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-outside-down-day-and-parabolic-wedge-sell-climax.png\"><img loading=\"lazy\" src=\"2018-10-29-2.png\" alt=\"Emini outside down day and parabolic wedge sell climax\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>By going above Friday’s high, the Emini ended the 8 day bear micro channel on the daily chart. However, 8 days down is a sign of strong bears. They sold above Friday’s high and the day became a broad bear channel. The selling accelerated after midday and the Emini fell below Friday’s low. Today was therefore an outside down day.<p>However, there is still a parabolic wedge bear channel on the daily chart. This is an extreme sell climax. Consequently, the odds favor a bounce this week. For example, if tomorrow is a bull inside day, it will be an ioi buy signal bar for Wednesday.<p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-10-29"
    }
  ],
  "30": [
    {
      "data": [
        "<article class=\"post-82825 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini outside down bar in parabolic wedge sell climaxIntraday market update: Tuesday October 30, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini outside down bar in parabolic wedge sell climax<br>Intraday market update: Tuesday October 30, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-10-30T06:20:26-07:00\">October 30, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini outside down bar in parabolic wedge sell climax</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>I have been saying since Friday that the 8 day bear micro channel probably would end today or tomorrow. By today trading above Friday’s high, there is now a pullback and the micro channel on the daily chart has ended.<p>But, I also said that a micro channel is a sign of strong bears and that the 1st reversal up would probably only last a day or two before there was a test back down. Yesterday sold off strongly to below Friday’s low and formed an outside down day. That might be the end of the test.<p>While the selling could continue today, there is a parabolic wedge sell climax on the daily chart. Therefore, the odds still favor a minor reversal up this week.<h4>Minor reversal up should begin this week</h4><p>Because of the extreme sell climaxes of the past 3 weeks and now the parabolic shape, the odds favor a rally for the next week or two. It might have begun yesterday. If so, today could be a bull inside day. That means that there is an increased chance of an early selloff that reverses up, and the day then closes above the open. If so, today would be a buy signal bar for tomorrow.<p>If instead today is a bear inside day, today would be a sell signal day for tomorrow. However, you can see how violently the bulls bought below Friday’s low. Many bulls will buy again if today or tomorrow falls below yesterday’s low.<p>While the odds are that the 1st reversal up will be minor, the Emini will probably need a double bottom before this selloff will end. Therefore, even if there is a strong reversal up this week, there is still a 50% chance of a test down to the February low before the correction ends.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 13 points in the Globex session. Since yesterday was a sell climax, there is a 75% chance of at least a couple hours of sideways to up trading that starts by the end of the 2nd hour. It might have begun with yesterday’s late reversal up. But, there is also a 50% chance of at least some resumption of selling within the 1st 2 hours as well.<p>Because yesterday was an outside day that closed in its middle 3rd, today will probably mostly overlap yesterday’s range. There is only a 25% chance of a big bear day.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-outside-down-day-and-parabolic-wedge-sell-climax.png\"><img src=\"2018-10-30.png\" alt=\"Emini outside down day and parabolic wedge sell climax\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex micro double bottom and nested parabolic wedge bottom</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/EURUSD-Forex-micro-double-bottom-and-nested-parabolic-wedge-bottom.png\"><img loading=\"lazy\" src=\"2018-10-30-1.png\" alt=\"EURUSD Forex micro double bottom and nested parabolic wedge bottom\"></a><p class=\"caption\">The EURUSD daily Forex chart triggered a weak sell signal today by trading below yesterday’s low. The selloff is now in a nested parabolic wedge at the bottom of a 6 month trading range.<p><br>The EURUSD daily Forex chart has almost completely reversed the rally from the August 15 low. However, the 5 week selloff did not yet fall below that low. Therefore, it can still be just a deep pullback from the 2 month rally. Furthermore, trading ranges resist breaking out. Consequently, even if this selloff continues below the August low, there is a 60% chance that it would soon reverse back up into the 6 month trading range.<p>Since yesterday was a bear inside day in a 6 week bear trend, it was a sell signal bar. However, it had a prominent tail below and the day before was a bull reversal day. In addition, today so far is not a big bear day. Moreover, the signal is just above the support of the August low. Finally, the chart has a nest wedge bear channel. That is a sell climax pattern and therefore there is a 50% chance of a reversal up beginning this week.<p>If there is a reversal, it would probably be like all of the other reversals over the past 6 months. Traders would expect 2 – 3 weeks up to test the 20 day EMA and either the October 22 or the October 16 highs.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart sold off 40 pips overnight in a wedge bear channel. By breaking below yesterday’s low, it therefore triggered the weak sell signal on the daily chart.<p>Because the overnight selloff has been weak and in a wedge bear channel, there is an increased chance of a reversal up today or tomorrow. If that were to happen, the bulls would have a micro double bottom on the daily chart. If today closed near its high, it would be a buy signal bar on the daily chart for a micro double bottom, a double bottom, and a nested wedge bottom. Traders would then look for a rally over the next 2 weeks.<p>While the 6 week bear trend has fallen over 400 pips, it is losing momentum at the bottom of the 6 month trading range. It could still break strongly below the August low, but it appears to be trying to reverse up.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-double-bottom-higher-low-major-trend-reversal.png\"><img loading=\"lazy\" src=\"2018-10-30-2.png\" alt=\"Emini double bottom higher low major trend reversal\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>The Emini formed a bull inside day today, as expected. Today is therefore both a buy and sell signal bar for tomorrow. After the parabolic wedge sell climax and today’s bull close, the odds favor a rally for 1 – 2 weeks. Therefore, there will probably be more buyers below today’s low and above today’s high tomorrow.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-10-30"
    }
  ],
  "31": [
    {
      "data": [
        "<article class=\"post-82827 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini ioi breakout mode after October parabolic wedge sell climax Intraday market update: Wednesday October 31, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini ioi breakout mode after October parabolic wedge sell climax<br>Intraday market update: Wednesday October 31, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-10-31T06:20:35-07:00\">October 31, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini ioi breakout mode after October parabolic wedge sell climax</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini formed an inside day yesterday. There is therefore an ioi Breakout Mode setup on the daily chart. But, the extreme parabolic wedge bottom on the daily chart makes a relief rally more likely than a continuation of the selling. While some bears will sell below yesterday’s low, there will probably be more buyers below. Bulls will probably also buy above yesterday’s high, especially since yesterday closed near its high.<p>I wrote over the weekend that the parabolic wedge sell climax would likely lead to a 1 – 2 week rally. However, I said that there might be one brief new low 1st. Monday so far was a brief new low. The bulls need to begin a swing up this week.<p>Even though the Emini will probably rally over the next 2 weeks, the bears have been strong. Consequently, the rally will probably be weak. That means that the rally will probably not have several consecutive big bull days. Instead, there will probably be pullbacks after every day or two up. As a result, the rally will probably be in a tight bull channel instead of a bull breakout.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 26 points in the Globex session. It will therefore probably gap above yesterday’s high and above the close of last year.<p>A gap up increases the chance of a trend day. Since the gap is up, if there is a trend day, up is more likely. That is especially true since the daily chart has a parabolic wedge sell climax.<p>Bull trends usually have at least a minor selloff on the open. But, there is usually a reversal up from a double bottom or a small wedge bottom at support. That support is yesterday’s high, last year’s close, and the 20 bar EMA.<p>The bears who create that early selloff know that the bulls will try to get a reversal up. They will therefore try to overwhelm the bulls and push the selloff far below support. If the bears break below support, they still have the problem of a sell climax bottom. Therefore, the selloff will more likely lead to a trading range or a weak bear trend.<p>Day traders will watch what happens at support. If there is a reversal up, the bulls could have a strong bull trend day.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-double-bottom-higher-low-major-trend-reversal.png\"><img src=\"2018-10-31.png\" alt=\"Emini double bottom higher low major trend reversal\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex nested wedge bear channels at bottom of 6 month trading range</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/EURUSD-Forex-nested-wedge-bear-channels-at-bottom-of-6-month-trading-range-1.png\"><img loading=\"lazy\" src=\"2018-10-31-1.png\" alt=\"EURUSD Forex nested wedge bear channels at bottom of 6 month trading range\"></a><p class=\"caption\">The EURUSD daily Forex chart is testing the August 15 low at the bottom of its 6 month trading range. If it reverses up this week, the bulls will have a nested wedge bottom.<p><br>The EURUSD daily Forex chart is continuing down in its 6 week bear channel. Today’s low is now only 30 pips above the August 15 bottom of the 6 month range. There is now a 50% chance of a break below that low.<p>However, trading ranges resist breaking into trends. Therefore, if the bears get their breakout, there is a 60% chance of it reversing back up within a week.<p>If the breakout is made of consecutive big bear bars, the probability will flip in favor of the bears. They would then have a 60% chance of a measured move down. That would be either from the October 16 major lower high or the September 24 top of the 6 month range.<p>Traders are deciding if the selloff will reverse up from above or below the August 15 low. The bottom of the 6 month range is major support. But there is no breakout nor a reversal up yet. Traders should find out within a week. What takes place here will determine the direction of the next several hundred pips.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart has been in a 30 pip range overnight. This is a lack of conviction. Traders are waiting for a breakout up or down on the 5 minute chart. Since the chart is at major support on the daily chart, a breakout up or down on the 5 minute chart could be unusually big. This is because it could be the start of a 300 pip move on the daily chart.<p>Until there is a breakout, there is no breakout. Day traders have been scalping overnight. However, everyone is aware of what is going on. Traders will quickly switch to swing trading once the breakout comes. This is especially true if the breakout is big.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/10/Emini-gap-up-to-wedge-top-for-bear-reversal-day.png\"><img loading=\"lazy\" src=\"2018-10-31-2.png\" alt=\"Emini gap up to wedge top for bear reversal day\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>Today was the last day of October and the Emini found buyers at the 20 month EMA. There was a 20 Gap Bar buy signal. However, because October was a big bear trend bar, the Emini will probably go mostly sideways for a few months.<p>It reversed up from a parabolic wedge selloff on the daily chart. There is room to the targets above, which are the 20 day EMA and the September 19 major lower high at around 2820. Since the Emini will probably work higher over the next week, there is an increased chance of bull trend days. Today’s late selloff turned the day into a doji day on the daily chart.<p>The bears want a gap down tomorrow. That would create an island top with today’s gap up. Alternatively, they want tomorrow to trade below today’s low. That would trigger a sell signal on the daily chart. However, the odds still favor sideways to up trading for at least another week.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-10-31"
    }
  ]
}