{
  "5": [
    {
      "data": [
        "<article class=\"post-77657 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini triangle buy signal but needs follow-through buying Emini weekend update: May 5, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini triangle buy signal but needs follow-through buying<br>Emini weekend update: May 5, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-05-05T00:30:14-07:00\">May 5, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>4 month tight trading range and bull flag</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/05/m-1.png\"><img loading=\"lazy\" src=\"2018-5-5.png\" alt=\"Monthly Emini bull flag.\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart so far this month is a small bull inside bar. Furthermore, last month was also a bull doji bar. The bulls need a breakout above last month’s high.<p>The monthly S&amp;P500 Emini futures candlestick chart is in a 4 month pullback in a strong bull trend. The odds therefore are that the bull trend will resume and not reverse. However, the reversal up has not yet begun on the monthly chart. The bulls need May to trade above April’s high before traders will conclude that the bull trend is resuming.<p>This month so far is a bull doji. If the 2 day rally continues next week, this month would begin to be a strong bull trend bar. If this month closes above April’s high, the bull trend will probably resume. The target is a new all-time high.<p>By going sideways, the monthly chart is getting close to its 20 month EMA. That is support and therefore a magnet. It might now be close enough to be unable to escape the gravitational pull. Therefore, there is still a 40% chance that the Emini will sell off to below the 20 month EMA before the bull trend resumes. The average currently is 2499. If the Emini sells down to it, it probably will fall at least 50 points below before reversing up.<h4>1st pullback in bull micro channel</h4><p>The monthly chart went 15 months without a pullback. Typically, the bulls buy the 1st 1 – 3 bar (month) pullback in a micro channel. But, this was the most extreme buy climax in the 100 year history of the stock market. Therefore, the bulls are more exhausted than after prior buy climaxes. Consequently, they might need more than the usual 3 bars before they buy again. Yet, there is only a 20% chance that this pullback will grow into a bear trend without 1st testing the January high.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Triangle with micro double bottom buy setup</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/05/w-1.png\"><img loading=\"lazy\" src=\"2018-5-5-1.png\" alt=\"Weekly Emini triangle bull flag buy signal.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart is in a 4 month triangle. Since this week formed a micro double bottom with last week, it is a buy signal bar for next week.<p>The weekly S&amp;P500 Emini futures candlestick chart has been in a triangle for 13 weeks. Since the trading range is less than 20 weeks, it is still a pullback in a bull trend. That means that it is a bull flag. Consequently, the odds are greater that there will be a successful bull breakout than a successful bear breakout.<p>The past 6 weeks have been in a tight trading range. Five of the bars were dojis. This means that there is no sign of a breakout up or down. However, the past 2 weeks were dojis that closed near their highs. This is buying pressure. In addition, this week is a buy signal bar for next week. If next week trades above this week’s high, it will trigger the buy signal.<p>Yet, the Emini is in a trading range and most breakout attempts fail. The bulls therefore need next week to be a bull trend bar that closes near its high. If the bulls achieve that goal, the odds will be that the bull trend is resuming.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Emini triangle buy signal but needs follow-through buying</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/05/d-1.png\"><img loading=\"lazy\" src=\"2018-5-5-2.png\" alt=\"Emini daily chart reversing up from Triangle bottom.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart formed a big bull trend bar Friday after Thursday’s strong buy signal bar. The bulls need a strong breakout above the April 30 lower high. The bears will try to create a double top with that high.<p>The daily S&amp;P500 Emini futures candlestick chart had a big bull trend day on Friday. There was a good buy signal bar on Thursday and 2 other strong buy signal bars in the past 2 weeks. The odds are that the Emini is resuming its bull trend.<p>However, the bulls need follow-through buying next week. Without it, the odds will revert back to favoring a continuation of the 4 month trading range. In addition, a strong reversal down from either the April 18 or 30 lower highs would create a double top. That would switch the probability in favor of a bear breakout.<p>I have said that the monthly, weekly, and daily charts are all<em>about</em>to resume their bull trends. They have not yet. Until there is a breakout, there is no breakout. There have been many strong legs up and down over the past few months. That is one of the hallmarks of a trading range. As soon as you think the bulls are in control, the chart reverses down. Once you think the bears own the market, the selloff reverses up.<h4>Strong 2 day rally, but still in triangle</h4><p>The daily and weekly charts are still in triangles. While the past 2 days were very good for the bulls, until the rally breaks strongly above one or more lower highs, the chart is still in an early bear trend. Lower highs, even in a trading range, mean that the chart is an early bear trend. Every trading range is also in a bull trend. Until there is a breakout, the odds shift back and forth in favor of the bulls or bears.<p>For example, if next week rallies to or even slightly above the April 30 lower high at 2681.75, but reverses down, there will be double top bear flag there. The bears can also create a double top with the April 18 lower high at 2718.00 or even the March 13 high of 2807.25. Yet, if the bulls begin to get 4 – 5 consecutive strong bull days, the odds are that the bull trend is resuming, even if the rally is not yet above the March lower high.<p>The bears will sell around each lower high. We do not yet know if there will be more bulls buying each breakout. Until it is clear, the bulls only have a slight advantage at the moment. But, even if the bears get a breakout to below the 20 month moving average, the odds will be that it is still in a bull flag on the monthly chart, even if there is a bear trend on the daily chart.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-5-5"
    }
  ],
  "12": [
    {
      "data": [
        "<article class=\"post-77770 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini bull flag buy signal after micro channel buy climaxEmini weekend update: May 12, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini bull flag buy signal after micro channel buy climax<br>Emini weekend update: May 12, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-05-12T00:30:11-07:00\">May 12, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Emini bull flag buy signal after micro channel buy climax</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/05/Monthly-Emini-futures-contract-breaking-above-a-3-month-bull-flag-after-a-micro-channel-parabolic-buy-climax-2.png\"><img loading=\"lazy\" src=\"2018-5-12.png\" alt=\"Monthly Emini futures contract breaking above a 3 month bull flag after a micro channel parabolic buy climax\"></a><p class=\"caption\">The candlestick on the monthly S&amp;P500 Emini futures chart so far this month is a bull trend bar. Since it broke above last month’s high, it triggered a monthly buy signal. The 3 month pullback is a bull flag in a strong bull trend.<p>The monthly S&amp;P500 Emini futures candlestick chart traded above the April high after a 3 month pullback in a very strong bull trend. Because there has been no clear top, there is only a 20% chance that the selloff will continue down into a bear trend. Since the 20 month EMA is not far below, the bears might get one more leg down to that support over the next several months. But, even if they do, the selloff will still be a bull flag. Consequently, a new high is more likely to come before there is a 20% correction.<p>Since April was a doji bar, it has less chance of leading to a strong rally than a strong buy signal bar. However, the bull trend on the monthly chart was exceptionally strong. When that is the case, buy signal bars in bull flags are often not strong bull reversal bars. Yet, the trend can still resume and make a new high.<p>The probability of a new high will be greater if May closes near its high and becomes a bigger bull trend bar. If instead it closes below the April high, the Emini will probably continue sideways for at least a couple more months. Alternatively, if May closes near its low, the probability will shift in favor of the bears. The Emini would then probably test the 20 month EMA, which is below the February low.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Breakout of a 3 month triangle</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/05/Weekly-Emini-candlestick-chart-breaking-above-a-triangle-bull-flag-2.png\"><img loading=\"lazy\" src=\"2018-5-12-1.png\" alt=\"Weekly Emini candlestick chart breaking above a triangle bull flag\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart is breaking above a 6 week tight trading range. Furthermore, that range is nested within a 3 month triangle. By going above last week’s high, the Emini triggered a buy signal on the weekly chart.<p>The weekly S&amp;P500 Emini futures candlestick chart is breaking above a 3 month triangle. Triangle breakouts, in general, fail 50% of the time. Since last year’s bull trend was especially strong, there is a 60% chance that this breakout will lead to a new all-time high.<p>But, traders need to see 2 – 3 consecutive bull trend bars before they will be confident that the breakout will succeed. If they get that, the rally will probably continue up to a new high this summer. If there are not strong follow-through bull bars, there will be a 50% chance that the 4 month trading range will continue for several more months. Finally, if the next 2 weeks are strong bear bars, the breakout will probably reverse down. The Emini would then likely again test the February low.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Breakout above the April 18 major lower high</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/05/Daily-Emini-Breakout-above-April-high-and-bull-trend-resumption.png\"><img loading=\"lazy\" src=\"2018-5-12-2.png\" alt=\"Daily Emini Breakout above April high and bull trend resumption\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart this week broke above the April 18 major lower high. However, the bulls need strong follow-through buying if the rally is to continue up to the more important March 13 lower high at 2807.25.<p>The daily S&amp;P500 Emini futures candlestick chart has rallied strongly from the May 3 low. In addition, this week it broke above the April 18 lower high. It might stall here for a few days as it decides on its direction. The bulls want a rally to the next resistance at the March 13 lower high. However, the bears hope for a reversal down from a double top with the April 18 high. The bears got a double top after the March 13 breakout above the February 27 lower high. The Emini then sold off for 250 points over the next few weeks.<p>What’s different this time? The rally up from the February 9 low followed a strong selloff. That made the rally likely to be minor. Therefore, the odds favored a test of the February low.<p>The current rally comes after 2 tests of the February low. Furthermore, the monthly chart was likely to begin to resume up within 3 months (see above). Consequently, this rally has a 60% chance of successfully breaking above the April high and then testing the March 13 high at 2807.25. In addition, even if it stalls there for a couple of weeks, the rally should break out to a new all-time high within 2 – 3 months.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noopener\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-5-12"
    }
  ],
  "19": [
    {
      "data": [
        "<article class=\"post-78032 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini weak bull flag after breakout above April highEmini weekend update: May 19, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weak bull flag after breakout above April high<br>Emini weekend update: May 19, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-05-19T00:30:50-07:00\">May 19, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Weak buy signal</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/05/Monthly-Emini-chart-is-breaking-out-above-3-month-bull-flag.png\"><img loading=\"lazy\" src=\"2018-5-19.png\" alt=\"Monthly Emini chart is breaking out above 3 month bull flag\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart traded above the April high. This triggered a buy signal. However, April was a doji bar and therefore a weak signal bar. So far, May is a bull bar, but it is currently only at the April high and not far above.<p>The monthly S&amp;P500 Emini futures candlestick chart has a 4 month bull flag. Since May broke above last month’s high, the bulls hope that the bull trend is resuming. Yet, each candle stick for the past 3 months has had prominent tails. This is a tight trading range and a magnet. It resists breakouts. Therefore, the bulls need May to close on its high, and preferably far above the April high. In addition, they need June to be a bull trend bar as well. Otherwise, the odds favor more sideways bars in the 4 month tight trading range.<p>The bulls had a 15 month bull micro channel that ended when February traded below the January low. After such a strong bull trend, there is only a 20% chance of a bear trend on the monthly chart without at least a small double top. Therefore, the downside risk is probably limited to a 5 – 10 bar pullback and maybe a tested below the 20 month EMA. If the Emini pulls back to the EMA, it will likely fall at least 30 – 50 points below. That means that a break below the February low would probably continue down to at least 2450.<p><br><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/05/Weekly-Emini-chart-has-failed-breakout-above-triangle.png\"><img loading=\"lazy\" src=\"2018-5-19-1.png\" alt=\"Weekly Emini chart has failed breakout above triangle\"></a><h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Bar follow-through after last week’s breakout above a triangle</h2><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart this week was a bear bar. This is bad follow-through after last week’s breakout above a 3 month triangle.<p>The weekly S&amp;P500 Emini futures candlestick chart broke above a 3 month triangle two weeks ago, but this past week was a bear bar. That lack of follow-through buying reduces the chance that the breakout will be successful. Fifty percent of triangle breakouts fail.<p>The bears see this week as a sell signal bar for a failed breakout. Since the bar is not big, it is not a strong sell setup. The probability still slightly favors the bulls. The bulls need follow-through buying next week. If they fail to get it, the trading range is likely to continue.<p>Alternatively, if the bears get a big bear bar next week, then the bull breakout will have failed. The weekly chart would then either stay sideways or continue to fall and have bear breakout.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Emini weak bull flag after breakout above April high</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/05/Daily-Emini-candle-stick-chart-has-bull-flag-pullback-from-breakout-anove-April-high.png\"><img loading=\"lazy\" src=\"2018-5-19-2.png\" alt=\"Daily Emini candle stick chart has bull flag pullback from breakout above April major lower high.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart pulled back this week after a breakout above the April 18 major lower high. The bears have a micro double top, but the 4 day tight trading range is more likely a bull flag.<p>The daily S&amp;P500 Emini futures candlestick chart has been oscillating around the April 18 major lower high for 7 days. The bulls need follow-through buying next week. Since the rally from the May low was strong, the odds favor at least slightly higher prices next week.<p>However, the bears see Friday as a 2nd entry short for a failed breakout above the April 18 lower high. If they get 2 big bear trend days next week, they will probably get another test back down to the bottom of the 4 month trading range.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-5-19"
    }
  ]
}