{
  "1": [
    {
      "data": [
        "<article class=\"post-81027 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini breakout to all-time high but September often weak Emini weekend update: September 1, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini breakout to all-time high but September often weak<br>Emini weekend update: September 1, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-09-01T00:30:04-07:00\">September 1, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Emini breakout to all-time high but September often weak</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-monthly-candlestick-chart-closing-at-new-all-time-high.png\"><img loading=\"lazy\" src=\"2018-9-1.png\" alt=\"Emini monthly candlestick chart closing at new all-time high\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart had a bull trend bar in August. Furthermore, August closed near its high and above the January high. It is resuming its bull trend.<p>The monthly S&amp;P500 Emini futures candlestick chart has rallied for 5 months after a brief pullback from a 15 month buy climax. This month’s close at a new all-time high increases the odds of higher prices.<p>There is always a bear case. However, after 5 bars up, the odds of a big reversal down are small. The bears would typically need at least a micro double top, which would take at least 2 more months. Less likely, if September was a huge bear month, it could lead to a test down to the February low. Therefore, the odds favor sideways to up trading over the next few months.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Gap up to a new all-time high</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-weekly-candlestick-chart-at-top-of-bull-channel-and-new-all-time-high.png\"><img loading=\"lazy\" src=\"2018-9-1-1.png\" alt=\"Emini weekly candlestick chart at top of bull channel and new all time high\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart gapped up above the January all-time high this week. In addition, the bull trend has been very strong for past 2 months. However, this week was a small bull doji, which is not a strong breakout bar. But, it is also a weak sell signal bar for next week.<p>The weekly S&amp;P500 Emini futures candlestick chart gapped up to a new all-time high this week. Because the 9 week bull channel is tight, the odds favor higher prices in September.<p>There have been 3 pushes up over the past 6 weeks. This is a micro wedge top. Furthermore, this week was a small bull doji bar. Since it is not a big bear bar, it is a weak sell signal bar for next week. However, the bears still want a failed breakout above the January high and a reversal down.<p>For example, if the bears close the gap below this week’s low, the gap would be an exhaustion gap. Alternatively, if the bears get a gap down at any point over the next few weeks on the weekly chart, there would be an island top. Any strong reversal down would create a higher high major trend reversal with the January high.<p>But, the past 9 weeks have been in a tight bull channel. A reversal down from here would therefore more likely be minor. That means 1 – 3 weeks down into a bull flag, or a month or two of trading range trading. In either case, the odds favor higher prices.<h4>Measured move targets</h4><p>The weekly chart is breaking above an 8 month trading range. This will make traders look for the rally to reach measured move targets above based on highs and lows in the range.<p>April and February formed a double bottom. A measured move up above the March 13 neck line is 3066 or 3083, depending on which of the 2 lows you use. A measured move up from the gap above the March 13 high is 3036. The highest measured move target of 3229.00 is based on the February 9 low to the January 26 high.<p>The bears had a strong reversal down in February. They want the breakout above the January high to fail. Then, they want a break below the February low and a measured move down to 2194.00. While this seems unlikely now that the Emini is at a new high, there is no strong bull breakout yet. The bears therefore still have a 30% chance of a selloff to far below the February low before reaching the targets above.<p>The Emini does not have to reach any of these bull targets. But, traders and computers see them. Therefore, unless there is a convincing reversal down, the bulls will buy pullbacks until the rally reaches around those bull targets. They then will either take profits, look for new, higher targets, or sell a reversal down. At the moment, the momentum favors higher prices.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Breakout above 8 month trading range and 5 month bull channel</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-daily-candlestick-chart-breaking-above-bull-channel-1.png\"><img loading=\"lazy\" src=\"2018-9-1-2.png\" alt=\"Emini daily candlestick chart breaking above bull channel\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart gapped up above the January high on Monday this week, and every day closed above that breakout point. But, the bulls are also breaking above a bull channel, and a bull breakout above a bull channel usually fails.<p>The daily S&amp;P500 Emini futures candlestick chart has been in a bull channel since the April 2 low. Bull channels have bull legs and bear legs. The bulls are hoping to create a successful breakout for several weeks above the bull channel. Then, instead of a bear leg, the market cycle would start over.<p>Every strong bull breakout eventually has a pullback. That begins a bull channel, which later weakens and forms a trading range. Traders sometimes call a bull breakout above a bull channel a “melt up” market. The 6 day rally that started on September 28, 2017 (not shown) is an example. That was a bull breakout above a bull channel, and it led to a strong bull trend.<h4>Most breakouts above bull channels fail</h4><p>A bull breakout above a bull channel typically fails 75% of the time within about 5 bars. The bears then get a sideways to down leg to the bottom of the channel. There are usually different ways to draw the channel lines. The nearest reasonable bull trend line for the bull channel that began in April is around 2850. But, the current breakout attempt is also a breakout above an 8 month trading range. Therefore, the odds of a strong rally from here without much of a pullback are about 50%.<p>The Emini had a weak reversal down this week from above the top of the bull channel. The bulls hope that this is a pullback and that the rally will resume next week. The odds favor the bulls.<p>The bears want a 1 – 3 week selloff to the 2850 bottom of the channel. Then, they want a break below the channel, and a bear trend. At the moment they have a 50% chance of achieving their goal of a pullback to 2850 before the rally goes much higher.<p>Next week’s behavior will give more information. If the bears get consecutive big bear bars or a gap down, the odds will shift in favor of a test down to 2850. Alternatively, if the bulls can prevent a selloff, the odds will favor a resumption of the 3 week rally up above 3,000 to the measured move targets.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-9-1"
    }
  ],
  "3": [
    {
      "data": [
        "<article class=\"post-81024 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini possible island top on weekly and daily chartsIntraday market update: Tuesday September 4, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini possible island top on weekly and daily charts<br>Intraday market update: Tuesday September 4, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-09-03T06:20:24-07:00\">September 3, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini possible island top on weekly and daily charts</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini gapped up last week and closed just above the week’s midpoint. This is good for the bulls this week. But, if today gaps down, there will be a 1 bar island top on the weekly chart. Also, that would create a 5 bar island top on the daily chart. A gap down any day this week would create an island top on the daily chart. Without that, the odds favor higher prices.<p>The weekly chart is in a tight bull channel. Last week was the 3rd push up the past 6 weeks. Therefore, there is a parabolic wedge rally. Because last week was a bull bar that closed above its midpoint, is a bad sell signal bar. Also, the bull channel is tight, which is bad for the bears. If this week triggers the sell signal, the bears will probably only get a 1 – 3 week pullback.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 4 points in the Globex session, which is near Friday’s low. Today therefore might gap down and create both weekly and daily island tops. However, if a gap is small, it usually closes within the 1st hour.<p>But, it would still be a sign on weakness on the part of the bulls, and it could lead to sideways to down trading for several weeks. September is the weakest month of the year, and that can be self-fulfilling. If enough traders expect the worst, they can create a down month.<p>Because the Emini is testing the January all-time high, there is an increased chance of a big trend day up or down. This is true even though every day over the past week has spent most of the day going sideways.<h2>Friday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-bear-trend-reversal-and-then-bull-trend-reversal.png\"><img src=\"2018-9-3.png\" alt=\"Emini bear trend reversal and then bull trend reversal\"></a><p class=\"caption\">Here are several reasonable stop entry setups from Friday (market closed yesterday). I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex parabolic wedge bull flag after parabolic wedge buy climax</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/EURUSD-Forex-parabolic-wedge-bull-flag-after-parabolic-wedge-buy-climax.png\"><img loading=\"lazy\" src=\"2018-9-3-1.png\" alt=\"EURUSD Forex parabolic wedge bull flag after parabolic wedge buy climax\"></a><p class=\"caption\">The EURUSD daily Forex chart has sold off from a lower high for 6 days. It is now at the support of the EMA, the August 23 pullback low, and a 50% retracement.<p><br>I said several times last week the the parabolic wedge rally to a lower high would likely test down to the 20 day EMA, the August 23 low, and the 50% retracement. The overnight selloff is testing that support. Because a higher low is likely after the strong 3 week rally, this selloff should end between 1.1450 and the overnight low at around 1.1550.<p>The 2 day selloff is a parabolic wedge bear channel. This is easier to see on a 4 hour chart. Therefore, the odds are that there will be a couple legs sideways to up starting today or tomorrow.<p>Since a trading range is likely over the next couple of weeks, both the bulls and the bears will be disappointed. The bulls obviously did not like this 2 week selloff after a strong bull trend reversal. They also will be unhappy that this selloff will probably fall 50 – 150 pips further. However, the odds favor a higher low and a continuation of the trading range that began in June.<h4>Minor EURUSD Forex weekly sell signal</h4><p>The candlestick on the weekly chart last week was a small bear reversal bar. Since it was a lower high at the 20 week EMA in a 7 month bear swing, it is a sell signal bar for this week.<p>By trading below its low overnight, today triggered the weekly sell signal. But, last week was only a doji. In addition, the 2 prior weeks were strong bull bars. Finally, the 7 month selloff is a big bull flag. Consequently, the 2 week selloff will more likely form a higher low than resume the bear swing.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart sold off 60 pips overnight. It has been in a 20 pip tall tight trading range for 5 hours. Since there is room to the August 23 low and the 2 week bear channel is tight, the odds favor lower prices. Therefore, if there is a rally today, it probably will fail within 2 days.<p>However, a tight trading range late in a bear trend is usually the Final Bear Flag. As a result, a bear breakout will probably only last a day or two and then reverse up. Furthermore, the 2 week selloff is in a parabolic wedge. It therefore will likely reverse up in at least 2 legs, lasting at least a couple days. This should begin by the end of the week.<p>Since this week’s upside and downside are probably small, the odds favor a trading range on the daily chart. A trading range on the daily chart usually creates a lot of trading range trading on the smaller time frames. Consequently, day traders will look to scalp reversals.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-breakout-test-of-January-high.png\"><img loading=\"lazy\" src=\"2018-9-3-2.png\" alt=\"Emini breakout test of January high\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>The Emini fell below last week’s low. While this triggered a weekly sell signal, it is a weak signal. Last week had a bull body and the weekly chart is in a tight bull channel.<p>The Emini had several big reversals today, and formed a trading range day. It reversed up from just above the January high. Since the reversal was not very strong, the Emini might have to drop below that high before the bulls will buy aggressively again. However, sometimes breakout tests like this are small, but lead to huge bull trend. An example is September 25, 2017. While unlikely, traders need to be prepared for a possible strong rally starting over the next few days.<p>Even though the daily chart is in a bull trend, most of the bars on the 5 minute chart have been within trading ranges for the past week. That is therefore likely again tomorrow. Traders will expect reversals.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-9-3"
    }
  ],
  "5": [
    {
      "data": [
        "<article class=\"post-81240 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini breakout test of January’s high and last week’s gapIntraday market update: Wednesday September 5, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini breakout test of January’s high and last week’s gap<br>Intraday market update: Wednesday September 5, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-09-05T06:20:15-07:00\">September 5, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini breakout test of January’s high and last week’s gap</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Yesterday had several reversals and therefore was a trading range day. The Emini tested into the gap below last week’s low, but did not close the gap. Furthermore, it reversed up from just above the January high. That is the breakout point of the 2 week rally. It is important to note that sometimes a small breakout test like this can lead to a huge bull trend.<p>However, the reversal up was not especially strong. In addition, by going below last week’s low, the Emini triggered a minor weekly sell signal. Therefore, the Emini might fall to below the January high before the bull trend resumes.<h3>Overnight Emini Globex trading</h3><p><br>The past 2 days had rallies into the close, which is bullish. Yet, yesterday opened down. In addition, since the Emini is down 10 points in the Globex session, today probably will open down as well. This erases that bullishness of those strong closes and it increases the odds that last week’s gap will close this week.<p>The daily and weekly charts are overbought and at the resistance of the top of the 8 month trading range. While last week broke above the range, there has been no follow-through. Therefore, the breakout is not yet successful. This means that it could reverse down for several weeks before the bulls try again.<p>An obvious target is the bottom of the bull channel on the daily chart, which is around 2850. Less likely, the Emini could reverse into a bear swing that tests below the midpoint of the 8 month range.<p>The Emini has been sideways for 6 days. Traders are deciding between trend resumption up and trend reversal down. Either could be strong. Therefore, while the days have been mostly in trading ranges on the 5 minute chart, there is an increased chance of a big trend day up or down. With September and October’s notorious history, traders should be ready if a selloff begins because it could be surprisingly strong.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-breakout-test-of-January-high.png\"><img src=\"2018-9-5.png\" alt=\"Emini breakout test of January high\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex parabolic wedge bull flag at support</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/EURUSD-Forex-parabolic-wedge-bull-flag-at-support.png\"><img loading=\"lazy\" src=\"2018-9-5-1.png\" alt=\"EURUSD Forex parabolic wedge bull flag at support\"></a><p class=\"caption\">The EURUSD daily Forex chart had big doji bar yesterday. It was the 3rd small leg down in a parabolic wedge pullback to support. Today so far is a doji inside day.<p><br>The 3 week rally on the weekly chart probably ended the bear trend on the daily chart. Now, the chart is now back in its 4 month trading range. While it might continue sideways for several more weeks, the odds favor a test of the 1.1850 top of the range.<p>At some point over the next few months, the bulls will probably get a breakout. Then next target would be a 50% retracement of the 2018 rally. That would be a test of the 1.20 Big Round Number.<h3>Overnight EURUSD Forex trading</h3><p><br>The daily chart is at support after a 3 week rally. Therefore, day traders will look to buy reversals up and bull breakouts on the 5 minute chart for scalps and swing trades. Since the daily chart is now in a bull trend, day trading bears will mostly look to scalp reversals down for 10 – 30 pips.<p>Because yesterday was a big day and today opened in its middle, traders will look to sell rallies near yesterday’s high and buy selloffs near yesterday’s low. Today will probably be either an inside day, or only break slightly beyond yesterday’s range.<p>The 6 day wedge bear channel is a big move down after a bigger move up. That creates confusion and typically leads to a trading range. Therefore, the EURUSD might spend a few days between 1.15 and 1.1650. However, the odds favor higher prices over the next couple of months. Day traders will be ready to swing trade strong rallies.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-test-of-January-high-and-bottom-of-gap.png\"><img loading=\"lazy\" src=\"2018-9-5-2.png\" alt=\"Emini test of January high and bottom of gap\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>The Emini sold off in a sell climax on the open and reversed up from 1 tick above the bottom of last week’s gap. Also, it reversed up from below the January high. However, the reversal up was not strong. Therefore, the Emini is still deciding whether the breakout above the January high will succeed or fail. Traders need more information.<p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-9-5"
    }
  ],
  "6": [
    {
      "data": [
        "<article class=\"post-81242 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini test of January high and bottom of gapIntraday market update: Thursday September 6, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini test of January high and bottom of gap<br>Intraday market update: Thursday September 6, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-09-06T06:20:29-07:00\">September 6, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini test of January high and bottom of gap</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Yesterday, the Emini sold off to within 1 tick of the bottom of the gap on the daily chart. Furthermore, it reversed up from below the January high. Yesterday is therefore a breakout pullback test of support and a buy signal bar for today. The bulls want a strong rally today and tomorrow. They would like the week to get above last week’s high. This week would then be an outside up week, which would be a sign of strength.<p>However, yesterday’s rally was not strong and the bulls failed to break above the 60 minute EMA. In addition, the Emini has been sideways for 7 days.<p>For the bears, the Emini is reversing down from the top of a 5 month bull channel. The target is the bottom of the channel, which is around 2860.<p>Therefore, the daily chart is still deciding whether the breakout above the January high will succeed or fail. Traders need more information.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 1 point in the Globex session. Therefore, today will probably open in yesterday’s 4 hour tight trading range. That increases the chance of a trading range open and of another mostly sideways day.<p>Since the daily chart is in breakout mode, a big trend up or down can begin on any day. However, until there is a strong breakout, there is no breakout. Day traders will continue to look for reversals after every 2 – 4 hour swing.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-test-of-January-high-and-bottom-of-gap.png\"><img src=\"2018-9-6.png\" alt=\"Emini test of January high and bottom of gap\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex double bottom bull flag after parabolic wedges</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/EURUSD-Forex-double-bottom-bull-flag-after-parabolic-wedges.png\"><img loading=\"lazy\" src=\"2018-9-6-1.png\" alt=\"EURUSD Forex double bottom bull flag after parabolic wedges\"></a><p class=\"caption\">The EURUSD daily Forex chart is rallying from a double bottom bull flag at the 20 day EMA. However, this follows a parabolic wedge buy climax and it is in the middle of a 5 month trading range.<p><br>The EURUSD daily Forex chart is rallying for a double bottom bull flag at the 20 day EMA. However, the parabolic wedge buy climax that ended August 28 is likely to have a 2nd leg sideways to down. In addition, the parabolic wedge bull flag that ended Tuesday was a tight bear channel. It therefore will likely lead to more sideways trading.<p>Consequently, while the bulls took control on August 15, the odds favor at least another week in the 5 month trading range. Since trading ranges resist breaking out, the daily chart may stay sideways for many weeks.<p>Markets often have symmetry. The daily chart was sideways for 3 months before the August 15 bull trend reversal. While unlikely, the trading range might continue for another 3 months before the bulls get their breakout.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute chart rallied 40 pips overnight, but most of the bars were small and had prominent tails. This looks more like a bull leg in a trading range than a resumption of a bull trend. Day traders will therefore continue to scalp until there is a strong breakout up or down.<p>Since there is support at the 1.1530 double bottom, the bulls will look for a swing trade up from that level. The bears correctly expect that this rally will form a lower high. They will therefore look for a 1 – 3 day reversal down starting today or tomorrow.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-parabolic-wedge-bottom-and-then-weak-lower-low-major-trend-reversal.png\"><img loading=\"lazy\" src=\"2018-9-6-2.png\" alt=\"Emini parabolic wedge bottom and then weak lower low major trend reversal\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>The Emini sold off strongly early and then entered a tight trading range at the 20 day EMA. It closed the August 24 gap, making it an exhaustion gap. However, the bulls got a late reversal back to test the January high.<p>Since the Emini reversed down from above the top of its 5 month bull channel, it will probably continue sideways to down to the bottom of the channel. There are 2 bull trend lines below, and the 1st target is around 2860. Traders will look for a reversal up from there. The bottom of the broader bull channel is around 2820.<p>Tomorrow is Friday and traders will pay attention to weekly support and resistance. The bears want the week to close below the bottom of the gap and below the January high. They also want the week to close on its low. The bulls always want the opposite.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-9-6"
    }
  ],
  "7": [
    {
      "data": [
        "<article class=\"post-81244 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini exhaustion gap and double top but minor reversalIntraday market update: Friday September 7, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini exhaustion gap and double top but minor reversal<br>Intraday market update: Friday September 7, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-09-07T06:20:25-07:00\">September 7, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini exhaustion gap and double top but minor reversal</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini sold off yesterday and closed the gap above the August 24 high. That is therefore now an exhaustion gap. If it gaps down any day within the next week, there will be an island top on the daily chart. However, the bull channel on the weekly chart is tight. Hence, this selloff will probably be minor, although it could last for 1 – 3 weeks.<p>The target for the bears is the bottom of the bull channel on the daily chart. There are 2 ways to draw it. Both bull trend lines are rising and currently are around 2860 and 2820. The bulls will buy a reversal up from either line.<p>By falling below last week’s low, the Emini triggered a minor weekly sell signal. Since today is Friday, the bears will try to make today close on its low. That would create a bear bar closing on its low on the weekly chart. It would make at least slightly lower prices likely next week.<p>The bulls always want the opposite. However, the 7 day bear micro channel will limit the upside over the next few days.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 10 points in the Globex session. If it gaps down, there will be an 8 day island top on the daily chart. But, island tops and bottoms are minor reversals. In addition, if there is only a small gap down, it will probably close in the 1st hour.<p>There is a magnet at the bottom of the bull channel on the daily chart. In addition, there is a 7 day bear micro channel on the daily chart. Therefore, there is good momentum down. The odds are that traders will sell rallies until the chart reaches the bottom of the bull channel.<p>Because that bull trend line is so close, there is an increase chance of a sell vacuum down today. That simply means a quick bear breakout down to support. But, there will probably be buyers in that area.<p>Today will probably be the 6th day without a pullback. While the bear leg is not strong, it is enough selling for traders to sell above the prior day’s high. Therefore, the bulls will need at least a micro double bottom before they can rally to a new high. Traders will continue to sell rallies until then.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-parabolic-wedge-bottom-and-then-weak-lower-low-major-trend-reversal.png\"><img src=\"2018-9-7.png\" alt=\"Emini parabolic wedge bottom and then weak lower low major trend reversal\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex trading range with limit order buyers below and sellers above</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/EURUSD-Forex-trading-range-with-limit-order-buyers-below-and-sellers-above.png\"><img loading=\"lazy\" src=\"2018-9-7-1.png\" alt=\"EURUSD Forex trading range with limit order buyers below and sellers above\"></a><p class=\"caption\">The EURUSD daily Forex chart has been sideways for 5 days. A 2nd leg sideways to down is likely after the August 28 parabolic wedge buy climax.<p><br>The EURUSD daily Forex chart reversed up strongly from the August 15 failed breakout. However, it is back in its 5 month trading range and again going sideways. The August 28 parabolic wedge buy climax is likely to have a 2nd leg sideways to down. Therefore, there are probably sellers around the current level and up to 1.17.<p>But, the bull trend reversal was strong enough to end the bear trend. Consequently, there are probably buyers below, including below the September 4 low.<p>Since the chart is in a trading range, traders believe that there will not be protracted moves. They will therefore take quick profits. Because traders will scale into shorts above and scale into longs below, the daily chart will have a difficult time going more that a few days in one direction.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart sold off 70 pips over the past 4 hours. It will probably test the September 4 low early next week, and it might even fall below.<p>However, since the daily chart is in a trading range, it will be difficult for day traders to make more than 30 pips on any trade. The trading range on the daily chart is a sign that traders believe that the price is fair. If the price falls, traders see it as a discount and look to buy a reversal up. When it goes up, they see it as too expensive and look to sell a reversal down.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-expanding-triangle-bear-flag-and-expanding-triangle-bottom.png\"><img loading=\"lazy\" src=\"2018-9-7-2.png\" alt=\"Emini expanding triangle bear flag and expanding triangle bottom\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>After an expanding triangle bottom on the open, the Emini rallied for 2 hours. It sold off from a wedge and expanding triangle top at the 60 minute EMA, the January high, and the top of the 7 day bear channel. The bull trend line on the daily chart is around 2860 and it will probably draw the Emini down to it next week.<p>Since there is a 7 day bear micro channel, traders will probably sell the 1st reversal up.<p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-9-7"
    }
  ],
  "8": [
    {
      "data": [
        "<article class=\"post-81248 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini exhaustion gap but minor higher high reversalEmini weekend update: September 8, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini exhaustion gap but minor higher high reversal<br>Emini weekend update: September 8, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-09-08T00:30:28-07:00\">September 8, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Stalling just above the January all-time high</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-monthly-candlestick-chart-has-a-bear-inside-bar.png\"><img loading=\"lazy\" src=\"2018-9-8.png\" alt=\"Emini monthly candlestick chart has a bear inside bar\"></a><p class=\"caption\">The candlestick so far this month on the monthly S&amp;P500 Emini futures candlestick chart is a bear inside bar. While the bears want a reversal, the bull trend is strong. September is more likely a pause in the bull trend than a setup for a bear trend reversal.<p>The monthly S&amp;P500 Emini futures candlestick chart has rallied for the past 5 months after the most extreme buy climax in the history of the stock market. September is currently a pause in the rally to a new high. The odds are that the pullback will last for only a month or two before the bull trend resumes. There are measured move targets around 3100 and 3200 on the weekly chart. The rally will probably reach them within a few months.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Weak micro wedge sell signal</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-weekly-chart-has-failed-breakout-above-January-all-time-high.png\"><img loading=\"lazy\" src=\"2018-9-8-1.png\" alt=\"Emini weekly chart has failed breakout above January all time high\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart triggered a minor sell signal this week by trading below last week’s low. The bears have a 6 week micro wedge and a failed breakout above the January high. This week also closed last week’s gap up.<p>The weekly S&amp;P500 Emini futures candlestick chart is in a tight bull channel. However, the micro wedge of the past 6 weeks could lead to a 1 – 3 week pullback. Since the rally from the April low is strong, the 1st reversal down will probably be minor.<p>It is important to note that every leg down since January lasted only 1 – 3 weeks. That includes the big selloffs in February and March. There is no reason to believe that this week’s reversal down will be any different. The odds are that there are buyers below and that the bull trend will soon resume. The 1st support is the 20 week EMA which is around 2800. That is also around the June high.<p>Because September has a bad reputation as worst performing month of the year, traders are extra cautious. This increases the chances of a bigger pullback. For example, the gap above the 2766.25 July 6 high is another magnet below. However, the odds favor a rally up to the measured move targets around 3100 and 3200 before there is a test of the February low.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Emini exhaustion gap but minor higher high reversal</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-daily-chart-reversing-down-from-top-of-bull-channel.png\"><img loading=\"lazy\" src=\"2018-9-8-2.png\" alt=\"Emini daily chart reversing down from top of bull channel\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart sold off in a 7 bar bear micro channel over the past 2 weeks. The odds are that it will continue sideways to down to one or both bull trend lines below.<p>Six days ago, the daily S&amp;P500 Emini futures candlestick chart reversed down from above the top of its 5 month bull channel. While the 20 day EMA is support, a channel reversal usually reaches the bottom of the channel before the bulls will return. The selloff might stop at the higher bull trend line. Even if it reaches the lower line, it will likely be just a bear leg in a bull trend.<p>The next support is the June 13 high just below 2800. The most recent major higher low is the June 28 low at 2693. No one knows where the end of the selloff will be, but there is only a 40% chance of a test of the April low, and only 1 30% chance of a strong break below the February low. The bulls will buy any reversal up from even a strong reversal down and expect a new all-time high.<p>The bears want a strong break below both bull trend lines. They also want a break below a major higher low, like the August 2 low. They need to get consecutive big bear bars falling below support before traders will believe that the breakout above the January high has failed. Since the weekly and monthly bull trends are strong, the odds continue to favor the bulls. Traders will will continue to buy every reversal down.<h4>7 day bear micro channel means subtle selling pressure</h4><p>Each of the past 6 days has a high below the high of the prior day. This is a 7 day bear micro channel. Even though the price has not fallen greatly, the bears have been in control for a long time. Every chart has 2 variables, price and time. Some trends begin slowly, which means that time can be more important before price falls sharply.<p>Why is every high a little lower? It is because traders correctly believe that there are sellers above the prior day’s high. The bears are so afraid of missing out on a short that they are beginning to sell any rally that gets near the prior day’s high.<p>This 7 day micro channel is a warning that the Emini could fall quickly next week. After an unknown number of days in a micro channel, both the bulls and bears agree that the bears own the market. Once that happens, the Emini could fall far and fast from a bear breakout below the 7 day bull flag (a bear channel is a bull flag). At the moment, there is a 40% chance of a successful bear breakout below the bear channel and a measured move down to around 2800.<p>Traders will watch for a gap down next week. If one comes, then there will be an island top that began with the August 27 gap up. Alternatively, if there is an unusually big bear bar or consecutive big bear bars, that could be a measuring gap. The bears will sell and the bulls will wait until the selloff has at least a couple legs down to support before buying again.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-9-8"
    }
  ],
  "10": [
    {
      "data": [
        "<article class=\"post-81246 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini testing bottom of bull channel at around 2860Intraday market update: Monday September 10, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini testing bottom of bull channel at around 2860<br>Intraday market update: Monday September 10, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-09-10T06:20:58-07:00\">September 10, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini testing bottom of bull channel at around 2860</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini has sold off without a pullback for 7 days. It is getting vacuumed down to the bottom of the bull channel. There are two bull trend lines. The 1st is just below Friday’s low, and the Emini will probably get there within a week by trading mostly sideways.<p>While the bulls want a reversal up from that trend line support, they will probably need a micro double bottom. This is because after 7 days without a pullback, the bears will sell above the prior day’s high. As a result, the upside is limited for at least a couple of days.<p>Can the bears get a strong break below the channel and then a test of the broader bull channel’s bottom around 2820? Of course, but the odds are that there will be at least some buying around the 2860 bottom of the tighter bull channel.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 8 points in the Globex session. However, after 7 days without a pullback, the odds are that there are sellers above Friday’s high. In addition, the bull trend line below Friday’s low is still a magnet. Consequently, the bulls will probably not be able to hold above Friday’s high for more than a couple of days.<p>But, 7 days without a pullback is extreme and therefore climactic. Consequently, there is an increased chance of a 1 – 3 day rally. Emini day traders will look for a swing up today, especially if the bulls can break above the 60 minute EMA and the 7 day bear trend line on the 60 minute chart.<p>Can the bears get a collapse today? Unlikely. However, if there is a strong break below the 7 day bear channel, day traders need to sell. It never matters if something is unlikely if it is happening. Day traders trade what is in front of them, not what they thing should be in front of them.<h2>Friday’s setups</h2><p><br><img src=\"2018-9-10.png\" alt=\"\"><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/EURUSD-Forex-head-and-shoulders-top-and-triangle-bull-flag.png\"><img loading=\"lazy\" src=\"2018-9-10-1.png\" alt=\"EURUSD Forex head and shoulders top and triangle bull flag\"></a><p class=\"caption\">The EURUSD daily Forex chart has a 3 week head and shoulders top. But, that is always also a triangle bull flag. Since the chart had a bull trend reversal in August, the odds favor the bulls.<p><br>Last week, I said that the daily chart would have 2 legs down to around the August 23 low and the 20 day EMA after a parabolic wedge rally. The bears achieved their goal overnight.<p>The bears now have a head and shoulders top over the past 3 weeks. However, only 40% of reversals actually lead to a reversal. Furthermore, every head and shoulders top is also a triangle bull flag. There is a 60% chance of sideways to up trading.<p>Even if the bears get a few days down below the neck line, the daily chart had a strong bull trend reversal that began on August 15. Therefore, the odds are that the bulls will buy any selloff that reverses up from above that low. The bears need a strong break below that support before traders will believe that the bears have regained control.<p>The odds favor the bulls over the next several weeks. Since the daily chart is back in a 5 month trading range, it might trade sideways here for many more weeks before breaking above the July 31 top of the final leg down. But, the odds favor the breakout.<p>Because of the trading range, traders will take profits after ever few days up or down. In addition, when the market is low, like today, they buy. When it is near the top of the range around 1.17, they sell. The result is a continuation of the range.<p>I wrote about this repeatedly in May and June. Every time there was a strong leg up or down, I said that a reversal was more likely than a breakout. That is again true.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute chart dipped 4 pips below the 2 week double bottom and then reversed up 60 pips over 3 hours. This is because most traders believe that the head and shoulders top is a minor reversal. They therefore bet against the bear breakout.<p>The 5 minute chart has been sideways for 3 hours. If the bulls can close the day near its high, today will be a good buy signal bar on the daily chart. There is therefore an increased chance of a resumption of the overnight bull trend this morning.<p>But, the daily chart is in a trading range. Therefore, the odds constantly favor disappointed bulls and bears. For example, if today closes 20 or more pips below today’s high, the buy signal bar on the daily chart will be weak. The bulls tomorrow will be less willing to buy above today’s high. That could result in a few sideways days around 1.1550. The bears would then try again to break below the 3 week head and shoulders top.<p>Since the rally stalled over the past 3 hours, there might not be much movement left for the remainder of the day. Also, 1.16 has been both support and resistance over the past 5 days, and it is only 20 pips above.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-failed-breakout-above-8-day-bear-micro-channel.png\"><img loading=\"lazy\" src=\"2018-9-10-2.png\" alt=\"Emini failed breakout above 7 day bear micro channel\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>Today was the 1st breakout above a 7 day bear micro channel. As expected, there were sellers above Friday’s high. But, the selloff was not strong and today was a trading range day. The bulls might get a 2nd day above the micro channel, but the odds favor a test of the bull trend line on the daily chart, which is now around Friday’s low. The Emini can get there by going sideways or down this week.<p>Since today was a failed breakout above the 7 day bear micro channel, it is a sell signal bar for tomorrow. However, there will probably be buyers around the bull trend line, which is around Friday’s low.<p>Last week was a bear bar on the weekly chart after a 6 bar bull micro channel. It is therefore a sell signal bar for this week. But, the bull channel on the weekly chart is tight. Therefore, this is a minor sell setup.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-9-10"
    }
  ],
  "11": [
    {
      "data": [
        "<article class=\"post-81433 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini weak breakout above 7 day bear micro channel Intraday market update: Tuesday September 11, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weak breakout above 7 day bear micro channel<br>Intraday market update: Tuesday September 11, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-09-11T06:20:27-07:00\">September 11, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini weak breakout above 7 day bear micro channel</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Yesterday was the 1st day in 7 days that traded above the prior day’s high. A 7 bar bear micro channel is a sign of strong bears. Therefore, there were more likely going to be more sellers than buyers above Friday’s high. The result was a failed breakout above Friday’s high on the open. Yesterday is a sell signal bar for today.<p>Furthermore, the Emini should test the bull trend line below last week’s low. It can get there by going sideways or down. Even if today trades above yesterday’s high, the magnet of the bottom of the channel is strong. Most bulls will not buy until that bull trend line has been touched, or unless there is a strong rally from here. The bulls want to see a strong reversal up from that support.<p>If instead the Emini simply rallies strongly this week without touching the line, traders will conclude that Friday’s test was good enough. More likely, the Emini will need to touch that line.<h4>Minor sell signal on the weekly chart</h4><p>There is a 6 week parabolic wedge top on the weekly chart. This is a small pattern and therefore minor. The bears want it to be a failed breakout above the January high. Last week was a bear bar and therefore a 2 bar reversal with the prior week. It is a sell signal bar for this minor top.<p>Since there is a bull trend line on the daily chart around last week’s low, the Emini will probably trade below last week’s low in its test of that trend line. That would trigger the weekly sell signal.<p>Every selloff since the January high ended after 1 – 3 weeks. This includes the huge February collapse. Traders will therefore expect the same this time, and look for a reversal back up within 2 – 3 weeks.<p>Can a minor top like this lead to a major trend reversal? Here, a bear trend and a break below the February low. In general, there is a 20% chance. The odds go up if the bears begin to get consecutive big bear bars on the weekly chart. Also, if there is a strong minor reversal and then a failed attempt to resume the bull trend, there would then be a major trend reversal sell setup.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 8 points in the Globex session. It will therefore gap down on the open. Since last week’s low and the daily bull trend line are just below, the Emini should trade lower this week. There is therefore an increased chance of a bear trend day today. However, most days over the past 2 weeks have had mostly trading range trading. Therefore, even if today sells off, the odds are against a strong bear trend.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-failed-breakout-above-8-day-bear-micro-channel.png\"><img src=\"2018-9-11.png\" alt=\"Emini failed breakout above 8 day bear micro channel\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex head and shoulders top and triangle bull flag so Breakout Mode</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/EURUSD-Forex-head-and-shoulders-top-and-triangle-bull-flag-1.png\"><img loading=\"lazy\" src=\"2018-9-11-1.png\" alt=\"EURUSD Forex head and shoulders top and triangle bull flag\"></a><p class=\"caption\">The EURUSD daily Forex chart has been in a trading range for 3 weeks. There is therefore both a buy setup and a sell setup. The bears have a head and shoulders top and the bulls have a triangle bull flag.<p><br>The EURUSD daily Forex chart is in a 3 week triangle and therefore in Breakout Mode. Furthermore, that triangle is in a 5 month trading range. Since there is no sign of an impending breakout, traders will take profits after 2 – 5 days and look for reversals.<p>The August reversal was strong and the weekly chart is probably having a 7 month pullback in a bull trend. Consequently, the odds ultimately favor a bull breakout. But, until there is a breakout, there is no breakout. Traders will expect every strong 3 – 5 day move up or down to reverse.<h4>3 week Triangle means Breakout Mode</h4><p>While the bulls have a triangle bull flag, triangles are not high probability setups. The initial breakout up or down reverses 50% of the time. In addition, the successful breakout has almost an equal chance of being up or down. There is therefore a 50% chance of a break below 1.15 before a test of the 1.1750 top of the 5 month range. However, there will probably be buyers above 1.14.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart sold off 80 pips overnight after a rally for a day and a half. Big Up, Big Down creates Big Confusion. Therefore, the selloff will probably disappoint the bears, just like reversal down from the the rally disappointed the bulls. Today will probably be a trading range day in the middle of a 7 day tight trading range.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-outside-up-day-and-bull-trend-from-the-open.jpg\"><img loading=\"lazy\" src=\"2018-9-11-2.jpg\" alt=\"Emini outside up day and bull trend from the open\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>The Emini reversed up from below yesterday’s low and broke above yesterday’s high. It therefore was an outside up day, which is a sign of strong bulls. It also formed a micro double bottom with Friday’s low.<p>However, it is in a 4 day tight trading range. Furthermore, it has not yet pulled back to the bull trend line, which is now around yesterday’s low. Therefore, unless there is strong follow-through buying this week, the odds will continue to favor a test of that bull trend line before the bull trend resumes.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-9-11"
    }
  ],
  "12": [
    {
      "data": [
        "<article class=\"post-81435 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini outside up day and micro double bottomIntraday market update: Wednesday September 12, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini outside up day and micro double bottom<br>Intraday market update: Wednesday September 12, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-09-12T06:20:40-07:00\">September 12, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini outside up day and micro double bottom</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini had a big outside up day yesterday. It formed a micro double bottom with Friday’s low, and it is therefore a buy signal bar for today.<p>However, the 2 week selloff did not reach the bottom of the bull channel or last week’s low. Both remain magnets below. Unless the bulls get strong follow-through buying today or tomorrow, the odds favor sideways to down to the bull trend line. It is currently just below yesterday’s low.<p>If yesterday is the end of the 2 week selloff, the bulls will begin to create a series of bull trend days. Day traders should therefore be ready to swing trade if today begins to trend.<p>Can today reverse down? Yes. Remember, there are magnets below yesterday’s low. Also, yesterday’s high stopped at a 50% pullback from the 2 week selloff. As big a bull day as yesterday was, without follow-through today, it is just a bull bar in a 4 day tight trading range.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 1 point in the Globex session. If it opens here, it will be in yesterday’s 4 hour tight trading range. The bulls want trend resumption up, which is slightly more likely than a trend reversal down.<p>However, the Emini would not be going sideways if the bulls had a significant advantage. The bulls and bears are balanced, and day traders need to be prepared for a breakout up or down. Support below is at the 60 minute 20 bar EMA and the January high. Resistance is at yesterday’s high, which was a 50% retracement of the 2 week selloff.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-outside-up-day-and-bull-trend-from-the-open.jpg\"><img src=\"2018-9-12.jpg\" alt=\"Emini outside up day and bull trend from the open\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex triangle bull flag in 5 month trading range</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/EURUSD-Forex-triangle-bull-flag-in-5-month-trading-range.png\"><img loading=\"lazy\" src=\"2018-9-12-1.png\" alt=\"EURUSD Forex triangle bull flag in 5 month trading range\"></a><p class=\"caption\">The EURUSD daily Forex chart has been in a triangle for 3 weeks. While the pullback from the August 28 bull trend reversal might extend lower, the odds are that the daily chart is now in an early bull trend.<p><br>The EURUSD daily Forex chart had a lower high on August 28. The bears hope that the 3 week selloff is a resumption of the 8 month bear trend. However, the reversal up from the August 15 low was strong. In addition, the 8 month bear trend is probably just a bull flag on the weekly chart. Therefore, the daily chart is likely in the early stage of a bull trend that will last many months.<p>Since the daily chart is now back in its 5 month trading range, it could stall here for a couple of months. In addition, it might break again below the June 21 low. But, the odds are that the August 15 low will hold and the rally will break above the 1.1850 top of the range before the bears break below the August 15 low.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute chart has been in a 35 pip range overnight. That range is in the middle of a 3 week triangle and a 5 month trading range. Day traders will only scalp unless there is a strong breakout up or down. Since the daily chart is reversing every couple of days, the bulls will look to buy below yesterday’s low.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-trading-range-day-above-January-all-time-high.jpg\"><img loading=\"lazy\" src=\"2018-9-12-2.jpg\" alt=\"Emini trading range day above January all time high\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>The Emini formed a trading range today. There was no follow-through buying after yesterday’s rally. This is because many bulls do not want to buy until there is a reversal up from the daily trend line, which is around yesterday’s low. Alternatively, they will buy higher if there is a strong rally tomorrow. The odds favor sideways to down to the bull trend line.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-9-12"
    }
  ],
  "13": [
    {
      "data": [
        "<article class=\"post-81437 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini 50% retracement of last week’s bear trendIntraday market update: Thursday September 13, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini 50% retracement of last week’s bear trend<br>Intraday market update: Thursday September 13, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-09-13T06:20:12-07:00\">September 13, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini 50% retracement of last week’s bear trend</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini formed a trading range yesterday after Tuesday’s rally. That rally topped out at a 50% retracement of the 2 week selloff. After yesterday’s lack of follow-through buying, the bulls need a bull day today.<p>Their problem is the bull trend line on the daily chart. It is around Tuesday’s low and the Emini still might get there this week by going sideways or down. Consequently, to make traders believe that Tuesday was an adequate test of that support, the bulls need a strong rally today.<h3>Overnight Emini Globex trading</h3><p><br>Today is rollover day in the Emini. Most traders will continue to trade the September contract today because it will have much greater volume. However, the continuation charts are now based on December.<p>The Emini is up 10 points in the Globex market. It therefore might gap above yesterday’s high. The bulls need a strong rally today and tomorrow to confirm Tuesday’s micro double bottom on the daily chart. If they get it, the odds will favor a new high within a couple of weeks. If they do not, the Emini will likely continue sideways to down to the bull trend line below.<p>The Emini has been in a tight range for 6 days. That increases the chance of a lot of trading range trading again today. But, since the Emini is at support on the daily chart, it is in breakout mode. Tuesday was a small bull breakout. There is an increased chance of a bull trend day today and a confirmation of Tuesday’s bull trend reversal.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-trading-range-day-above-January-all-time-high.jpg\"><img src=\"2018-9-13.jpg\" alt=\"Emini trading range day above January all time high\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/EURUSD-Forex-triangle-bull-flag-after-bull-trend-reversal.png\"><img loading=\"lazy\" src=\"2018-9-13-1.png\" alt=\"EURUSD Forex triangle bull flag after bull trend reversal\"></a><p class=\"caption\">The EURUSD daily Forex chart has been sideways for 3 weeks after its bull trend reversal. This might continue for 1 – 2 months, but the odds favor a bull breakout. If there is a break below the September 10 low, there will be buyers above the August 15 low.<p><br>The EURUSD daily Forex chart has been in a trading range for 5 months. Despite the August 28 lower high, it is also in the early stages of a bull trend. Therefore, the odds are that it will break above the 1.1850 top of the range before it falls below the August 15 1.13 bottom of the range. But, there is no sign of an impending breakout, so the range could continue for a month or more.<p>It had been in a tight triangle for 3 weeks. Traders ave been taking profits after 1 – 3 days and betting on small reversals.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart has been in a 30 pip range overnight. Day traders are continuing to scalp, betting on reversals instead of breakouts.<p>Since the past 3 weeks have been in a triangle, the odds of a bear breakout below the 3 week tight range are almost as high as for a breakout above. However, the bear breakout will fail, even if it lasts a few days. The bulls should be able to create a higher low above the August 15 low.<p>The 5 minute chart had a 40 pip rally over the past 10 minutes. That increases the chance of a bull trend day today.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-gap-up-and-double-bottom.jpg\"><img loading=\"lazy\" src=\"2018-9-13-2.jpg\" alt=\"Emini gap up and double bottom\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>The Emini gapped up, but then went sideways. The bulls need strong follow-through buying tomorrow. If they fail to get it, this 4 day rally might reverse down from a lower high. If tomorrow gaps down, today will be a 1 day island top. However, island tops and bottoms are minor reversals.<p>Tomorrow is Friday and therefore weekly support and resistance are important, especially at the end of the day. This week’s high, low and open are magnets, as are last week’s high and low.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-9-13"
    }
  ],
  "14": [
    {
      "data": [
        "<article class=\"post-81439 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini weak bull trend resumption but trend line belowIntraday market update: Friday September 14, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weak bull trend resumption but trend line below<br>Intraday market update: Friday September 14, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-09-14T06:20:04-07:00\">September 14, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini weak bull trend resumption but trend line below</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini gapped up yesterday, but formed a small trading range day. This is weak follow-through after Tuesday’s bull reversal. If the bulls do not get strong buying in the next few days, the Emini will probably reverse down from a lower high. The target for the bears is the bottom of the bull channel.<p>Today is Friday and therefore weekly support and resistance are important. Because the week is small, its high, low, and open are magnets, as are last week’s high and low.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 3 points in the Globex session. If it gaps up, the gap will be small. Small gaps usually close in the 1st hour.<p>Since yesterday was a small day, there is an increased chance of an outside down day. This means that the Emini has an early reversal down from above yesterday’s high followed by a break below yesterday’s low.<p>Most days over the past 3 weeks have been sideways with legs up and down. That is therefore likely again today, especially with yesterday being a small day.<p>However, because the daily chart is testing the resistance of the January high, there is an increased chance of a big trend day up or down. If there is a strong breakout in either direction, day traders will be willing to hold their swing trades all day if the trend continues.<p>But, the odds favor another mostly sideways day. Day traders will expect reversals. They will also expect the Emini to get drawn to weekly support or resistance in the final hour.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-gap-up-and-double-bottom.jpg\"><img src=\"2018-9-14.jpg\" alt=\"Emini gap up and double bottom\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex top of 3 week and 5 month trading ranges</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/EURUSD-Forex-top-of-3-week-and-5-month-trading-ranges.png\"><img loading=\"lazy\" src=\"2018-9-14-1.png\" alt=\"EURUSD Forex top of 3 week and 5 month trading ranges\"></a><p class=\"caption\">The EURUSD daily Forex chart rallied for 5 days. It is now at the top of a 3 week and 5 month trading range.<p><br>The EURUSD daily Forex chart is at the top of a 5 month trading range. There have been many strong legs up and down in the 5 month range. Most trading range breakout attempts fail, even when they are strong. Therefore, the odds are that the daily chart will reverse down for several days starting within the next few days. This is true even if the rally breaks above the July 31 top of the sell climax.<p>The late August bull trend reversal was strong and the weekly chart is in a bull trend. Therefore, there should be a successful break above the trading range and a 50% retracement of the 7 month selloff.<p>However, picking which breakout attempt will succeed is a bad way to trade. Until there is a clear breakout, it is better to bet on reversals. Therefore, traders will look for sell setups now that the rally is at the top of the 5 month range. Since all legs up and down have reversed within 3 – 5 days, they will look for a trade down and not a bear trend.<p>Once there is a strong breakout above the June 14 1.1851 high, traders will look for a move up to 1.20. However, the 5 month trading range could last for more than a month before that happens.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart has been in a 30 pip range overnight. It reversed down from just below the August 28 lower high. The bears want the series of lower highs since June to continue. But, the daily chart is now in a bull trend. Therefore, there will soon be a move above the July 31 high.<p>Because the daily chart is at the top of its range, day traders will sell rallies, looking for at least a 100 pip reversal down for a few days. However, since the 5 day rally has been strong, they will buy pullbacks as well. They know that the leg down will probably need a micro double top. Therefore, the 1st down move will likely last only 1 – 2 days.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-reversed-up-from-almost-outside-down-day-1.png\"><img loading=\"lazy\" src=\"2018-9-14-2.png\" alt=\"Emini reversed up from almost outside down day\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>The Emini sold off from above yesterday’s high, but reversed up from just above yesterday’s low. It was a trading range day. The tail below the bar on the daily chart makes it a weak sell signal.<p>A gap down next week would create an island top. If instead the Emini just sold off and closed the gap above Thursday’s high, the gap would be an exhaustion gap. But, island tops, island bottoms, and exhaustion gaps are minor reversal patterns. The odds are against a bear trend on the daily chart at the moment.<p>A selloff next week would create a micro double top on the weekly chart. Since the weekly bull trend is strong, the reversal would be minor.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-9-14"
    }
  ],
  "15": [
    {
      "data": [
        "<article class=\"post-81443 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini possible minor trend reversal at August highEmini weekend update: September 15, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini possible minor trend reversal at August high<br>Emini weekend update: September 15, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-09-15T00:30:03-07:00\">September 15, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>6 month rally to new all-time high</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-monthly-chart-in-strong-bull-breakout-to-new-all-time-high.png\"><img loading=\"lazy\" src=\"2018-9-15.png\" alt=\"Emini monthly chart in strong bull breakout to new all time high\"></a><p class=\"caption\">The candlestick on the monthly S&amp;P500 Emini futures chart is a doji inside bar so far in September. The 6 month rally is likely to continue.<p>The monthly S&amp;P500 Emini futures candlestick chart is having strong trend resumption up after the February selloff and then 2 sideways months. Because 2017 was so climactic, the current rally will probably stall within a few months from a 2nd exhaustion. The measured move projection based on the height of the February pullback is 3234.00 (see weekly chart). Their are other lower targets as well.<p>Since the 6 month rally is strong, the bulls will buy the 1st pullback. Consequently, the downside risk over the next couple of months is small.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Small Pullback Bull Trend at all-time high</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-weekly-chart-in-Small-Pullback-Bull-Trend-in-breakout-to-new-all-time-high.png\"><img loading=\"lazy\" src=\"2018-9-15-1.png\" alt=\"Emini weekly chart in Small Pullback Bull Trend in breakout to new all time high\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart has rallied in a tight bull channel since the April low. In fact, every pullback since January ended in 1 – 3 weeks. There is no reason to believe that the current pullback will be different. The odds favor higher prices.<p>The weekly S&amp;P500 Emini futures candlestick chart has been rallying in a tight bull channel since the April double bottom with the February low. While last week was a sell signal bar for a failed breakout above the January high, any reversal was likely to be minor.<p>This is because the 6 month rally is a Small Pullback Bull Trend. That is a strong bull trend and reversals typically only last 1 – 3 bars. The bears usually need a strong minor reversal down and then some type of a double top before they can create a trend down.<p>Because last week was a bear bar, it was a weak buy signal bar for this week. That increases the chances that there will be more sellers than buyers above its high. If so, next week could reverse down. That would form a micro double top, as well as a higher high double top with the January high. Traders would then look for a 1 – 3 week pullback.<h4>1st trend reversal down will likely be minor</h4><p>If next week reverses down, it will form a micro double top with the high from 2 weeks ago. The bears would then have a 40% chance of a test down. A reasonable target is the 20 week EMA, which is just above 2800.<p>But, because the 6 month bull channel is tight, the bulls will buy the selloff. Their buying would likely lead to another all-time high. The odds favor a test of the measured move targets around 3100 and 3200 over the next several months (see the chart).<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Emini possible minor trend reversal at August high</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-daily-candlestick-chart-getting-weak-breakout-above-bull-flag.png\"><img loading=\"lazy\" src=\"2018-9-15-2.png\" alt=\"Emini daily candlestick chart getting weak breakout above bull flag\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart rallied this week after a 2 week selloff. However, the rally is weak and Friday is a minor sell signal bar for next week.<p>The daily S&amp;P500 Emini futures candlestick chart has been in a bull channel since the April low. But, the 5 day rally has been weak. Since Friday has a bear body, it is a sell signal bar for Monday. The big tail at the bottom of the bar lowers the probability of a selloff. The bears will probably need a better sell signal bar next week before traders will sell.<p>The bears want a lower high major trend reversal (compared to the August high). Since the 6 month bull channel is tight, any reversal here will probably be minor. However, a minor reversal could last several weeks and fall to support at around 2800.<p>Since the Emini gapped up on Thursday, a gap down next week would create an island top. If next week did not gap down but simply closed the gap, the gap would be an exhaustion gap. Island tops, island bottoms, and exhaustion gaps are minor reversal patterns. But, a minor reversal could still last several weeks.<h4>The importance of a major higher low</h4><p>The bears need a strong reversal down to below the bottom of the bull trend channel. More importantly, they need a break below the most recent major higher low. The is the June 28 low of 2698.50. While the August 2 low of 2800.00 is important, it came after just a couple medium size bear bars in a tight bull channel. It is therefore minor. That means that a selloff to below its low would not end the bull trend.<p>If the bears break below the June 28 major higher low, the bull trend will have ended. The chart would then be either in a trading range or a bear trend. Until then, it is in either a trading range or a bull trend.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-9-15"
    }
  ],
  "17": [
    {
      "data": [
        "<article class=\"post-81441 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini possible minor double top at August all time highIntraday market update: Monday September 17, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini possible minor double top at August all time high<br>Intraday market update: Monday September 17, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-09-17T06:20:21-07:00\">September 17, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini possible minor double top at August all time high</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini rallied last week, but the rally lacked consecutive big bull bars. It therefore looks more like a leg in a trading range than a bull trend.<p>Friday closed with a bear body and it a sell signal bar for today. Since it was a doji bar, it is a weak sell signal.<p>Thursday gapped up so a gap down today or any day this week will create an island top. If today simply sold off and closed the gap, the gap would be an exhaustion gap. Therefore, there is an increased chance of a bear trend day today and for the start of a leg down.<p>Island tops, island bottoms, and exhaustion gaps are minor reversals. But, a minor reversal could last several weeks and test support around 2800.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 4 points in the Globex market. It will therefore probably open in the middle of the 2 day range. Traders are deciding if last week’s rally is a resumption of the bull trend or just a bear leg in a 3 week trading range. The more bull bars that form on the daily chart, the more likely the bull trend has resumed. The lack of consecutive strong bull days over the past 6 days makes a bull leg in a trading range more likely. That means that the odds favor sideways to down over the next week or two.<p>Because the Emini is testing the important January high, there is an increased chance of a big trend day up or down. However, since most of the days over the past 3 weeks have spent most of the time in trading ranges, that is likely again today.<h2>Friday’s setups</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-reversed-up-from-almost-outside-down-day-2.png\"><img src=\"2018-9-17.png\" alt=\"Emini reversed up from almost outside down day\"></a><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex pullback from test of top of 5 month trading range</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/EURUSD-Forex-pullback-from-test-of-top-of-5-month-trading-range.png\"><img loading=\"lazy\" src=\"2018-9-17-1.png\" alt=\"EURUSD Forex pullback from test of top of 5 month trading range\"></a><p class=\"caption\">The EURUSD daily Forex chart reversed most of Friday’s selloff overnight. Friday was probably a pullback from a test of the top of the 5 month range and not the start of a bear trend reversal.<p><br>I said last week that traders would sell above bars and buy below. On Friday, they sold above Thursday’s high, and today they bought below Friday’s low. This is what typically happens in a trading range.<p>As strong a bear day as Friday was, the daily chart is now in a bull trend. Therefore, Friday was likely simply a pullback from a 4 day rally that was testing the top of the 5 month range.<p>The bears want Friday to be another lower high in a 5 month series of lower highs. They then want a new low below the August low. That would indicate that their broad bear channel is still intact. However, the reversal up from the August 15 low and the context makes a bull trend more likely on the daily chart. Therefore, selloffs are probably just pullbacks in an early bull trend.<p>Trading ranges resist breaking out. As a result, the daily chart could go sideways for months before the bulls break strongly above the June 15 top of the range at around 1.1850. More likely, they will get a minor break above the July 31 sell climax high of 1.1747 within 1 – 3 weeks. If so, that breakout could reverse back into the range. Whether or not it does, the odds still favor a strong break above 1.1850 before a break below 1.13.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute chart rallied 60 pips overnight. But, it is now close to the top of its 4 week range within the top half of the 5 month range. Since most breakout attempts fail, the odds are that the overnight rally will stall today or tomorrow and continue the 4 week range. Consequently, despite the good overnight rally, day traders will look to sell reversals down from above 1.17. Because the daily chart is in an early bull trend, day traders will keep buying selloffs, like below Friday’s low.<p>The overnight rally has had 3 pushes up in a tight bull channel. That is a potential parabolic wedge buy climax, which typically transitions into a trading range lasting at least 10 bars.<p>The bulls do not need today’s rally to extend above Friday’s high and form an outside up day. However, they want today to close near its high. Day traders will therefore buy pullbacks to make the day close near its high. Today would then be a strong buy signal bar for tomorrow. Then tomorrow, they might buy above today’s high for a test of 1.1750 this week.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-broad-bear-channel-and-exhaustion-gap.png\"><img loading=\"lazy\" src=\"2018-9-17-2.png\" alt=\"Emini broad bear channel and exhaustion gap\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>Most of the bars today were in tight trading ranges. That is better for limit order traders. Stop entry traders should not trade in tight trading ranges. The bears had a swing down late in the day.<p>By trading below Friday’s low, today triggered a minor sell signal. Today also closed the gap above Wednesday’s high. That gap is now an exhaustion gap. But, exhaustion gaps are minor signals. Therefore, more trading range trading is more likely that a bear trend on the daily chart.<p>There is still a bull trend line below. The odds are that the Emini will get there this week by trading sideways to down. Will it get down to the lower bull trend line as well? The bears need to get consecutive big bear bars. Without that, the odds are that the 4 week trading range will continue.<p>Other magnets below are the January high and the 20 day EMA. The odds favor at least slightly lower prices over the next few days.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-9-17"
    }
  ],
  "18": [
    {
      "data": [
        "<article class=\"post-81648 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini 3 day exhaustion gap is minor trend reversalIntraday market update: Tuesday September 18, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini 3 day exhaustion gap is minor trend reversal<br>Intraday market update: Tuesday September 18, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-09-18T06:20:19-07:00\">September 18, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini 3 day exhaustion gap is minor trend reversal</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>By closing the gap above Wednesday’s high, the gap is now an exhaustion gap. Magnets below on the daily chart are the bull trend line, the 20 day EMA, and the January high.<p>However, an exhaustion gap is a minor reversal. The bears need follow-through selling today to increase the chances that last week’s rally was just a bull leg in a 3 week trading range.<p>The bulls need to form consecutive bull days. Without them, the 7 day rally will probably fail and lead to a bear leg in the 4 week trading range.<p>Since yesterday was a sell climax, there is only a 25 % chance of a strong bear trend day today. However, there is a 50% chance of some bear trend resumption in the 1st hour. Finally, there is a 75% chance of at least a couple hours of sideways to up trading starting by the end of the 2nd hour.<p>Since most days over the past several weeks have been mostly trading range days, today will likely be another mostly sideways day.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 7 points in the Globex session. It will therefore gap up on the open to around the 60 minute EMA. Furthermore, it will reverse about half of yesterday’s selling.<p>While it is still possible to have another bear trend day today, a big gap up after 3 sideways days makes that unlikely.<p>Yesterday’s big bear day reduces the chances of a strong bull day. That means a trading range day is most likely. This is especially true since most days over the past several weeks have spent the majority of their time in trading ranges. The Emini still has not yet decided whether the breakout above the January high will succeed or fail.<h2>Yesterday’s setups</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-broad-bear-channel-and-exhaustion-gap.png\"><img src=\"2018-9-18.png\" alt=\"Emini broad bear channel and exhaustion gap\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/EURUSD-Forex-double-top-with-August-28-high-but-only-minor-reversal-likely.png\"><img loading=\"lazy\" src=\"2018-9-18-1.png\" alt=\"EURUSD Forex double top with August 28 high, but only minor reversal likely\"></a><p class=\"caption\">The EURUSD daily Forex chart is testing the August 28 lower high and the top of the 5 month trading range.<p><br>The EURUSD daily Forex chart is testing the top of the 5 month trading range. Because the August 15 bull trend reversal was strong and the context was good, the chart is now in a bull trend. Consequently, the odds favor a breakout above the range and a test of 1.20.<p>But, most trading range breakouts fail. I said this repeatedly after each strong leg up and down since May. While the odds now favor an eventual bull breakout, betting that any one leg will be successful is a losing strategy. Most bulls will take profits around the top of the range and this is where the bears sell. Therefore, it is more likely that there will be a reversal down over the next week than a successful breakout.<p>However, the August bull trend reversal was strong. As a result, this week’s rally might make a minor new high above the August or June highs before that leg down begins.<p>If instead the bulls get 2 or more big bull bars closing above the June high, then the breakout will probably be successful. More likely, there will be a test down to 1.15 to 1.16 over the next 2 weeks.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart has been in a 40 pip range overnight. Since the daily chart is now in a bull trend, the bulls want to stop the 5 month series of lower highs. Therefore, they might get a rally above 1.1750 before the next bear leg begins.<p>However, because the daily chart is now at the top of the 5 month range, day traders will begin to sell rallies. They will especially focus on reversals down from above the prior day’s high. They will also buy reversals up from minor prior lows, like those of the past week at around 1.16 and of the past month at around 1.15.<p>Since there has been only limited follow-through after bull and bear breakouts, day traders are taking quick profits of 10 – 30 pips.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-Spike-and-Channel-Bull-Trend.png\"><img loading=\"lazy\" src=\"2018-9-18-2.png\" alt=\"Emini Spike and Channel Bull Trend\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>The Emini began with a huge bull bar and then entered a tight bull channel. By trading above last week’s high, it triggered a weekly buy signal. However, it then entered a tight trading range.<p>While the bulls want a strong breakout above last week’s high, the 3 week rally on the daily chart is weak. It is therefore more likely a bull leg in a trading range. Consequently, there will probably be a pullback within a week or two.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-9-18"
    }
  ],
  "19": [
    {
      "data": [
        "<article class=\"post-81650 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini spike and wedge channel bull trend at last week’s high Intraday market update: Wednesday September 19, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini spike and wedge channel bull trend at last week’s high<br>Intraday market update: Wednesday September 19, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-09-19T06:20:19-07:00\">September 19, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini spike and wedge channel bull trend at last week’s high</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Last week was a bull bar closing on its high on the weekly chart. Since that chart is in a bull trend, last week is a buy signal bar for this week. The Emini rallied to above last week’s high yesterday and triggered the weekly buy signal. However, the weekly chart has also been sideways for 4 weeks. That reduces the chances of strong follow-through buying this week.<p>Friday was a big bear day. Since it is in a bull leg on the daily chart, it was a buy signal bar for yesterday. The buy triggered yesterday. However, a bear buy signal bar usually has more sellers than buyers above. Many bulls prefer to wait to buy above a bull bar that closes near its high. Since yesterday was a bull bar, many traders will view yesterday as the buy signal bar. But, with its tail on top and 4 sideways days, it is a low probability buy setup.<p>The 2 week rally has lacked consecutive strong bull bars. It therefore looks more like a bull leg in a trading range than a bull trend. Therefore, many bulls will only buy pullbacks and not a breakout at the high.<p>Conflicting signs create confusion, which usually results in sideways trading.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 4 points in the Globex session. It will therefore likely open in the middle of its 4 day tight trading range. The Emini is deciding between a successful breakout above the January high and a failed breakout. While the odds favor a breakout within 2 months, the 2 week rally looks like a bull leg in a trading range. Therefore, the bears will continue to look to sell tops on the 5 minute chart.<p>While the past 2 days were trend days in opposite directions, they were just legs in the 4 day tight range and the 4 week range. Together, they formed a 2 day trading range. The odds are that trading range price action will continue. Day traders expect at least one reversal every day.<p>Everyone knows that there will be a strong move up or down soon on the daily chart. When it comes, they will swing trade all day. However, any one day is more likely to have at least one reversal and be mostly sideways.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-Spike-and-Channel-Bull-Trend.png\"><img src=\"2018-9-19.png\" alt=\"Emini Spike and Channel Bull Trend\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex micro double top and double top at top of 5 month trading range</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/EURUSD-Forex-micro-double-top-and-double-top-at-top-of-5-month-trading-range.png\"><img loading=\"lazy\" src=\"2018-9-19-1.png\" alt=\"EURUSD Forex micro double top and double top at top of 5 month trading range\"></a><p class=\"caption\">The EURUSD daily Forex chart has been in a tight trading range for 5 days. It has a micro double top, a double top, and a lower high, but a strong August bull trend reversal.<p><br>The EURUSD daily Forex chart is at the to of its 5 month range. The bulls want at least a small breakout above the July 31 high because that would end the series of lower highs. Traders would then conclude that the bear trend has ended.<p>The August reversal up was strong enough, given the context, to make the chart likely in an early bull trend. However, until the series of lower highs ends, the chart is also still in a bear trend.<p>Because most trading range breakout attempts fail, even if the bulls get a breakout above the July high of 1.1747, there will probably be a 1 – 3 week leg down. Trading ranges tend to last much longer than what seems likely. Until there is a clear strong breakout, there is no breakout. Traders will continue to bet on reversals.<p>For example, the daily chart has been in a tight range for 5 days. Every time it got near the prior day’s high or low, it reversed. I have been writing for the past week that traders should look for reversals around the prior day’s high and low. That is true again today.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart reversed down 60 pips overnight from the top of the 5 day tight trading range. However, it is back to the middle of the range. Furthermore, that range has become a triangle and the 5 minute chart is now at the apex. Therefore, the 5 minute chart will probably be sideways today. Day traders will be scalping. There is no sign of an impending breakout.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-trading-range-day-with-2nd-leg-bull-and-bear-traps.png\"><img loading=\"lazy\" src=\"2018-9-19-2.png\" alt=\"Emini trading range day with 2nd leg bull and bear traps\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>The Emini continued yesterday’s trading range. It might be waiting for next Wednesday’s FOMC announcement before either breaking to the upside or reversing down. Since the 2 week rally has been weak, the odds favor a test of the bull trend line within a week. It is currently around 2895.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-9-19"
    }
  ],
  "20": [
    {
      "data": [
        "<article class=\"post-81653 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini ignoring China tariffs and trade war ahead of FOMCIntraday market update: Thursday September 20, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini ignoring China tariffs and trade war ahead of FOMC<br>Intraday market update: Thursday September 20, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-09-20T06:20:15-07:00\">September 20, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini ignoring China tariffs and trade war ahead of FOMC</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini has been sideways for 5 days. Traders are deciding if the rally will continue up to the measured move targets above at around 3100 and 3200 or reverse down. The 2 week rally has lacked consecutive big bull bars. It therefore looks like a bull leg in a trading range. But, a strong rally today could change that.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 11 points in the Globex session. It will probably gap up today and it might gap to a new all-time high.<p>A big gap means that the chart will be far above the average price. Since many traders do not want to pay much more than average, big gap up openings usually enter a trading range by the end of the 1st hour. Once there is a pullback to around the moving average, the bulls will look for a reversal up. This usually comes from either a wedge selloff or a double bottom around the 20 bar EMA.<p>A big gap up also has an increased chance of leading to a bear trend day. When it does, it typically sells off on the open in a series of bear bars. Since the past 2 days were sideways in a bull trend, they have created a potential Final Bull Flag on the 60 minute chart. If there is a selloff, that range is a magnet below.<p>A big gap up makes a trend day more likely, and a bull trend is more likely than a bear trend. However, even if there is a bull trend for a couple of days, the Emini will probably begin to go sideways next week ahead of Wednesday’s FOMC announcement.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-trading-range-day-with-2nd-leg-bull-and-bear-traps.png\"><img src=\"2018-9-20.png\" alt=\"Emini trading range day with 2nd leg bull and bear traps\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex breakout above July sell climax high</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/EURUSD-Forex-breakout-above-July-sell-climax-high.png\"><img loading=\"lazy\" src=\"2018-9-20-1.png\" alt=\"EURUSD Forex breakout above July sell climax high\"></a><p class=\"caption\">The EURUSD daily Forex chart broke above the July 31 sell climax high overnight.<p><br>While the EURUSD daily Forex chart is in an early bull trend, the bulls need a breakout above the June 14 top of the 5 month trading range at 1.1851. Until then, this rally is still in its 5 month range.<p>The overnight rally is the 1st time in 5 months that the bulls have broken above a significant lower high. While the bulls will eventually<br>get their breakout above 1.1850, look to the left and you will see that the daily chart had several strong rallies in May and June to around 1.18.<p>Yet, they were unable to break above 1.1850, which is the major lower high. Therefore, as strong as the overnight breakout was, the daily chart might still go sideways here for a month or more. No matter. It is in an early bull trend and the bulls finally have a higher high after a higher low. That is the definition of an early bull trend.<p>It is a sign of strength and it will cause more traders to believe the bull case. That will make the bears take quicker profits on shorts and the bulls more eager to buy 3 – 5 day selloffs. This will eventually result in a breakout above 1.1850 and a test of 1.20 and the 50% retracement of the 2018 selloff.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart had a strong 120 pip rally overnight. It broke above 2 significant highs on the daily chart. The rally is strong enough for the bulls to get at least a small 2nd leg up today after the 1st 20 – 30 pip pullback. Therefore, the bulls will buy the 1st pullback.<p>The bears will need at least a micro double top before they can get a 50 pip pullback. In addition, because today is also a strong breakout on the daily chart, the bears will need at least a micro double top on the daily chart before getting a 100 pip pullback. Day traders will buy pullbacks 30 – 50 pip pullbacks for hold for 30 – 50 pip swing trades.<p>It is too early for the bears to sell so far this morning. However, the rally of the past hour was climactic. It will therefore attract profit takers. This will create a trading range today. Once in a range, some bears will sell for 10 – 20 pip scalps. But, it will be easier for the bulls to make money and traders should focus on buying pullbacks.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-gap-up-to-new-all-time-high-and-small-pullback-bull-trend.png\"><img loading=\"lazy\" src=\"2018-9-20-2.png\" alt=\"Emini gap up to new all-time high and small pullback bull trend\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>The Emini had a big gap up to a new all-time high today. It rallied in a weak small pullback bull trend for the 1st half of the day and then entered a trading range. There was a late minor new high.<p>The bulls want follow-through buying tomorrow, but the Emini often soon goes sideways for a few days after a big gap. In addition, next Wednesday’s FOMC report is another reason for the market to get neutral.<p>The bears want a gap down and an island top. Alternatively, they want tomorrow to be a bear trend day. It would then be a sell signal bar for Monday. However, the odds are against a reversal until at least after Wednesday’s FOMC announcement.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-9-20"
    }
  ],
  "21": [
    {
      "data": [
        "<article class=\"post-81655 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini gap up ahead of Wednesday’s FOMC announcementIntraday market update: Friday September 21, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini gap up ahead of Wednesday’s FOMC announcement<br>Intraday market update: Friday September 21, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-09-21T06:20:00-07:00\">September 21, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini gap up ahead of Wednesday’s FOMC announcement</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Yesterday gapped up to another all-time high and was a strong bull trend day in a bull trend. But, whenever there is a gap up, there is often a gap down. The gap down can be on the next day or several weeks later. That would create an island top. If there is no gap down, there is often a pullback that closes the gap, like after the gaps of August 27 and September 13. Even if yesterday’s gap closes, a gap closure or an island top is only a minor reversal. The odds still favor higher prices.<p>Since next Wednesday is an FOMC day, the Emini might begin to go sideways. In addition, after a big gap up above major resistance, the Emini usually goes sideways for a few days. Therefore, even though the odds favor higher prices, the bulls might not get much follow-through buying until after the FOMC announcement.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 1 point in the Globex market. The bulls are hoping that the weak September rally is now strong. They therefore want confirmation of yesterday’s breakout. Their minimum goal is to create a bull body on the daily chart today. That would increase the chance of higher prices next week.<p>Since yesterday was a buy climax, the bulls are probably exhausted. That increases the likelihood of a trading range day today. If so, there will be a fight in the final hour over whether the close will be above or below the open. In the final hour, the bulls will buy if the Emini is below the open and the bears will sell if it is above. Since yesterday was a strong bull day in a bull trend on the daily and weekly charts, the bulls will probably have a bull close today.<p>There is a 20% chance of a strong trend day up or down. If the bears get a strong bear trend day, yesterday’s breakout will fail. Their minimum goal is a close below the open. However, they need a reasonable size bear body closing on its low on the daily chart. If they get that today, which is unlikely, today would be a good sell signal bar on the daily chart. More likely, today will either be a trading range day or a weak bull trend day.<h2>Yesterday’s setups</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-gap-up-to-new-all-time-high-and-small-pullback-bull-trend.png\"><img src=\"2018-9-21.png\" alt=\"Emini gap up to new all-time high and small pullback bull trend\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex parabolic wedge rally above July 9 high</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/EURUSD-Forex-parabolic-wedge-rally-above-July-9-high.png\"><img loading=\"lazy\" src=\"2018-9-21-1.png\" alt=\"EURUSD Forex parabolic wedge rally above July 9 high\"></a><p class=\"caption\">The EURUSD daily Forex chart achieved the initial goal of the bulls by breaking above the July 9 high. Since the rally is a parabolic wedge, a 2 legged pullback is likely over the next week.<p><br>The EURUSD daily chart had a parabolic wedge rally to above resistance. Therefore, the odds favor a pullback for the next week. However, the bears might need a micro double top over the next few days before they get their 200 – 300 pip pullback.<p>Since a pullback is likely, day traders will sell rallies. Because the daily chart is in a bull trend, they will buy selloffs. Finally, the daily chart is still in a trading range and the month-long rally has probably ended. Therefore the odds favor smaller days and more trading range trading over the next week. As a result, most day trades will be 10 – 30 pips. The market is also likely to get quiet ahead of Wednesday’s FOMC announcement.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD daily Forex chart achieved its major goal of rallying above the July 9 high. There was a spike down on June 14 and then a pullback to the July 9 high. This led to a parabolic channel down to August 15. Typically, there is a rally back to the top of the channel, which is the July 9 high. Then, the chart enters a trading range. So far, this is unfolding in the usual way.<p>Because the September rally has 3 legs in a tight channel, it is a parabolic wedge buy climax. The odds favor a couple legs down that will retrace 50 – 100% of the rally from September 10.<p>Since the daily chart is now in a bull trend, the rally will likely continue above the June 14 high at the top of the trading range. However, it might stay in the range for a month or more before the successful breakout.<p>There is a 30% chance that the bears will get a double top with the July 9 high and then a break below the August 15 neck line.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-Spike-and-Channel-Bear-Trend.png\"><img loading=\"lazy\" src=\"2018-9-21-2.png\" alt=\"Emini Spike and Channel Bear Trend\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>The Emini sold off from the open in a relentless Spike and Channel Bear Trend. Since today was a bear day on the daily chart, it provided no confirmation of yesterday’s bull breakout. Furthermore, it is a sell signal bar on the daily chart for next week for a failed breakout above the August high.<p>The bulls need a bull bar early next week to make traders believe that the rally will continue up to 3000. If next week sells off, like after Wednesday’s FOMC announcement, next week would be a sell signal bar on the weekly chart. That would probably lead to a 2 – 3 week selloff down to the 20 week EMA.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-9-21"
    }
  ],
  "22": [
    {
      "data": [
        "<article class=\"post-81659 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini considering China tariffs ahead of Wednesday’s FOMC Emini weekend update: September 22, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini considering China tariffs ahead of Wednesday’s FOMC<br>Emini weekend update: September 22, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-09-22T00:30:30-07:00\">September 22, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Emini considering China tariffs ahead of Wednesday’s FOMC</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-monthly-candlestick-chart-has-small-bull-bar-at-new-all-time-high.png\"><img loading=\"lazy\" src=\"2018-9-22.png\" alt=\"Emini monthly candlestick chart has small bull bar at new all-time high\"></a><p class=\"caption\">The candlestick on the monthly S&amp;P500 Emini futures candlestick chart is a small bull doji so far in September. However, it made a new all-time high and the 6 month rally is strong.<p>The monthly S&amp;P500 Emini futures candlestick chart broke to a new all-time high this week. Late last year, I said that the monthly chart had never been as climactic as it was in its 100 year history. However, the 15 bar bull micro channel was a sign of extremely strong bulls. I wrote that when there is a reversal it typically lasts 1 – 3 months and then the bull trend resumes. But, the bulls are usually still somewhat exhausted. Once they get a new high, there is usually another pullback within a few months.<p>So far, the monthly chart is behaving as it typically does. It will probably continue higher for at least a few months before the bears will be able to get more than a 1 month pullback. After 6 months without a pullback, the bulls will buy the 1st pullback below the prior month’s low. Consequently, the downside risk over the next couple of months is small.<p>There are measured move targets above at around 3100 and 3200. I drew them on the weekly chart. The momentum up on the monthly chart is strong enough for the bulls to get to at least 3100 within the next several months.<p>There is always a bear case. However, there is only a 30% chance of a strong reversal down lasting 3 or more months without 1st seeing a micro double top.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Tight bull channel at all-time high.</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-weekly-candlestick-chart-has-possible-micro-doube-top-with-August-high.png\"><img loading=\"lazy\" src=\"2018-9-22-1.png\" alt=\"Emini weekly candlestick chart has possible micro double top with August high\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart broke to another all-time high this week. Because the bull channel is tight, the odds favor sideways to up next week.<p>The weekly S&amp;P500 Emini futures candlestick chart has been in a tight bull channel since the April low. There are measured move targets above at around 3100 and 3200. Also, the 3,000 Big Round Number is a magnet above. Can this rally get vacuumed up to the targets without more than a 3 week pullback? Probably not, but it should reach the targets within a few months.<p>The bears will need at least a micro double top before they can get a reversal down to the 20 week EMA. That support is currently around 2820. If the Emini reverses down this week or next week, it will form a higher high micro double top with the August 28 high. That could lead to a test down to the 20 week EMA.<p>The bears want to sell below a bear bar that closes near its low. Therefore, if next week sells off on Wednesday’s FOMC announcement, next week could be a sell signal bar.<p>However, every pullback since the January high has ended within 3 weeks. Consequently, the next selloff will probably not last much more than that. The odds favor a continued bull trend up to the measured move targets at around 3100.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Gap up to new all-time high</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-daily-candlestick-chart-has-bear-sell-signal-bar-for-possible-island-top.png\"><img loading=\"lazy\" src=\"2018-9-22-2.png\" alt=\"Emini daily candlestick chart has bear sell signal bar for possible island top\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart gapped up on Thursday to a new all-time high. Friday had a bear body and was therefore a bad follow-through day.<p>The daily S&amp;P500 Emini futures candlestick chart gapped up on Thursday. Friday was a reminder that the 2 week rally is failing to get consecutive strong bull bars. It might therefore be a bull leg in a trading range instead of a successful breakout above the August high. If so, the Emini will begin to test higher lows within 2 weeks.<p>Since Friday had a bear body, the bulls need follow-through buying early next week to erase Friday’s bearishness. Because there is uncertainty ahead of Wednesday’s FOMC announcement, the Emini might continue sideways until then.<p>If the bulls get strong bull bars next week, the next target is the top of the bull channel, which is around 2970, and then the 3,000 Big Round Number. Above that are the measured move targets on the weekly chart.<h4>Sell signal bar</h4><p>The bears want a reversal down from a failed breakout above the August high. Since Friday was a bear day and it closed near its low, it is a sell signal bar for Monday. However, the bull channel on the daily chart since September 7 is tight. That makes the sell signal minor. It is more likely to lead to a pullback than a bear trend. The 1st target is the higher of the 2 bull trend lines, and then the September 7 higher low of 2870.00.<p>Wednesday could be a catalyst for a few bear days. If the bears start to get bear bars closing on their lows on the daily chart, they will create a sell signal bar on the weekly chart. That could lead to a test of the 20 week EMA.<h4>Possible island top or exhaustion gap</h4><p>Any gap down next week would create an island top with Thursday’s gap up. If instead the Emini simply trades below Wednesday’s high, the bears will have turned the gap up into an exhaustion gap, like the gaps of August 27 and September 13.<p>However, island tops and exhaustion gaps are minor reversal patterns. They only rarely lead to bear trends. Consequently, even of the bears get several weeks down, the selloff will probably simply be a bear leg in the bull channel that began in April.<p>For traders to believe that the bears have taken control and the selloff will reach the February low, they need several big bear bars. Without that, the bulls will buy the selloff and any reversal up. There is currently only a 30% chance of a break below the February low before reaching 3,100.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noopener\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-9-22"
    }
  ],
  "24": [
    {
      "data": [
        "<article class=\"post-81657 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini bulls need follow-through buying after breakoutIntraday market update: Monday September 24, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini bulls need follow-through buying after breakout<br>Intraday market update: Monday September 24, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-09-24T06:20:08-07:00\">September 24, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini bulls need follow-through buying after breakout</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini was in a Spike and Channel Bear Trend on Friday after Thursday’s gap up to a new high. A gap up to a new high usually leads to at least a couple days of a pause. This is even more likely because of the uncertainty about Wednesday’s FOMC announcement. Because Friday closed on its low, it is a sell signal on the daily chart for today. If the bears get additional selling this week, this week will be a bear bar and a weekly sell signal bar for next week.<p>A strong trend up or down is unlikely today. However, if there is a gap down, the bears would have a 2 day island top. But, most island top reversals are minor. The odds favor trading range trading for the next few days.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 4 points in the Globex session. It therefore might gap down below Friday’s low, which would create a 2 day island top. Since most small gaps close in the 1st hour, that is what would be likely today.<p>Because the daily chart has a strong sell signal bar and the breakout above the January high might fail, Friday might be the high for the next several weeks. If so, there would be an increased chance of bear trend days going forward. With the uncertainty over Wednesday’s FOMC announcement, the Emini will probably be mostly sideways until the report.<p>A big bull trend day is unlikely after Friday’s strong bear day. However, if the gap stays open for the 1st 90 minutes, the day will probably be a bear trend day.<p>Friday sold off in a tight bear channel. A bear channel is a bull flag, and therefore there is usually a breakout above the channel. But, there is often a breakout below the channel 1st. Consequently, if today gaps down, it will likely break below Friday’s channel. Day traders would then watch for an early reversal up.<p>Today is unlikely to be a big bull trend day. The start of the bear channel is a magnet, and the channel usually evolves into a trading range. Therefore, if there is a rally, it will probably extend to above 2941 and today will likely be a trading range day.<h2>Friday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-Spike-and-Channel-Bear-Trend.png\"><img src=\"2018-9-24.png\" alt=\"Emini Spike and Channel Bear Trend\"></a><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex parabolic rally at top of 5 month trading range</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/EURUSD-Forex-parabolic-rally-at-top-of-5-month-trading-range.png\"><img loading=\"lazy\" src=\"2018-9-24-1.png\" alt=\"EURUSD Forex parabolic rally at top of 5 month trading range\"></a><p class=\"caption\">The EURUSD daily Forex chart pulled back overnight. If it closes with a bull body today, today’s candlestick will be a High 1 bull flag for tomorrow.<p><br>The EURUSD daily Forex chart has rallied strongly for 6 weeks. But, it is now at the top of its 5 month trading range. Furthermore, the 3 week rally has had 3 small legs up in a tight bull channel. That is a parabolic wedge buy climax at resistance.<p>Typically, the chart sells off for a couple small legs over the next week or so and tests the beginning of the channel. That is the September 10 low, just above 1.15.<p>It is important to note that most reversals over the past 5 months began with micro double tops or bottoms. Therefore, that is likely here. Consequently, the bulls will probably trigger their bull flag buy signal tomorrow by going above today’s high. However, the rally will probably fail within a couple days, forming a micro double top with Friday’s high. Wednesday’s FOMC announcement could be the catalyst for the minor reversal down.<p>While the daily chart has been in a trading range for 5 months, it is now likely also in a bull trend. Most trading range breakouts fail. Therefore, a pullback this week is more likely than a bull breakout. Because the daily chart is now in a bull trend, bull surprises are more likely. Traders need to be ready for a bull breakout above the June 14 high at any time.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute chart has been sideways in an 80 pip range for 2 days. After rallying 50 pips at the start of the European session, the chart has been in a tight range for 5 hours. The fight now is over the close of the day. The bulls want today to close on its high. This would create a stronger buy signal bar for tomorrow. However, the bears want a weak close. While the chance of a successful breakout above the June 14 high will be greater if today closes on its high, the odds still favor a micro double top with Friday’s high. Therefore, day traders will sell rallies.<p>Since Friday was not a strong sell setup on the daily chart, the bulls will buy reversals up from around Friday’s low. Since there is a buy climax and a pullback is likely this week, they will scalp for 10 – 20 pips. With bulls and bears scalping, today will probably continue the 5 hour trading range, although the range will probably get bigger at some point today.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-2-day-island-top-and-weak-bull-reversal-day.png\"><img loading=\"lazy\" src=\"2018-9-24-2.png\" alt=\"Emini 2 day island top and weak bull reversal day\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>After gapping down and forming a 2 day island top, the Emini sold off in a weak trend for 90 minutes. It then had a weak rally from a double bottom higher low major trend reversal. While today was a bull reversal day, it was more of a trading range day.<p>The bulls want a gap up tomorrow, which would form a 1 day island bottom. That would erase the significance of the 2 day island top. Even if they get it, or if they simply close the gap above yesterday’s high, the Emini will probably be quiet ahead of Wednesday’s 11 a.m. PST FOMC announcement.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-9-24"
    }
  ],
  "25": [
    {
      "data": [
        "<article class=\"post-81839 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini weak selling after 2 day island top ahead of FOMCIntraday market update: Tuesday September 25, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weak selling after 2 day island top ahead of FOMC<br>Intraday market update: Tuesday September 25, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-09-25T06:20:13-07:00\">September 25, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini weak selling after 2 day island top ahead of FOMC</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini gapped down yesterday and formed a 2 day island top. However, yesterday was not a strong bear trend day. While Friday might be the high of the next several weeks, the bears need a series of bear bars to take control. The odds still favor higher prices, even if there is a 3 week pullback.<p>If today trades above yesterday’s high, but there is a reversal day later this week, there would be a micro double top with Friday’s high. That would be a possible sell setup for a 2 – 3 week pullback.<p>If today gaps up today and rallies, it will form a 1 day island bottom. It could simply rally and close yesterday’s gap. Either way would erase the bearishness of the 2 day island top.<p>The Emini probably will stay sideways into tomorrow’s 11 a.m. PST FOMC announcement. It then could move sharply up or down. However, most FOMC reports in recent years have not had strong follow-through. Each was usually just another day.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 4 points in the Globex session. It might therefore gap up, which would create a 1 day island bottom. However, a small gap up typically closes in the 1st hour.<p>A gap up or a closure of yesterday’s gap down would make the Emini neutral going into tomorrow’s FOMC report. Since the Emini usually tries to become neutral ahead of a catalyst, the odds are against a big trend day up or down today. Yesterday’s trading range also increases the chance of a quiet day today.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-2-day-island-top-and-weak-bull-reversal-day.png\"><img src=\"2018-9-25.png\" alt=\"Emini 2 day island top and weak bull reversal day\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex ioi bull flag but parabolic wedge top</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/EURUSD-Forex-ioi-bull-flag-but-parabolic-wedge-top.png\"><img loading=\"lazy\" src=\"2018-9-25-1.png\" alt=\"EURUSD Forex ioi bull flag but parabolic wedge top\"></a><p class=\"caption\">The EURUSD daily Forex chart today has an inside day after yesterday’s outside day. This is an ioi (inside-outside-inside) bull flag. There is also a potential measuring gap below yesterday’s low. But the 3 week rally is also a parabolic wedge at the top of a 5 month trading range.<p><br>If today remains a bull inside day, it will be a buy signal bar for tomorrow. Since yesterday was an outside day, the pattern would be an ioi bull flag. But, it is at the top of a 5 month trading range and most breakout attempts fail. Furthermore, the 3 week rally is a parabolic wedge. While the momentum favors the bulls and an eventual rally to 1.20, the chart is more likely to pullback for the next couple of weeks.<p>Traders should find out over the next few days. If there are 2 – 3 big bull bars, the breakout will probably continue to 1.19 to 1.20. On the other hand, if tomorrow triggers the buy by going above today’s high, but tomorrow or Thursday close near their lows, the breakout will likely fail. If so, there will probably be a 200 pip pullback over the next 2 weeks.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart has rallied 50 pips overnight. Since the bulls do not need today to go above yesterday’s high, there might not be much left to the rally today. However, the bulls do want today to close near its high, and especially above the midpoint. This would create a good buy signal bar for tomorrow. Therefore, the bulls will buy 20 – 30 pip selloffs today.<p>The bears would like today to close near its low. Then today would be a bear ioi and a sell signal bar for tomorrow. At the moment, this is unlikely. The best the bears can reasonably hope to achieve is to prevent today from closing on its high. They will therefore sell rallies for 10 pip scalps.<p>Their next goal is to get today to close below the midpoint. If there is strong momentum down, they might even get a close below the open, but that is unlikely at the moment.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-Broad-Bear-Channel-after-2-day-island-top.png\"><img loading=\"lazy\" src=\"2018-9-25-2.png\" alt=\"Emini Broad Bear Channel after 2 day island top\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>There were several reasonable stop entry buys on the open that failed. Scale in bulls still theoretically made money by buying more lower.<p>Despite a strong reversal up from the August high, the bears got a new low of the day after a 22 bar bear micro channel. That is extremely relentless selling, and therefore a sell climax. The bulls reversed the selloff up from just above yesterday’s low. That prevented an outside down day. However, the Emini stayed sideways into the close.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-9-25"
    }
  ],
  "26": [
    {
      "data": [
        "<article class=\"post-81841 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini island top and bull flag going into FOMC announcement Intraday market update: Wednesday September 26, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini island top and bull flag going into FOMC announcement<br>Intraday market update: Wednesday September 26, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-09-26T06:20:38-07:00\">September 26, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini island top and bull flag going into FOMC announcement</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Yesterday sold off from the open after failing to close the gap below Friday’s low. But, it reversed up twice at the end of the day and held around Monday’s low.<p>This is a 2 day trading range going into today’s FOMC report. The 11 a.m. PST report usually has a sharp reversal in the 1st 10 minutes. Day traders should exit positions about an hour before the announcement and not trade again until at least 10 minutes afterwards.<p>The bears want Friday’s sell signal bar to be the top for a move down to the 20 week EMA. However, the bulls want the 2 day selloff to be a pullback in a bull trend. The probability is about the same for both. A big breakout up or down today would provide clarity. If today remains sideways after the 11 a.m. FOMC announcement, traders will have to wait until tomorrow or later for clarity.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 4 points in the Globex session. Today will therefore probably open in the middle of the 2 day range. The 2 day range increases the chances of more trading range trading ahead of today’s FOMC announcement. If there is a strong trend ahead of the announcement, day traders will swing trade.<p>Does it matter if the Fed raises rates? No. All that matters is whether the institutions buy or sell after the report. The report itself is meaningless. Day traders simply have to wait and trade what is on the chart in front of them, and not worry about what the Fed does.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-Broad-Bear-Channel-after-2-day-island-top.png\"><img src=\"2018-9-26.png\" alt=\"Emini Broad Bear Channel after 2 day island top\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/EURUSD-Forex-double-top-and-micro-double-top-ahead-of-FOMC-today.png\"><img loading=\"lazy\" src=\"2018-9-26-1.png\" alt=\"EURUSD Forex double top and micro double top ahead of FOMC today\"></a><p class=\"caption\">The EURUSD daily Forex chart has a bear body today ahead of today’s FOMC report. yesterday’s bull inside bar created a 3 day ioi breakout mode pattern. The 4 week rally is a parabolic wedge at the top of the 5 month trading range.<p><br>The EURUSD daily Forex chart had a strong bull trend reversal in August and it is now at the top of its 5 month range. The rally is forming a double top with the July high. In addition, there is a micro double top over the past 4 days. The odds favor lower prices for a week or two. Also, trading ranges resist breaking out. Therefore, the bulls might have to wait more than a month before they see their breakout.<p>An ioi is a Breakout Mode pattern. The bulls want a breakout above the June high. But, the parabolic wedge makes a 200 pip pullback more likely over the next week.<p>While the bears want a break below the August 15 low, the reversal up was strong enough to make a bull trend more likely. Consequently, the bulls will buy a 200 – 300 pip selloff, knowing that a higher low is more likely than a bear trend.<p>The odds favor a 1 – 2 week selloff down to below 1.16.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart sold off 45 pips in a tight bear channel over the past 3 hours. It is testing yesterday’s low. While the ioi on the daily chart is a breakout mode pattern, yesterday was a bull day. That is a weak sell signal bar for today. Therefore, there are probably buyers not far below yesterday’s low. Consequently, the overnight selloff will probably stall there. This is especially true because financial markets tend to enter trading ranges on the mornings of FOMC reports.<p>Will there is a big trend after the 11 a.m. PST report today? There sometimes is, even though the Forex markets usually enter tight ranges by 11 a.m. Day traders will probably scalp until then and exit positions about an hour before the report. Since there is usually a fast reversal in the 1st 10 minutes after the report, they should wait until at least 11:10 a.m. PST before resuming trading.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-bear-trend-reversal-after-FOMC-rate-hike.png\"><img loading=\"lazy\" src=\"2018-9-26-2.png\" alt=\"Emini bear trend reversal after FOMC rate hike\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>The Emini rallied after the FOMC report, but reversed down from above yesterday’s high. By trading below yesterday’s low, today was an outside down day. The bears are breaking below the 3 day range. They need follow-through selling tomorrow. The targets below are the bull trend lines and the 20 week EMA.<p>The 3 week rally looks more like a bull leg in a trading range than a bull trend. That makes a 2 – 3 week bear leg likely to begin within a couple weeks. It probably began on Friday.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-9-26"
    }
  ],
  "27": [
    {
      "data": [
        "<article class=\"post-81843 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini outside down day after September FOMC announcementIntraday market update: Thursday September 27, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini outside down day after September FOMC announcement<br>Intraday market update: Thursday September 27, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-09-27T06:20:38-07:00\">September 27, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini outside down day after September FOMC announcement</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini rallied briefly after the FOMC report but sold off from above Tuesday’s high to below Tuesday’s low. Yesterday was therefore an outside down day. The odds are that last Friday began a 2 – 3 week selloff down to support. The support is the bull trend line and the 20 week EMA.<p>If the bulls create a strong reversal up today or tomorrow, then they will have a chance at a new high before testing the 20 week EMA. For example, if today is a bull inside bar on the daily chart, it will form an ioi buy signal for Friday. But, the bulls still would need a strong reversal up to erase yesterday’s selling pressure.<p>The bears want the week to close near its low. That would create a sell signal bar on the weekly chart and make a test down to the 20 week EMA more likely. They will therefore sell rallies and try to get tomorrow’s close to be near the low of the week.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 5 points in the Globex market. A big selloff like what happened yesterday is not as bearish as it appears. About 50% of it is related to the gamma of puts and option selling firms having to hedge. Since they got back to fully hedged by yesterday’s close, there is less chance of a big follow-through bear day today. After yesterday’s sell climax, there is a 75% chance of at least 2 hours of trading range trading beginning by the end of the 2nd hour. It often begins on the open.<p>Most big outside days are followed by inside days or days that fail to go much beyond the range of the outside day. If today opens above yesterday’s low, the bulls will try to keep today above yesterday’s low. If the bears break below yesterday’s low, the bulls will try to prevent a big selloff. Therefore, there will probably be sellers around yesterday’s low. Since today will probably open near yesterday’s low, there might be an early low of the day.<p>Yesterday might be the start of a swing down to the 20 week EMA. The bears will try to create another strong bear day. However, today will probably not gap down on the open. That means the bears were not as strong they could have been. This generates confusion, and confusion usually creates a trading range. Day traders do not believe that trends will last and they therefore bet on reversals.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-bear-trend-reversal-after-FOMC-rate-hike.png\"><img src=\"2018-9-27.png\" alt=\"Emini bear trend reversal after FOMC rate hike\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/EURUSD-Forex-reversal-down-from-parabolic-wedge-rally-and-double-top.png\"><img loading=\"lazy\" src=\"2018-9-27-1.png\" alt=\"EURUSD Forex reversal down from parabolic wedge rally and double top\"></a><p class=\"caption\">After rallying over the past month to the top of the 5 month trading range, the EURUSD daily Forex chart turned down last week. There was a micro double top, a double top, and a parabolic wedge buy climax.<p><br>I have been saying for the past week that the rally would probably end with the parabolic wedge buy climax. I also said that the odds favored about 10 days and 2 legs down. The typical target is the bottom of the parabolic wedge, which is the September 10 low just above 1.15.<p>A reversal from a parabolic wedge buy climax usually has at least 2 small legs. In addition, the 1st leg down usually ends in the middle of the wedge, which would be between 1.16 and 1.1650.<p>If the selloff reaches the target at around 1.15, it typically ends. The chart then enters a trading range. The bulls will want a double bottom with the September 10 low, and the bears want the double top with the July high to lead to a breakout below the August low.<p>The odds favor a trading range over the next several weeks. This selloff will probably continue down to around 1.16, but there will probably be a 2 – 3 day rally within a week.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart sold off 80 pips in 2 legs over night. The bears want the week to close near its low. That would create a sell signal bar on the weekly chart at the 20 week EMA.<p>The bulls want a rally back up above the open of the week. However, the bulls are running out of time. The odds are that day traders will sell rallies and the candlestick on the weekly chart will be a bear sell signal bar. The odds are against a strong bull day today.<p>While the 5 minute chart sold off overnight, the most of the selling was in 2 brief bear breakouts. The majority of the overnight trading was within tight trading ranges. That makes a big trend today unlikely.<p>Since the bears have already accomplished their goal of creating a possible good sell signal bar on the weekly chart, they do not need lower prices this week. They will therefore simply try to prevent a strong reversal back up. Consequently, the bears will sell any 30 – 50 pip rally today or tomorrow and try to keep the market near the low of the week.<p>With the bulls unable to get a strong reversal and the bears not needing a strong selloff, day traders will most likely scalp today.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-bear-trend-reversal-day-and-doji-inside-day.png\"><img loading=\"lazy\" src=\"2018-9-27-2.png\" alt=\"Emini bear trend reversal day and doji inside day\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>The Emini rallied on the open, but then reversed back down to the open. Today was an inside day. After yesterday’s outside day, there is now an ioi Breakout Mode pattern on the daily chart. Because today’s range was fairly big, tomorrow could be a consecutive inside day.<p>Every day this week has oscillated around Monday’s open. Therefore traders are fighting over the body on the weekly chart. The bulls want a bull bar and the bears want a bear bar. This week so far is an inside bar on the weekly chart, which is also a breakout mode pattern. The breakout up or down will probably come next week.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-9-27"
    }
  ],
  "28": [
    {
      "data": [
        "<article class=\"post-81845 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini forming weekly inside bar for Breakout Mode setupIntraday market update: Friday September 28, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini forming weekly inside bar for Breakout Mode setup<br>Intraday market update: Friday September 28, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-09-28T06:20:39-07:00\">September 28, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini forming weekly inside bar for Breakout Mode setup</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>After Wednesday formed a big outside down day, yesterday formed a bull inside day. The ioi on the daily chart is a Breakout Mode pattern. Because yesterday had a bull body, it is a low probability sell signal bar. But, after 4 consecutive bear days, it is a low probability buy signal as well. Therefore, there are probably sellers above and buyers below. If today is a 2nd consecutive inside day, it will be a Breakout Mode buy and sell signal bar for Monday.<p>The week oscillated around the week’s open and the 60 minute EMA. It might be able do that again today. If today closes above Monday’s open, the candlestick on the weekly chart will be a bull inside bar. That would be a buy signal bar for next week. Alternatively, if today closes below Monday’s open, the week will be a bear bar and a sell signal bar on the weekly chart for next week.<p>Can today trend far from Monday’s open? Of course, but that is not likely because the Emini has been telling us all week that it is focused on Monday’s open.<p>As I have been writing over the past 2 week’s, the September rally looked more like a bull leg in a trading range than a bull trend. The odds are that the September high began a bear leg in the trading range. Logical targets below are the 2 bull trend lines, the 20 week EMA, and higher lows on the daily chart.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 7 points in the Globex market. Today therefore might open at the higher of the 2 bull trend lines on the daily chart.<p>After 4 sideways days, the odds favor another sideways day. But, the key force controlling the market today is the weekly chart. Will the bears get the week to close near its low? If so, this week will be a credible sell signal bar on the weekly chart for next week.<p>Alternatively, will the bulls get the week to close above Monday’s open at 2927.25? If so, the weekly candlestick will have a bull body. That would make higher prices likely next week.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-bear-trend-reversal-day-and-doji-inside-day.png\"><img src=\"2018-9-28.png\" alt=\"Emini bear trend reversal day and doji inside day\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/EURUSD-Forex-reversal-down-from-double-top-and-parabolic-wedge-buy-climax.png\"><img loading=\"lazy\" src=\"2018-9-28-1.png\" alt=\"EURUSD Forex reversal down from double top and parabolic wedge buy climax\"></a><p class=\"caption\">The EURUSD daily Forex chart is trading down sharply for the 2nd day after testing the top of the 6 month trading range. There is support at the September 10 low around 1.15.<p><br>The EURUSD daily Forex chart has a 2nd big bear trend bar so far today. I have been saying over the past week that the September bull breakout would probably reverse down and test the September 10 higher low. However, the 2 day selloff has been stronger than what was likely. But, as long as the selloff stays above the August 15 bottom of the bull trend reversal, the odds are that there will be an eventual break above the 6 month range before a break below.<p>Whenever a leg down has strong momentum like this, the bulls typically need at least a micro double bottom before they can get a reversal up. Therefore, the daily chart will probably continue sideways to down to around 1.15 for at least another week.<p>Can this selloff be a resumption of the 2018 bear trend? Yes, but the probability is only 40% at the moment. If there are more big bear days, the probability will go up.<p>The 6 month trading range has had many strong moves up and down. During each one, I said that a reversal was more likely than a breakout. That is true with this selloff as well.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart sold off 80 pips in a tight bear channel overnight. It is near the support of the September 10 low just above 1.15. In early September, there were many bounces up from around 1.1550, which is another 10 pips below the overnight low. The odds are that today will find support there as well. Consequently, the 5 minute chart is probably near what will be the low of the day.<p>This week is now an outside down week on the weekly chart. Last week’s 1.1618 low is a magnet above. The bears want the week to close below last week’s low as a sign of strength.<p>The bulls want the opposite. Since that low is 40 pips above the current price and the bear channel is tight, the odds are against the bulls getting there. At a minimum, they want a significant tail on the bottom of the weekly candlestick. That would require a close at least 20 pips above the low of the day.<p>Because the chart is near the support of 1.1550, the bulls will soon begin to buy minor reversals up and try to get today’s close to be above last week’s low. The momentum down is strong and therefore the bears will sell rallies. This will result in the tight bear channel evolving into a 40 – 50 pip tall trading range this morning.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-trading-day-in-3-day-triangle-at-end-of-quarter.png\"><img loading=\"lazy\" src=\"2018-9-28-2.png\" alt=\"Emini trading day in 3 day triangle at end of quarter\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>Today was the last day of the week, month, and quarter. It was trading range day and the 3rd day in a triangle on the 60 minute chart. It is also the 5th day in a tight trading range. It closed with a bull body and is therefore a buy signal bar for Monday, but the tail on top and 5 day tight trading range makes more sideways trading likely.<p>Traders are deciding if the September high is the start of a pullback to the 20 week EMA. If there is one more new high, the bears will try to create a wedge top on the daily chart. That would then probably lead to several weeks down to the 20 week EMA.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-9-28"
    }
  ],
  "29": [
    {
      "data": [
        "<article class=\"post-81849 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini September high might be minor exhaustive buy climax Emini weekend update: September 29, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini September high might be minor exhaustive buy climax<br>Emini weekend update: September 29, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-09-29T00:30:21-07:00\">September 29, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>6 month rally to new all-time high</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-monthly-candlestick-chart-has-bull-doji-in-6-month-bull-micro-channel.png\"><img loading=\"lazy\" src=\"2018-9-29.png\" alt=\"Emini monthly candlestick chart has bull doji in 6 month bull micro channel\"></a><p class=\"caption\">The September candlestick on the monthly S&amp;P500 Emini futures candlestick chart is a bull doji. It is the 6th bar in a bull micro channel. But, because it is smaller, it is a sign that the bulls are losing momentum.<p>The monthly S&amp;P500 Emini futures candlestick chart has continued its rally from the April micro double bottom. There is no sign of a top. Furthermore, after a 6 bar bull micro channel in a strong bull trend, the bulls will buy the 1st reversal down. Therefore, there will be buyers below the September low.<p>The bears will need a micro double top to get a trend reversal. Consequently, the downside risk is small over the next couple of months. October sometimes has sharp selloffs. But, since the monthly chart is so strongly bullish, even if the bears get a 5 – 10% selloff, it will be a pullback in the bull trend and not the start of a bear trend. The bears will need at least 2 or 3 consecutive bear bars before traders believe that the bears have taken control. As a result, the odds continue to favor higher prices.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>2 month tight bull channel in 6 month bull trend</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-weekly-candlestick-chart-has-bear-doji-inside-bar-in-small-pullback-bull-trend.png\"><img loading=\"lazy\" src=\"2018-9-29-1.png\" alt=\"Emini weekly candlestick chart has bear doji inside bar in small pullback bull trend\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart formed an inside bar this week. It is in a tight 2 month bull channel within a 6 month bull trend.<p>The weekly S&amp;P500 Emini futures candlestick chart had a small bear doji inside bar this week. Because the bull trend is strong, this week is a buy signal bar for next week. But, the past 5 weeks have been mostly sideways and this week has a bear body. Therefore, this is not a strong buy setup.<p>The bulls have measured move targets above at around 3,100 and 3,200. They should be able to reach at least the lower target within the next few months, even if there is a sharp, brief selloff first.<p>The bears hope that last week formed a micro double top with the high of 4 weeks ago. Since this week did not close near its low, it is a weak sell signal bar. The bears want to trigger the sell next week by trading below this week’s low, but they will need 1 or 2 big bear bars if they are going to get a deep pullback.<p>The 2 month bull channel is tight and this week is a weak sell signal bar. Moreover, every selloff this year ended within 3 weeks. Consequently, the odds are that any reversal down will end within 2 – 3 weeks.<p>What if there is a huge October selloff, as sometimes happens? Because the 6 month bull trend is strong, even a fast reversal down to the 20 week EMA will probably be minor. The odds are that it would be brief and the bulls would buy it. There is currently only a 30% chance of a reversal down to the February low without at least a small double top.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Emini September high might be minor exhaustive buy climax</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/09/Emini-daily-candlestick-chart-has-6-day-bull-flag-at-EMA-1.png\"><img loading=\"lazy\" src=\"2018-9-29-2.png\" alt=\"Emini daily candlestick chart has 6 day bull flag at EMA\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart had a strong sell signal bar 6 days ago late in a bull channel. The pullback might continue down to the August low.<p>Friday was the last day of the week, month, and quarter. The daily S&amp;P500 Emini futures candlestick chart has been in a bull channel for 6 months. Since the July low, the channel has been tight. While that is a sign of strong bulls, it is also exhaustive. Therefore, there is a growing risk of a trading range.<p>The bulls are hoping that the 6 day pullback is a bull flag. But, there have been many bear bars, and any rally might form a double top with the September high. If instead there is a new high, it would be the 3rd leg up from the August 15 low. A reversal down would create a wedge top.<p>Furthermore, the September rally lacked consecutive big bull bars. It therefore looked more like a bull leg in a trading range than a resumption of the bull trend. This increases the chance that the 6 day selloff is the start of a bear leg in the trading range.<p>Traders are deciding if the September high will be the top for the next several weeks. If so, the downside targets are the support levels below. These include the bull trend line at around 2870, the September low (also around 2870), and the August low at around 2800. In addition, there is the 20 week EMA, which is just below 2840.<h4>How far down can a correction go?</h4><p>Traders always should think about low probability events because they are usually more likely than what seems reasonable. Currently, there is a 50% chance that the September top will be the start of a move down to the 20 week EMA. Furthermore, there is a 40% chance of a selloff down to the June low of 2700 and a 30% chance of a reversal to below the February low.<p>While the odds favor higher prices after 2 – 3 weeks down, if the bears begin to create consecutive big bear bars, traders will begin to consider the possibility of a deeper pullback.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-9-29"
    }
  ]
}