{
  "1": [
    {
      "data": [
        "<article class=\"post-80282 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini 50% retracement of 2 day selloff ahead of FOMC Intraday market update: Wednesday August 1, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini 50% retracement of 2 day selloff ahead of FOMC<br>Intraday market update: Wednesday August 1, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-08-01T06:20:21-07:00\">August 1, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini 50% retracement of 2 day selloff ahead of FOMC</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Yesterday retraced about half of the 2 day selloff. The odds were that the Emini would bounce at the 20 day EMA and try to get more neutral ahead of today’s FOMC meeting.<p>However, the 2 day selloff was surprisingly strong. A Surprise reversal usually has at least a small 2nd leg sideways to down. But, sometimes there is a bounce that retraces all of the selloff before the bears get their 2nd leg. Therefore, the odds are that traders will sell this rally, even if it tests Friday’s high. The bears are trying to create a lower high major trend reversal and head and shoulders top on the 60 minute chart.<p>Because yesterday had a strong rally, there is a 50% chance of some trend resumption up early today. However, the Emini is now around the middle of the 2 day selloff. It will therefore likely go sideways ahead of today’s FOMC meeting.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is trading about 6 points below yesterday’s close. It will therefore likely open within yesterday’s 4 hour upper trading range. The legs up and down yesterday were big enough to make at least one swing likely again today. But, today’s FOMC meeting is an important catalyst. Financial markets usually do not have big trends on the day before major news announcements.<p>A 1 – 3 day rally was likely after the 2 big bear days. The odds favor a test of Monday’s low. I said last week that a 50 – 100 point selloff was likely. Therefore, the Emini will probably form a lower high this week and have a 2nd leg sideways to down. While that can begin today, it likely will wait until after the FOMC report. Furthermore, today’s report could lead to a rally to Friday’s high at around 1850 before there is a 2nd leg down.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/07/Emini-bull-trending-trading-range-day-ahead-of-FOMC-meeting.png\"><img src=\"2018-8-1.png\" alt=\"Emini bull trending trading range day ahead of FOMC meeting\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex at apex of triangle ahead of Wednesday’s FOMC news</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/EURUSD-Forex-apex-of-nested-triangle-ahead-of-Wednesdays-FOMC-new.png\"><img loading=\"lazy\" src=\"2018-8-1-1.png\" alt=\"EURUSD Forex apex of nested triangle ahead of Wednesday's FOMC new\"></a><p class=\"caption\">The EURUSD daily Forex chart has nested triangles within a 3 month trading range. Yesterday reversed down from a breakout above the top of the bigger triangle. There was no strong selloff today yet and the chart is still in breakout mode.<p><br>The EURUSD daily Forex chart is at the apex of nested triangles that are within a 3 month trading range. Yesterday reversed down from a breakout above the bear trend line of the bigger triangle. Today, so far, is a bad entry bar. The bears now want a successful breakout below the triangle after the failed bull breakout. But, the bulls see the 2 day selloff as a pullback from the breakout attempt.<p>Trading ranges are constantly trying to breakout, but 80% of attempts fail. All financials markets will probably go sideways into today’s 11 a.m. FOMC announcement. While traders hope that the news will lead to a successful breakout, the odds still favor a continuation of the 3 month trading range. There is no breakout until there is a clear strong breakout with follow-through. While that will probably happen soon, traders are unwilling to hold onto positions for more than a couple of days until it occurs.<h3>Overnight EURUSD Forex trading</h3><p><br>Today is the entry day for the reversal down from the top of the triangle on the daily chart. Yet, the 5 minute chart has been in a 30 pip range overnight. There is no sense that the price is horribly wrong and that the market has to quickly move to a new price. Today’s 11 a.m. FOMC announcement is the next obvious catalyst. The extremely tight trading range of the past 2 weeks will probably continue at least until then. Therefore, day traders will keep scalping.<p>A breakout can come at any time. But, unless it is strong and has good follow-through, day traders will keep looking for reversals.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-trending-trading-range-day-after-FOMC-announcement-1.png\"><img loading=\"lazy\" src=\"2018-8-1-2.png\" alt=\"Emini trending trading range day after FOMC announcement\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>The Emini formed an outside down day yesterday. It was also a bear trending trading range day. Tomorrow has an increased chance of being an inside day. It would then form an ioi breakout mode setup.<p>The odds still favor a 2nd leg down before a break above last week’s high. But, there will probably be a new all-time high within a couple months.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-8-1"
    }
  ],
  "2": [
    {
      "data": [
        "<article class=\"post-80284 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini 2nd leg down in early August after buy climax  Intraday market update: Thursday August 2, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini 2nd leg down in early August after buy climax<br>Intraday market update: Thursday August 2, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-08-02T06:20:20-07:00\">August 2, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini 2nd leg down in early August after buy climax</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini sold off strongly yesterday and formed an outside down day prior to the 11 a.m. FOMC announcement. However, it closed above the low and the daily chart had a tail below. Since the past 3 weeks were mostly sideways, there is an increased chance of a trading range day today.<p>The odds still favor a 2nd leg down on the daily chart. But, the pullback from the 1st leg down might go sideways to up for more bars before the 2nd leg begins. The odds are that the Emini will fall about 70 – 100 points below Friday’s high, and then resume its trend up to a new high. There is still a 30% chance of a break below the February low and a measured move down to around 2300.<p>Since there is a lower high major trend reversal and a head and shoulders top on the 60 minute chart, there is a 40% chance of a measured move down over the next couple of weeks. While the odds still favor mostly trading range trading within the 3 week trading range, there is an increased chance of a surprisingly big trend day up or down this week.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 13 points in the Globex session. It will therefore probably fall below last week’s low. That would trigger a sell signal on the weekly chart. The bears want a measuring gap and a 50 point measured move down.<p>But, the sell signal bar on the weekly chart had a bull body. That lowers the probability of a trend down. Furthermore, an early reversal up would create an expanding triangle bottom on the 5 minute chart.<p>Because the Emini is at support, there is an increased chance of a surprisingly big trend day up or down.<h2>Yesterday’s setups</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-trending-trading-range-day-after-FOMC-announcement-1.png\"><img src=\"2018-8-2.png\" alt=\"Emini trending trading range day after FOMC announcement\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/EURUSD-Forex-bear-leg-in-2-month-triangle-after-FOMC-1.png\"><img loading=\"lazy\" src=\"2018-8-2-1.png\" alt=\"EURUSD Forex bear leg in 2 month triangle after FOMC\"></a><p class=\"caption\">After failing to break above the top of the 3 week trading range and the 2 month triangle, the EURUSD daily Forex chart has sold off for 3 days. It is now trying a bear breakout.<p>The EURUSD daily Forex chart is at the apex of a 2 month triangle. It broke above the bear trend line 3 days ago and now is trying to break below the triangle. A failed breakout and then an attempted breakout in the opposite direction has a higher probability of success.<p>However, there have been many small rallies and selloffs for 3 months and each reversed. Therefore, the odds are that this 3 day selloff will as well. But, since the legs now are lasting only 2 – 3 days, the tension is building. This makes a successful breakout likely within the next few weeks.<p>Traders will continue to bet on reversals until there are consecutive closes beyond the triangle. Furthermore, they want to see big trend bars far beyond the triangle. Once they do, they will look for a 300 pip measured move, based on the height of the triangle.<p>Since the triangle on the weekly chart is late in a bear trend and at support, it will probably be a Final Bear Flag. This means that the odds are that a bear breakout will reverse back into the triangle after testing its measured move target at around 1.1200.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart has sold off 140 pips in a tight bear channel for 3 days. The overnight selling broke below the 2 day bear channel. Since a bear break below a bear channel usually fails, the odds are that the selling will stop today.<p>The chart has been in a 30 pip trading range for the past 4 hours. That is likely to continue today. In addition, the recent legs up and down have lasted 2 – 3 days. Since this is the 3rd day, bulls will begin to buy again.<p>Because the 3 day selloff has not been strong and the past 4 hours have been sideways, the bears will begin to take profits and bulls will buy at new lows on the 5 minute chart. Furthermore, the bulls will look for a 50 – 100 pip bounce over the next few days. But, since a breakout of the triangle is likely within a few weeks, day traders will be quick to swing trade if they see a strong breakout beginning.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-consecutive-outside-days-and-small-pullback-bull-trend.png\"><img loading=\"lazy\" src=\"2018-8-2-2.png\" alt=\"Emini consecutive outside days and small pullback bull trend\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>The Emini reversed up on the open from below last week’s low, yesterday’s low, and the neck line of a head and shoulders top on the 60 minute chart. It then traded above yesterday’s high to form an outside up day after yesterday’s outside down. Today was a strong day for the bulls. If they get follow-through buying tomorrow, it will increase the odds of new all-time high within the next 2 months.<p>The bears still want a 2nd leg down from the 2 big bear days on Friday and Monday. They need a strong bear day tomorrow to erase today’s bullishness.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-8-2"
    }
  ],
  "3": [
    {
      "data": [
        "<article class=\"post-80286 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini buyers below last week’s sell signal barIntraday market update: Friday August 3, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini buyers below last week’s sell signal bar<br>Intraday market update: Friday August 3, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-08-03T06:20:39-07:00\">August 3, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini buyers below last week’s sell signal bar</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>I have been saying for the past week that the bears would get a 50 – 100 point pullback over the next couple of weeks, and then the Emini would resume up to a new all-time high. Yesterday’s low was a little more than 50 points down from last week’s high. However, yesterday reversed up to above Wednesday’s high and was therefore an outside up day. Since Wednesday was an outside down day, yesterday was especially bullish. Furthermore, yesterday formed a micro double bottom above the 20 day EMA. This is a bull flag.<p>The bulls need some follow-through buying today. If they get it, then they will probably break to a new all-time high within a few weeks. If they do not get it, the Emini might stay sideways for a couple more weeks. The minimum that the bulls need is the absence of a bear body. Because yesterday was climactic, today will probably be more of a trading range day. If the Emini is below the open in the final hour, look for a rally to above the open.<p>The Emini has probably begun a move back to a new all-time high. But, the bulls 1st need to break above last Friday’s high. That was the top of a 2 day sell climax. The odds were that there would be a 2nd leg down. Yesterday might have been that 2nd leg down. But, if the rally stalls at Friday’s high, the bears will sell, expecting a test below today’s low.<p>On the weekend, I said that last week was a sell signal bar on the weekly chart for a failed breakout above the March high. Since it had a bull body, I said that there would probably be more buyers than sellers below, even if the pullback lasted a couple weeks. Yesterday traded below last week’s low only for the first few minutes of the day. The day then rallied in a strong Trend From The Open bull trend.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 1 point in the Globex session. While the bulls would like a strong bull trend today, they have only a 25% chance after yesterday’s buy climax. Today will probably have at least a couple hours of sideways to down trading that starts by the end of the 2nd hour.<p>The odds favor at least a small bull body on the daily chart. Therefore, if the Emini is below the open in the final hour, the bulls will buy, expecting a rally back above the open.<p>The odds are against a strong bear trend after such a strong rally. Therefore, the bulls will look to buy a reversal up from any 2 – 4 hour selloff.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-consecutive-outside-days-and-small-pullback-bull-trend.png\"><img src=\"2018-8-3.png\" alt=\"Emini consecutive outside days and small pullback bull trend\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex bear leg near bottom of trading range</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/EURUSD-Forex-bear-leg-near-bottom-of-trading-range.png\"><img loading=\"lazy\" src=\"2018-8-3-1.png\" alt=\"EURUSD Forex bear leg near bottom of trading range\"></a><p class=\"caption\">Today is the 4th day in a bear leg near the bottom of a 2 month trading range on the EURUSD daily Forex chart. Since reversals are more common than breakouts, the chart should turn up over the next few days.<p><br>The EURUSD daily Forex chart has been in a trading range at support for 2 months. What had been a triangle is evolving back into simply a trading range. The bears want the past 4 days to be the start of a breakout and a 300 pip measured move down. However, there have been many strong legs up and down and all led to reversals. That is what is likely over the next few days.<p>The bulls see the 3 legs down from the July 23 high as a wedge pullback in the trading range. Because yesterday was a big bear day, the bulls will probably need a micro double bottom before they can get a bull leg in the trading range.<p>Since the 3 bear bars have increased in size, the selling is gaining momentum. Therefore, the 1st reversal up over the next few days will probably stall at the EMA. Traders will look to see if a small double top bear flag forms just below the EMA. If so, swing traders will short, hoping for a bear breakout of the trading range after this 4 day breakout below the triangle. Like all breakout attempts, the probability would be low, but the risk/reward would be good enough to make the math work.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart had a 50 pip reversal up overnight. But, the 4 day selloff was in a tight bear channel. Therefore a trading range is likely for a couple of days. The bears will sell rallies between 1.1600 and 1.1650 for scalps. Some will also hold part of their position for a swing down after the break below the triangle on the daily chart. They will take a chance that this is the start of a 300 pip selloff below the May low.<p>Since a strong bull trend is unlikely today, the bulls will buy pullbacks for scalps.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-small-pullback-bull-trend-after-yesterdays-outside-up.png\"><img loading=\"lazy\" src=\"2018-8-3-2.png\" alt=\"Emini small pullback bull trend after yesterday's outside up\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>Yesterday was an outside up day after an outside down day. By going above yesterday’s high, the Emini triggered a buy signal today. While it was not a big bull day, it did provide good follow-through buying. It therefore increased the chance of a new all-time high within the next couple of months. It might even come next week.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-8-3"
    }
  ],
  "4": [
    {
      "data": [
        "<article class=\"post-80290 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini consecutive outside bars in a bull flag Emini weekend update: August 4, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini consecutive outside bars in a bull flag<br>Emini weekend update: August 4, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-08-04T00:30:22-07:00\">August 4, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Strong test of all-time high</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-monthly-candlestick-chart-testing-all-time-high-after-buy-climax.png\"><img loading=\"lazy\" src=\"2018-8-4.png\" alt=\"Emini monthly candlestick chart testing all-time high after buy climax\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart is in a bull trend after a 3 month bull flag. A new all-time high is likely within a couple of months. The bears need a strong bear bar this month if they are going to get a successful double top. This is currently unlikely.<p>The monthly S&amp;P500 Emini futures candlestick chart has rallied for 4 months after a pullback. This followed the most extreme buy climax in the 100 year history of the stock market. When the buy climax is a micro channel (15 bars without a pullback), the bull trend usually resumes within a few bars, followed by a new high. How high can it go? There is no clear target on the monthly chart. However, the measured move up based on the weekly chart is about 300 points. Therefore, a reasonable target over the next 6 months is between 3,000 and 3,200.<p>There is always a bear case. However, the bears need a strong bear trend bar this month. If they get it, they will then have a credible double top with the January high. But, even then, the bull trend was so strong that the reversal down will probably be minor. If they got a strong break below the neck line at the February low, the measured move target would be around 2,200. Even then, a trading range on the monthly chart would be more likely than a bear trend.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Last week’s sell signal failed</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-weekly-candlestick-chart-resuming-up-after-pulling-from-breakout-above-March-high.png\"><img loading=\"lazy\" src=\"2018-8-4-1.png\" alt=\"Emini weekly candlestick chart resuming up after pulling from breakout above March high\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart reversed up this week from below last week’s low. It is still in a bull channel from the April low. This week is now a buy signal bar for next week.<p>The weekly S&amp;P500 Emini futures candlestick chart had a reversal down bar last week. The bears wanted a lower high major trend reversal. However, last week had a bull body. Additionally, the bull channel from the April low is tight. That made it likely that there would be more buyers than sellers below last week’s low.<p>On Thursday, the Emini dipped below last week’s low for a few minutes, and it then reversed up strongly.<p>Traders see this week as a pullback from the break above the March high. It is therefore a buy signal bar for next week.<p>It is still possible for the bears to get a lower high major trend reversal or a double top with the January high. However, they need to form big bear bars closing on their lows. Even then, there is only a 30% chance of a strong reversal down to below the February low.<br><h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Emini consecutive outside bars in a bull flag</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-daily-candlestick-chart-resuming-up-after-consecutive-outside-days.png\"><img loading=\"lazy\" src=\"2018-8-4-2.png\" alt=\"Emini daily candlestick chart resuming up after consecutive outside days\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart had a bear outside down day on Wednesday. This was followed by a big outside up day on Thursday. Thursday also formed a micro double bottom just above the 20 day EMA. Finally, Thursday closed above Wednesday’s high. The odds favor higher prices.<p>The daily S&amp;P500 Emini futures candlestick chart had a very unusual pattern this week. There were consecutive outside bars on Wednesday and Thursday. The bull bar followed the bear bar, trapping the bears. Additionally, the pattern is just above the 20 day EMA. It is therefore a bull flag. Furthermore, Thursday closed above Wednesday’s high. Finally, there is a micro double bottom. These factors increase the odds of the bull trend continuing up to a new high within a couple of months. In fact, the bulls might get a new high next week, although this is unlikely.<p>The 2 big bear days on July 27 and 30 were strong enough to get a 2nd leg down. Thursday might have been that 2nd leg. However, sometimes the Emini will go sideways for 10 or more bars and then have a 2nd leg down. The 2 strong bull days probably erased the bearishness of the 2 bear days. But, the bulls need a break above the two bear days to eliminate the bear pattern.<p>If the bears can prevent a breakout above that high, they will try for a lower high or a small double top. Their goal would be a break below this week’s low and at least a 50 point measured move down. They have a 40% chance as long as they can prevent a break above the July high.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-8-4"
    }
  ],
  "6": [
    {
      "data": [
        "<article class=\"post-80288 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini follow-through buying after consecutive outside dayIntraday market update: Monday August 6, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini follow-through buying after consecutive outside day<br>Intraday market update: Monday August 6, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-08-06T06:20:39-07:00\">August 6, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini follow-through buying after consecutive outside day</h2><p class=\"caption\">I will update again at the end of the day.<p>Thursday was an outside up day after an outside down day on Wednesday. It was therefore a buy signal bar. Friday was the entry bar on the daily chart, and it provided reasonable follow-through buying. This increases the odds of a new all-time high within a couple of months. It might even come this week.<p>The bears need to create strong bear days before traders will believe that they are back in control. The odds favor higher prices.<h2>Pre-Open market analysis</h2><p><br>The Emini is down 1 point in the Globex market. The market only rarely has 3 consecutive strong trend days. It has been in a tight channel for 2 days. Ninety percent of tight channels end by the end of the 3rd day. They end by converting into a trading range for about 10 bars on the 60 minute chart. That is about a day and a half. Therefore, the odds favor more trading range trading today and certainly by the end of tomorrow.<p>Consequently, day traders expect a 10 point selloff today or tomorrow. But, the 2 day rally was strong. Day traders will buy every 10 – 20 point reversal attempt, expecting a new high within a day or two.<h3>Overnight Emini Globex trading</h3><h2>Friday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-small-pullback-bull-trend-after-yesterdays-outside-up.png\"><img src=\"2018-8-6.png\" alt=\"Emini small pullback bull trend after yesterday's outside up\"></a><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex has 5 consecutive bear trend days</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/EURUSD-daily-Forex-chart-has-5-consecutive-bear-days.png\"><img loading=\"lazy\" src=\"2018-8-6-1.png\" alt=\"EURUSD daily Forex chart has 5 consecutive bear days\"></a><p class=\"caption\">The EURUSD daily Forex chart has a bear trend day so far today today. If it remains a bear day, it will create the 1st streak of 5 consecutive bear days since May 18. Even if it does not, there have not been 4 consecutive trend days up or down in the entire 3 month trading range. This increases the chances of a successful bear breakout.<p><br>The EURUSD daily Forex chart had its 4th consecutive bear trend day on Friday. This is the 1st streak of 4 trend days up or down in the entire 3 month trading range. So far, today is another bear trend day. The last streak of 5 consecutive trend days up or down came during the May collapse.<p>All trading ranges eventually breakout, even though most attempts lead to reversals and a continuation of the range. This breakout attempt is different. Whenever a trading range begins to have a streak of 4 or 5 consecutive trend days up or down, the odds are that a successful breakout is about to happen. Here, the bear days are a sign of sustained selling pressure. Therefore, traders should expect a break below 1.15 within the next week. This is true even if there is a 100 pip reversal up to around the 20 day EMA 1st. Therefore, traders will sell rallies.<p>Furthermore, traders will look for the selloff to fall for about a measured move down. Since the 3 month range is about 300 pips tall, traders will look for the move to reach around 1.12 over the next few months. Unless the bulls create a very strong reversal up before then, the odds are that the bear trend is resuming.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart sold off 40 pips overnight. While the past 5 days have not been big bear days, the number of bear days is important. A chart has 2 variables, price and time. Many trends begin with time (a streak of trend days) before price. Traders now believe that there will be a successful breakout below the 3 month range.<p>Every trend will have many reversal attempts. But, my 80% inertia rule also applies to trends. Once a market is in a trend, 80% of reversal attempts will fail and become bear flags. While the daily chart is still in its 3 month range, it is also in an early bear trend. Therefore, day traders will look to sell 50 – 100 pip rallies this week. They expect each to lead to a new low.<p>Because the selloff on the 5 minute chart was not climactic, bull day traders are buying reversals for 10 – 20 pip scalps. The bears will sell rallies for scalps and swings.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-bull-trend-and-then-triangle.png\"><img loading=\"lazy\" src=\"2018-8-6-2.png\" alt=\"Emini bull trend and then triangle\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>While the 3 day rally has been strong, it is also a buy vacuum test of the July high and the 2850 Big Round Number. Furthermore, the Emini had its 3rd consecutive day in a tight bull channel on the 5 minute chart. This is unusual and therefore climactic. The odds favor a pause for 1 – 1 1/2 days starting within 2 days.<p>If the bulls get a breakout above today’s triangle, the triangle would likely be a Final Bull Flag. The result would be a pullback into the triangle on the 5 minute chart. However, the bull trend is strong enough to make a bear swing unlikely without at least a micro double top on the daily chart.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-8-6"
    }
  ],
  "7": [
    {
      "data": [
        "<article class=\"post-80456 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini buy vacuum test of July high and all-time highIntraday market update: Tuesday August 7, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini buy vacuum test of July high and all-time high<br>Intraday market update: Tuesday August 7, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-08-07T06:20:11-07:00\">August 7, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini buy vacuum test of July high and all-time high</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Yesterday was the 3rd consecutive strong bull trend day. It broke above last week’s high and the July high. However, the 5 minute chart has been in a tight bull channel for 3 days. Tight bull channels rarely last more than 3 days. Therefore, today will probably be a trading range day and a pause in the bull trend.<p>Yesterday ended with a triangle, which was late in a bull trend. That will probably either be the Final Bull Flag before a pullback to the 60 minute EMA, or it will be a triangle top that will lead to a pullback to the 60 minute EMA.<p>Can today be a 4th strong bull trend day? Of course, but that is less likely than mostly a trading range day.<p>The 3 day bull channel is a sign of strong bulls. That makes a bear trend unlikely without the Emini 1st going sideways for at least a couple of hours. With the 3 day breakout as strong as it is on the daily chart, the bears will need at least a micro double top before traders think that the bulls might have lost control. Therefore, the downside risk is small for the next couple of days. The 1st reversal will probably only last a day to a day and a half.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 6 points in the Globex market. It might therefore gap above yesterday’s high. But, the gap would be small. Small gaps typically close in the 1st hour and are not meaningful. Furthermore, after 3 days in a tight bull channel, today will probably be a pause day in the strong bull trend.<p>However, the odds are that last year’s bull trend is resuming. If so, this rally could be unusually strong. Therefore, even though unlikely, traders should be ready for a surprisingly strong series of bull trend days. If today is another one, day traders will swing trade again, even though a trading range day is more likely.<h2>Yesterday’s setups</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-bull-trend-and-then-triangle.png\"><img src=\"2018-8-7.png\" alt=\"Emini bull trend and then triangle\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/EURUSD-Forex-double-bottom-higher-low-major-trend-reversal-but-strong-selling-pressure.png\"><img loading=\"lazy\" src=\"2018-8-7-1.png\" alt=\"EURUSD Forex double bottom higher low major trend reversal, but strong selling pressure\"></a><p class=\"caption\">The EURUSD daily Forex chart is reversing up from a double bottom with the June 28 low. Both bottoms are above the June 21 bottom of the bull trend reversal. Therefore, this is a double bottom higher low major trend reversal attempt. However, the 5 consecutive bear days makes a bear breakout slightly more likely.<p><br>The EURUSD daily Forex chart yesterday formed its 5th consecutive bear day yesterday. This is the 1st time that the chart has had more than 4 consecutive trend days up or down since the trading range began on May 29. Because this selling pressure is unusual, it increases the chance that it is the start of a bear breakout.<p>Most breakout attempts fail, even when they are strong, like this one is. However, after 5 bear days, the bulls will probably need at least a micro double bottom over the next few days before they can erase what the bears have accomplished.<p>The bears will try to stop the bull reversal up from the bottom of the trading range. Typically, they would create a double top bear flag just below the 20 day EMA.<p>The odds are that the Emini will bounce today and maybe tomorrow. It will then form a small trading range. The range will have a small double top bear flag and a micro double bottom. The direction of the breakout of that small pattern will probably determine what the daily chart will do over the next month.<p>If the bulls get a strong reversal up, the 3 month trading range will continue. In addition, they will hope for a breakout above the top of the range at 1.1850. However, if the bears get consecutive closes below the June 21 low and 1.15, the chart will probably work down to around 1.12.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart rallied 50 pips in Europe overnight. But, a tight trading range is likely over the next week. Consequently, the rally will probably stall between 1.1600 and 1.1650. The legs in the upcoming tight trading range on the daily chart typically last only a day or two. Therefore, traders will look for reversals after 1 – 2 days up or down. They expect both a double top and a double bottom between 1.15 and 1.1650 over the next week.<p>If the rally reaches 1.17, the odds of the bear breakout below the 3 month range drop back to where they were last week. The chart would be back to neutral.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-wedge-top-at-60-minute-parabolic-wedge-and-measured-move-target.png\"><img loading=\"lazy\" src=\"2018-8-7-2.png\" alt=\"Emini wedge top at 60 minute parabolic wedge and measured move target\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>Today was the 4th consecutive bull trend day, but the rally stalled at the 60 minute chart’s measured move target. In addition, the 60 minute chart has a parabolic wedge rally. The Emini will likely pull back tomorrow and maybe Thursday after such a climactic rally.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-8-7"
    }
  ],
  "8": [
    {
      "data": [
        "<article class=\"post-80458 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini parabolic wedge top at measured move targetIntraday market update: Wednesday August 8, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini parabolic wedge top at measured move target<br>Intraday market update: Wednesday August 8, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-08-08T06:20:23-07:00\">August 8, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini parabolic wedge top at measured move target</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini rallied for 4 days in a tight bull channel on the 60 minute chart. This is extreme and unsustainable, and therefore climactic. It pulled back in a tight range yesterday from a 4 day parabolic wedge rally on the 60 minute chart. The high was at a measured move target based on the 60 minute chart (not shown).<p>A buy climax will usually pull back for 10 or more bars. This is about a day and a half on the 60 minute chart. A major reversal comes less than 40% of the time. Yesterday’s high might be the start of the pullback. Since Monday had a triangle, it is probably the Final Bull Flag. Therefore, a minimum target is a test of the apex of that triangle today or Thursday.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 2.5 points in the Globex session. It therefore might gap down. This would make yesterday a 1 day island top. If so, that slightly increases the chance of a minor reversal for a few days. But, most small gaps close within the 1st hour. While a 1 – 2 day pause or pullback is likely, it can come even if today gaps down and then rallies back above yesterday’s low, closing the gap.<p>The one thing that is unlikely today is a strong bull trend day. The 5 minute chart’s bullish momentum has reduced over each of the past 2 days. This makes at least a small pullback likely. Therefore, today will probably be either another trading range day or a small bear day.<p>As always, there is a 20% chance of a big trend up or down on any day.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-wedge-top-at-60-minute-parabolic-wedge-and-measured-move-target-1.png\"><img src=\"2018-8-8.png\" alt=\"Emini parabolic wedge top at 60 minute parabolic wedge and measured move target\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Low 1 bear flag after selling pressure</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/EURUSD-Low-1-bear-flag-after-selling-pressure.png\"><img loading=\"lazy\" src=\"2018-8-8-1.png\" alt=\"EURUSD Low 1 bear flag after selling pressure\"></a><p class=\"caption\">After 5 consecutive bear days on the EURUSD daily Forex chart, the bears will probably break below the June low. If today is a bear day, It will be a Low 1 bear flag and a sell signal bar for tomorrow.<p><br>The 5 consecutive bear days on the EURUSD daily Forex chart after the breakout below the 2 month triangle is a sign that the selling pressure has increased. This is a change and it makes a break below the June low likely. If today has a bear body, it will be a Low 1 bear flag and a sell signal bar for tomorrow.<p>The final 2 days of the selloff had small bodies. This represents a loss of momentum near the bottom of the range. Therefore, the bears will probably need 2 attempts to break below the range. As a result, the chart will likely enter a tight trading range over the next few weeks. If so, there will probably be a small double top and a small double bottom. This will slightly reduce the bearishness of the 5 bear days.<p>The small double top would be a Low 2 bear flag. If the bears then get consecutive closes below the June 21 low, traders will conclude that a 300 pip measured move down is underway.<p>Alternatively, if the bulls get 3 or more bull days, traders will believe that the chart formed a double bottom with the June 28 low. The pattern would then be a micro double bottom and a double bottom higher low major trend reversal. Without this, the odds now favor a bear breakout.<h3>Overnight EURUSD Forex trading</h3><p><br>I said yesterday that the 5 minute chart would probably bounce to between 1.16 and 1.1650 in the next 2 days and stall. This is because the daily chart will probably enter a tight trading range over the next week. That range will have a small double bottom and a small double top.<p>Day traders will expect this and look for reversals every couple days. They therefore will buy around 1.1550 – 1.1570 expecting about a 50 pip rally from a double bottom with the August 6 low. This would create a micro double bottom on the daily chart.<p>The rally will likely only last a couple of days. Day traders will then sell again above 1.16. If the selloff from there is strong, they will look for a swing trade and a break below the June low.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-bear-doji-day-after-60-minute-parabolic-wedge-top.png\"><img loading=\"lazy\" src=\"2018-8-8-2.png\" alt=\"Emini bear doji day after 60 minute parabolic wedge top\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>After trading below yesterday’s low, the Emini reversed up sharply. It then entered a trading range. The open of the day was a magnet all day. Today is a High 1 bull flag buy signal bar for tomorrow. But, the bears got a close below the opne. Therefore, the bears will probably get a little more sideways to down trading after their 4 day parabolic wedge top at a measured move target.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-8-8"
    }
  ],
  "9": [
    {
      "data": [
        "<article class=\"post-80460 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini pullback from parabolic wedge top on 60 minute chartIntraday market update: Thursday August 9 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini pullback from parabolic wedge top on 60 minute chart<br>Intraday market update: Thursday August 9 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-08-09T06:20:47-07:00\">August 9, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini pullback from parabolic wedge top on 60 minute chart</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini had another trading range day yesterday. Its high was below Tuesday high, and therefore yesterday is a High 1 bull flag. But, yesterday had a bear body and is therefore a weak buy signal bar.<p>In addition, the 60 minute chart still has a parabolic wedge top at a measured move target. Hence, the odds favor at least a little more pullback before the bull trend resumes. This is true even if today trades above yesterday’s high.<p>A major reversal down is unlikely to begin within the next few days. More likely, there will be a test of the all-time high within a few weeks. There is a 30% chance of it coming within a week.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 3 points in the Globex market. After the parabolic wedge rally to a measured move target on the 60 minute chart, the odds favor a longer pullback. In addition, the past 2 days were trading range days. That increases the odds for another one today.<p>Furthermore, Tuesday’s triangle on the 5 minute chart is a magnet below. Other important magnets below are the 60 minute EMA and the July 25 high, which is a breakout point. All are around the 2850 Big Round Number. Therefore, day traders will look to sell rallies. This is true even if today goes above yesterday’s high.<p>Once the pullback reaches that support around 2850, the bulls will begin to look for a reversal up. That could lead to one or more bull trend days and a resumption of the rally up to a new all-time high.<p>Can the 60 minute parabolic wedge top lead to a bear trend reversal down to last week’s low at around 2800? Yes, but there is a 70% chance of another leg up to at least a little above Tuesday’s high 1st.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-bear-doji-day-after-60-minute-parabolic-wedge-top.png\"><img src=\"2018-8-9.png\" alt=\"Emini bear doji day after 60 minute parabolic wedge top\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex Low 1 bear flag will probably grow into Low 2</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/EURUSD-Forex-Low-1-bear-flag-will-probably-grow-into-Low-2.png\"><img loading=\"lazy\" src=\"2018-8-9-1.png\" alt=\"EURUSD Forex Low 1 bear flag will probably grow into Low 2\"></a><p class=\"caption\">The EURUSD daily Forex chart rallied for 2 days from a double bottom with the June 28 low. However, after 5 bear bars, the bulls will need a micro double bottom. Furthermore, the odds now favor a break below the June low after a micro double top bear flag.<p><br>The EURUSD daily Forex chart had 5 consecutive bear trend bars. While they were not big, that is the longest streak up or down in the 3 month trading range. Charts have 2 variables, price and time. Sometimes, time is more important. This selling pressure now makes a bear breakout likely within a couple of weeks.<p>Yesterday is a Low 1 bear flag, but it was a bull bar and the 5 bear bars were not all big. Therefore, the bears will probably need 2 failed small rally attempts before they can get their breakout. The odds are the daily chart will trade down for a day or two and bounce from a micro double bottom. Then, the bears will try for their breakout after a micro double top (Low 2) bear flag. This means that the daily chart will probably be in a tight range for several more days.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart is in the middle of a 45 pip overnight trading range. In addition, it is probably also in the middle of a 100 pip tall tight trading range that will last several more days. Day traders will look to buy reversals up from below the prior day’s low and sell reversals down from above the prior day’s high. In addition, they will trade any small reversal on the 5 minute chart and be quick to take profits.<p>There is a 60% chance of a bear breakout on the daily chart and a 40% chance of a strong reversal up. Either would require a strong trend on the 5 minute chart. But, neither is likely for at least a few days.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-outside-down-day.png\"><img loading=\"lazy\" src=\"2018-8-9-2.png\" alt=\"Emini outside down day\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>The Emini sold off from above yesterday’s high, but rallied off the 60 minute EMA. Late in the day, it traded below yesterday’s low and became an outside down day. There is now a micro double top.<p>The parabolic wedge rally to resistance on the 60 minute chart will probably limit any rally over the next few days. The odds still favor a test down to Tuesday’s triangle at around 2850, even if there is a new high 1st.<p>If tomorrow gaps down, there will be a 3 day island top. This could lead to a deeper pullback, but the odds still favor a new high within a couple of months.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-8-9"
    }
  ],
  "10": [
    {
      "data": [
        "<article class=\"post-80462 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini outside down day and micro double topIntraday market update: Friday August 10, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini outside down day and micro double top<br>Intraday market update: Friday August 10, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-08-10T06:20:47-07:00\">August 10, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini outside down day and micro double top</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>After a 4 day parabolic wedge rally on the 60 minute chart, the Emini has been in a tight range for 3 days. However, yesterday was an outside down day. It also was a micro double top on the daily chart. It is therefore a sell signal bar for today. Furthermore, a gap down today would create a 3 day island top. That could lead to a deeper pullback. But, the odds still favor a new all-time high within a couple months.<p>Today is Friday, but there is no nearby major weekly support or resistance. The bulls want the week to close on its high. At a minimum, they want a close above the midpoint and above last week’s high. The bears always want the opposite. If the week closes below its midpoint, it will be a sell signal bar on the weekly chart for next week.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 13 points in the Globex session. It will probably gap down and create a 3 day island top. The bears hope that this is the start of a double top reversal with the January high. More likely, it is a bear leg in a 4 month bull channel. However, if the bears begin to get a series of big bear trend days, the selloff could be deep. The next major support is the August 2 buy climax low at 2795.00.<p>The gap down will be big. It is coming after a buy climax and at the top of a 7 month trading range. This increases the chance of at least several days down. Bear legs typically have mostly bear trend days. Therefore, there is an increased chance of a bear trend day today.<p>However, the 4 day rally was strong, as has been the leg up from June 28. There is therefore a 40% chance of a strong bull trend day that rallies back above yesterday’s low and closes the gap. Traders need to be ready for anything today. The big gap down at major resistance increases the odds of a trend day up or down. If there is a big trend day, down is more likely.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-outside-down-day.png\"><img src=\"2018-8-10.png\" alt=\"Emini outside down day\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex breakout below 3 month trading range</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/EURUSD-Forex-breakout-below-3-month-trading-range.png\"><img loading=\"lazy\" src=\"2018-8-10-1.png\" alt=\"EURUSD Forex breakout below 3 month trading range\"></a><p class=\"caption\">The EURUSD daily Forex chart has a big bear trend bar so far today. It is a breakout below a 3 month trading range and a resumption of the May bear trend.<p><br>The EURUSD daily Forex chart broke below the 3 month trading range today. For the past several weeks, I said that there would probably be a breakout within a couple of weeks because the daily chart worked its way into a triangle apex. Last week, I said that the 5 consecutive bear days made a bear breakout likely. Today is the breakout. The bigger a bear day the bears get today and the more it closes on its low, the more likely the breakout will succeed. In addition, if there are follow-through bear days over the next few days, the odds will favor a 300 pip measured move down.<p>If the bulls get a strong bull trend day in the next couple of days and then additional bull days, the breakout will fail. They have a 40% chance of success at the moment.<p>A big breakout from an extended trading range changes the market from a trading range to a trend. That increases the odds of more trend days over the next week or more. Therefore, day traders will be more willing to hold onto swing trades for more pips.<h3>Overnight EURUSD Forex trading</h3><p><br>Every trend has pauses. When there is a trading range on the 5 minute chart, day traders will scalp. The 5 minute chart has been in a 40 pip range for the past 8 hours, which is a scalper’s market. However, day traders will be more willing to swing part of their shorts because of the new bear trend on the daily chart.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-island-top-and-wedge-bear-flag-followed-by-bull-trend-reversal.png\"><img loading=\"lazy\" src=\"2018-8-10-2.png\" alt=\"Emini island top and wedge bear flag followed by bull trend reversal\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>The Emini gapped down and formed a 3 day island top. It sold off to the 50% pullback level from last week’s 4 day rally and reversed up strongly at the end of the day. Today was a doji day on the daily chart. The bulls hope for a gap up on Monday. That would create a one day island bottom and erase much of today’s bearishness. More likely, the Emini will pull back for at least a couple weeks.<p>The candlestick on the weekly chart is also a doji and a sell signal bar for next week. A reversal after a buy climax typically falls in at least 2 legs and lasts 10 or more bars. Therefore, the Emini will probably pull back for at least a couple of weeks. It might test last week’s buy climax low at 2795.00.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-8-10"
    }
  ],
  "11": [
    {
      "data": [
        "<article class=\"post-80466 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini island top forming double top with January all-time highEmini weekend update: August 11, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini island top forming double top with January all-time high<br>Emini weekend update: August 11, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-08-11T00:30:32-07:00\">August 11, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>5 month rally, testing all-time high</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-monthly-candlestick-chart-testing-January-all-time-high.png\"><img loading=\"lazy\" src=\"2018-8-11.png\" alt=\"Emini monthly candlestick chart testing January all time high\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has a doji bar so far for August. The bears want a double top with the January high. They need a strong bear bar in August for a sell signal bar.<p>The Emini monthly candlestick chart has been in a bull trend for 10 years. February ended the most extreme buy climax in the 100 year history of the stock market. As is usually the case after a strong bull trend, the climax led to a pause and not a bear trend. The bull trend has resumed for the past 5 months.<p>The bulls want a breakout above the January high and then a measured move up, based on the height of the 7 month trading range. That target is between 3,000 and 3,200, depending of which highs and lows a trader uses to make the projection.<h4>Possible double top and measured move down</h4><p>While the bears want a double top with the January all-time high, they need August to close near its low to create a strong sell signal bar. However, the reversal down would still probably be minor since last year’s rally was so strong.<p>The bears want a breakout below the February low. That is the neck line of the double top. A measured move down is around 2200. While that would be a 25% correction, a bear trend is unlikely. Instead, it would probably be a bear leg in what would become a trading range for 10 – 20 bars (1 – 2 years). However, it would be a bear trend on the daily chart.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Lower high major trend reversal and at top of 5 month tight bull channel</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-weekly-candlestick-has-lower-high-major-trend-reversal.png\"><img loading=\"lazy\" src=\"2018-8-11-1.png\" alt=\"Emini weekly candlestick has lower high major trend reversal\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart formed a reversal bar this week for a double top with the January high. It is therefore a sell signal bar for next week. Because it is a doji bar and in a tight bull channel, it is a low probability sell signal.<p>The Emini weekly candlestick chart has rallied since the April double bottom with the February low. The rally was particularly strong for the past 6 weeks. This was a buy vacuum test of the January all-time high. It got close enough for the bears to create a credible double top. In addition, the rally was in a wedge bull channel.<p>This week’s reversal bar is now a sell signal bar for next week. But, it is a doji bar and the bull channel is tight. This reduces the chance of a big selloff. The odds are that the Emini will trade down for 2 – 3 weeks. I have said that even if the rally continues up to above 3,000, there would be swings down along the way. This is probably one of those bear swings.<p>I have been writing every week for months that there is still a 30% chance of a break below the February low and a measured move down to 2,200. Nothing has changed. The odds favor a minor reversal down, maybe to the start of the July buy climax at around 2700. The deeper the selloff and the bigger the bear bars, the less likely the bulls will make a new high this year.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Emini formed 3 day island top at top of bull channel and near all-time high</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-daily-candlestick-has-3-day-island-top-at-top-of-bull-channel.png\"><img loading=\"lazy\" src=\"2018-8-11-2.png\" alt=\"Emini daily candlestick has 3 day island top at top of bull channel\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart had a gap down on Friday. This created a 3 day island top after a 4 day buy climax last week. The 1st target after a buy climax is the bottom of the buy climax. That is the August 2 low of 2795.<p>The daily Emini candlestick chart gapped down and sold off strongly for most of Friday from just below the all-time high. In addition, it was at the top of a 5 month bull channel. Even though it closed near the open, the selloff will probably test support below the 20 day EMA. If the selloff is persistent, the next major support is the August 2 buy climax low. Reversals usually have at least two legs down and last 10 or more bars. That is a reasonable minimum goal for the bears.<p>While the August 2 low is important, it is not as major as the June 28 low of 2693.50. As long as the selloff remains above that low, the daily chart is still in a bull swing in a 7 month trading range. But, if the Emini falls below that low, it would then be either in a bear trend or a bear leg in the 7 month range.<p>What about a new high this year? Friday’s reversal reduces the chances, but the odds are still 60%. They will fall if the selloff is deep. There is a 40% chance of a test of the February low, and a 30% chance of a big bear break below that low. I have been saying that for months, and it is still true.<h4>How does a double top reversal form?</h4><p>When a rally approaches a prior high, there are always sellers. The bulls who bought the January high were disappoint by the February selloff. They bought what they thought was a bull trend. Now, they believe they bought what now is the top of a trading range.<p>Traders want to buy low and sell high in a trading range. Therefore, those bulls want to sell out of their longs if the market allows them to get out around breakeven. This means there are bulls looking to sell up there. That is never a good thing for traders hoping for a strong breakout above the old high. Friday in part was caused by those bulls giving up.<p>The bears know this, and they, too, sold around the old high and on Friday’s reversal down. This selling by the bulls and bears usually causes the rally to stall. Once it does, traders begin to wonder if there will be a trend reversal down from the double top, rather than just a deep pullback.<h4>Buy The Close rally in January</h4><p>The January rally was strong enough so that many traders bought the closes of strong bull days. This includes the strong bull trend day on January 26, which was the top of the rally. When traders take a reasonable trade like this, they have an 80% chance of making a profit or at least avoiding a loss if they use wide stops and scale in.<p>The January 26 Buy The Close bulls were disappointed by February. If they scaled in above either of the big bull bars a couple weeks later, they could have exited at the midpoint of their 2 buys without a loss.<p>Since the January rally was so strong, the odds are that the current rally will get all the way up to the January 26 close of 2883.25 before breaking below the 7 month range. If it gets back to that January high close, traders will watch to see if there is a reversal down. If so, they will look to sell, betting that the bulls will give up and then only buy deep selloffs.<p>Alternatively, if the Emini rallies strongly to above that price without much of a pause, it will then probably continue up the the measured move target between 3,000 and 3,200.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-8-11"
    }
  ],
  "13": [
    {
      "data": [
        "<article class=\"post-80464 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini weekly sell signal for double top with January highIntraday market update: Monday August 13, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weekly sell signal for double top with January high<br>Intraday market update: Monday August 13, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-08-13T06:20:53-07:00\">August 13, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini weekly sell signal for double top with January high</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Last week formed a reversal bar on the weekly chart. While it was not a big bear bar, the context is good for the bears. They now have a credible double top with the January high. However, the weekly bull channel is tight. Therefore, this is probably a minor reversal than the start of a swing down. A minor reversal means that a bull flag is more likely than a bear trend.<p>This week is the entry bar for the bears on the weekly chart. If they can create a series of bear days, the odds will favor a deeper pullback to the middle of the 7 month trading range. However, if the bear bars are not big and not consecutive, the selloff will probably only last 1 – 3 weeks. Then, the bulls will try again to get above the January high.<p>Friday was a doji bar on the daily chart. It therefore was not a strong day for the bears. A gap up today or any day this week will create an island bottom. That would erase the bearishness of last week’s island top. However, at the moment, the Emini will probably pull back for a couple more weeks.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 1 point in the Globex session. After Friday’s late big reversal up, traders are now less certain of lower prices. Confusion usually results in a trading range. The bulls want Friday to be the end of a 3 day selloff. They see it as a 3 day bull flag. But, the bears want it to be a major reversal down. While the odds favor the bulls over the next month or two, the selloff was strong enough to make sideways to down likely for a week or two.<p>When a market is in a trading range, legs up and down usually only last 1 – 3 days. In addition, the uncertainty exists on small time frames as well. The 5 minute chart spends more time going sideways.<p>The 1st target for the bulls is Friday’s high. If they can break strongly above it, they will try to close the gap below Thursday’s low. Both are resistance areas, and the bears will sell there.<p>The bears want a breakout below the August 2nd buy climax low. That is their target over the next few weeks.<h2>Friday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-island-top-and-wedge-bear-flag-followed-by-bull-trend-reversal.png\"><img src=\"2018-8-13.png\" alt=\"Emini island top and wedge bear flag followed by bull trend reversal\"></a><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex pullback from bear breakout of trading range</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/EURUSD-Forex-pullback-from-bear-breakout-of-trading-range.png\"><img loading=\"lazy\" src=\"2018-8-13-1.png\" alt=\"EURUSD Forex pullback from bear breakout of trading range\"></a><p class=\"caption\">The EURUSD daily Forex chart has a bull trend bar so far today. But, after 2 surprisingly big bear bars, a minor reversal and a bear flag are more likely than a bull trend reversal.<p><br>The EURUSD daily Forex chart broke strongly below the 3 month trading range on the daily chart. The 3 week selloff has been strong and the bears have a measured move target at around 1.12.<p>But, the price is now far below average (the 20 day EMA). There are fewer bears willing to sell this low. They prefer to sell closer to the average price. The bulls know that and they therefore are willing to buy for a 1 – 3 day bounce.<p>With a relative absence of bears and now some aggressive bulls here, the selling will probably stop for a few days. The result will probably be several days of sideways to up trading.<h4>Bull flag on the weekly chart</h4><p>It is important to note that the bears do not have consecutive bear bars that both close below the June 21 bottom of the range. Today will likely close below, but it might have a bull body. That would be a sign of a weaker bear breakout.<p>In addition, the bull trend in 2017 was very strong, The selloff since February is more likely only a pullback in that trend on the weekly chart. The pullback is now around 50%. Also, it is a Breakout Test of the top of the 2015 – 2016 trading range. Therefore, even if the selloff continues down to the 1.12 measured move target, the bulls would then probably get a rally back to the June high. That rally would probably last many months.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart has rallied 40 pips in the past 2 hours, reversing an early selloff in the European session. This is probably a sign that the bears are taking partial profits and bull scalpers are beginning to buy. Consequently, the 60 minute chart will begin to enter a trading range for a few days. This rally is the 1st leg up in that range, and today might not be the final bottom of the range.<p>When a market enters a trading range, there are swings up and down. Day traders will therefore be more willing to hold onto positions for 30 – 50 pip swings. Furthermore, scalpers will trade reversals for 10 – 20 pip scalps.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-outside-down-day-and-weekly-sell-signal.png\"><img loading=\"lazy\" src=\"2018-8-13-2.png\" alt=\"Emini outside down day and weekly sell signal\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>The Emini traded above Friday’s high and then below its low. It therefore formed an outside down day. By going above Friday’s high, it triggered a daily buy signal. Once it went below last week’s low, it triggered a weekly sell signal. When there are conflicting signals, the Emini usually goes sideways for a few days as the bulls and bears fight for control. This is more likely after 2 doji days and 3 other small days.<p>Since the daily chart was overbought and at the January high, the odds still favor a 1 – 3 week pullback before a new all-time high.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-8-13"
    }
  ],
  "14": [
    {
      "data": [
        "<article class=\"post-80641 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini daily buy signal stronger than weekly sell signalIntraday market update: Tuesday August 14, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini daily buy signal stronger than weekly sell signal<br>Intraday market update: Tuesday August 14, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-08-14T06:20:20-07:00\">August 14, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini daily buy signal stronger than weekly sell signal</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Friday was a weak buy signal bar on the daily chart. There were therefore likely sellers above. Yesterday triggered the buy, but then reversed down. It broke below Friday’s low and formed an outside down day.<p>Last week was a weak sell signal bar on the weekly chart. By trading below last week’s low, yesterday triggered the sell signal on the weekly chart. The bears want the week to be a big bear bar on the weekly chart. The bulls would like it to close above the open and form a High 1 bull flag for next week.<p>While yesterday was an outside down bar on the daily chart, it had fairly conspicuous tails above and below. In addition, the daily chart is at the 20 day EMA and a 50% pullback from the rally 2 weeks ago. This signifies confusion and makes more sideways trading likely today. The bulls still want a gap up any day this week. That would create an island bottom and increase the chances that the pullback has ended.<p>The bears want a test of the August buy climax low. While the odds still favor a new all-time high, this pullback might last 1 – 3 weeks.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 7 points in the Globex session. The bulls want yesterday to be a double bottom on the 5 minute chart. A measured move up would be above the 60 minute EMA.<p>When there is an outside day, like yesterday, there is an increased chance that today will be an inside way. If so, today will be an ioi bull flag and a buy signal bar on the daily chart. With the Emini likely to open in the middle of yesterday’s range, the odds of an inside day are higher. Furthermore, it is in the middle of the strong 4 day rally of 2 weeks ago. That also increases the chance of an inside day, or at least another sideways day.<p>While the bears want another big bear day, the 2 days of hesitation at the 20 day EMA and the 50% pullback on the daily chart make that unlikely. The bears and bulls are balanced at support. This reduces the chance of a big trend day today.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-outside-down-day-and-weekly-sell-signal.png\"><img src=\"2018-8-14.png\" alt=\"Emini outside down day and weekly sell signal\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex Low 1 bear flag after breakout below Final Bear Flag</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/EURUSD-Forex-Low-1-bear-flag-after-breakout-below-Final-Bear-Flag.png\"><img loading=\"lazy\" src=\"2018-8-14-1.png\" alt=\"EURUSD Forex Low 1 bear flag after breakout below Final Bear Flag\"></a><p class=\"caption\">The EURUSD daily Forex chart had a small bull day yesterday after a strong breakout below a trading range. There will probably be at least a small 2nd leg down this week. If today’s low stays above yesterday’s, today will be a Low 1 bear flag sell signal bar.<p><br>The EURUSD daily Forex chart broke far enough below the 3 month trading range to make lower prices likely. A trading range late in a bear trend is usually the Final Bear Flag. Therefore, this breakout will probably reverse back up into the range after it runs its course. There is a 50% chance of a measured move down to around 1.12 over the next 2 months.<p>Yesterday was a bull bar and a pause in the bear breakout. If today’s low stays above yesterday’s low, today will be a Low 1 bear flag. The odds favor at least a small 2nd leg down. But, the price is far below the the EMA. Consequently, many bears will only scalp here. Traders will be ready for the break below today’s low to reverse up within a couple of days. That might form a micro double bottom with yesterday’s low.<h4>Might get breakout test of 1.15</h4><p>While the bulls want a failed breakout and a reversal up, the best they probably will get is a bigger bear flag. The rally might test the 1.15 bottom of the trading range and the EMA before the bears begin a 2nd leg down.<p>Since the past 2 days have been sideways, there is an increased chance of more sideways trading today. Furthermore, there will probably be a test the 1.15 within a couple of weeks. Therefore, bulls will buy a reversal up to that level.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart has been in a 50 pip range for 2 days. This is a bear flag on the 60 minute chart. But, the 2 day selloff was extreme and therefore climactic. Consequently, traders know that there is a 40% chance of a 100 pip rally within a week. They therefore will look for a rally that could last a couple of weeks.<p>Since the bears expect at least 1 – 2 days of follow-through selling after this 2 day pause, the bulls will watch to see if that selling is weak and brief. If they sense that the bears are only scalping, the bulls will look to buy for a 100 reversal up over the next week or two.<p>The bears know that there is a 60% chance of at least one more day down this week. But, because the daily chart is so far below the EMA, they will be quick to take profits. They want to sell closer to the average price.<p>With both bulls and bears expecting limited selling and a 100 pip rally soon, day traders will be willing to buy and sell. If reversals are strong, they will swing trade for 30+ pips. But, because the odds are that the sell climax on the daily chart will lead to a trading range for a couple of weeks, most day traders will be scalping.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-inside-day-and-possible-island-bottom-after-island-top.png\"><img loading=\"lazy\" src=\"2018-8-14-2.png\" alt=\"Emini inside day and possible island bottom after island top\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>The bulls got a reversal up from last week’s low, but the rally stalled just below yesterday’s high. Today therefore was an inside day after an outside day. It is both a buy and sell signal bar for tomorrow. After 3 sideways days, the Emini is in breakout mode. The odds still favor another week or two sideways to down. However, they also favor a new all-time high within a couple of months. If tomorrow gaps up to form a 3 day island bottom, then the week may go outside up. This would make a new high likely within weeks.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-8-14"
    }
  ],
  "15": [
    {
      "data": [
        "<article class=\"post-80643 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini ioi breakout mode pattern after island topIntraday market update: Wednesday August 15, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini ioi breakout mode pattern after island top<br>Intraday market update: Wednesday August 15, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-08-15T06:20:23-07:00\">August 15, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini ioi breakout mode pattern after island top</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Yesterday was the 3rd sideways day after last week’s reversal down. The bulls want the bull trend to resume up from a higher low. A gap up today would create a 3 day island bottom. That would probably mark the end of the pullback.<p>However, the bears triggered a weekly sell signal yesterday. Furthermore, the daily chart is overbought. In addition, the bears have a double top with the January high. But, the bull channel over since early July is tight and the weekly sell signal bar is weak. While the odds favor another 2 – 3 weeks of pulling back, they also favor a new all-time high within a couple of months. There is still a 30% chance of a 20% correction before a big breakout above the old high.<p>The Emini is deciding how big this pullback will be. At a minimum, the bears want a test of the August 2 buy climax low. Even if they get that, the odds still favor at least one more attempt at a new all-time high.<h4>ioi Breakout Mode</h4><p>Since yesterday was an inside day after an outside day, it formed an ioi pattern. Because yesterday was an outside bar, the day before was inside of yesterday. Hence, this is inside-outside-inside, or ioi. This is a breakout mode setup.<p>Because yesterday was a bull bar and the pattern is in a bull trend, it is an ioi bull flag. But, the location in the middle of the August range is bad for breakout traders. The odds favor lower prices. However, a gap up above the ioi this week would probably end the pullback. This is unlikely, but it would make a new high likely within a few weeks.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 15 points in the Globex market. It will therefore gap down on the 5 minute chart. If it trades below yesterday’s low, it would trigger another sell signal on the daily chart, based on the ioi.<p>A big gap down increases the chance of a trend day up or down. The bulls hope for a micro double bottom with Monday’s low on the daily chart. A bear trend day would be more likely. The next target for the bears is the August 2nd low, which is the bottom of the most recent buy climax on the daily chart.<p>When there is a big gap down, there is only a 20% chance of a strong trend from the open. Eighty percent of the time, the Emini enters a trading range for about an hour until it gets closer to the EMA. At that point, the bulls look for a double bottom or wedge bottom and the bears want a double top or wedge bear flag. Then, a swing is likely for at least a couple of hours.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-inside-day-and-possible-island-bottom-after-island-top.png\"><img src=\"2018-8-15.png\" alt=\"Emini inside day and possible island bottom after island top\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex parabolic wedge sell climax but room to 1.12 measured move target</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/EURUSD-Forex-parabolic-wedge-sell-climax-but-room-to-1.12-measured-move-target.png\"><img loading=\"lazy\" src=\"2018-8-15-1.png\" alt=\"EURUSD Forex parabolic wedge sell climax but room to 1.12 measured move target\"></a><p class=\"caption\">The EURUSD daily Forex chart fell again over the past 2 days. Since this is the 3rd leg down from over the past 8 days and it is in a tight bear channel, it is a parabolic wedge sell climax. There is room to the 1.12 measured move target, so a reversal up will probably form a bear flag.<p><br>So far, the EURUSD daily Forex chart has a bear trend day again today. This 2 day selloff after the bull day is a 3rd leg down in a tight bear channel. The selloff is therefore a parabolic wedge sell climax. There is no reversal yet and there is room to the 1.12 measured move target below. Consequently, there could be 1 -2 more small legs down before a reversal attempt.<p>If the bulls get a reversal from here, it could last 2 weeks and test the June 21 low at the bottom of the 3 month trading range. That Breakout Test would also be around the 20 day EMA. However, that rally would probably be a bear flag. The odds still favor a test of 1.12, which is a 300 pip measured move based on the height of the 3 month trading range.<h3>Overnight EURUSD Forex trading</h3><p><br>Since there is a parabolic wedge sell climax on the daily chart, the bulls will probably get at least a 100 pip bounce over the next few days. Day traders will therefore look for a swing up. However, there might be a day or two of sideways trading 1st.<p>Since the selloff has been climactic, the bears will probably soon switch to scalping until there is a rally back up to resistance. The 1st target is Monday’s high, since Monday was a bull bar on the daily chart.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-conscutive-sell-climaxes-led-to-bull-trend-reversal.png\"><img loading=\"lazy\" src=\"2018-8-15-2.png\" alt=\"Emini conscutive sell climaxes led to bull trend reversal\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>The Emini had a big gap down and then a Bear Trend From The Open. After a parabolic wedge sell climax, it rallied and closed above the midpoint. It is therefore a buy signal bar for tomorrow. If tomorrow gaps up and rallies, or just rallies strongly, the pullback on the daily chart will probably have ended. Without that, the odds still favor a test of the August 2 buy climax low.<p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-8-15"
    }
  ],
  "16": [
    {
      "data": [
        "<article class=\"post-80645 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini failed bear breakout below ioi pattern in bull channel Intraday market update: Thursday August 16, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini failed bear breakout below ioi pattern in bull channel<br>Intraday market update: Thursday August 16, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-08-16T06:20:21-07:00\">August 16, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini failed bear breakout below ioi pattern in bull channel</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Yesterday gapped down and sold off early, but reversed up from the March high. That is the top of the 7 month trading range. Yesterday was therefore a reversal day and it is now a buy signal bar for today. However, it has a bear body and the August 2 buy climax low is a magnet below. The correction still might test a little lower.<p>With yesterday’s reversal, the Emini might have completed its pullback from the August high. If today gaps up or rallies strongly above yesterday’s high, then the bull trend on the daily chart is likely resuming. Without that, the odds still favor a test of the August 2 low below 2800 within a few days before this pullback ends.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 13 points in the Globex market. It will therefore gap above yesterday’s high. This will create a 1 day island bottom. Since yesterday was a Breakout Test of the March high in a bull trend, it might be the end of the pullback. Therefore, there is an increased chance of a big bull trend day today. In addition, if the bull trend is resuming, there might be several consecutive bull trend days.<p>Last week was a small, weak sell signal bar on the weekly chart in a bull trend. This week triggered the sell signal by trading below last week’s low. If the bulls get a strong rally today, last week’s high will be a magnet by tomorrow’s close. The bulls might be able to create a rally to above that high. That would turn this week into an outside up week, which would be a sign of buying pressure.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-conscutive-sell-climaxes-led-to-bull-trend-reversal.png\"><img src=\"2018-8-16.png\" alt=\"Emini conscutive sell climaxes led to bull trend reversal\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex parabolic wedge sell climax and minor trend reversal</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/EURUSD-Forex-parabolic-wedge-sell-climax-and-minor-trend-reversal.png\"><img loading=\"lazy\" src=\"2018-8-16-1.png\" alt=\"EURUSD Forex parabolic wedge sell climax and minor trend reversal\"></a><p class=\"caption\">The EURUSD daily Forex chart reversed up yesterday after a parabolic wedge sell climax. Since yesterday was a doji, it is a weak buy signal bar after a strong bear breakout. Today so far is a small reversal bar for the bulls. This is probably going to be a minor reversal.<p><br>The EURUSD daily Forex market fell over the past 3 weeks in a parabolic wedge sell climax to far below its 20 day EMA. The bears are taking some windfall profits and will look to sell closer to the average price.<p>The 3 month trading range was late in a bear trend. It therefore will probably be the Final Bear Flag. This means that the breakout will likely reverse up for several months back into that trading range. However, there is no clear bottom yet.<p>Yesterday was a doji, which is a weak buy signal bar. In addition, the momentum down is strong. Finally, there is room to the 1.12 measured move target below. Therefore, any rally over the next 2 weeks will more likely be a test of the breakout point at 1.15 and the EMA than a major reversal. The odds favor lower prices.<p>The bear trend could resume tomorrow because today might form a small double top bear flag with Monday’s high. More likely, the daily chart will continue the 4 day trading range for at least several more days. It probably will soon rally 150 – 200 pips up to resistance before resuming down.<h4>Weekly chart forming minor reversal</h4><p>The weekly chart is forming a minor reversal. However, after 3 big bear bars, the odds favor at least one more small leg down to the measured move target. Therefore, if there is a reversal up next week, it will probably only last 1 – 3 weeks. The bulls need several consecutive strong trend bars on the weekly chart to reverse the selloff. That is unlikely without at least a micro double bottom.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart rallied 100 pips above yesterday’s low. The top of the most recent sell climax is Monday’s high, which is just below 1.1450. That is the magnet above. Since the daily chart fell in a parabolic wedge, the odds favor at least 2 legs up on the 5 minute chart. Therefore, day traders will look to buy a 50% selloff from the 2 day rally.<p>The bears know that the 4 week tight bear channel on the daily chart is unlikely to reverse into a bull trend without at least a small double bottom. They therefore will bet that this 2 day rally is a minor reversal. Since they expect a test down, they will sell rallies to resistance. Consequently, they will look to sell a 2nd leg up to around 1.1450 over the next couple of days.<p>Because a sell climax usually leads to a trading range, the bears will be quicker to take profits. For day traders, that means swing trades up and down will be 30 – 50 pips.<p>Since the chart is probably going to go sideways for several days, there will be lots of scalping opportunities up and down.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-island-bottom-and-bear-trend-reversal.png\"><img loading=\"lazy\" src=\"2018-8-16-2.png\" alt=\"Emini island bottom and bear trend reversal\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>The Emini gapped up and rallied in a Small Pullback Bull Trend. But, it was unable to close the gap below Thursday’s low and reversed down in the middle of the day. The reversal down was big enough to create confusion. That increases the chance of a trading range tomorrow.<p>Tomorrow is Friday and the closest weekly magnet is the open of the week. This week so far is a doji. Less likely, the bulls will rally 20 points to get above last week’s high and create an outside week.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-8-16"
    }
  ],
  "17": [
    {
      "data": [
        "<article class=\"post-80647 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini unlikely to create outside up candlestick on weekly chartIntraday market update: Friday August 17, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini unlikely to create outside up candlestick on weekly chart<br>Intraday market update: Friday August 17, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-08-17T06:20:35-07:00\">August 17, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini unlikely to create outside up candlestick on weekly chart</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini gapped up yesterday and created a 1 day island bottom. While yesterday was a bull trend day, it closed below its high. But, the momentum up good enough to make traders believe that the 6 day pullback has ended. However, the bulls need to get above the August high.<p>Today is the last day of the week. If it is a big bull trend day, it could get above last week’s high. This week would then be an outside up bar on the weekly chart. While unlikely, that would be a sign of strong bulls and increase the odds of a new all-time high soon.<p>The other weekly magnet is the open of the week. If the bears can get a close below the open, the week would have a bear body. That would make it a weaker buy signal bar for next week.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 7 points in the Globex market. If it gaps below yesterday’s low, yesterday will be a 1 day island top. Wednesday was a 1 day island bottom, and last week’s gap down created a 3 day island top. This confirms the point that I often make that islands tops and bottoms are usually not major reversal patterns.<p>Today is Friday so weekly support and resistance are important. If the Emini is within about 5 points of a weekly magnet in the final hour today, it might get drawn to that magnet.<p>The bulls want the week to be a bull reversal bar on the weekly chart. They therefore will try to make today close above the 2837.00 open of the week. They would prefer the week to close on its high.<p>The bears always want the opposite and therefore want the week to close below its open. Furthermore, last week was a sell signal bar on the weekly chart. The sell triggered this week. The bears want this week to close below last week’s 2826.00 low. That would increase the chance of another week or two of sideways to down trading. If the bears get that, they will hope for the start of a swing down on the weekly chart.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-island-bottom-and-bear-trend-reversal.png\"><img src=\"2018-8-17.png\" alt=\"Emini island bottom and bear trend reversal\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex small bear flag after parabolic wedge sell climax</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/EURUSD-Forex-small-bear-flag-after-parabolic-wedge-sell-climax.png\"><img loading=\"lazy\" src=\"2018-8-17-1.png\" alt=\"EURUSD Forex small bear flag after parabolic wedge sell climax\"></a><p class=\"caption\">The EURUSD daily Forex chart has rallied for 3 days after a parabolic wedge sell climax. The bears have a small double top bear flag, but the bear flag might continue up to the June low and the EMA before the bears sell again. This is probably a minor reversal up.<p><br>The EURUSD daily Forex chart broke far below a 3 month trading range in a bear trend. The bulls want that trading range to be the Final Bear Flag. They are trying to create a trend reversal up.<p>However, the buy signal bar from 2 days ago was small and weak. In addition, the rally so far is also weak. Also, the momentum down has been strong and there is a measured move target at 1.12. This reversal therefore more likely will be a bear flag. Traders are deciding on the size of the bear flag.<p>It might end today or Monday and be a double top with the bull bar of 5 days ago. Alternatively, the bear rally could continue up for a week or two and reach the June low. That is the bottom of the 3 month bear flag. It is also at the 1.15 Big Round Number and the 20 day EMA.<p>In either case, the odds still favor a test of the 1.12 measured move target and a stronger bottom. Therefore, traders will sell this rally. In addition, the bulls will only scalp on the daily chart until there is a credible trend reversal up.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart has been in a 40 pip range overnight. It reversed down from a test of the high from 5 days ago. Since it has been in a trading range for 5 days, the odds favor more trading range trading today.<p>The most important price today is 1.1374. That is the open of the week. Today is Friday, and today’s close determines the appearance of the weekly chart. If today closes above this week’s open, the candlestick on the weekly chart will be a bull trend reversal bar. The bull body would increase the chance of higher prices next week. This is especially true if today closes at the high of the week.<p>The bears want a bear body on the weekly chart. They therefore will sell rallies and try to get the week to close below its open.<p>Since the weekly chart has 3 big bear bars, a small bull reversal bar this week is not too important. It would still probably only lead to a minor reversal up and lead to a bigger bear flag. After such a strong bear breakout on the weekly chart, the bulls will probably need a micro double bottom before they can create a bull trend. That would require another small leg down, which means at least a couple more weeks of selling after this bounce.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-wedge-bull-channel.png\"><img loading=\"lazy\" src=\"2018-8-17-2.png\" alt=\"Emini wedge bull channel\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>The Emini sold off on the open and reversed up from the 60 minute EMA, the open of the week, and the gap below yesterday’s low. After a higher low major trend reversal, it broke above yesterday’s high. Furthermore, it closed last week’s gap down. These all make higher prices likely.<p>Finally, the week closed near its high. Therefore, the candlestick on the weekly chart is a High 1 bull flag for next week. Next week will probably trade above this week’s high and trigger the buy signal. The rally might even make a new all-time high.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-8-17"
    }
  ],
  "18": [
    {
      "data": [
        "<article class=\"post-80651 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini High 1 bull flag so imminent all time high Emini weekend update: August 18, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini High 1 bull flag so imminent all time high<br>Emini weekend update: August 18, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-08-18T00:30:27-07:00\">August 18, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>5th month in weak rally</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-monthly-candlestick-chart-testing-January-high-for-possible-double-top.png\"><img loading=\"lazy\" src=\"2018-8-18.png\" alt=\"Emini monthly candlestick chart testing January high for possible double top\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has a small bar so far in August. The Emini is deciding between a double top and a breakout above the January high.<p>The monthly S&amp;P500 Emini futures candlestick chart has rallied 5 months after February’s strong selloff. The rally has lacked consecutive big bull trend bars. It therefore is unlikely to continue up for many more months. However, there are measured move targets on the weekly chart above 3,000. That is therefore a reasonable location for the start of a swing sideways to down.<p>The monthly chart is almost to the January high and the 5 month rally is not particularly strong. Therefore, there is a 50% chance of a reversal down to the middle of the 8 month trading range before a new high. Whether or not that happens, the odds still favor a new all-time high and a test to between 3,000 and 3,200 before there is a leg down on the monthly chart.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Emini High 1 bull flag so imminent all time high</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-weekly-candlestick-chart-has-high-1-bull-flag.png\"><img loading=\"lazy\" src=\"2018-8-18-1.png\" alt=\"Emini weekly candlestick chart has high 1 bull flag\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart has rallied strongly from the April low. It is now testing the January high. This week is a High 1 buy signal bar for next week. Less likely, the bears will get a double top with the January high and a reversal down<p>The weekly S&amp;P500 Emini futures candlestick chart is testing the January high. Last year’s rally was strong enough to be a Buy The Close (BTC) Bull Trend. Therefore, there are theoretically bulls who bought the January close. They were confident that either the rally would continue and they would make a profit, or the chart would enter a trading range and then rally back to their entry price.<p>These BTC bulls were disappointed by February. They therefore concluded that the weekly chart had evolved into a trading range. A bull trend usually does not become a bear trend without first transitioning into a trading range. These bulls therefore were confident that they could scale in lower and expect an eventual rally back up to the January close at the top of the range. That would allow them to exit with a profit on their lower buys and exit breakeven on their buy at the January close.<p>The current rally did not quite reach that January close. However, it is close enough so that it probably cannot escape the gravitational pull of that resistance. This makes it likely that the rally will continue up to a new high within a month or two. It could even come next week.<br><h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Possible bull breakout above bull channel</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-daily-candlestick-chart-has-double-bottom-bull-flag-and-head-and-shoulders-top-1.png\"><img loading=\"lazy\" src=\"2018-8-18-2.png\" alt=\"Emini daily candlestick chart has double bottom bull flag and head and shoulders top\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart is rallying from a double bottom bull flag. The odds favor a new all-time high within 1 – 3 weeks. But, there is a 30% chance of a lower high major trend reversal over the next week. That would also be a head and shoulders top.<p>The daily S&amp;P500 Emini futures candlestick chart has been in a bull channel for 5 months. It reversed up this week from a higher low double bottom with the August 2 low. While the bears want a lower high and a head and shoulders top next week, the odds favor a new all time high within a few weeks. It might even come next week.<p>Traders will not believe that the bears have taken control until there is a series of big bear days and a break below the bull channel. Then, traders would need to see lower highs. This process would take weeks. Therefore, the downside risk over the next week is small.<h4>Possible bull breakout above bull channel</h4><p>It is important to note that a bull channel typically has a bear breakout and then the chart evolves into trading range. There is usually 1st a bull breakout above that fails within about 5 bars. That is then an exhaustive buy climax and the end of the bull trend.<p>However, 25% of the time, there is a successful bull breakout above the bull channel. When this happens, the market cycle starts over again. The breakout is a measuring gap instead of an exhaustive buy climax. As the breakout weakens, it evolves into a bull channel. That channel has a 75% chance of an eventual bear breakout, which then evolves into a trading range.<p>If the bulls get a strong breakout above this channel, it would also be a breakout above the 8 month trading range. A strong trading range breakout usually continues for a measured move up.<p>The bull channel from the April low is almost to the January high. The Emini could therefore simultaneously break above both the channel and the trading range. The result could be an explosive 300 point rally that races up to the measured move targets at 3,100 or 3,200.<p>An extreme example of a successful bull breakout above a bull channel happened in 1995 on the S&amp;P cash index monthly chart. The S&amp;P more than tripled its value over the next 5 years.<p>The Emini is not going to do that this time because the 2017 buy climax was so extreme. Furthermore, this is a much smaller pattern because it is on the daily chart. More likely, the rally will reach the 3,200 area and then pull back into this year’s trading range. That range will probably be the Final Bull Flag. Then, the Emini will probably enter a trading range for at least a year.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-8-18"
    }
  ],
  "20": [
    {
      "data": [
        "<article class=\"post-80649 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini weekly High 1 bull flag below all time highIntraday market update: Monday August 20, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weekly High 1 bull flag below all time high<br>Intraday market update: Monday August 20, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-08-20T06:20:33-07:00\">August 20, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini weekly High 1 bull flag below all time high</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Last week closed near its high. Therefore, the candlestick on the weekly chart is a High 1 buy signal bar for this week. If this week trades above last week’s high, it will trigger the buy signal. The odds continue to favor a new all time high within a month or so. It might even come this week. However, the past 5 bars on the weekly chart have had small bodies, prominent tails, and several reversals. This is not yet a strong attempt at a new high.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 3 points in the Globex session. It might gap above Friday’s high. If so, the gap will be small and it will probably close in the 1st hour.<p>Last week was a 1 week pullback in a Small Pullback Bull Trend. In addition, it was a bull candlestick bar that closed on its high. It is therefore a High 1 bull flag and a buy signal bar for this week. Since today will open near last week’s high, today will probably trigger the weekly buy signal by going above last week’s high.<p>However, the daily chart has had lots of bars with tails on top over the past 2 weeks. This hesitation reduces the chances of a strong bull entry bar on the weekly chart this week. Furthermore, the 3 day rally is forming a wedge bull channel on the 60 minute chart. This increases the chance of the rally stalling near the high of 2 weeks ago. That high is the top of a 4 week trading range.<p>Because the daily chart is close to the January all-time high, there is an increased chance of a strong breakout to a new high this week. Therefore, traders will be ready for a one or more big bull trend days. But, whenever a market is at resistance, there is also an increased chance of a reversal down and a big bear trend day. Since the past 5 days have had relatively big ranges, the odds are that today will also have at least one 10 point swing up or down.<h2>Friday’s setups</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-wedge-bull-channel.png\"><img src=\"2018-8-20.png\" alt=\"Emini wedge bull channel\"></a><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD daily Forex breakout test after Final Bear Flag</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/EURUSD-daily-Forex-breakout-test-after-Final-Bear-Flag.png\"><img loading=\"lazy\" src=\"2018-8-20-1.png\" alt=\"EURUSD daily Forex breakout test after Final Bear Flag\"></a><p class=\"caption\">The EURUSD daily Forex chart has rallied for 4 days after breaking below a 3 month trading range in a bear trend. This is probably a breakout test of the June 21 low. It is strong enough for 2 legs sideways to up over the next week or two.<p>The EURUSD daily Forex chart had a big bull day on Friday. Today is the 4th day in an attempted bull trend reversal. However, the 3 week breakout was very strong. In addition, there is a measured move target below at around 1.12. Therefore, this rally is probably a minor reversal. The bears will sell at resistance near the 1.15 trading range bottom and the 20 day EMA.<p>The odds are that the rally will fail after about 2 weeks of sideways to up trading. The bears will begin to sell above prior day highs, betting that the bulls will use those highs to take profits. But, the bulls will buy below the prior day’s low because they are confident that the rally will have at least 2 legs and reach the magnets above. With traders buying dips and selling rallies, this 4 day rally will turn into a trading range or a bear flag.<h4>EURUSD weekly buy signal bar</h4><p>Last week was a strong bull reversal bar on the weekly chart. It is therefore a buy signal bar for this week. But a bull candlestick pattern is not enough. Traders always have to look at context, which means the bars to the left. Since it is following 3 strong bear bars and there is a measured move target below, there is only a 30% chance that last week is the start of a bull trend. The bulls usually need at least a small double bottom on the daily chart. That would require a test of last week’s low. Alternatively, if they can create a series of bull trend bars and get closes above 1.15, traders will begin to believe that the bear trend has reversed up.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart traded down 50 pip overnight after going 2 pips above Friday’s high. This is trading range price action. Since at least 2 legs sideways to up are likely over the next 1 – 2 weeks, traders will look for reversals after every 50 – 100 pip move.<p>The bars overnight were small, and they had lots of overlap and prominent tails. This usually leads to a quiet day. Day traders therefore will probably scalp for 10 – 20 pips today. In addition, they will use limit orders above and below the prior day’s range betting on reversals.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-weak-bull-trend-reversal-day.png\"><img loading=\"lazy\" src=\"2018-8-20-2.png\" alt=\"Emini weak bull trend reversal day\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>By trading above last week’s high, the Emini triggered a buy signal on the weekly chart. Even though today was a bull reversal day, it was mostly a trading range day. It spent 4 hours in a 3 point range. The open of the day is always a magnet during a trading range day, and today closed near the open.<p>The bulls need to break above the top of the 4 week trading range before they can make a new all-time high. That top was 2 weeks ago.<p>The bears will try to create a double top with that high. However, they need a strong reversal down this week to convince traders that they will be able to trade down to the neck line of the 2 week double top. That is last week’s low. More likely, legs up and down will continue to reverse every few days.<p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\" rel=\"noopener\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noopener\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-8-20"
    }
  ],
  "21": [
    {
      "data": [
        "<article class=\"post-80814 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini 60 minute wedge rally testing all-time high Intraday market update: Tuesday August 21, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini 60 minute wedge rally testing all-time high<br>Intraday market update: Tuesday August 21, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-08-21T06:20:35-07:00\">August 21, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini 60 minute wedge rally testing all-time high</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Yesterday was a weak bull reversal day, but it spent most of its time in a tight trading range. By going above last week’s high yesterday, the Emini triggered a buy signal on the weekly chart. The bulls hope to get a new all-time high this week. However, they 1st have to break above the high from 2 weeks ago, which is the top of a 4 week trading range.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 4 points in the Globex market. It therefore might gap above yesterday’s high and the 4 week trading range. Because the momentum up is good on the daily and weekly charts, the bulls expect a new all-time high within weeks. The target is close enough for the bulls to reach it this week. Therefore, there is an increased chance of a big bull trend day this week.<p>Whenever the Emini is testing resistance, there is also an increased chance of a reversal down. Therefore, despite yesterday being in a tight trading range, there is an increased chance of a surprisingly big bear day as well. However, yesterday’s tight trading range increases the odds of more trading range trading. This is true even though a big bull or bear trend day will probably come within the next few days.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-weak-bull-trend-reversal-day.png\"><img src=\"2018-8-21.png\" alt=\"Emini weak bull trend reversal day\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex bear rally and trading range more likely than bull trend</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/EURUSD-Forex-bear-rally-and-trading-range-more-likely-than-bull-trend.png\"><img loading=\"lazy\" src=\"2018-8-21-1.png\" alt=\"EURUSD Forex bear rally and trading range more likely than bull trend\"></a><p class=\"caption\">The EURUSD daily Forex chart has reversed up strongly for 5 days. It is testing the 20 day EMA and the breakout point at the bottom of the 3 month trading range.<p><br>The EURUSD daily Forex chart reversed up strongly for 5 days after a strong 3 week selloff. Big Down, Big Up means Big Confusion. Confusion is one of the hallmarks of a trading range. Therefore, the daily chart will probably be sideways for at least a couple of weeks. The bears will try to create a double top bear flag. They then want a test of the 1.12 measured move target. However, the bulls want a double bottom with last week’s low and then the start of a bull trend.<p>I have been writing for months that the weekly chart is still bullish. Therefore, even if the bears reach their goal of 1.12, there will then be a reversal back up. The 3 month trading range is probably the Final Bear Flag in the 8 month swing down. When a market reverses up from a Final Bear Flag, the 1st target is always the top of the Final Flag. Here, that is 1.18, but the bulls might need several months to get there.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart has been sideways overnight after a buy climax up to resistance on the daily chart. Because the 5 day rally has been extreme and it has reached resistance, the odds favor sideways to down for several days. Therefore, day traders will mostly scalp.<p>Since the rally has been strong, swing traders will begin to look to day trade for a swing up once there is a 50% pullback to around 1.14. The bear day traders will be quicker to take profits for a couple of days until there is more of a trading range. At that point, they will look for 30 – 50 pip swings down from new highs on the 5 minute chart.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-bear-trend-reversal-day-after-failed-trending-trading-range-day.png\"><img loading=\"lazy\" src=\"2018-8-21-2.png\" alt=\"Emini bear trend reversal day after failed trending trading range day\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>Today began as a Bull Trending Trading Range day. However, the Emini reversed down in the middle of the day after the cash index made a slight new all-time high. Because it reversed down and closed on its low, today is a sell signal bar on the daily chart for tomorrow. In addition, the 3 legs up over the past 3 weeks created a wedge top. If tomorrow gaps down, today would be a 1 day island top. The bears need big bear days over the next few days to convince traders that they have taken control.<p>But, the Emini all-time high is still a magnet just above. In addition, the past 3 days had bull bodies. Therefore, while today is a sell signal bar for tomorrow, the reversal will probably be minor. That means a few days of sideways to down trading. The odds favor a new all-time high in the Emini within the next couple weeks. It still might come this week.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-8-21"
    }
  ],
  "22": [
    {
      "data": [
        "<article class=\"post-80816 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini wedge top bear trend reversal at January all time high Intraday market update: Wednesday August 22, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini wedge top bear trend reversal at January all time high<br>Intraday market update: Wednesday August 22, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-08-22T06:20:35-07:00\">August 22, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini wedge top bear trend reversal at January all time high</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The cash index reversed down from a small breakout above the January all-time high. The reversal created a sell signal bar on the Emini daily chart. Furthermore, there is a wedge rally over the past 3 weeks. In addition, yesterday closed near its low. Finally, if today gaps down, yesterday will be a 1 day island top.<p>While these factors are good for the bears, the 5 day rally is in a micro channel. Also, the 5 month bull channel is tight and therefore strong. And, the all-time high in the Emini is still a magnet above. While the bears have a good setup coming into today, a minor reversal is more likely than a bear trend on the daily chart.<p>But, if the bears get a series of big bear days over the next week, traders will conclude that the bears might get a swing down for a month or more. I want to continue to remind traders that there is still a 30% chance of a break below the February low and a measured move down to 2200 before there is a break far above the January high.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 8 points in the Globex session. Today will therefore probably gap down. That would create a 1 day island top. Since the 5 day bull channel is tight and the weekly chart is also in a tight bull channel, the reversal will probably be minor.<p>However, there is a 3 week wedge top on the daily chart and that top is at the January high. Therefore, there is an increased chance of a big bear trend day today. In addition, the selloff might continue down for a few days and have at least 2 legs on the 60 minute chart.<p>Yesterday’s selloff was climactic. There is a 50% chance of follow-through selling in the 1st 2 hours, but only a 25% chance of a strong bear trend day. If there is a series of big bear bars on the open, that probability will go up.<p>Also, after a sell climax, there is a 75% chance of at least 2 hours of sideways to up trading beginning by the end of the 2nd hour. However, the bears will sell rallies today since a 2nd leg down is likely after yesterday’s strong reversal down.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-bear-trend-reversal-day-after-failed-trending-trading-range-day.png\"><img src=\"2018-8-22.png\" alt=\"Emini bear trend reversal day after failed trending trading range day\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex bull trend reversal after Final Bear Flag</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/EURUSD-Forex-bull-trend-reversal-after-Final-Bear-Flag.png\"><img loading=\"lazy\" src=\"2018-8-22-1.png\" alt=\"EURUSD Forex bull trend reversal after Final Bear Flag\"></a><p class=\"caption\">The 6 day rally has 5 bull bars with very little overlap. In addition, it has completely reversed the August 8 sell climax. The bear trend has ended so the odds favor sideways to up for at least a month.<p><br>The 6 day reversal up from a sell climax is strong. The bears have lost control. Since the rally totally reversed the final sell climax, there is now a Big Down, Big Up pattern. The result is usually at least a few days of sideways trading. However, I have been writing for several months that the weekly chart is in a bull trend and that the bear trend on the daily chart would reverse back up. This reversal is strong enough to make a resumption of the weekly bull trend likely.<p>Since the rally is now back in the 3 month trading range, it might get stuck here for a while. For 4 months, traders concluded that a range between 1.15 and 1.18 was a fair price. They will probably have that same opinion for at least a month. Less likely, the rally will continue far above 1.18 before pulling back, or reverse back below 1.12.<p>Since the daily chart will probably trade sideways to up for at least a month, the bulls will buy pullbacks. There have been no pullbacks in the strong 6 day reversal. Therefore, the bulls will buy at the prior day’s low.<p>For the bears on the daily chart, they will need at least a micro double top before there is a 2 – 5 day leg down. However, they now believe that the 1st selloff will form a higher low. Therefore, they will only hold onto their 1st short for 1 – 3 days.<h3>Overnight EURUSD Forex trading</h3><p><br>The rally on the EURUSD 120 minute Forex chart is in a tight bull channel. In addition, it is in its 3rd leg up. This is a parabolic wedge. Furthermore, it is testing the August 8 sell climax high. Consequently, the odds favor a 100 pip pullback for at least a day or two starting today or tomorrow.<p>The 5 minute chart rallied strongly overnight. However, it, too, is in a wedge. Therefore, there is a nested wedge. This makes the rally likely to pause starting today or tomorrow. The bulls will buy pullbacks, especially down to 1.15 and 1.1550. However, the bears will begin to sell today, expecting at least a 50 – 100 pip pullback starting soon.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-trading-range-day-after-yesterdays-sell-climax.png\"><img loading=\"lazy\" src=\"2018-8-22-2.png\" alt=\"Emini trading range day after yesterday's sell climax\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>The Emini reversed up after yesterday’s sell climax. However, the rally evolved into a trading range. While today is a High 1 buy signal bar on the daily chart for tomorrow, yesterday’s selling on the 5 minute chart make more sideways trading more likely than a bull trend tomorrow.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-8-22"
    }
  ],
  "23": [
    {
      "data": [
        "<article class=\"post-80818 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini already priced in Cohen and Manafort Intraday market update: Thursday August 23, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini already priced in Cohen and Manafort<br>Intraday market update: Thursday August 23, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-08-23T06:20:26-07:00\">August 23, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini already priced in Cohen and Manafort</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini reversed up yesterday after Tuesday’s sell climax. It is a buy signal bar on the daily chart for today. However, the selling on the 60 minute chart was strong enough to make a 2nd leg sideways to down likely. Therefore, there are conflicting signals. That usually results in a trading range.<p>The bull channel on the weekly chart is tight. Consequently, the bulls are still in control and the odds continue to favor higher prices after every reversal attempt.<p>The market already priced in the news on Cohen and Manafort. Was anyone really surprised by the news? If the Emini reverses down for the next couple of months, the news will be the excuse. But, the real cause will traders again selling where they sold in January. For whatever reason, the computers thought that was a good place to sell in January, and they might still hold that belief. More likely, the Emini will continue up to 3,000 – 3,200.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is unchanged in the Globex market. Since Tuesday’s selloff was strong, the Emini might go sideways to down for another day or two. “Might” means a lack of conviction, and that usually results in mostly sideways trading, which is what we have seen for 3 days.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-trading-range-day-after-yesterdays-sell-climax.png\"><img src=\"2018-8-23.png\" alt=\"Emini trading range day after yesterday's sell climax\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex 1st pullback after bull trend reversal</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/EURUSD-Forex-1st-pullback-after-bull-trend-reversal.png\"><img loading=\"lazy\" src=\"2018-8-23-1.png\" alt=\"EURUSD Forex 1st pullback after bull trend reversal\"></a><p class=\"caption\">By trading below yesterday’s low, the EURUSD daily Forex chart had its 1st pullback after a bull trend reversal.<p><br>The EURUSD daily Forex chart reversed up strongly enough over the past 2 weeks to create a credible bull trend reversal. The odds therefore are for sideways to up trading for at least a month. When a market reverses up after a triangle breakout, the 1st target is the apex of the triangle. That is around 1.17. The next target is the top of the triangle, which is 1.18.<p>A pullback following a reversal is a cup and handle buy setup. While the bull flag can be a single day, like today, it will more likely last at least several days to a couple of weeks. Therefore, if the rally resumes tomorrow, today will not be the handle. The bulls will look for a 5 – 10 bar bull flag over the next several weeks. Then, the expect a rally to at least 1.18.<p>The bears always have a case, but their probability is now much less for at least a month. They hope that this is just a sharp, brief bear rally. They need at least a micro double top over the next few days. Then, they want an endless pullback from this rally and a move down to the 1.12 measured move target.<p>There is only a 30% chance that they will succeed. However, if they can stop the rally and create a trading range for a month or more, their probability will go up.<h3>Overnight EURUSD Forex trading</h3><p><br>I said yesterday that the bulls would buy the prior day’s low. Last night dipped below yesterday’s low and rallied 40 pips. Day traders will continue to buy below prior days’ lows and below intraday lows, betting on more sideways to up trading for at least several days.<p>Because the 5 minute chart is now getting pullbacks, the bears will begin to scalp. But, since the daily chart is now in a strong bull reversal, the odds favor higher prices for at least several weeks. Therefore, it will be easier to make money as a buyer.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-cup-and-handle-bear-flag-and-outside-down-day.png\"><img loading=\"lazy\" src=\"2018-8-23-2.png\" alt=\"Emini cup and handle bear flag and outside down day\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>The Emini reversed down from above yesterday’s high to below its low. This created an outside down day. While the location on the daily chart is good for the bears, the weekly chart is still in a tight bull channel. Therefore, a reversal down from a double top with the January high will probably create a bull flag, not a bear trend.<p>Since tomorrow is Friday, weekly support and resistance are important. The bears want the week to close on its low to create a strong sell signal bar for next week. However, unless tomorrow is a big bear day, the week’s range will be small. When that happens, it has little predictive value.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-8-23"
    }
  ],
  "24": [
    {
      "data": [
        "<article class=\"post-80820 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini double top after Cohen and China tariff news Intraday market update: Friday August 24, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini double top after Cohen and China tariff news<br>Intraday market update: Friday August 24, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-08-24T06:20:20-07:00\">August 24, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini double top after Cohen and Manafort news</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Yesterday rallied, but reversed down strongly, forming an outside down day. It is therefore a sell signal bar on the daily chart. However, it was a doji bar and the 3rd small day in a bull trend. This is a low probability sell signal. Furthermore, the bulls hope that yesterday formed a double bottom bull flag with Tuesday’s low on the 60 minute chart. That chart is now in breakout mode.<p>The market is always looking for an excuse to do what it wanted to do anyway. If the Emini sells off over the next several weeks, the news will say that Trump’s problem with Cohen and Manafort or the new China tariffs was the cause. Since the markets already all of this, the news was already factored into the current price. However, the market can use anything as an excuse, and this qualifies.<p>Today is Friday and therefore weekly support and resistance can be important. The bears want the week to close on its low. It would therefore be a sell signal bar on the weekly chart for a double top with the January high. Since the bull channel from the April low is tight, this would be a weak sell setup. But, it would slightly increase the odds of a reversal down next week.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 5 points in the Globex market. It therefore might open above yesterday’s trading range. The bulls want a measured move up and then a relentless rally to a new all-time high today. Since big trend days come only about once a week, a trading range day is always more likely. This is especially true after 3 sideways days.<p>Yesterday’s reversal down was strong and a surprise. If the bulls fail to break strongly above the 60 minute EMA, the bears will try to break below yesterday’s low and create trend resumption down. Traders will swing trade their shorts if the bears get several consecutive big bear bars breaking below yesterday’s low.<p>The daily chart has 3 dojis and the weekly chart so far this week is a small doji. This is a neutral market and the odds favor another trading range day. However, the all-time high magnet above and the wedge top at the January high increase the chance of a big trend up or down.<h2>Yesterday’s setups</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-cup-and-handle-bear-flag-and-outside-down-day.png\"><img src=\"2018-8-24.png\" alt=\"Emini cup and handle bear flag and outside down day\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex High 1 bull flag but buy climax</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/EURUSD-Forex-High-1-bull-flag-but-buy-climax.png\"><img loading=\"lazy\" src=\"2018-8-24-1.png\" alt=\"EURUSD Forex High 1 bull flag but buy climax\"></a><p class=\"caption\">The EURUSD daily chart sold off yesterday to below Wednesday’s low. As was likely after 5 strong bull days, the bulls quickly bought the pullback. Yesterday is now a High 1 bull flag buy signal bar.<p><br>I said earlier this week that the bulls will buy at the prior day’s low. The 6 day reversal up was so strong that the bulls were buying every small pullback. They therefore were likely to buy a pullback that fell below the prior day’s low. Today so far reversed most of yesterday’s selloff. Now, yesterday and today are forming a High 1 bull flag. Since the rally is so strong that it is unsustainable, it is a buy climax. Therefore, it will soon convert into a trading range. Yesterday could be the start of that range.<p>When there is an exceptionally strong rally, the odds favor at least one more small leg up. That can be as brief as a single bar. Whether that leg lasts 1 day or 1 week, the odds favor higher prices.<p>After that leg up, the daily chart will probably enter a trading range for 1 – 2 weeks. Remember, it is back in a 3 month trading range. Traders thought this 1.17 area was a fair price. They will probably think the same thing again and trade around it for at least a couple of weeks.<h4>How likely is a resumption of the bear trend?</h4><p>If the breakout above the 2 day bull flag reverses after 1 day, can the bears resume the bear trend? That is unlikely. However, they could get a sharp selloff that retraces much of the rally. But, the odds would favor a higher low. The minimum goal would be a 2nd leg up that at least a test back up to the high of this buy climax. Therefore, the downside risk over the next few weeks is small.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart rallied 70 pips overnight after yesterday’s small break below Wednesday’s low. Yesterday and today are sideways days after a strong rally. This is a 2 day bull flag. The downside risk over the next few days is small. But, since the 6 day rally was climactic, the EURUSD 5 minute chart might continue sideways for several days.<p>The odds favor higher prices, even if there is a selloff that retraces half of the 2 week rally. Therefore, the bulls will buy pullbacks. The minimum target over the next week is 1.17, which is the apex of the 2 month triangle and the middle of the 3 month trading. The odds are that the rally will continue up to the 1.1752 top of the triangle within a few weeks.<p>Because the daily chart is now in a bull trend, it will be easier for day traders to make money buying rather than selling. The shorts for at least the next couple of days will only be scalps.<p>Because the overnight rally on the 5 minute chart was a parabolic wedge and it totally reversed Wednesday’s selloff, today will probably be sideways for the rest of the day.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-gap-up-and-rally-then-tight-trading-range.png\"><img loading=\"lazy\" src=\"2018-8-24-2.png\" alt=\"Emini gap up and rally, then tight trading range\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>While the cash index went above Wednesday’s all-time high, the Emini’s rally stopped about 7 points below its January all-time high. It remained in a trading range for the rest of the day. The bulls will probably get a new all-time high within a few weeks, and maybe next week.<p>With the day and week closing on the high, the bulls might get a gap up on both the daily and weekly charts. Furthermore, a big gap up could be a gap to a new high. If the bulls then got a bull trend on Monday, the Emini would then probably work up to the measured move targets around 3100 and 3200 over the next few months.<p>The bears need several consecutive big bear days before traders will believe that a double top reversal is underway. The odds favor the bulls.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-8-24"
    }
  ],
  "25": [
    {
      "data": [
        "<article class=\"post-80824 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini possible gap up above January all-time high Emini weekend update: August 25, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini possible gap up above January all-time high<br>Emini weekend update: August 25, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-08-25T00:30:46-07:00\">August 25, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Testing the January all-time high</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-monthly-candlestick-chart-with-likely-breakout-to-new-all-time-high.png\"><img loading=\"lazy\" src=\"2018-8-25.png\" alt=\"Emini monthly candlestick chart with likely breakout to new all time high\"></a><p class=\"caption\">The August candlestick on the monthly S&amp;P500 Emini futures chart so far is a bull bar. The bears want a double top with the January high, but the odds favor a new all-time high soon.<p>The monthly S&amp;P500 Emini futures candlestick chart is resuming its bull trend from 2017. Although the cash index made a new high this week, it was only by $3. However, the momentum up in the Emini is strong. Therefore, the odds favor a new all-time high next week.<p>The 2017 bull trend is strong enough to make a bear trend reversal unlikely. Even if the Emini reverses down from a double top, the bulls will likely buy the selloff. It therefore would probably last only a month or so before the rally resumes.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Emini possible gap up above January all-time high</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-weekly-candlestick-chart-might-gap-up-to-new-all-time-high.png\"><img loading=\"lazy\" src=\"2018-8-25-1.png\" alt=\"Emini weekly candlestick chart might gap up to new all time high\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart this week got to within 6 points of the January all-time high. In addition, the week closed on its high and the 8 week bull channel lacks strong bear bars. The odds favor a new all-time high next week. The rally is strong enough so that the Emini might even gap above the January high.<p>The weekly S&amp;P500 Emini futures candlestick chart rallied strongly for 8 weeks. There were no big bear bars in the rally. That lack of selling pressure makes a trend reversal unlikely. The best the bears will probably get is a few weeks of sideways to down trading.<p>The 5 month bull trend resumption is strong enough to make a new all-time high likely next week. This week closed on its high just below the resistance of the January high. Therefore, Monday might gap up to a new all-time high next week. Whether or not it does, if next week is a big bull trend bar, the odds are that the rally will continue up over the next several months to the measured move targets around 3100 and 3250.<p>The bears need a big bear bar before traders will believe that the rally is failing. Furthermore, they need several consecutive bear bars before traders believe that the bears have begun a swing down. That would take several weeks. Consequently, the downside risk over the next few weeks is small.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Strong rally to just below January all-time high</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-daily-candlestick-chart-near-top-of-strong-bull-channel.png\"><img loading=\"lazy\" src=\"2018-8-25-2.png\" alt=\"Emini daily candlestick chart near top of strong bull channel\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart has made 3 pushes up since July 23. The rally is therefore a wedge top. However, the 5 month bull trend is strong enough to make a new all-time high likely next week.<p>The rally on the Emini daily chart since the June 28 low is very strong. Friday closed on its high, and Monday might gap up. A big gap would create a gap above the January all-time high. If Monday is a big bull trend day, the Emini could quickly reach the measured move targets around 3100 and 3250.<p>Because the daily chart is still in an 7 month trading range, there is a 50% chance of a test down to the middle of the range at around 2700 before reaching the 3100 target. Furthermore, there is a 40% chance of a test of the bottom of the range at around 2550. Finally, as unlikely as it might seem, the bears have a 30% chance of a break below the range and a measured move down. That would be a 20% selloff down to around 2200. However, the bears need to create a series of big bear bars closing near their lows, which is unlikely. Unless they do, the odds continue to favor higher prices.<h4>Measured move targets for the bulls</h4><p>There are different ways to create measured move targets for the bulls. Using the February low and the January high, a measured move up would be around 3250. There was a double bottom with the February and April lows. The March high is the neck line. The measured move projection is just below 3100. Finally, the 3,000 Big Round Number is a less important psychological target.<p>Does the Emini need to hit any of these target before falling 10 – 20%? Of course not. But, the momentum up is strong enough to make higher prices likely. These are targets that traders think are reasonable.<h4>Bears hope for small wedge top reversal at January high</h4><p>The bears see a month-long wedge top at the January high. A reversal down from here would therefore be a big double top in addition to the small wedge top.<p>But, the bull channel from the June 28 low is tight. Furthermore, there have not been many big bear bars and therefore there has not been significant selling pressure. As a result, a reversal down might have a couple legs and last a couple of weeks, but a major reversal is unlikely. There is support at 2800, which is the June high and the July low.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-8-25"
    }
  ],
  "27": [
    {
      "data": [
        "<article class=\"post-80822 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini August breakout to a new all time highIntraday market update: Monday August 27, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini August breakout to a new all time high<br>Intraday market update: Monday August 27, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-08-27T06:20:15-07:00\">August 27, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini August breakout to a new all time high</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini rallied again on Friday and closed about 7 points below the all-time high. The cash index made a new high on Wednesday and again on Friday. The bulls want follow-through buying today and a close at a new all-time high. Whether or not they achieve their goal, the bull trend is strong. Since the weekly bull channel is tight, the odds continue to favor higher prices.<p>Since last week closed on its high, if today gaps up, there would be a gap on both the daily and weekly charts. A big gap up could be above the January all-time high. This would increase the chance of a bull trend day today.<p>It also increases the chance of a bear trend day. If there is a gap up and an early reversal down, today could be the start of a swing down on the daily chart. The bull case is more likely. Because of the increased chance of a trend day, day traders will look for an early swing entry up or down.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 11 points in the Globex session. If it opens here, it will gap up to a new all-time high on the daily and weekly charts. A breakout above major resistance increases the chance of a trend day. Up is more likely than down. Furthermore, the Emini is close to breaking above a bull channel in addition to the 8 month trading range breakout. This could result in a surprisingly strong series of trend days over the next week.<p>While most breakouts above bull channels fail, this one has a higher probability of success because it is also a breakout above a trading range. The result can be a very strong breakout.<p>The breakout is probably the start of a 300 point measured move rally. Even so, the Emini often goes sideways for several days when it breaks above resistance. Furthermore, it could still pull back below the breakout point and form another bull flag before it continues up.<h2>Friday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-gap-up-and-rally-then-tight-trading-range.png\"><img src=\"2018-8-27.png\" alt=\"Emini gap up and rally, then tight trading range\"></a><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex pause in bull trend reversal</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/EURUSD-Forex-pause-in-bull-trend-reversal.png\"><img loading=\"lazy\" src=\"2018-8-27-1.png\" alt=\"EURUSD Forex pause in bull trend reversal\"></a><p class=\"caption\">The EURUSD daily Forex chart rallied for 2 days after a 7 day buy climax. It will probably begin to enter a trading range.<p><br>The EURUSD daily Forex chart rallied for 2 days after a one day High 1 bull flag. The 7 day reversal up was strong and the context was good enough for a bull trend reversal. Consequently, the odds are that the August low will hold for at least a couple of months. Since the weekly chart has been in a bull trend during the 8 month selloff, this low could hold for many months.<p>I said last week that the 1st pullback might last only a day, which it did. In addition, I said that the trend resumption up might last only a few days. This is because that is what usually happens when there is a buy climax to resistance. Here, the resistance is the August 8 sell climax high.<h4>Likely resumption of bull trend on weekly chart</h4><p>The reversal is strong on the daily chart and the pullback on the weekly chart is probably ending. Therefore, the daily chart will probably go sideways to up for at least several more weeks. However, Big Down, Big Up creates Big Confusion. Confusion is a hallmark of a trading range. In addition, the daily chart is back to a price level where traders thought the price was fair from May through July. They will probably again believe it is fair. Consequently, the daily chart will probably go sideways for at least a month.<p>Trading ranges have legs up and down. The odds are that there will be a test down within the next couple of weeks. It could easily retrace half of the current rally and to below the June 21 bottom of the 3 month trading range.<p>Less likely, the bull trend reversal will continue up in a Small Pullback Bull Trend and break strongly above the June 14 high with a leg down first.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart had legs up and down overnight. Most of the bars were in small tight trading ranges. Day trading bears have been making money selling new highs, despite the bull trend. They will continue to do so today. When bears find it easy to make money in a bull trend, the trend is weakening. It usually soon enters a trading range. That is what is likely over the next week. The range will probably be between 1.15 and 1.17.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-weekly-gap-up-to-new-all-time-high-3.png\"><img loading=\"lazy\" src=\"2018-8-27-2.png\" alt=\"Emini weekly gap up to new all time high\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>After a gap up to a new high and an 11 bar rally on the open, the Emini entered a trading range. The Emini often goes sideways for 2 – 4 days after breaking above resistance. That is likely here. The bears want a gap down tomorrow and an island top, but higher prices are more likely.<p>If the bulls begin to get a series of bull days closing on their highs, the rally could quickly reach the measured move targets at around 3100 and 3200. More likely, the rally to the targets will have pullbacks and be in a bull channel instead of entirely in a breakout.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-8-27"
    }
  ],
  "28": [
    {
      "data": [
        "<article class=\"post-81016 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini weekly gap up to new all time high on NAFTAIntraday market update: Tuesday August 28, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weekly gap up to new all time high on NAFTA<br>Intraday market update: Tuesday August 28, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-08-28T06:20:09-07:00\">August 28, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini weekly gap up to new all time high on NAFTA</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini gapped up to a new all-time high yesterday on the daily and weekly charts. While the news will attribute this to a possible NAFTA deal, it is mostly technical. I said last week that this week might gap up based on the strong momentum up. There is news every day. That is not what caused the breakout. Last year was strongly bullish. Exhausted bulls took profits in February. They have been buying since April, and have been buying aggressively for 8 weeks.<p>When there is a big gap above resistance, the Emini usually goes sideways for 2 – 4 days. However, the bull trend then usually resumes once it is clear that the bears will fail to create a reversal. Therefore, the odds favor higher prices. This is especially true since August 30 to September 5 is seasonally bullish as well.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 3 points in the Globex session. It might gap up above the 2900 Big Round Number. If the gap is small, it probably will close in the 1st hour.<p>Because the Emini broke above major resistance, there is an increased chance of a big trend day up or down. But, a breakout above major resistance usually leads to a pause for 2 – 4 days. Traders then decide if the breakout will continue or reverse. Also, yesterday was in a tight range for most of the day. Therefore, the odds are that today will probably be mostly sideways again.<h2>Yesterday’s setups</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-weekly-gap-up-to-new-all-time-high-4.png\"><img src=\"2018-8-28.png\" alt=\"Emini weekly gap up to new all time high\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex buy climax near resistance at apex of triangle</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/EURUSD-Forex-buy-climax-near-resistance-at-apex-of-triangle.png\"><img loading=\"lazy\" src=\"2018-8-28-1.png\" alt=\"EURUSD Forex buy climax near resistance at apex of triangle\"></a><p class=\"caption\">The EURUSD daily Forex chart has rallied for 3 days in a 2nd leg up after a bull trend reversal. It is now testing resistance at the apex of the triangle. The odds favor a trading range before a breakout above the June 14 high.<p><br>The EURUSD daily Forex chart has rallied strongly for 3 weeks. This is a bull trend reversal. However, the rally is back to the apex of the 2 month triangle, which was a magnet and therefore resistance. Furthermore, the daily chart was sideways for 3 months around 1.17. In addition, it is now testing the 20 week EMA. Finally, the June 14 top of the 3 month trading range is resistance. Therefore, the odds are that this rally will stall this week and begin to enter a trading range for at least a couple of weeks.<p>Less likely, the rally will continue up and break strongly above the 1.1850 top of the 3 month trading range. While that breakout is likely within a few months, the daily chart will probably have to go sideways for at least a few weeks first.<p>The bears want a lower high below the June 14 or July 31 highs. They then want a break to a new low below 1.13. They only have a 30% chance of success at the moment. Since the rally was strong and the context is good for the bulls, the odds are that any selloff will form a higher low. The best the bears will get is a bear leg in a trading range or in a bull channel.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute chart rallied 50 pips overnight. It is now at the apex of the 2 month trading range. Also, the 60 minute chart is at the top of a wedge. The odds are that the rally will stall around here for a couple of days. The bears will probably need a double top on the 60 minute chart. Then, there will probably be a 100 – 150 pip pullback for a few days.<p>Since the rally is climactic and a pullback is likely soon, the bears will begin to sell this rally. Because the downside is limited, the bulls will buy selloffs, especially down to the August 23 low at the 20 day EMA at around 1.15.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-failed-breakout-above-yesterdays-all-time-high.png\"><img loading=\"lazy\" src=\"2018-8-28-2.png\" alt=\"Emini failed breakout above yesterday's all-time high\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>The Emini gapped above yesterday’s high and the 2900 Big Round Number. It then reversed back down into yesterday’s tight trading range. This reversal is probably minor, but it could last another day or two.<p>Since today has a bear body on the daily chart, it is a sell signal bar for tomorrow. But, the bull channel over the past 3 weeks is tight. Therefore, the bears will probably need at least a micro double top before they can get a swing down. Consequently, there will likely be more buyers than sellers below today’s low.<p>If tomorrow gaps down, there would then be a 2 day island top at the all-time high. While this is bearish, island tops and bottoms only rarely lead to big moves.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-8-28"
    }
  ],
  "29": [
    {
      "data": [
        "<article class=\"post-81018 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini failed breakout above January high and 2900Intraday market update: Wednesday August 29, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini failed breakout above January high and 2900<br>Intraday market update: Wednesday August 29, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-08-29T06:20:17-07:00\">August 29, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini failed breakout above January high and 2900</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Yesterday gapped up to another all-time high, but sold off back into Monday’s tight trading range. Since it was a bear bar on the daily chart, it is a sell signal bar for today. The bears want a failed breakout above the January high.<p>Their 1st goal is to get back below the 2884 January high. A more important goal is to close the gap above Friday’s high. The bulls always want the opposite and they will buy just above that 2877.25 high. The Emini will probably test one or both of these support levels this week. It will then decide between trend resumption up or trend reversal down. Up is more likely.<p>The 3 week bull channel on the daily chart is tight. The bears therefore will probably need at least a micro double top before they can get a swing down. But, the 1st reversal down will probably only last 1 – 2 days.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 1 point in the Globex session. After Monday’s gap up to a new all-time high, the odds favor 2 – 4 trading range days. Since yesterday was a trading range day, today will likely be another. However, because the Emini is at a major prior high, there is an increased chance of a big trend day up or down.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-failed-breakout-above-yesterdays-all-time-high.png\"><img src=\"2018-8-29.png\" alt=\"Emini failed breakout above yesterday's all-time high\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex parabolic wedge buy climax at resistance</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/EURUSD-Forex-parabolic-wedge-buy-climax-at-resistance-1.png\"><img loading=\"lazy\" src=\"2018-8-29-1.png\" alt=\"EURUSD Forex parabolic wedge buy climax at resistance\"></a><p class=\"caption\">Yesterday’s reversal was a 3rd leg up from the August 15 low. The 3 week rally was in a tight bull channel and therefore it is a parabolic wedge.<p><br>The EURUSD daily Forex chart had a 3 legged rally in a tight bull channel. This is a parabolic wedge buy climax. Two small legs sideways to down over the next week are likely.<p>The rally came from a parabolic wedge sell climax. Trend reversals usually have a transition when there are elements of both a bull and bear trend. For example, the 1st leg up in the August 15 parabolic wedge bottom began before the final low. This is common.<p>The rally is strong enough to have one more leg up before there is exhaustion. But, it has met the minimum goal. In addition, it is just below the July 31 major lower high and at the 20 week EMA resistance. Furthermore, the daily chart has been oscillating around 1.17 for 4 months, so that is also resistance.<p>The daily chart has probably entered a trading range, especially since it is back in the middle of a 4 month range. While there might be another minor high this week, the chart will probably be sideways for at least a week or two. Traders will sell rallies, buy selloffs, and take quick profits.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart sold off 70 pips overnight. I said yesterday that the trading range would probably be about 150 pips tall. Obvious support is the 20 day EMA, the August 23 low just above 1.15, and he June 21 low.<p>When the daily chart enters a trading range, the lower time frame charts begin to have smaller bars and lots of small trading ranges. Day Traders will be quick to take profits. However, there will be 30 – 50 pip day trades from minor support and resistance on the daily and 60 minute charts.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-wedge-rally-to-new-all-time-high-then-trading-range.png\"><img loading=\"lazy\" src=\"2018-8-29-2.png\" alt=\"Emini wedge rally to new all time high, then trading range after moving average gap bars\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>The Emini rallied strongly to a new all-time high. However, the 2 day trading range on the 60 minute chart is a possible Final Bull Flag. In addition, this rally is extreme and therefore climactic. This increases the odds of a 1 – 2 day pullback soon. However, the bull trend is intact and higher prices are likely.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-8-29"
    }
  ],
  "30": [
    {
      "data": [
        "<article class=\"post-81020 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini buy climax and 60 minute Final Bull Flag Intraday market update: Thursday August 30, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini buy climax and 60 minute Final Bull Flag<br>Intraday market update: Thursday August 30, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-08-30T06:20:20-07:00\">August 30, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini buy climax and 60 minute Final Bull Flag</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini rallied strongly to another new all-time high. Like most recent days, it then spent the next several hours going sideways. The bulls want the week to close on its high. While the bears prefer a close on the low, they would be happy to have the week close in the middle.<p>Monday and Tuesday’s tight trading range on the 60 minute chart is a possible Final Bull Flag. It is a magnet that could draw the Emini back down tomorrow or Friday. However, the odds continue to favor higher prices, although the bears will probably get a 1 – 2 day pullback soon.<h4>Possible failed breakout above the January high</h4><p>After a break above major resistance, like the January high, there is usually a Breakout Test. This is a reversal down to the breakout point. Traders want to see if the bulls will buy again at that price.<p>While a Breakout Test does not have to happen, traders will watch for it. The bears want the Emini to fall far below the breakout point. If it does, traders will begin to believe that the breakout failed. If the reversal down gains momentum, the bears could win. This week’s rally would then be a failed breakout of the top of the 8 month range.<p>The momentum up over the past 4 months favors the bulls. Therefore, the odds are that every selloff will fail and form a higher low. The rally should continue up to the measured move targets around 3100 over the next few months. However, any breakout can fail. Day traders will be ready to sell any strong reversal down.<h3>Overnight Emini Globex trading</h3><p><br>The Emini Globex chart is down 3 points. Today will probably open around the bottom of yesterday’s 5 hour trading range. The bears saw yesterday’s trading range as a double top or a higher high major trend reversal. The low of the range is the neck line. A measured move down would be close to yesterday’s low.<p>The past 4 days had early rallies and then protracted trading ranges. Since markets resist change, behavior tends to repeat. However, they usually display variations on the theme. Since the Emini might test down to the January high over the next week or two, one variation would be an early selloff and then a trading range. Day traders should be prepared for an early selloff today or tomorrow, followed by a trading range.<p>The Emini has spent most of the past week in trading ranges, despite early rallies. This increases the chance of more trading range trading today.<p>After a break above major resistance on the daily chart, the bulls want the week and month to close near the high tomorrow. This reduces the chances of strong selling before tomorrow’s close.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-wedge-rally-to-new-all-time-high-then-trading-range.png\"><img src=\"2018-8-30.png\" alt=\"Emini wedge rally to new all time high, then trading range after moving average gap bars\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex parabolic wedge buy climax just below resistance</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/EURUSD-Forex-parabolic-wedge-buy-climax-just-below-resistance.png\"><img loading=\"lazy\" src=\"2018-8-30-1.png\" alt=\"EURUSD Forex parabolic wedge buy climax just below resistance\"></a><p class=\"caption\">The EURUSD daily Forex chart rallied strongly for 3 weeks to near the top of the 4 month trading range. It has been sideways for 3 days.<p><br>The EURUSD daily Forex chart had a bull trend reversal 3 week ago. It is now back in its 4 month trading range. Since traders believed that this was a fair price for many months, they will probably continue to hold this belief until it is clearly wrong. Consequently, the daily chart might go sideways for several more weeks before breaking out.<p>Because the weekly chart has been in a bull trend for a year and a half, a bull breakout is more likely than a bear breakout. But the 3 week rally on the daily chart has been in a series of buy climaxes. When that happens, the bulls typically begin to take profits (“exhausted bulls”). They then wait for about 10 bars and 2 sideways to down legs before buying again.<p>This is because they want to test the bears. If the bears are strong, the selloff could be more than 50%. That would allow the bulls to buy again around 1.15, which is much cheaper than today. Alternatively, the bears might not be able to drive the market down. Instead, the daily chart could go sideways. If that happens, the bulls will buy again after a sideways High 2 bull flag or a triangle.<h4>Parabolic wedge buy climax transitions into a trading range</h4><p>The 3 week parabolic wedge buy climax has been strong and there is room to the top of the 4 month range. Therefore, there might be 1 or 2 more small legs up before there is a 10 bar sideways to down move. However, the bulls will begin to take profits above the high of prior days and the bears will sell there. Also, both will buy below the lows of prior days. Finally, both believe the moves up and down will be brief. They therefore will take quick profits. This creates a trading range.<h3>Overnight EURUSD Forex trading</h3><p><br>The bulls bought below Tuesday’s low and the bears sold above yesterday’s high. Fading breakouts is an early sign of a bull trend evolving into a trading range. The EURUSD 5 minute chart is forming smaller legs. Day traders are taking quick profits. They are looking for reversals, especially from above yesterday’s high and below yesterday’s low. Therefore, the 5 minute chart is back to a scalping market.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-double-top-lower-high-major-trend-reversal.png\"><img loading=\"lazy\" src=\"2018-8-30-2.png\" alt=\"Emini double top lower high major trend reversal\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>The Emini turned down from a lower high major trend reversal but found buyers just above the 60 minute EMA. It then had a dramatic selloff from a big double top bear flag late in the day. There were some buyers below yesterday’s low and the 60 minute EMA.<p>However, this selloff was strong enough to give the bears a 40% chance of closing the week and month back below the January high. The odds would still favor higher prices over the next few months. However, that would increase the chance of a 1 – 3 week pullback.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-8-30"
    }
  ],
  "31": [
    {
      "data": [
        "<article class=\"post-81022 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini strong August close likely todayIntraday market update: Friday August 31, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini strong August close likely today<br>Intraday market update: Friday August 31, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-08-31T06:20:15-07:00\">August 31, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini strong August close likely today</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Today is the last day of the week and of the month. The bulls want both to close on the high. That would increase the chance of higher prices next week and next month.<p>The bears are unlikely to get a big enough selloff today to create a big bear bar on either chart. However, this week’s low is close enough for the bears to have a chance of creating at least a small bear body. When the monthly candlestick closes today, it will probably be a bull trend bar closing above its midpoint. That would be a reasonably strong bull bar on the monthly chart.<p>The bulls have already accomplished their goal of creating a good bull bar on both charts. They therefore do not need a big bull day today. Their minimum goal is a close above the January high of 2884.00. With yesterday’s late selloff, the bears have 40% chance of a close below the January high today.<p>Yesterday’s late selloff was strong. Therefore, if the Emini is within 5 points of that price in the final hour, there will probably be a test down to that level by the end of the day. Less likely, the week will close on its low and be a good sell signal bar for next week.<p>A gap down on any day over the next week will create an island top. If the gap stays open for a few days, it could lead to several weeks of lower prices.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 7 points in the Globex market. Today might therefore gap down, which would create a 4 day island top. However, a small gap usually closes in the 1st hour. Also, there is support below at the January high and the top of the gap at Friday’s high. This selloff will more likely be a test of those breakout points than the start of a bear trend reversal.<p>The January high is the most important price today. If the Emini is within about 5 points of it after 11 a.m. PST today, it will probably get drawn to it. Traders should look for that reversal trade at the end of the day.<p>Since it is such an important price, the Emini might selloff early today to test it. If so, it might then enter a trading range around it for the rest of the day.<p>Can today be a huge bear trend day and begin a bear trend that can last for months? Any reversal down from important resistance can lead to a huge bear trend. However, the odds are always against a major trend reversal. Most trend reversal attempts fail. Traders want to see a series of big bear days before they will conclude that a bear trend is underway. But, if today starts to selloff strongly on the open, day traders will swing trade their shorts.<p>Most days are mostly trading range days, and the past week has been like that. Therefore, today will again probably be mostly sideways. However, yesterday’s huge reversal down was extremely unusual. It therefore increases the chance of several days of sideways to down trading.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-double-top-lower-high-major-trend-reversal.png\"><img src=\"2018-8-31.png\" alt=\"Emini double top lower high major trend reversal\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex trading range after parabolic wedge buy climax</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/EURUSD-Forex-trading-range-after-parabolic-wedge-buy-climax.png\"><img loading=\"lazy\" src=\"2018-8-31-1.png\" alt=\"EURUSD Forex trading range after parabolic wedge buy climax\"></a><p class=\"caption\">Today is the 4th sideways day after a parabolic wedge buy climax. The rally is a bull trend reversal and a buy vacuum test of resistance at the top of the 4 month trading range.<p><br>The EURUSD daily Forex chart rallied for 3 weeks in a parabolic wedge buy climax. While the rally is a bull trend reversal, it is also a buy vacuum test of resistance. A buy climax to resistance usually makes bulls take at least partial profits. This stops the rally and often leads to a pullback. The sideways to down move typically has at least a couple legs and often lasts about 10 bars. Therefore, the daily chart will probably be mostly sideways for at least another week.<p>The bulls might get one more small leg up to around 1.1750 and the July 31 high before there are a couple legs sideways to down. However, the rally stalled in the middle of a 4 month trading range. That is a sign that traders still believe that the trading range is the appropriate price.<p>Can the chart reverse back down from a lower high and continue a broad bear channel on the daily chart? Probably not because the reversal up was surprisingly strong and the weekly chart is still in a bull trend.<p>Can the 3 day pullback form a High 2 bull flag and lead to a strong breakout above the range over the next week? That, too, is unlikely. A parabolic buy climax reversal is usually an attempt to fix a price that was clearly too low. The price is now back to what has been normal for 4 months. Traders will probably need to trade in this range for at least a couple of weeks before they can conclude that the price is still too low.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart sold off about 50 pips overnight after yesterday’s outside down day. Since the daily chart is now probably in a tight range, day traders will look to buy reversals up from below the prior day’s low and sell reversals down from the prior day’s high. Support is at the 20 day EMA and the August 23 pullback low.<p>That means that the pullback will probably continue down to around 1.1550 over the next week. Day traders will sell rallies and bulls buy new lows on the 5 minute and daily charts, looking for 10 – 30 pip scalps. Some legs might last 4 or more hours, but day traders will probably have a hard time making more than 30 pips on a trade over the next week.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/08/Emini-bear-trend-reversal-and-then-bull-trend-reversal.png\"><img loading=\"lazy\" src=\"2018-8-31-2.png\" alt=\"Emini bear trend reversal and then bull trend reversal\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>After a strong rally on the open, the Emini reversed down in an endless pullback to a new low of the day. However, the bulls then got a bull trend reversal. The week and month closed above the January high, which is good for the bulls. The odds favor higher prices.<p>There is a 6 week micro wedge on the weekly chart. Since this week was a bull bar that closed above the middle of its range, it is a bad sell signal for next week. Also, the weekly bull channel is tight. Therefore, any reversal down will probably be minor and last only 1 – 3 weeks.<p>However, a gap down on Tuesday (Monday is a holiday) would create a 1 bar island top on the weekly chart. That would increase the chance of a swing down to the bottom of the channel on the daily chart at around 2850.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-8-31"
    }
  ]
}