{
  "2": [
    {
      "data": [
        "<article class=\"post-78164 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini breakout soon after Euro sell climax and Treasury bond reversal Emini weekend update: June 2, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini breakout soon after Euro sell climax and Treasury bond reversal<br>Emini weekend update: June 2, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-06-02T00:30:53-07:00\">June 2, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Bulls need follow-through buying</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/Monthly-Emini-candle-stick-chart-has-4-bar-bull-flag.png\"><img loading=\"lazy\" src=\"2018-6-2.png\" alt=\"Monthly Emini candle stick chart has 4 bar bull flag\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart had a bull bar in May, but a prominent tail on top. It was a breakout above a 3 month bull flag.<p>The monthly S&amp;P500 Emini futures candlestick chart has been sideways for 4 months after a 15 month buy climax. While May traded above April’s high, it closed below that high. This is a sign that the bulls might not yet be strong enough to test the January all-time high. It increases the chances of the trading range lasting longer before the bull trend resumes.<p>Furthermore, the monthly chart has not touched its moving average in a long time. Any support is a magnet. The 20 month EMA is now just above 2500, which is just below the bottom of the 4 month trading range.<p>Part of the reason for the lack of a strong bull breakout is that many bulls are beginning to wonder if the chart has to test this support zone. If enough do, there might not be enough buyers at the current price.<p>The Emini might have to drop to that support zone to find more buyers. If it does and then reverses up sharply, there will be a consensus that the bottom is in. That could lead to FOMO (Fear Of Missing Out) panic buying and a strong rally to a new high.<h4>Only 20% chance of bear trend on monthly chart in 2018</h4><p>There is still an 80% chance that the 1st pullback in a 15 month bull micro channel will test the high before the bears can get a bear trend. The odds go up for the bears if they can make the trading range last 10 or more bars. Alternatively, if they can create consecutive very big bear trend bars, they then would have a 50% chance of at least a 20% correction.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>3 week bull flag after breakout of 3 month triangle</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/Breakout-pullback-bull-flag-on-weekly-Emini-candlestick-chart-1.png\"><img loading=\"lazy\" src=\"2018-6-2-1.png\" alt=\"Breakout pullback bull flag on weekly Emini candlestick chart\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart broke above a 3 month triangle 3 weeks ago. The past 3 weeks are more likely forming a bull flag than a failed breakout.<p>The weekly S&amp;P500 Emini futures candlestick chart has had small bodies with prominent tails for the 3 weeks after breaking above a 3 month triangle. This lack of immediate follow-through buying is a sign that the bulls are not yet strongly in control. But, there is still a 60% chance that these 3 weeks are forming a bull flag.<p>However, if the bears can create consecutive big bear bars, they could make the bull breakout fail. That would lead to another test of the bottom of the 4 month trading range.<h4>Possible double top lower high major trend reversal at 2800</h4><p>There is no significant resistance above this week’s high until around 2800. That is a Big Round Number and just below the March 13 high. Because there is no resistance below that, the Emini could quickly get vacuumed up there. However, if it turns down at that point, it will form a double top with the March 13 low. That would be an adequate test of the all-time high of 2880.25. Therefore, a selloff from there would have a 40% chance of a major reversal.<p>A major reversal in a bull trend is a bear trend. The neck line of the double top is the April 6 low of 2552.00. A measured move down from there is 2297, which would also be below the 20 month EMA. Furthermore, it would be a 20% correction.<p>While the weekly and daily charts would be in bear trends, the double top on the monthly chart would be too small to be major to be a major top. Consequently, the 20% selloff would still be minor. That means that it would form a bull flag and not a bear trend.<br><h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Emini breakout soon after Euro sell climax and treasury bond reversal</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/Daily-Emini-chart-rallying-from-cup-and-handle-bull-trend.png\"><img loading=\"lazy\" src=\"2018-6-2-2.png\" alt=\"Daily Emini chart rallying from cup and handle bull trend\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart has been in a tight trading range for 3 weeks. There is a 60% chance that there will be a bull breakout above this bull flag.<p>The daily S&amp;P500 Emini futures candlestick chart has been sideways for 4 months. The May rally is strong enough to make at least slightly higher prices likely in June. But, legs in trading ranges are more likely to reverse than to lead to a successful breakout of the range. Therefore, as strongly bullish as the monthly chart is, the daily chart will continue to have 5 – 10 bar legs that reverse until it breaks out of the 4 month range.<p>In addition, whenever the bulls have a strong rally, like they did in early May, there is always at least a 40% chance of a an eventual successful breakout below the 4 month trading range.<h4>Bears want 350 point Leg 1 = Leg 2 measured move down to 2400</h4><p>The bears want at least one more leg down after February’s strong selloff. Their minimum target is a Leg 1 = Leg 2 measured move. The 1st leg down ended with the February 9 low. It is therefore about 350 points tall. If May 22 turns out to be the start of a 2nd leg down, the target would then be around 2400.<p>The bears see the trading range as a wedge bear flag after the February strong 1st leg down. The 1st leg up in the wedge bear flag is the March 27 high. April 18 was the 2nd top. May 22 was the final top. They know that the past 3 weeks are forming a bull flag. But they also know that there is a 40% chance of a bear breakout below a bull flag. If they can get that breakout and make it strong, there would be a 50% chance of a test of the bottom of the wedge. That is at either the April or May lows.<h4>Do Treasury bonds and the dollar matter?</h4><p>No, not if you are a trader. A trader trades the chart in front of him and does not worry about anything else. He knows that the institutions instantaneously price in all information, and there is nothing that he can know that is not already priced in. You always see traders on TV trying to impress viewers with their profound analysis of fundamentals. It is simply hubris and it makes them look dumb.<p>Yet, the bonds rallied strongly for the past couple of weeks. In addition, the Euro is at the end of a sell climax. All financial markets are related. These 2 are changing their behavior. That increases the chance of a breakout in the stock market. But only an arrogant fool will confidently predict the direction of the breakout based on his analysis of the news and other markets. The odds favor a new all-time high in the Emini before there is a bear trend. However, there is still a 40% chance of a bear breakout first.<p>I trade price action, not news. Therefore, I will wait for a breakout before switching from trading range trading to trend trading.<p>I like the news. It is entertaining and I like to know what is going on. However, I ignore it when placing trades. I wait to find out if more dollars see it as bullish or bearish and then trade.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-6-2"
    }
  ],
  "9": [
    {
      "data": [
        "<article class=\"post-78465 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini bull trend resumption after buy climax and triangle Emini weekend update: June 9, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini bull trend resumption after buy climax and triangle<br>Emini weekend update: June 9, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-06-09T00:30:05-07:00\">June 9, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Emini bull trend resumption after buy climax and triangle</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/Emin-monthly-chart-breaking-out-above-bull-flag-for-test-of-3000-in-the-SP.png\"><img loading=\"lazy\" src=\"2018-6-9.png\" alt=\"Emin monthly chart breaking out above bull flag for test of 3,000 in the S&amp;P\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart is breaking above a 3 month bull flag. This month so far is the 3rd consecutive bull trend bar.<p>The monthly S&amp;P500 Emini futures candlestick chart is breaking above a 3 month bull flag in a strong bull trend. But, the bears want a double top after the 15 month buy climax. However, after a 15 month bull micro channel, there is a 70% chance of at least a new small new high before the bears can take control. This is true even if the Emini forms a lower high within the next few months and a break below the February low. Since 3,000 is a Big Round Number and just above the old high, that is a minimum goal over the next 3 – 6 months.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Rally should test above 2800 within a few weeks</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/Emini-weekly-chart-breaking-above-triangle-but-might-double-top-at-2800.jpg\"><img loading=\"lazy\" src=\"2018-6-9-1.jpg\" alt=\"Emini weekly chart breaking above triangle but might double top at 2800\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart has rallied strongly for 2 weeks after pulling back from a breakout above a triangle. The odds are that the Emini will test the 2800 Big Round Number and the March 13 high within a few weeks.<p>The weekly S&amp;P500 Emini futures candlestick chart has rallied from the May 3 low at the bottom of a 3 month triangle. Since the weekly chart was in a strong bull trend before the triangle formed, the odds favor bull trend resumption.<p>A breakout above a triangle often continues for a measured move up. Since the triangle is about 300 points tall, the current rally could reach 3100 – 3200 over the next 6 months.<h4>Triangle late in bull trend is usually the Final Bull Flag</h4><p>The current trend on the weekly chart began in early 2016. It therefore was in effect for about 100 bars when the buy climax evolved into the triangle in February.<p>It is important to realize that a triangle late in a bull trend is usually the Final Bull Flag. This means that the breakout above the triangle usually reverses back down to the apex or bottom of the triangle. While the odds favor a rally over the next 6 months or so, there will then likely be a reversal back down to around 2600.<p>Traders should not lose sight of the fact that this rally will likely continue for at least 10% above the 2700 apex of the triangle. Therefore, traders should continue to look to buy over the next many months.<h4>Double top lower high major trend reversal (DT LH MTR)</h4><p>Even though the bull trend is resuming, the weekly chart is still in a 5 month trading range. Consequently, there is always a reasonable bear case. They want this rally to reverse down from a double top with the May 13 high. That would be a double top lower high major trend reversal.<p>If there is a strong reversal down, the bears would have a 40% chance of a swing down to the bottom of the triangle. In addition, there would be a 30% chance of a break below the February low and a 300 point measured move down to 2301.00.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Pausing around March major lower high ahead of next week’s FOMC meeting</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/Emini-daily-chart-in-bull-trend-to-2800-resistance-at-March-major-lower-high.png\"><img loading=\"lazy\" src=\"2018-6-9-2.png\" alt=\"Emini daily chart in bull trend to 2800 resistance at March major lower high\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart has rallied strongly since May 3. It might pause around the March 13 major lower high going into Wednesday’s FOMC announcement.<p>The daily S&amp;P500 Emini futures candlestick chart has been in a bull trend since the May 3 low. Since the next resistance above the April 18 high is the March 13 high of 2811.00, the market is getting vacuumed up there quickly.<p>Because that is major resistance, the Emini will likely stall there or even pull back for a week or two. But, there is a 60% chance of a breakout above that high within the next couple of months. This is true even if there is a reversal back down to the May 29 low of 2678.75.<h4>What will the rally to 3,000 look like?</h4><br>The Emini will probably rally to above 3,000 before the end of the year. However, 3,000 is not that much about the current price, and there are almost 7 months left to the year. Consequently, the Emini will probably spend a lot of time in 2 – 4 week pullbacks as it channels up to the target. Each pullback will look like the start of a bear trend. But, as long as the Emini continues to make major higher lows, the bull trend will still be in effect.<p>The most recent major higher low is the May 3 low of 2595.00. That is about 200 points below the current price. Traders must realize that there can therefore be very deep selloffs over the next 6 months in the bull channel. As long as the selloffs stay above the most recent major higher low, the bull trend is still intact. Therefore, the selloffs will be pullbacks and buying opportunities.<p>But, if there is a strong break below a major higher low, the bull trend will be over. The Emini would then be back in a trading range and possibly even a bear trend.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-6-9"
    }
  ],
  "14": [
    {
      "data": [
        "<article class=\"post-78604 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini testing 2800 Big Round Number and major lower highIntraday market update: June 14, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini testing 2800 Big Round Number and major lower high<br>Intraday market update: June 14, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-06-14T06:20:12-07:00\">June 14, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini testing 2800 Big Round Number and major lower high</h2><p class=\"caption\">I will update again at the end of the day<h2>Pre-Open market analysis</h2><p><br>The Emini daily chart had an outside down day yesterday that closed below Tuesday’s low. It is therefore a sell signal bar for today. Furthermore, yesterday was the 3rd leg up in a small parabolic wedge on the daily chart and a 60 minute wedge rally. In addition, it was just below the resistance of the 2800 Big Round Number and the March major lower high. Today might therefore be the start of 2 or more weeks of sideways to down trading. There is an increased chance of a bear trend day today.<p>Since yesterday is a sell signal bar on the daily chart, traders want to know if there are more buyers or sellers below its low. Therefore, the bears will try to break below yesterday’s low in the 1st hour today to trigger the sell signal. However, they will not get a big gap down open. They are therefore not as strong as they could have been.<p>They need a big bear today today and again tomorrow to make traders believe that they are in control of the daily chart. At a minimum, they want the week to have a bear body. That means their minimum goal for the week is to have tomorrow close below 2784.50. If they achieve that, this week will be a sell signal bar for next week on the weekly chart. That would increase chance of lower prices over the next few weeks.<h4>The bulls need an early reversal up from yesterday’s low</h4><p>The bulls would like today to be an inside day with a close above the open. Today would then be an ioi bull flag on the daily chart. The bulls will therefore buy an early selloff to just above yesterday’s low. If today falls below yesterday’s low, the selloff will trigger a sell on the daily chart. However, the bulls would then try to get a reversal back up, which would make the sell signal fail.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 7 points in the Globex session. Yesterday ended with an expanding triangle bottom after the FOMC report. The bulls hope it will be a bull flag and that the 2 week rally will continue up to the March high.<p>Since yesterday is a sell signal bar on the daily chart, there probably will be a selloff in the 1st 2 hours to test yesterday’s low. If so, traders will look for a reversal up from around yesterday’s low. The minimum goal for the bulls is a trading range day today. Next, they want a close above the open and a bull inside day. A big bull trend day is unlikely after yesterday’s strong reversal down.<p>If there is a strong break below yesterday’s low, today could be a big bear trend day. The 1st target for the bears is 2763.75. That is the beginning of the wedge rally on the 60 minute chart. If the bulls cannot get a reversal up from around yesterday’s low, they will probably find support there. The odds are that the Emini will test that low within a week because of the wedge top on the 60 minute chart.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/Emini-outside-down-sell-signal-bar-and-parabolic-wedge-top-after-FOMC.png\"><img src=\"2018-6-14.png\" alt=\"Emini outside down sell signal bar and parabolic wedge top after FOMC\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars.<h2>EURUSD Forex outside down day at resistance</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/EURUSD-Forex-outside-down-day-at-resistance.png\"><img loading=\"lazy\" src=\"2018-6-14-1.png\" alt=\"EURUSD Forex outside down day at resistance\"></a><p class=\"caption\">EURUSD daily Forex chart has outside down day at resistance. It is reversing down from a double top with the May 22 high. In addition, this rally is a 20 Gap Bar bear flag at the EMA.<p><br>The EURUSD daily Forex chart has been testing the 20 day EMA for the past 7 days. Since this is the 1st touch of the average in over 20 days (more like 50 days), it is a 20 Gap Bar Sell Signal. The bears want a resumption of the bear trend. However, since the 9 week selloff had consecutive sell climaxes at major support, a trading range is more likely.<p>Therefore, if this is the start of a 1 – 2 week selloff, it will probably be a pullback from the 2 week rally. There are probably buyers around the May low and there will then be a 2nd leg sideways to up. The bulls hope that the 2nd leg up will form a double bottom with the May low. They then will try for a breakout above today’s high, which would be the neck line of the double bottom. A measured move up would be around the May 14 high and the 1.2000 Big Round Number.<h4>Trading range is more likely than a resumption of bear trend</h4><p>The daily chart is probably in a trading range that will last 2 – 3 months. If so, the overnight outside down could fail tomorrow. The chart could then continue higher and create a bigger 1st leg up.<p>More likely, the overnight selloff will continue down and test the May low. The 2nd leg up could begin either around a 50% pullback to around 1.16, or at or below the May low.<p>The bears need a strong break below the May low before traders will conclude that the bear trend is resuming. It is important to remember that the reversal up began at the major support of the November 7 low. That increases the chances of a double bottom test of that area and then a 2nd leg up.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart sold off from above yesterday’s high to below its low. Today is therefore an outside down day. Since the daily chart is at resistance and the selloff was strong, the odds are that there will be follow-through selling over the next week. Consequently, unless there is a strong reversal back up, day traders will sell rallies for a swing down to at least 1.16.<p>Any selloff that lasts several days will have bear rallies. If the 5 minute chart begins to go sideways for an hour or two, the bulls will buy for 10 – 20 pip scalps. However, it will be easier to make money by selling rallies until there is a strong reversal back up.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/Emini-inside-day-and-triangle-bull-flag.png\"><img loading=\"lazy\" src=\"2018-6-14-2.png\" alt=\"Emini inside day and triangle bull flag\"></a><p class=\"caption\">The Emini reversed down from below yesterday’s high. It then reversed up from above yesterday’s low. Today was therefore an inside day and a trading range day. Since it had higher lows and lower highs, it was also a triangle.<p><br>After yesterday’s outside day, today was an inside day. This creates an ioi breakout mode setup on the daily chart. Because the bull channel is tight, it is a weak sell setup. Since the resistance of the March high is just above, and there is a 4 bar tight trading range, it is a weak buy setup. Therefore, tomorrow will probably be mostly sideways.<p>In addition, the week’s range has been small. Therefore, this week is a potential sell signal bar on the weekly chart for next week. The bears want a bear bar and the bulls want the week to close above the open. Consequently, the open of the week will be an important price again tomorrow.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-6-14"
    }
  ],
  "15": [
    {
      "data": [
        "<article class=\"post-78606 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini weekly candlestick chart creating weak sell signal for next week Intraday market update: June 15, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weekly candlestick chart creating weak sell signal for next week<br>Intraday market update: June 15, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-06-15T06:20:25-07:00\">June 15, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini weekly candlestick chart creating weak sell signal for next week</h2><p class=\"caption\">I will update again at the end of the day<h2>Pre-Open market analysis</h2><p><br>After Wednesday’s big outside down day, yesterday was an inside day and a trading range day. It is therefore both a buy and sell signal bar for today on the daily chart. Since it is at the top of a 4 day tight trading range and Wednesday was a big bear day, it is not a strong buy setup. Because the 3 week bull channel is tight, it is not a strong sell setup. Therefore, the odds are for more sideways trading again today. However, after 3 consecutive bear days, traders will be ready for more bear days over the next couple of weeks.<p>The range this week has been small. If the week closes below the open, the candle stick on the weekly chart will have a bear body. That would make it a sell signal bar for next week. The daily chart is just below the March high and the 2800 Big Round Number. A selloff from here would therefore create a lower high double top.<p>But, the 3 week rally has been strong in a tight bull channel. Consequently, the odds are against a big, fast selloff. If this is the start of a 2 – 3 week bear leg down to the May 29 low, it will probably be gradual, like the selloffs from the April 18 and May 14 highs. Any selloff will more likely be a bear leg in the 5 months trading range than a resumption of February’s bear trend.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 14 points in the Globex session. It might therefore gap down below yesterday’s low. However, there is a wedge rally, a lower high double top, and a buy climax on the daily chart. Hence, there is an increased chance of a 2 – 3 week selloff down to the May 29 low. Therefore, there is an increased chance of a preponderance of bear days over the next couple of weeks.<p>Will there be small early rallies that reverse down and late selloffs that lead to closes near the low over the next week? If so, day traders will conclude that the daily chart has begun a swing down. They will therefore look for this pattern to repeat most days and create many bear days.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/Emini-inside-day-and-triangle-bull-flag.png\"><img src=\"2018-6-15.png\" alt=\"Emini inside day and triangle bull flag\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars.<h2>EURUSD Forex sell vacuum test of support and double bottom major trend reversal</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/EURUSD-Forex-sell-vacuum-test-of-support-and-double-bottom-major-trend-reversal.png\"><img loading=\"lazy\" src=\"2018-6-15-1.png\" alt=\"EURUSD Forex sell vacuum test of support and double bottom major trend reversal\"></a><p class=\"caption\">The EURUSD daily Forex chart had a huge bear day yesterday. While the bears hope that this is a resumption of the bear trend, they need strong follow-through selling over the next 2 weeks. Otherwise, yesterday will simply be a sharp sell vacuum test of support. The bulls will try for a double bottom major trend reversal.<p><br>The EURUSD daily Forex chart had a dramatically big bear day yesterday. It was an outside down day, and the week is now outside down as well. But, there were consecutive sell climaxes down to support on May 29. Therefore, the odds still favor a trading range that will last at least a couple of months. Yesterday’s momentum down increased the odds of a strong break below the May low and a 300 pip measured move down to around 1.12. However, unless the bears get strong follow-through selling over the next 3 weeks, yesterday will soon reverse up from around the May low.<p>If the daily chart begins to turn up over the next few weeks, the bulls would have a major trend reversal. Last week’s high is the neck line of the double bottom. A breakout above would lead to a test of the May 14 high at around 1.20.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart had a big bear trend day yesterday. However, there was no overnight follow-through selling. Instead, the market traded in a 50 pip range. In addition, the odds are that the daily chart is now in a trading range, despite yesterday’s big bear trend on the 5 minute chart. If the bulls can prevent a strong selloff over the next few days, traders will begin to see yesterday as a test of the May low. The bulls will look for buy setups for a rally back up to the June high.<p>Because yesterday was as strong bear trend day, the bears have an increased chance of follow-through selling over the next several weeks. But, the odds still are greater that the daily chart is in a trading range.<h4>EURUSD Forex Day traders choosing between probability and risk/reward</h4><p>Trading is always a choice between probability and risk/reward. The momentum down favors the bears on the 5 minute chart, which means it is likely that there will be at least a small 2nd leg down over the next week. But, the risk/reward favors the bulls. The bulls do not need to risk much below the May low in their attempt to make 400 pips up to the May high. They will bet that the 2nd leg down will be brief and small and form a micro double bottom with yesterday’s low.<p>Yesterday’s big move down slightly lowers the probability of a trading range on the daily chart, but a trading range is still likely. Yesterday therefore created confusion, and confusion usually results in at least a small trading range. Therefore, the odds are that the 5 minute chart will go sideways for a few days.<p>Less likely, yesterday will be a resumption of the bear trend on the daily chart and the start of many big bear days. What if those bear days do not appear? Traders will conclude that yesterday was just a strong bear leg in a developing trading range. They will therefore buy, expecting a 2 – 3 week bull leg in the range.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/Emini-bull-reversal-day-and-weekly-doji-bar-and-sell-signal.png\"><img loading=\"lazy\" src=\"2018-6-15-2.png\" alt=\"Emini bull reversal day and weekly doji bar and sell signal\"></a><p class=\"caption\">The Emini sold off on the open and then reversed up. With a late rally, it closed exactly at the open of the week.<p><br>By trading below yesterday’s low, the daily chart triggered a sell signal. There was a wedge rally since the April 18 high, and a lower high double top with the March high. However, the daily chart has been in a trading range for 5 months. Therefore, even if there is a selloff for 2 weeks, it will more likely be a bear leg in the trading range than a bear trend.<p>Since this week is a doji bar on the weekly chart, it is a weak sell signal bar.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-6-15"
    }
  ],
  "16": [
    {
      "data": [
        "<article class=\"post-78610 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini buy climax just below 2800 resistance  Emini weekend update: June 16, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini buy climax just below 2800 resistance<br>Emini weekend update: June 16, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-06-16T00:30:05-07:00\">June 16, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Breakout above 3 month bull flag</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/Emini-monthly-chart-has-breakout-above-bull-flag-after-sell-climax-2.png\"><img loading=\"lazy\" src=\"2018-6-16.png\" alt=\"Emini monthly chart has breakout above bull flag after sell climax\"></a><p class=\"caption\">The candlestick on the monthly S&amp;P500 Emini futures chart is a strong bull bar so far this month. It is the 2nd month of a breakout above a 3 month bull flag.<p>The monthly S&amp;P500 Emini futures candlestick chart is breaking above a 3 month bull flag. Since the chart has been sideways for 5 months, it might continue sideways for several more months. However, whether or not it does, the odds favor a new all-time high this year. The rally will probably continue to above the 3,000 Big Round Number.<p>The bears always have an argument, even though it is not strong at the moment. The month is only half over and therefore the chart might look very different in a couple of weeks. For example, if the Emini sells off from here, the month could end up as a bear reversal bar and a lower high.<p>But, even if that were to happen, the odds would favor more sideways trading instead of a bear trend. The bull trend is strong and the bulls will probably get a new all-time high this year.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Weak sell signal bar</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/Emini-weekly-chart-wedge-rally-and-double-top-lower-high-major-trend-reversal.png\"><img loading=\"lazy\" src=\"2018-6-16-1.png\" alt=\"Emini weekly chart wedge rally and double top lower high major trend reversal\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart had a small, perfect doji this week. The bears want a reversal down from a wedge rally. They also see this as a lower high double top with the March high. However, the week is a small bar and therefore a weak sell signal bar, especially since the 2 month bull channel is tight. Furthermore, there is still room to the resistance of the March high and the 2800 Big Round Number above.<p>The weekly S&amp;P500 Emini futures candlestick chart has been in a weak bull trend since the May 3 low. The bears want a reversal down next week. The 11 week rally has had 3 pushes up in a tight bull channel. It is therefore a parabolic wedge. In addition, a reversal down from here would be a double top lower high major trend reversal with the March high.<p>This is a reasonable sell setup, but after 2 strong week’s up, this week’s small bar is a low probability sell signal. The bears will probably need at least a micro double top. If they get it, or if they get a strong reversal down next week, they will have a 40% chance of a swing down for a month or more. Furthermore, they would have a 30% chance of a break below the February low. The March low is the neck line of the double top. A break below projects to a measured move down to around 2300.<h4>Double tops are created by trapped bulls</h4><p>Markets have memory. Traders who bought at the March 13 high discovered that they bought badly. They are trapped bulls and are hoping for an opportunity to sell out of their longs without a loss. There are always bears selling as well. Finally, the bulls who bought near the bottom see the resistance and have a big profit. They will sell to take some of that profit.<p>No one knows if there are more buyers or sellers here. However, when a market approaches a prior high, it usually pauses as the trapped bulls sell out of their longs and the bulls who bought well take some profits. If there are enough new bulls willing to buy at the top of the range, there will be a successful breakout. Since the weekly chart was in a strong bull trend prior to this 6 month trading range, the odds are that the bulls will return, overpower the bears, and get a rally to a new high. This is true even if the market goes sideways to down for a couple months.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Emini buy climax just below 2800 resistance</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/Emini-daily-chart-bull-flag-testing-resistance-at-top-of-trading-range-1.png\"><img loading=\"lazy\" src=\"2018-6-16-2.png\" alt=\"Emini daily chart bull flag testing resistance at top of trading range\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart rallied strongly for the past 3 weeks. However, this buy climax stalled this week just at the top of the 5 month trading range, just below the March high and the 2800 Big Round Number.<p>The daily S&amp;P500 Emini futures candlestick chart formed a tight trading range this week. Its 3 week rally is the 3rd leg up from the March low. Therefore, the bull channel is a wedge. However, the shape is bad and the 3rd leg up is strong. Hence, if there is a selloff next week, it will probably be a minor reversal and not a bear trend. The odds favor at least one more small leg up.<p>Because the daily chart has been in a trading range since February, pullbacks can be deep and last several weeks. The pullbacks from the March 13 high, the April 18 high, and the May 14 high are examples. Bulls who are swing trading need a stop below the most recent major higher low, which is the May 3 low. The May 29 higher low is minor. That means if the Emini breaks below it, the bull channel up from the April 2 low is still in effect. The Emini would still be in a trading range and a bull channel, and not in a bear trend.<h4>Bears will sell at the March 13 high</h4><p>There is a 60% chance of a breakout to a new all-time high this year because the monthly chart is in a strong bull trend. However, this 5 month trading range could continue for many more months. In fact, there is a 40% chance that it could last all year.<p>The bulls had a 2 legged rally from the April 2 low to May 22. Instead of selling off, they got got a breakout above this top. The 3 week breakout is strong enough for at least a small 2nd leg up. Therefore, the daily chart will probably test the March 13 high within a few weeks. However, that would be a second 2 legged rally, which is a possible consecutive top (a Low 4 sell signal). If the bulls are unable to break strongly above the March 13 high, they will give up. The bears would then probably get a 1 – 2 month bear leg in the 6 month trading range.<p>Traders need to carefully watch how the candle sticks look over the next couple of weeks. If the bulls get a series of bull trend bars, especially big bars, they will likely get a successful breakout soon. Alternatively, if every bull bar is followed by bear a bar, and many bars have tails on top, the odds are that this rally will end. The bears would then take control for 1 – 3 months and the trading range will continue.<p>For traders to conclude that the Emini has entered a bear trend and not just a bear leg in the 5 month trading range, the bears need a strong break below the February low. It is common for a bear trend to become clear only after it is already about half over. This would be an example.<p>The odds still favor the bulls. A bull breakout above the 5 month trading range projects to around 3,100. If there is a bull breakout, which is likely, the top will probably be between 3,000 and 3,200.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-6-16"
    }
  ],
  "18": [
    {
      "data": [
        "<article class=\"post-78608 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini weekly sell signal for wedge rally and double topIntraday market update: June 18, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weekly sell signal for wedge rally and double top<br>Intraday market update: June 18, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-06-18T06:20:34-07:00\">June 18, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini weekly sell signal for wedge rally and double top</h2><p class=\"caption\">I will update again at the end of the day<h2>Pre-Open market analysis</h2><p><br>Friday gapped down and triggered a minor sell signal on the daily chart. The daily chart was a wedge rally to just below the March high.<p>The weekly chart has a small wedge rally and a big double top. Last week was a perfect doji bar on the weekly chart, and therefore a weak sell signal bar. The bears want this week to trade below last week’s low to trigger the sell. However, the prior 2 weeks were big bull bars. Hence, the bears will need at least a couple big bear bars before traders will believe that the bears have regained control.<p>Furthermore, June 26 – July 5 is one of the more reliable bullish times of the year. This implies that the Emini often sells off a little before June 26. This week might be the start of this seasonal pattern.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 17 points in the Globex market. It might therefor gap below last week’s low and trigger a sell signal on the weekly chart. Consequently, there is an increased chance of a bear trend day today. Furthermore, there is also an increased chance of a bull trend day whenever the bears try for a bear breakout. The past 2 weeks have spent a lot of time in trading ranges on the 5 minute chart. Because of the location and chart patterns on the daily and weekly charts, there is an increased chance of a trend day today.<h2>Friday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/Emini-bull-reversal-day-and-weekly-doji-bar-and-sell-signal.png\"><img src=\"2018-6-18.png\" alt=\"Emini bull reversal day and weekly doji bar and sell signal\"></a><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I sometimes also show limit order entries and entries on the close of bars.<h2>EURUSD Forex market trading strategies</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/EURUSD-Forex-double-bottom-major-trend-reversal-or-bear-flag-6.png\"><img loading=\"lazy\" src=\"2018-6-18-1.png\" alt=\"EURUSD Forex double bottom major trend reversal or bear flag\"></a><p class=\"caption\">The EURUSD daily Forex chart had a big bear day last week. But, there was no follow-through selling on Friday or so far today. The bulls want a double bottom with the May 29 low. Yet, the bears want a small bear flag this week and then a 300 pip measured move down below the May 29 low. The odds are that the month-long trading range will continue for at least another month.<p><br>The EURUSD daily Forex chart is in a bear trend. Yet, there is better than a 50% chance that the daily chart is now also in a trading range. This is because it had consecutive sell climaxes that stopped at the November 7 major higher low. In addition, the early June rally from support was strong evidence that the daily chart is now in a trading range.<p>The bears hope that last week’s selloff is a resumption of the bear trend. But, the bear had a strong rally up to the June 14 high. When a bear trend resumes down strongly, like it did last week, but stops at the bear low, it might be testing that prior low. This means that last week’s selloff has at least a 50% chance of being a strong test of the bottom of the bear trend instead of a breakout below a bear flag and a resumption of the bear trend.<p>This is especially true since the next day, Friday, was a bull day. Successful bear breakouts usually do not stop at support. Furthermore, when they do, the next day is typically at least a small bear day. Here, Friday was a bull bar closing near its high. If the bulls get 3 or more consecutive bull days or a micro double bottom, there will be a 60% chance that Thursday’s bear breakout will fail.<p>After consecutive sell climaxes to support, a 2 – 3 month trading range is likely. The minimum target for the top of the range is last week’s high, which is the neck line of the double bottom. If the bulls break above that, they will look for a test of the May 14 high around 1.2000.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart rallied 60 pips overnight. It formed a double bottom with Friday’s low. The bulls want a break above Friday’s high, which is the neck line. They then want a measured move up. If they get it, they will then try to rally to the top of Thursday’s sell climax high over the next 2 weeks. Their minimum goal is a 2nd bull day on the daily chart. Therefore, the open of the day will be a magnet today.<p>The bears will try to get the day to close below its open. Today would therefore be a sell signal bar on the daily chart for tomorrow. The bears want a double top with Friday’s high on the 4 hour chart, which would be a bear flag. They hope that a breakout below would also strong break strongly below the May 29 low. More likely, a bear breakout will fail and form a micro double bottom on the daily chart.<p>There is almost a 50% chance that last week’s selloff will lead to another leg down on the daily chart. The bears will therefore be ready for big bear trend days over the next week. If they fail to get them, they will buy back their shorts. This will lead to bull trend days and a rally to last week’s high. The top of the most recent sell climax is always the 1st target for the bulls.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/Emini-triangle-and-bull-trend-resumption-after-failed-weekly-sell-signal.png\"><img loading=\"lazy\" src=\"2018-6-18-2.png\" alt=\"Emini triangle and bull trend resumption after failed weekly sell signal\"></a><p class=\"caption\">The Emini reversed up from below last week’s low and then entered a trading range.<p><br>Today triggered a weekly sell signal by falling below last week’s low. Since the weekly sell setup was weak, there were buyers below last week’s low. Today rallied and entered a trading range. The bears might try to trigger the weekly sell signal again tomorrow by going back below last week’s low, but the odds are against a big selloff. Most days are continuing to have mostly trading range trading.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-6-18"
    }
  ],
  "19": [
    {
      "data": [
        "<article class=\"post-78803 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini trading range at start of China trade warIntraday market update: June 19, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini trading range at start of China trade war<br>Intraday market update: June 19, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-06-19T06:20:59-07:00\">June 19, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini trading range at start of China trade war</h2><p class=\"caption\">I will update again at the end of the day<h2>Pre-Open market analysis</h2><p><br>Yesterday traded below last week’s low and therefore triggered a sell signal on the weekly chart. The weekly bears have a wedge rally and a double top bear flag. Yet, last week was only a doji and not a strong bear reversal bar. Furthermore, the prior 2 weeks were strong bull bars. Finally, the March high is a magnet and last week’s high did not get close enough to convince traders of an adequate test. These factors reduce the chance of a reversal down.<p>However, the weekly chart has been in a trading range for 5 months. Therefore, this reversal down could be the start of a bear leg in the range. If so, the selloff could test the bottom of the range. More likely, this is a minor reversal that will only last 1 – 3 weeks. The bulls will then again try to get above the March high.<p>Most days over the past several weeks had a lot of trading range trading, as did yesterday. Therefore, even if there is a big gap down, the odds are that today will spend a lot of time going sideways.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 28 points in the Globex session. If it opens here, it will again fall below last week’s low. This would trigger the weekly sell signal a 2nd time. The minimum goal for the bulls today is to close the day above last week’s low of 2765.50.<p>Whenever there is a big gap down, there is an increased chance of a trend day. The bulls want an immediate strong rally. If they get 3 – 4 consecutive big bull bars, the day will probably be a bull trend day.<p>The bears want a trend from the open bear trend. While strong trends after big gaps are infrequent, they can be big. The bears would like a small pullback bear trend day, which would have the highest probability of lasting all day.<p>Most often, when there is a big gap down, the bears are hesitant to sell far below the average price. In addition, the bulls are reluctant to fight the overnight trend. Consequently, the Emini usually enters a trading range for an hour or more. The bears will look to sell a double top or wedge rally to near the EMA. The bulls try to get a breakout above the trading range and moving average, and then a measured move up.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/Emini-triangle-and-bull-trend-resumption-after-failed-weekly-sell-signal.png\"><img src=\"2018-6-19.png\" alt=\"Emini triangle and bull trend resumption after failed weekly sell signal\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars.<h2>EURUSD Forex market trading strategies</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/EURUSD-Forex-Micro-double-top-Low-2-bear-flag.png\"><img loading=\"lazy\" src=\"2018-6-19-1.png\" alt=\"EURUSD Forex Micro double top Low 2 bear flag\"></a><p class=\"caption\">Today is an outside down day after yesterday’s outside up day. Yesterday exactly hit Friday’s high after reversing up from below its low and therefore qualifies as outside up. This is a micro double top bear flag, but it is at support.<p><br>The EURUSD daily Forex chart has consecutive outside bars (an oo pattern). This is therefore a micro double top bear flag. But, it is at support and after consecutive sell climaxes down to the May 29 low. The breakout below yesterday’s low has less chance of leading a 300 pip measured move down. However, it could lead to a 100 pip measured move down based on the height of the 3 day bear flag.<p>If the bulls get a reversal up from there, the bear flag would be a Final Bear Flag. Furthermore, the reversal up would be a lower low major trend reversal. Major reversal setups have a 40% chance of a bull trend. Most lead to a continuation of the trading range.<p>While the overnight selloff was strong and the 2 month bear trend is strong, a sell climax down to support usually leads to a trading range. That is still what is likely here. The bears need a strong break below a 100 pip measured move down for traders to conclude that the bear trend is resuming. If there is a reversal up from here or within 100 pips below, traders will conclude that the daily chart entered a trading range at the May 29 low.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart sold off 100 pips overnight from yesterday’s high to below its low. Consecutive outside days are more likely to lead to a trend when they reverse a trend. They are less likely to lead to a resumption of a trend. Therefore, bulls will look for a reversal back up over the next week.<p>The 5 minute chart has been in a 30 pip range for the past 4 hours. The bears want a bear breakout and a close below yesterday’s low. More likely, today will continue the overnight trading range. The minimum goal for the bulls is to have today close above yesterday’s low. That would weaken the bear case and increase the chance of more sideways days. A strong reversal up today is unlikely after such a strong overnight selloff.<p>Outside down days usually do not fall far below the prior day’s low. This makes further strong selling unlikely today. The minimum goal for the bears is a close below yesterday’s low of 1.1543. If there is not bull trend reversal, they will sell rallies for a test of 1.1543.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/Emini-gap-down-on-China-trade-war-and-wedge-bull-channel.png\"><img loading=\"lazy\" src=\"2018-6-19-2.png\" alt=\"Emini gap down on China trade war and wedge bull channel\"></a><p class=\"caption\">The Emini today had a big gap down, but it reversed up from just above the May 22 high. That was the breakout point for the June rally.<p><br>The Emini reversed up strongly from a test of the May 22 high. That was the breakout point for the June rally. Last week is a sell signal bar on the weekly chart. The bulls managed to rally back above last week’s low, weakening the already weak sell signal.<p>While the Emini has sold off for 5 days, the past 3 days of the selloff have bull bodies. That represents buying pressure and is unusual in a selloff. It therefore reduces the chance of much lower prices.<p>The bears want to break back below that high and test the May 29 higher low of 2678.75. However, unless the bears start to create big bear bars, the odds are that this week-long selloff will be a bull back in a bull trend.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-6-19"
    }
  ],
  "20": [
    {
      "data": [
        "<article class=\"post-78805 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini weak weekly sell signal and China trade warIntraday market update: June 20, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weak weekly sell signal and China trade war<br>Intraday market update: June 20, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-06-20T06:20:15-07:00\">June 20, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini weak weekly sell signal and China trade war</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini gapped down yesterday. Since it again fell below last week’s low, it triggered the weekly sell signal for a 2nd time. However, it rallied from a double bottom and a test of the May 22 high. That was the breakout point for the June rally. Additionally, yesterday was the 3rd consecutive bull day in a 5 day pullback. It is unusual to have 3 bull bars as the market is falling, and this is a sign of buying pressure. Therefore, it reduces the chances of much lower prices.<h3>Overnight Emini Globex trading</h3><p><br>Since yesterday was a wedge rally, it was a wedge bear flag on the 5 minute chart. The bears want a break below yesterday’s bull trend line and a test of yesterday’s low. They want the 5 day bear trend to continue and to fall below the May 22 high.<p>However, the Emini is up 7 points in the Globex session. It might therefore gap above yesterday’s high and the 60 minute EMA. This would be a bull breakout above yesterday’s wedge bear flag. The bulls would then want a measured move up based on the height of yesterday’s wedge.<p>Yesterday was a bull reversal day at key support. It is therefore a buy signal bar. This increases the chances of a big bull trend day today. A bull trend day is even more likely after 3 consecutive bull days in a 5 day selloff. However, if the breakout above the wedge reverses down, today could also be a bear trend day.<p>Every day for the past 2 weeks has spent a lot of time going sideways. If there is a trend up or down, there will probably be a lot of trading range trading as well. Day traders need to be ready for anything today, but the odds are there will be at least one good swing trade.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/Emini-gap-down-on-China-trade-war-and-wedge-bull-channel.png\"><img src=\"2018-6-20.png\" alt=\"Emini gap down on China trade war and wedge bull channel\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars.<h2>EURUSD Forex double bottom and failing oo bear flag</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/EURUSD-Forex-double-bottom-after-consecutive-outside-bars-oo-bear-flag.png\"><img loading=\"lazy\" src=\"2018-6-20-1.png\" alt=\"EURUSD Forex double bottom after consecutive outside bars (oo bear flag)\"></a><p class=\"caption\">The EURUSD daily Forex chart has been sideways for 4 days after last week’s big selloff. The bears want this to be a 4 day bear flag. However, a reversal up from a double bottom with the May 29 low is slightly more likely.<p><br>The EURUSD daily Forex chart sold off strongly last week, but stalled at the May 29 low. The bulls want a double bottom reversal up to test the June 14 sell climax high. The odds are that the daily chart is in a trading range, even if there is one more small leg down.<p>The bears have consecutive outside days (outside, outside so oo pattern) after last week’s big bear day. This is an oo bear flag. But, the past 4 days have prominent tails below. The bears so far have failed to get a breakout. If today is an inside day, there will then be an iooi pattern, which is a variation of an ioi (inside-outside-inside).<p>That is a breakout mode pattern. If today is an inside day, it is both a buy and a sell signal bar for tomorrow. The bears want a breakout below and a measured move down based on the 100 pip height of the bear flag.<p>The bulls will try to get a reversal up. If today is an inside day, especially if it closes near its high, the bulls will buy above today’s high. Their 1st goal is a test of the top of the most recent sell climax. That is the June 14 big bear trend day. Its high is the neck line of the double bottom. They then want a breakout above and another test of 1.20, which is at the May 14 high.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart has been in a 30 pip range for the past 4 hours. Today so far is an inside day. The bulls want today to remain an inside day so that it will be a buy signal bar for tomorrow. They especially want today to close above its open and have have a big bull body. That would indicate buying pressure and increase the chances of a rally tomorrow. The bears always want the opposite. The want a bear day closing near its low, and they do not care if it remains an inside day.<p>After 4 days in a tight range, the odds are that today will continue to have a small range. Day traders will scalp unless there is a big breakout up or down. After yesterday being an outside day in a tight trading range, the odds favor an inside day today.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/Emini-wedge-bull-flag-opening-reversal.png\"><img loading=\"lazy\" src=\"2018-6-20-2.png\" alt=\"Emini wedge opening reversal up from the EMA, then doji day\"></a><p class=\"caption\">Today was a trading range day that closed near its open. It therefore was a doji day on the daily chart.<p><br>Yesterday was a reversal up from the daily EMA. Today triggered a buy signal by going above yesterday’s high. Yet, today was a doji day and therefore a weak entry bar.<p>The bulls hope to get above last week’s high after reversing up from below its low yesterday. If they succeed, this week will be an outside up week. That is a sign of strong bulls. Hence, it would increase the chance of a test of the March high.<p>The weekly chart is still on its wedge top sell signal. But, this week so far is a bad entry bar for the bears. They need much more selling in the 2 remaining days of the week, which is not likely.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-6-20"
    }
  ],
  "21": [
    {
      "data": [
        "<article class=\"post-78807 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini daily bull flag after weekly wedge topIntraday market update: June 21, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini daily bull flag after weekly wedge top<br>Intraday market update: June 21, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-06-21T06:20:38-07:00\">June 21, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini daily bull flag after weekly wedge top</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Yesterday was a small trading range day. Since Tuesday was a bull day that reversed up from the 20 day EMA, it was a buy signal bar on the daily chart. When yesterday went above Tuesday’s high, it triggered the buy signal. However, since the Emini has sold off for 5 days, yesterday is a pullback in a bear trend. It is therefore a minor sell signal bar for today. But, it is a doji and it followed a big bull bar. Therefore it is a weak sell signal, and there are probably more buyers than sellers below its low.<p>The weekly chart is still on a weak sell signal. The two day reversal has been strong enough to generate confusion. Confusion usually leads to a trading range. Therefore, the odds are against a big move up or down today.<p>Because last week’s range was small, the bulls have a 40% chance of going above last week’s high. Since it reversed up from below last week’s low, this week would then be an outside up week. That is a sign of strength. But, the resistance of the March high is just above. Until the bulls break above it, there is no breakout. Therefore, the 5 month trading range is still in effect.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 3 points in the Globex market. Today will probably trade below yesterday’s low. That would trigger a sell signal on the daily chart.<p>There will likely be more buyers than sellers below yesterday’s low since it is a weak sell signal. Furthermore, yesterday was a small day. Therefore, a reversal up from below yesterday’s low would have a 30% chance of continuing to above yesterday’s high. Today would then be an outside up day, which is a sign of buying pressure.<p>With most days being mostly sideways, the odds are that today will have a lot of trading range trading again.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/Emini-wedge-bull-flag-opening-reversal.png\"><img src=\"2018-6-21.png\" alt=\"Emini wedge opening reversal up from the EMA, then doji day\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars.<h2>EURUSD Forex market trading strategies</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/EURUSD-Forex-weak-breakout-below-weak-ioi-bear-flag.png\"><img loading=\"lazy\" src=\"2018-6-21-1.png\" alt=\"EURUSD Forex weak breakout below weak ioi bear flag\"></a><p class=\"caption\">The EURUSD daily Forex chart broke below yesterday’s low. But, yesterday was a bear doji in a tight trading range, and the past 4 days had prominent tails below. This is a weak ioi bear flag. An ioi is an inside bar after an outside bar. The outside bar means that the bar before is inside of the outside bar.<p><br>The EURUSD daily Forex chart is in a strong bear trend. However, it is also in the early stages of a trading range. It is looking for the bottom of the range.<p>The bulls hope that this week’s low will be the bottom. But, they need a strong bull bar today or tomorrow for a buy signal bar. They would then have a High 2 bottom with Monday’s bull bar. That would be a reasonable bottom because it would be a 2nd reversal up from below the May low. In addition, the daily chart is at the support of the November 7 low.<p>While yesterday was a bear inside day, it was a doji bar. Therefore, it is a weak sell signal bar. Yet, if the bulls cannot create bull bars today or tomorrow, the odds favor at least slightly lower prices.<p>The minimum goal for the bears is a 100 point measured move down based on the height of the 4 day bear flag. They have a 40% chance of a 300 pip measured move down based on a failed double bottom attempt. There is a 60% chance of at least a 200 pip rally before the daily chart falls more than 100 pips below the May 29 low.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart reversed up 40 pips after breaking below yesterday’s low. However, the bulls need a continuation of the rally. Without that, the rally will be a bull leg in a trading range rather than the start of a swing up.<p>The 240 minute chart is forming a wedge bottom over the past 5 days. Therefore, the bulls will look for a strong rally and a test of the top of the wedge today or tomorrow. That is just above 1.1700.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/Emini-trend-resumption-after-moving-average-gap-bars.png\"><img loading=\"lazy\" src=\"2018-6-21-2.png\" alt=\"Emini trend resumption after moving average gap bars\"></a><p class=\"caption\">The Emini sold off on the open. After a 4 hour trading range, the bears got trend resumption down. However, the bulls again reversed up from just above the May 22 high.<p><br>After a sell climax on the open, the bulls got a trading range. But, the bears then got trend resumption down. Yet, they were unable to break below the May 22 high. The bulls got a 2nd reversal up from that support at the end of the day.<p>The bears need a break far below the May 22 high. They then would look for a test of the next higher low, which is the May 29 low.<p>Tomorrow is Friday and this week’s open and last week’s low are the most important weekly magnets for tomorrow.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-6-21"
    }
  ],
  "22": [
    {
      "data": [
        "<article class=\"post-78809 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini double bottom bull flag breakout pullback test of May 22 Intraday market update: June 22, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini double bottom bull flag breakout pullback test of May 22<br>Intraday market update: June 22, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-06-22T06:20:33-07:00\">June 22, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini double bottom bull flag breakout pullback test of May 22</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>This week triggered a sell signal on the weekly chart. In addition, by trading below Wednesday’s low, yesterday was an entry bar for a Low 1 sell signal on the daily chart. However, the selloff held above Tuesday’s low. The bulls therefore hope it is a 2nd test of the May 22 high. That increases the chance of a rally above 2800 over the next few weeks.<p>The bears want Wednesday to be a pullback in a 5 day bear swing. Furthermore, they want to drive the Emini below the May 22 high. That is the breakout point for the June rally. If the Emini closes far below, the June breakout will have failed. That would increase the odds of a test down to the May 29 higher low.<p>With the Big Up and Big down of the past 3 weeks, there is Big Confusion. That usually results in a trading range. Furthermore, most of the days over the past 3 weeks have spent most of their time going sideways. That is likely again today.<h4>Weekly support and resistance</h4><p>Today is Friday and therefore weekly support and resistance are important. The bulls want the week to close at or above the open of the week. The week would then be a doji bar on the weekly chart. It would therefore be a bad sell entry bar for the bears. In addition, it would be a buy signal bar for next week.<p>This week is the entry bar for last week’s sell signal on the weekly chart. The bears therefore want the week to be a big bear bar. They will try to close the week on its low. At a minimum, they want a close below the open and below last week’s low. Consequently, the open of the week and last week’s low are magnets today.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 14 points on the Globex chart. It is therefore back at the magnets of the open of the week and last week’s low. If today closes here, the week will be a doji bar on the weekly chart, like last week.<p>Markets have inertia. That means they tend to continue to do what they have been doing. Since last week was a doji, there is an increased chance of a doji this week. That means that the week will try to close near its open. At the moment, that is what is likely. There is therefore an increased chance of a trading range day today.<p>The bears twice this week tried to break back below the May 22 high and failed. Today will open about 20 points above that support. That makes a big bear trend day unlikely.<p>Because today will open near the open of the week, there is an increased chance that today’s open will be a magnet all day. Furthermore, yesterday was a big bear day. That also makes a big bull day unlikely.<p>Finally, most days over the past several weeks have been mostly sideways. That is a one more reason for today being mostly another trading range day.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/Emini-trend-resumption-after-moving-average-gap-bars.png\"><img src=\"2018-6-22.png\" alt=\"Emini trend resumption after moving average gap bars\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars.<h2>EURUSD Forex market trading strategies</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/EURUSD-Forex-double-bottom-leading-to-trading-range.png\"><img loading=\"lazy\" src=\"2018-6-22-1.png\" alt=\"EURUSD Forex double bottom leading to trading range\"></a><p class=\"caption\">EURUSD Forex double bottom leading to trading range<p>The EURUSD daily Forex chart reversed up twice this week after breaking below the May 29 low. This is a lower low double bottom major trend reversal.<p>But, only 40% of major reversals actually succeed in reversing the trend. More often, they pause the trend and the market enters a trading range. Therefore, that is what is likely here.<p>The bulls now have a credible bottom. However, the bears can get a new low at any time. As long as the bears do not get consecutive strong bear bars closing below the May low, the odds favor a trading range.<p>There are several targets for the bulls. The likely ones are the EMA and the top of the most recent sell climax. That is is the June 14 high. They also have a 40% chance of reaching the May 14 major lower high at the 1.20 Big Round Number.<p>Finally, and least likely, they want a 300 pip measured move up above that high. It is the neck line of the double bottom. The move would also test the March 1 low, which is the breakout point of the bear trend.<br><h3>Overnight EURUSD Forex trading</h3><p><br>The 5 minute chart rallied 70 pips overnight. It broke above yesterday’s high and triggered a 2nd entry buy signal on the daily chart. However, yesterday was an outside up bar in a 5 day tight trading range. In addition, it had a prominent tail on top. Also, it did not close above the 5 day range. These factors are not consistent with a strong reversal up.<p>The bulls want today to close above yesterday’s high. They therefore will buy pullbacks to below that high. Furthermore, they want today to close near its high. That is another reason for them to buy pullbacks. If today closes on its high, the week will close on its high. The weekly candlestick will then be a good buy signal bar for next week. The bulls will have a micro double bottom at the bottom of the 2018 buy climax. That is a support zone.<p>Since the 5 minute chart pulled back 40 pips over the past 2 hours, that is a significant loss of momentum. Therefore, the bulls will probably only scalp today as they try to keep the day near the high.<p>The bears always want the opposite. They therefore will sell rallies to around the high of the day. However, the 2 day rally is strong enough to make a bear trend day unlikely.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/Emini-wedge-rally-and-China-trade-war.png\"><img loading=\"lazy\" src=\"2018-6-22-2.png\" alt=\"Emini wedge rally and China trade war\"></a><p class=\"caption\">The Emini gapped up, but formed a trading range day.<p><br>After gapping up, the Emini entered a tight trading range and remained there all day. It is deciding whether the 2 tests of the May 22 high are adequate, or if the Emini will fall back below that high. After 2 doji bars on the weekly chart, the Emini is in breakout mode for next week.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-6-22"
    }
  ],
  "23": [
    {
      "data": [
        "<article class=\"post-78814 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini wedge rally and double top in 5 month trading range Emini weekend update: June 23, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini wedge rally and double top in 5 month trading range<br>Emini weekend update: June 23, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-06-23T00:30:11-07:00\">June 23, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Small bull bar testing the January high</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/Emini-monthly-candlestick-chart-is-breaking-above-bull-flag-2.png\"><img loading=\"lazy\" src=\"2018-6-23.png\" alt=\"Emini monthly candlestick chart is breaking above bull flag\"></a><p class=\"caption\">The candlestick on the monthly S&amp;P500 Emini futures chart is a small bull bar so far this month. It is the 3rd consecutive bull bar. The bulls therefore hope this is a resumption of the bull trend. But, the bar is small and has a tail on top. If the month closes below its midpoint, it will be a sell signal bar for July.<p>The monthly S&amp;P500 Emini futures candlestick chart is in a strong bull trend. It rallied for 15 months without a pullback. That is a 15 bar bull micro channel and a sign of strong bulls. However, it was also unsustainable and therefore climactic. When a micro channel lasts more than 10 bars and is therefore also a buy climax, it typically leads to a bull flag and not a bear trend.<p>But, the bull flag can last 10 or more bars. The Emini is currently deciding if the bull trend is resuming or testing the top of a developing trading range. If this month closes near its high, especially if the range gets bigger, the odds are that there will be a new all-time high within a couple months.<p>However, if it closes below its midpoint, it will be a sell signal bar for July. Furthermore, if it closes on its low and has a big bear body, the odds will favor at least a month or two of lower prices this summer.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Emini wedge rally and double top in 5 month trading range</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/Emini-weekly-candlestick-chart-has-weak-wedge-rally-and-double-top-2.png\"><img loading=\"lazy\" src=\"2018-6-23-1.png\" alt=\"Emini weekly candlestick chart has weak wedge rally and double top\"></a><p class=\"caption\">The candlestick last week on the weekly S&amp;P500 Emini futures chart was a sell signal bar. There was a 3 month wedge bull channel and a 4 month double top. This week triggered the sell signal by falling below last week’s low. Since this week was only a small doji bar, it is a weak entry bar for the bears.<p>The weekly S&amp;P500 Emini futures candlestick chart is in a 5 month trading range after last year’s bull trend. It is therefore in Breakout Mode, but in a bull trend. At the moment, there is a 60% chance that the bull trend will resume before there is a a strong bear breakout on the weekly chart. Yet, the 3 month rally has not been strong. It is a wedge rally and it lacks consecutive big bull bars. It therefore looks more like a bull leg in the 5 month trading range than a resumption of the bull trend.<p>Unless the bulls get a strong break above the March lower high, the bears will create another leg down. That leg would have a 50% chance of retracing at least 50% of the 3 month rally. In addition, if it was strong, it would have a 40% chance of falling below the April 2nd low and continuing down for 300 points. That is the measured move target for the double top with the March 13 high.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Emini wedge rally stalling at top of 5 month trading range</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/Emini-daily-candlestick-chart-has-double-top.png\"><img loading=\"lazy\" src=\"2018-6-23-2.png\" alt=\"Emini daily candlestick chart has double top\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart has been in a trading range for 5 months. There were 3 legs up from the April low. Therefore, the 3 month rally is a wedge bull channel. Furthermore, the past 2 weeks have traded down from the top of the range. Next week should tell traders if this is just a bull flag or the start of a 1 – 3 month bear leg.<p>The daily S&amp;P500 Emini futures candlestick chart has been going up since the April 2 low. This week tested down to the May 22 high and reversed up without overlapping it. There is now a possible measuring gap for about a 170 point rally [see comments below].<p>But, the chart is in a trading range. It is more likely that the bulls and bears will both be disappointed repeatedly. Therefore, the daily chart will probably close the gap above the May 22 high next week.<p>In a trading range, reversals are more common that breakouts. Hence, most breakout attempts up and down fail. Consequently, predicting which leg will ultimately be the start of the next trend is making a low probability bet.<h4>3 week bull flag or start of bear trend?</h4><p>Is the 3 month rally a resumption of last year’s bull trend or simply another leg in the 5 month trading range? Since it is not particularly strong, it is more likely a leg in the trading range. Traders will find out over the next several weeks.<p>If the bulls are unable to break strongly above the March high, they will sell out of their longs. They will then likely not look to buy again until the Emini is at least back to the middle of the 5 month range. This means that there would probably be a 1 – 2 month selloff.<p>The Emini has reversed down over the past 2 weeks. At the moment, there is a 50% chance that this is the start of a 1 – 3 month swing down to the middle of the range. Furthermore, any trading range always has at least a 40% chance of a breakout below the bottom of its range.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-6-23"
    }
  ],
  "25": [
    {
      "data": [
        "<article class=\"post-78811 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini double bottom bull flag just below resistance Intraday market update: June 25, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini double bottom bull flag just below resistance<br>Intraday market update: June 25, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-06-25T06:20:27-07:00\">June 25, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini double bottom bull flag just below resistance</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Last week was the 2nd consecutive doji bar on the weekly chart. It is a buy signal bar for this week, but a bear doji bar is a low probability setup for a swing up.<p>The weekly chart triggered a sell signal last week, yet the setup was weak. The daily chart had a bear inside bar on Friday. Also, Thursday was a big bear day. Therefore, Friday is a sell signal on the daily chart. But, the daily chart lacks strong legs up or down. Hence, a buy or sell signal is likely to lead to a 3 – 5 day move and not a trend.<p>The daily chart last week reversed up twice from above the May 22 high. There is therefore a gap between those two lows and the May breakout point. The bulls want a 160 or 190 point measured move up. But, unless they break above the March high in the next few weeks, the bears will probably get a swing down for several weeks. Furthermore, the daily chart is in a trading range, which disappoints bulls and bears. The odds are that the gap will close this week and disappoint the bulls.<p>June 26 to July 5 is up about 70% of the time. There is therefore a slight seasonal bias starting this week. However, the most important factor is the March high. The bulls need a strong breakout above it. Else, the 3 month rally is just a bull leg in a 5 month trading range.<p>Since the Emini is near major resistance, a big trend up or down can come at any time. However, most days have spent a lot of time in trading ranges, so that is likely again today.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 14 points in the Globex market. This is not how a reversal up from a gap usually behaves. It therefore increases the odds that the gap above the May 22 high will close this week. If so, it would be another sign that the rally from the April low is just a bull leg in the 5 month trading range.<p>Friday was mostly sideways, as were most days over the past month. Also, the Globex session was mostly sideways. This increases the chance that today will have a lot of trading range trading as well.<h2>Friday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/Emini-wedge-rally-and-China-trade-war.png\"><img src=\"2018-6-25.png\" alt=\"Emini wedge rally and China trade war\"></a><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I sometimes also show limit order entries and entries on the close of bars.<h2>EURUSD Forex double bottom and weekly buy signal bar</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/EURUSD-Forex-double-bottom-and-weekly-buy-signal-bar.png\"><img loading=\"lazy\" src=\"2018-6-25-1.png\" alt=\"EURUSD Forex double bottom and weekly buy signal bar\"></a><p class=\"caption\">The EURUSD daily Forex chart has rallied for 3 days from a double bottom with the May 29 low. This is also a larger double bottom with the November 7 low. However, it is now at the resistance of the 20 day EMA and a 50% retracement.<p><br>The EURUSD daily Forex chart has rallied for 3 days from the support of the May 29 low and the November 7 low. In addition, the weekly chart last week (not shown) was a a bull bar closing on its high. That is a strong buy signal bar.<p>But, context is always more important than a candlestick pattern. The selloff in April and May was extremely strong. Therefore, the odds are that the daily chart has entered a 2 – 3 month trading range. There is currently only a 30% chance that it is now in an early bull trend.<p>A trading range has at least 2 legs up and 2 legs down, and usually more. This rally is the 2nd leg up. Therefore, it will probably be followed by at least a small 2nd leg down. The 3 day rally has retraced about half of the selloff from 2 weeks ago. It is therefore at the resistance of a 50% pullback. Furthermore, it is at the resistance of the 20 day EMA.<p>When a sell climax evolves into a trading range, there is a magnet at the top of the most recent sell climax. Consequently, the daily chart will probably rally to at least the June 14 high within a couple of months. It might even reach the May 14 lower high. After reaching either of these 2 targets, it would then retrace at least half of the rally. This process will take at least another month or two.<h4>Bear flag, but trading range more likely</h4><p>I said that the 3 day rally is at resistance. The bears want the rally to stall here and form a bear flag. They then want a break below the double bottom and a 300 pip measured move down.<p>While they might get that a few months from now, the daily chart is in a trading range. Most trading range breakouts fail. There will probably be more buyers than sellers below the June low. The bears need a couple strong bear bars breaking 100 pips below that low before traders will conclude that the bear trend is ending. The bulls will buy any breakout that is less strong.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart rallied 50 pips over the past hour. However, this is the 3rd leg up on the 60 minute chart and it is therefore a wedge rally. A wedge bull channel typically converts into a trading range. In, addition, the rally is at resistance on the daily chart. So, this rally will probably stall over the next 2 hours and begin to go sideways.<p>While the odds favor a test of the June 14 high at 1.1851 within a few weeks, the 5 and 60 minute charts will have several 50 – 100 pip selloffs along the way. Since the rally on the 5 minute chart is probably within a bull leg in a trading range on the daily chart, both the bulls and the bears will look to sell rallies and buy pullbacks for 30 – 50 pip day trades.<p>The rally on the 5 minute chart is starting to form small, overlapping bars with prominent tails. These are early signs of a tight trading range. Day traders will begin to switch to scalping for 10 pips. They will soon look for a sell setup for a 30 – 50 pip pullback today or tomorrow.<p>Since the daily chart is in a trading range, day traders will be buying low, selling high, and going for small profits. Many will trade small and scale in to increase their probability. They will continue to do this until there is a strong breakout with follow-through up or down on the daily chart. Once that occurs, they will conclude that the trading range on the daily chart has broken out and a new trend has begun.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/Emini-trend-from-the-open-bear-trend-and-then-expanding-triangle-bottom.png\"><img loading=\"lazy\" src=\"2018-6-25-2.png\" alt=\"Emini trend from the open bear trend and then expanding triangle bottom\"></a><p class=\"caption\">After a big gap down and strong selloff, the Emini went sideways for the rest of the day. There was a late reversal up from an expanding triangle bottom just above the 2700 Big Round Number.<p><br>The bears had a strong Trend From The Open Bear Trend. After an expanding triangle bottom, the bulls got a late rally. The big selloff and then the big rally create confusion. This typically results in a trading range. Furthermore, the Emini is back in the May trading range. Therefore the Emini has an increased chance of being sideways for a few days.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-6-25"
    }
  ],
  "26": [
    {
      "data": [
        "<article class=\"post-79073 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini bear breakout below bull flag and wedge topIntraday market update: June 26, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini bear breakout below bull flag and wedge top<br>Intraday market update: June 26, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-06-26T06:20:50-07:00\">June 26, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini bear breakout below bull flag and wedge top</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini traded down for a couple of weeks from a 3 month wedge top. The bulls hoped the selloff was going to be a bull flag and lead to another leg up. Instead, the bears yesterday got a bear breakout below the bull flag. In addition, there is a wedge rally on the weekly chart.<p>I wrote over the weekend that the Emini would probably fall below the May 22 high this week. Yesterday, it fell far below. It was a surprisingly big bear day and therefore the odds favor at least a small 2nd leg down over the next several days.<p>Since yesterday was a big day, today has an increased chance of being a small day or an inside day. But, since at least a small 2nd leg down is likely, traders will sell rallies today and tomorrow.<p>June 26 to July 5 is seasonally bullish. In addition, the Emini is now back to the May trading range. Therefore, there is an increased chance of a mostly sideways market for a week or two.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 2 points in the Globex session after trading in a tight range overnight. Yesterday’s late reversal up reduces the chance of strong follow-through selling today. Furthermore, yesterday was in a big trading range after the 2nd hour. Therefore, today will probably have at least one swing up and one swing down. Because the legs yesterday were big, day traders will probably get several chances to swing trade again today.<p>But, yesterday was climactic. Therefore, traders are exhausted. Today will probably be mostly sideways.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/Emini-trend-from-the-open-bear-trend-and-then-expanding-triangle-bottom.png\"><img src=\"2018-6-26.png\" alt=\"Emini trend from the open bear trend and then expanding triangle bottom\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars.<h2>EURUSD Forex bear flag at 50% pullback, but bottom of trading range</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/EURUSD-Forex-bear-flag-at-50-pullback.png\"><img loading=\"lazy\" src=\"2018-6-26-1.png\" alt=\"EURUSD Forex bear flag at 50% pullback\"></a><p class=\"caption\">The EURUSD daily Forex chart is stalling at the EMA after a 50% pullback from a selloff 2 weeks ago. Since this 4 day bear flag is at the bottom of a month-long trading range, the odds are against a strong selloff.<p><br>The EURUSD daily Forex chart has a bear bar so far today. After a 3 day strong rally, the bear body represents stalling at resistance. While it can reverse down and break far below the double bottom, the 3 bull bars indicate aggressive bulls. Consequently, there are probably more buyers than sellers below today’s low. Most bears will want at least a micro double top before they are willing to sell.<p>Since the 2 month selloff was a sell climax that tested major support, the odds favor a trading range. This is true even if the bears get a 50 – 100 pip breakout below the June low. The trading range will likely last at least another month. Therefore, traders will be looking to trade 50 – 100 pip moves up and down.<p>Currently, the odds are that there will be a rally to the June 14 sell climax high before there is more than a 100 pip break below the double bottom. If that rally is strong, the bulls will then try to continue it up to the May 14 high. Less likely, they will retrace back to the March 1 low, which is the breakout point of the bear trend.<p>While this selloff is a bear trend on the daily chart, it is only a strong minor reversal down on the weekly and monthly charts. The odds favor a 300 – 500 pip second leg down after several months of sideways trading. A rally after that 2nd leg down would then have a 40% chance of leading to a major trend reversal down on the weekly chart.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 60 minute Forex chart had a wedge rally over the past 3 days. That made 2 legs sideways to down likely. The 5 minute chart sold off 70 pips overnight. Since traders expect a 2nd leg sideways to down after a wedge top, the bears will sell a rally today.<p>If the rally goes above the wedge top, traders will look for the breakout to fail. They will therefore sell a reversal down from above the overnight high.<p>Because the 3 day rally is strong, traders will buy below the low of the prior day. They know that the odds favor at least a micro double top, which means a test of the overnight high.<p>The 60 minute chart is probably entering a trading range for a few days. Day traders will therefore look to buy reversals up from 50 – 100 pip selloffs and sell reversals down from 50 – 100 pip rallies. Since the 5 minute chart has been in a 30 pip range for 5 hours, many day traders will look for 10 pip scalps while they wait for swing setups.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/Emini-doji-day-after-measured-move-up-and-small-pullback-bull-trend.png\"><img loading=\"lazy\" src=\"2018-6-26-2.png\" alt=\"Emini doji day after measured move up and small pullback bull trend\"></a><p class=\"caption\">After an early trading range, the Emini today had a weak rally in a trending trading range day. It closed near the open to form a doji day.<p><br>Today was an inside day and a bull doji bar on the daily chart. It is therefore a buy signal bar for tomorrow for a failed bear breakout yesterday. In addition, the stock market is seasonally bullish for the next week. However, the 3 week bear channel is tight. Therefore, the Emini might have to go sideways for a few days before the bulls can regain control.<p>Since yesterday had a big tail below and today did not have strong selling, the odds of a strong swing down are now less.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-6-26"
    }
  ],
  "27": [
    {
      "data": [
        "<article class=\"post-79075 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini doji inside day buy signal bar and seasonally bullish Intraday market update: June 27, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini doji inside day buy signal bar and seasonally bullish<br>Intraday market update: June 27, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-06-27T06:20:58-07:00\">June 27, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini doji inside day buy signal bar and seasonally bullish</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini formed a small bull doji inside day yesterday after Monday’s bear breakout. This reduces the chance of a big selloff this week. The Emini is back in the May trading range. It therefore might go sideways here for several days.<p>Since yesterday was a bull inside day after a bear breakout, it is a buy signal bar and a sell signal bar. But, the 3 week bear channel is tight and yesterday did not close on its high. Therefore, sideways for a few days is more likely that an immediate reversal up or a continuation down.<p>I mentioned that the Emini has a seasonal tendency to rally from June 26 to July 5. This further reduces the chances of a continued selloff over the next week.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 3 points in the Globex market. In addition, it reversed up 30 points overnight after testing yesterday’s low. Also, the day session began a broad bull channel yesterday and the late selloff was not strong. Consequently, despite Monday’s strong selloff, the day is starting more bullish than bearish.<p>Since yesterday had a small range, today will probably trade either above yesterday’s high or below its low. Because the range was small, there is an increased chance of an outside day, which means a break above and below yesterday’s range. As a doji bar, yesterday is a weak signal bar for the bulls and the bears. This means that there will probably be sellers above its high and buyers below its low and today will probably not be a big trend day.<p>But, Monday was climactic. There is therefore an increased chance of another big move up or down today. While the odds favor more two-sided trading after the sell climax, day traders will swing trade if there is a strong breakout up or down.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/Emini-doji-day-after-measured-move-up-and-small-pullback-bull-trend.png\"><img src=\"2018-6-27.png\" alt=\"Emini doji day after measured move up and small pullback bull trend\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/EURUSD-Forex-weak-bear-flag-at-50-pullback.png\"><img loading=\"lazy\" src=\"2018-6-27-1.png\" alt=\"EURUSD Forex weak bear flag at 50% pullback\"></a><p class=\"caption\">The EURUSD daily Forex chart sold off from the EMA and a 50% pullback from the strong selloff of 2 weeks ago. But, after 3 big bull bars, there are probably more buyers than sellers here.<p><br>The EURUSD daily Forex chart sold off over the past 2 days at a 50% retracement from the June 14 sell climax. However, this 2 day selloff follows 3 strong bull days and a double bottom at support. The selloff will probably be minor.<p>This means that there will likely be a 2nd leg up. Since the overnight low is around a 50% pullback, bulls will probably stop the selling today or tomorrow.<p>The bears will probably need a small double top with Monday’s high before they will be able to break below the June 21 low. Even if they get their new low, the selloff to the May 29 low was climactic and at major support. Therefore, there will likely be buyers 50 – 100 pips below the June low.<p>Most trading ranges after trends on the daily chart over the past 3 years lasted at least a couple months. There is no reason to believe this one will be different. The odds are that this one will last at least another month before there is a trend up or down.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart sold off 70 pips overnight, But, the selloff was in a broad bear channel. This is a weak bear trend and therefore more likely a leg in a trading range than a resumption of the bear trend on the daily chart. The odds are that the selling will stop somewhere above 1.1650 and lead to a 100 – 200 pip bounce over the next couple of weeks.<p>Since the selloff has been weak, day traders will buy below prior lows on the 5 minute chart. Day trading bears will prefer to sell 20 – 30 pip bounces and not at new lows. Instead, they will scalp out of their shorts below prior lows. Day traders will continue to scalp today unless there is a strong breakout up or down. But, that is unlikely in the middle of a 2 week trading range within a bigger range.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/Emini-parabolic-wedge-top-and-outside-down-day.png\"><img loading=\"lazy\" src=\"2018-6-27-2.png\" alt=\"Emini parabolic wedge top and outside down day\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>Today reversed down and formed an outside down day. However, it followed a day and a half of a strong rally. Therefore, there was Big Down on Monday, Big Up on Tuesday and early today, and more Big Down today. This creates confusion and makes a trading range likely over the next few days. The bulls want a double bottom with Monday’s low.<p>Since today was a bear outside down day in a bear trend on the daily chart, it is a sell signal bar for tomorrow. There is therefore an increased chance of a big bear day tomorrow. But, the Emini is in May’s trading range and has had 3 sideways days. The odds therefore favor a lack of follow-through selling.<p>Because yesterday’s selloff was climactic, there is a 75% chance of at least a couple hours of sideways to up trading by the end of the 2nd hour.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-6-27"
    }
  ],
  "28": [
    {
      "data": [
        "<article class=\"post-79077 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini outside down day after Tuesday’s inside dayIntraday market update: June 28, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini outside down day after Tuesday’s inside day<br>Intraday market update: June 28, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-06-28T06:20:02-07:00\">June 28, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini outside down day after Tuesday’s inside day</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Yesterday was a big outside down day after Monday’s big bear breakout. The bears want a break below the May 29 higher low, and then a breakout below the 5 month trading range. The bulls 1st want to stop the selling. They want a double bottom with Monday’s low. If the bears get a breakout, the bulls then want a higher low in the broad bull channel that began on April 2.<p>Tuesday’s reversal up and yesterday’s early rally represent strong bulls. That creates confusion after Monday’s big selloff. Confusion is a hallmark of a trading range. Furthermore, the Emini is back in May’s trading range. Finally, the 4th of July week is usually the 2nd quietest week of the year. Consequently, the Emini will probably go sideways for a few days.<p>The bears want follow-through selling, including a strong break below Monday’s low. But, today was climactic. Therefore, there is a 75% chance of at least 2 hours of sideways to up trading that begins by the end of the 2nd hour today.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 9 points in the Globex market. It is testing the 2700 Big Round Number. The next support is the May 29 low of 2678.75 and last year’s close of 2684.75. Since a leg in a trading range usually tests major support before reversing, the Emini will probably continue down at least another 20 points within a week.<p>Since yesterday was so climactic, there is only a 25% chance of another big bear trend today. More likely, the bear channel that began with the pullback to around 2722 will evolve into a trading range today. There is a 50% chance of follow-through selling in the 1st hour or two before there is a swing up.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/Emini-parabolic-wedge-top-and-outside-down-day.png\"><img src=\"2018-6-28.png\" alt=\"Emini parabolic wedge top and outside down day\"></a><p class=\"caption\">All of the markings on my charts show reasonable stop entry setups. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex triangle at support so bottom or Final Bear Flag</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/EURUSD-Forex-triangle-at-support-so-bottom-or-Final-Bear-Flag.png\"><img loading=\"lazy\" src=\"2018-6-28-1.png\" alt=\"EURUSD Forex triangle at support so bottom or Final Bear Flag\"></a><p class=\"caption\">The EURUSD daily Forex chart has a bull body so far today. This triangle is late in a bear trend and at support. It is therefore likely either a bottom or a Final Bear Flag.<p><br>The EURUSD daily Forex chart is in a month-long trading range with a higher low and a lower high. It is therefore a triangle. A triangle late in a bear trend is usually the Final Bear Flag. This means that it is a reversal pattern, or the bear breakout will soon reverse up. If there is a bear breakout, the selloff might fall for a 300 pip measured move down. More likely, there would be a reversal up within 200 pips because the chart is at major support.<p>The bears have a 30% chance that the triangle is a pause in a bear trend that will fall another 1,000 pips over the next year. However, if the bulls get several consecutive bull trend days at some point in the next couple of weeks, the month-long trading range will probably continue for at least another month. This is what is likely.<p>The bulls want a strong reversal up to above the June 14 high. That is the neck line of the May 29 and June 21 double bottom. They have a 30% chance that there will be a breakout and then a 300 pip measured move up to the March 1 low.<p>The bulls would like tomorrow to close above the open of the week. The week would then have a bull body after last week’s buy signal bar on the weekly chart. But, it will still be a weak buy entry bar on the weekly chart. That means that sideways will be more likely than either much up or down next week.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute chart reversed up 70 pips overnight from another test of the November 7 low. Because the 2 day selloff was strong, the rally will probably not go straight up to Tuesday’s high. However, the odds favor sideways to up for today and tomorrow.<p>The bears should not have allowed this reversal up from support. It reduces the chance of a bear trend today. Because the overnight rally was not very strong, the bull trend will probably evolve into a trading range today. The bears will sell reversals down from new highs. Additionally, the bulls will buy 20 – 30 pip selloffs and try to get the day to close near its high. Today would then be a buy signal bar on the daily chart.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/Emini-consecutive-parabolic-wedges-and-complex-tops.png\"><img loading=\"lazy\" src=\"2018-6-28-2.png\" alt=\"Emini consecutive parabolic wedges and complex tops\"></a><p class=\"caption\">All of the markings on my charts show reasonable stop entry setups. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>The Emini formed a micro double bottom with Monday’s low. Since today closed near its high, it is a buy signal bar on the daily chart for tomorrow. In addition, there is seasonal bullishness through July 5.<p>But, the month-long bear channel is tight and the past 4 days are in a tight trading range. This reduces the chance of a big bull trend day tomorrow.<p>Tomorrow is the last day of the month. The month is currently around the open of the month. It is therefore a doji bar on the monthly chart. The open of the month will therefore be a magnet at the end of the day tomorrow.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-6-28"
    }
  ],
  "29": [
    {
      "data": [
        "<article class=\"post-79083 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini bear leg in trading range after weak June wedge topEmini weekend update: June 30, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini bear leg in trading range after weak June wedge top<br>Emini weekend update: June 30, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-06-29T08:45:07-07:00\">June 29, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Lower high and doji bar in bull flag</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/Emini-monthly-candles-stick-chart-has-lower-high.png\"><img loading=\"lazy\" src=\"2018-6-29.png\" alt=\"Emini monthly candlestick chart has lower high\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart in June was a doji bar. It is therefore a neutral bar and a low probability sell signal bar for July. The bull flag now has 5 bars.<p>The monthly S&amp;P500 Emini futures candlestick chart has been forming a bull flag for 5 months after a buy climax in a strong bull trend. The bulls hoped that the past 3 months was a resumption of the bull trend. However, April was a doji and therefore a weak buy signal bar. While May was a bull bar, it had a tail on top and it did not close above April’s high. Finally, June was a doji, which is weak follow-through buying. Hence, the 3 month reversal looks more like a bull leg in a small trading range than a resumption of a bull trend.<p>Since June closed near its open, it is a neutral bar. Because it closed below its midpoint, it is a sell signal bar for July. However, a doji bar is a low probability sell signal, especially in a strong bull trend.<p>But, the 15 month buy climax on the monthly chart was the most extreme in the 100 year history of the stock market. Therefore, the pullback could last several more bars. For example, the monthly chart has been above its 20 month EMA for over 2 years. Since this is an unusually long time, June might be the start of a 2nd leg down to test the 20 month EMA. If so, the bull flag could continue for several more months.<br><h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Weak selloff from wedge rally and double top</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/Emini-weekly-candlestick-chart-has-wedge-top-and-double-top.png\"><img loading=\"lazy\" src=\"2018-6-29-1.png\" alt=\"Emini weekly candlestick chart has wedge top and double top\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart formed a double top 3 weeks ago with the March lower high. In addition, the rally since April had 3 legs up and is therefore a wedge. However, the reversal down so far has been weak. This week was a bear bar this week, but it closed far above its low. Also, the 3 week selloff does not yet have consecutive big bear bars closing near their lows.<p>January ended the most extreme buy climax on the weekly chart in the 100 year history of the stock market. Since the pullback on the weekly S&amp;P500 Emini futures candlestick chart has lasted about 20 weeks, it is more accurate to refer to it as a trading range instead of a bull flag. Once a pullback lasts 20 or more bars, the chart has become close to neutral. While the odds ultimately favor a rally to a new all-time high, there is now a 40% chance of a bear break below the trading range before a new high.<h4>Trading range always means both a bull and bear trend</h4><p>When the Emini is in a trading range in a bull trend, it is always also in a bull trend and a bear trend. The past 2 weeks sold off from a wedge rally to a double top with the March high. This is therefore the early stage of a bear trend. If the selloff continues down for a 300 point measured move below the neck line of the double top, traders will say that the bear trend began in January or with the May lower high.<p>On the other hand, if the Emini fails to break below the 5 month trading range before making a new high, the bulls will say that the bull trend resumed with the April low test of the February low.<p>Trading ranges have at least 2 legs up and 2 legs down. They often have many more. Since markets have inertia, the resist change. Therefore, most breakout attempts fail and reverse, and the trading range continues to add more bars. One of my many rules is that there is no breakout until there is a breakout. A successful breakout usually has at least 2 consecutive big trend bars closing beyond the range. Anything less is more likely to reverse than to grow into a trend.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Emini bear leg in trading range after weak June wedge top</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/Emini-daily-candlestick-chart-has-Low-2-bear-flag-and-micro-double-bottom.png\"><img loading=\"lazy\" src=\"2018-6-29-2.png\" alt=\"Emini daily candlestick chart has Low 2 bear flag and micro double bottom\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart formed a micro double bottom this week in a 3 month broad bull channel. Today created a Low 2 bear flag (a micro double top) just below the 20 week EMA.<p>The daily S&amp;P500 Emini futures candlestick chart has been in a trading range for 5 months. This week had a small reversal up from a 4 day double bottom. But Friday was the entry bar for the bulls and it was a bear reversal bar. Hence, Friday became a Low 2 sell signal bar for next week.<p>The bear flag is below the EMA and in a bear leg. Therefore, the odds are that Monday will trade below Friday’s low and trigger the sell signal. There is also the magnet at the May 29 higher low. The odds are that the Emini will trade below that low within a couple of weeks.<p>However, the daily chart is a trading range and not a bear trend. Consequently, there will probably be more buyers than sellers not far below the May 29 low. That will probably limit the selloff from below Friday’s small bear flag to just a few days. There will likely be a reversal up from below May 29 low. The bulls will then have a 2 – 3 week rally. There is no sign yet that the 5 month trading range is about to end.<h4>80% Rule and market inertia</h4><p>The bulls want a break above the March and May double top. However, a wedge top usually has a 2nd leg down. Therefore, it is more likely that any rally over the next couple of weeks will turn down from a lower high. The bears will see that as a lower high major trend reversal. However, the reversal down will probably be minor and lead to more trading range, not a bear trend.<p>Trading ranges are constantly forming tops and bottoms. My 80% rule says that 80% of breakout attempts in a trading range will fail. Consequently, it is better to look for reversals than breakouts. When there is a clear, strong breakout above or below the range, traders will once again be willing to hold onto positions for more than a few weeks.<p>The 2nd half of my 80% rule is that trends also have inertia. That means that 80% of trend reversal attempts will fail. It is therefore better to expect a reversal to fail and for the trend to resume.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-6-29"
    },
    {
      "data": [
        "<article class=\"post-79079 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini micro double bottom but minor trend reversalIntraday market update: June 29, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini micro double bottom but minor trend reversal<br>Intraday market update: June 29, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-06-29T06:20:04-07:00\">June 29, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini micro double bottom but minor trend reversal</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>After Wednesday’s sell climax, yesterday was bull trend day. The bulls see it as a buy signal bar on the daily chart for a double bottom with Monday’s low. Their minimum goal is a test of Wednesday’s sell climax high.<p>But, the month-long bear channel is tight. Therefore, the reversal up will probably not go straight up to 2800. In addition, the 3 week selloff followed a 3 month wedge rally. A selloff from a wedge typically has at least 2 legs sideways to down. Hence, if the bulls get a 1 – 2 week rally, the odds are that it will form a lower high and lead to at least a 1 – 2 week 2nd leg sideways to down.<p>The bears want any reversal up to be a pullback in the month-long bear swing. However, after a 4 day micro double bottom and a decent bull day yesterday, the odds are against a strong bear day today. This means that today will probably be sideways or up.<h4>Weekly and monthly support and resistance</h4><p>Today is Friday so weekly support and resistance are important. The week so far is a bear trend bar on the weekly chart. The bears want the week to close on its low, which is more than 20 points below yesterday’s close.<p>However, the bulls always want the opposite. They would like the week to close above the open. But, that is about 20 points above yesterday’s close. It therefore might be too far to reach today. Consequently, weekly targets might be unimportant today.<p>Today is the last trading day of the month. Therefore monthly support and resistance are important. Yesterday’s rally got back to the June open. The month is now a perfect doji bar. The June open will be a magnet today. The bulls want the month to close above the open so that the month will be a bull candle stick on the monthly chart. The bears want a bear body and a close below the open.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 9 points on the Globex chart. Today might therefore gap above yesterday’s high. If the gap is small, it will probably close within the 1st hour. By going above yesterday’s high, the Emini would trigger a buy signal on the daily chart. But, the Emini has been in a tight range for 4 days after a strong selloff. This reduces the chance of a big bull day today.<p>In addition, after yesterday’s buy climax, the odds favor at least a couple hours of sideways to down trading that begins within the 1st 2 hours. Yesterday’s late selloff might be the start of the trading range.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/Emini-consecutive-parabolic-wedges-and-complex-tops.png\"><img src=\"2018-6-29.png\" alt=\"Emini consecutive parabolic wedges and complex tops\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<h2>EURUSD Forex market turning up from bottom of triangle</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/EURUSD-Forex-triangle-bottom-after-parabolic-wedge-sell-climaxes.png\"><img loading=\"lazy\" src=\"2018-6-29-1.png\" alt=\"EURUSD Forex triangle bottom after parabolic wedge sell climaxes\"></a><p class=\"caption\">The EURUSD daily Forex chart is turning up from the bottom of a triangle at the support of the November 7 low.<p><br>The EURUSD daily Forex chart is turning up from a triangle bottom after a 2 month sell climax. Last week was a buy signal bar on the weekly chart (not shown). This week triggered the buy signal by going above last week’s high of 1.1677.<p>The 2 day rally is now within 20 pips of that high. It would be a sign of bullish strength if the bulls can close the week above last week’s high. If they succeed, the week will also close above the open of the week at 1.1665. This would be the 1st consecutive bull bars on the week chart since early February. It would therefore represent a bullish change in the market’s behavior and reduce the chances of a successful breakout below the triangle within the next few weeks.<p>In addition, it increases the chance of a further rally. Yesterday’s low formed a double bottom with last week’s low. The neckline is this week’s high of 1.1721. The bulls want a breakout above that and then a measured move up. If they get their measured move, they would have a test of the June 14 sell climax high. They then would hope for a 300 pip measured move up to the March 1 low.<p>That is the breakout point for the 3 month bear trend. Will they achieve all of their goals? They have a 30% chance of achieving all of these goals over the next 6 months. More likely, any rally will stall around the June 14 sell climax high.<h4>Until there is a clear breakout, there is no breakout</h4><p>Trading ranges resist breaking out of the top or bottom. The past 2 days have been reversing up from the bottom. A bull leg in the 2 month trading range is more likely than a reversal into a bull trend. However, the 2 day rally reduces the chances of a bear breakout.<p>Even if there is a breakout below the triangle, there is only a 30% chance of a 300 pip measured move down. Therefore, the odds are that the daily chart will continue in its trading range for at least another month.<p>Traders expect the legs up and down to continue to last 1 – 2 weeks. The 2 day rally is the start of a bull leg. If there is a bull leg, it will more likely lead to a 1 – 2 week sideways to down leg if the rally reaches the top of the 2 month range.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart had an 80 pip bull breakout late in the Asian session. It has been in a 40 pip range since. Because this week’s open and last week’s high are magnets above, the odds are that the bulls will try to get a weekly close above both today. They therefore will buy 10 – 30 pip dips, looking for rallies back up to around 1.1670.<p>The bears want the opposite, and they will sell reversals down from that level for 10 pips scalps. After a strong 2 day rally, the bears will probably not be able to get a bear trend today.<p>The bulls already have a very big range on the daily chart. In addition, they have already achieved their goal of getting back to near last week’s high. Finally, the 2 day rally is now at the resistance of the 20 day EMA. All of this makes a big rally from here unlikely today. Therefore, there will be a bullish bias today, but probably not a big rally from here.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/06/Emini-bear-trend-reversal-day.png\"><img loading=\"lazy\" src=\"2018-6-29-2.png\" alt=\"Emini bear trend reversal day\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I sometimes also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not in a position at the moment, these entries would be logical times for him to enter.<p><br>The Emini triggered a buy signal by going above yesterday’s high. But, the opening rally stalled at the open of the week. The Emini then entered a trading range. The late selloff turned the day into a bear reversal day. It is therefore a Low 2 sell signal bar on the daily chart for next week. However, there is a 5 day tight trading range and therefore more sideways is likely.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-6-29- 1"
    }
  ]
}