{
  "1": [
    {
      "data": [
        "<article class=\"post-73874 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Trump Emini rally continuing in 2018, but more volatile Emini weekend update: January 1, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Trump Emini rally continuing in 2018, but more volatile<br>Emini weekend update: January 1, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-01-01T06:00:50-08:00\">January 1, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Unprecedented rally</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/01/m-1.png\"><img loading=\"lazy\" src=\"2018-1-1.png\" alt=\"Emini strong bull trend but losing momentum before congress votes on government shutdown\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has gone for an entire year with every low above the low of the prior month. December, in fact, is the 14th month in the streak. This month had a small bull body. This is a sign of loss of momentum.<p>The S&amp;P500 cash index’s monthly candlestick chart ended 2017 without a pullback. This is only the 2nd time in the 95 year history of the S&amp;P500 cash index that this has happened. The other time was 1995. That streak lasted 13 months, and it was much longer than any prior streak. At 15 months, the current streak is therefore the longest in history. January of 1996 traded below the December 1995 low, ending the streak. After a 1 month, 4.6% pullback, the rally that followed over the next 5 years tripled the value of the stock market.<p>Markets have memory. Since the last streak was similar in duration and pulled back in January, there is an increased chance of this January falling below the December low. Furthermore, when historical extremes are exceeded, the new extreme is usually not much greater. Therefore, the odds are that the current streak will end soon. Finally, December had a smaller body than the past 3 months. This loss of momentum increases the chance of a pullback in January.<h4>A long micro channel is a buy climax</h4><p>While a micro channel lasting more than 10 bars is unsustainable and therefore climactic, it is also a sign of very strong bulls. Consequently, the bulls will be eager to buy once they finally get a chance to buy below the low of the prior month. Hence, when the pullback comes, it will probably last only 1 – 3 months before the bull trend resumes.<p>Because a protracted micro channel is a buy climax, the bulls become exhausted. Hence, the trend resumption that follows is often brief. This means that there is at least a 50% chance that the rally after the pullback will last about 5 months. The next pullback will probably last longer and be deeper than the upcoming 1st pullback.<h4>Minor stock market correction over the next several months</h4><p>There is only a 20% chance of a 20% correction without at least a micro double top first. This means that the bears usually need a pullback and then a test of the old high before they can take control. This would take at least 3 months, and usually more. Even then, the odds are that the correction would still only be 5 – 10%.<p>When a bull channel is as tight as this one has been for more than a year, the 1st correction, even after a micro double top, will probably form another bull flag. Therefore, bulls will keep buying reversals over the next 6 months. This will therefore limit the downside in the 1st half of the year.<h4>2018 will be more volatile, but still bullish</h4><p>Because buy climaxes exhaust the bulls, the market often enters a tight trading range for 5 – 10 bars. As a result, 2018 will probably be more volatile. The pullbacks will come more often, last longer, and be deeper. However, the odds of a reversal into a bear trend in 2018 are small.<p>For a major trend reversal, the bears will need a strong minor reversal down, and then a rally to around the old high. That process typically takes at least 10 bars, which means a year. Only rarely the bears can get a huge reversal without a clear top.<p>Alternatively, they can get an Endless Pullback. This is a minor pullback that keeps adding bars. After 10 – 20 bars, the bears then have a 40% chance of a bear break below the bull flag. Consequently, the bears will need a year or more before they can take control. Any selloff before then will probably be minor. A minor reversal is one that becomes either a bull flag or a bear leg in a trading range, and not a bear trend.<h4>Volatility Index</h4><p>The VIX, which is the volatility index, spent most of 2017 around 10. This is unusually low, and it means that there has been very little volatility. Volatility simply is a measure of the size of the swings up and down. Because there has not even been a single 3% pullback in 2017, a trader does not have to look at the VIX to know that the volatility is low. Looking at the monthly chart immediately tells him that there is little volatility. Because the Emini will begin to have pullbacks in 2018, especially after the 1st quarter, the VIX will probably hover closer to 13 in 2018.<br><h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Bull breakout above bull channel usually fails</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/01/w-1.png\"><img loading=\"lazy\" src=\"2018-1-1-1.png\" alt=\"Emini micro double top in buy climax before Congress votes on budget resolution and government shut down\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart has been above the top of an 8 year bull channel (see monthly chart) for the past 4 weeks. In addition, it has not touched the 20 week exponential moving average in 59 weeks. However, this week traded below last week’s low. Last week was a bear bar and a higher high double top with the high of 4 weeks ago. This therefore could be the start of a pullback to the moving average.<p>The weekly S&amp;P500 cash index’s candlestick chart has never been this overbought in the 95 year history of the S&amp;P. The cash index stayed above its 20 week EMA for 62 weeks in 1995 and 1996. However, the pullback began at the 55th week, and the index went sideways for 6 months. There was no Emini back then since it was created in 1997. Since is tightly mirrors the cash index, it is reasonable to look at the cash index for historical patterns.<p>The current streak is 59 weeks, and there is no convincing pullback yet. While last week traded below the prior week’s low and both weeks had bear bodies, the bodies are small. The bears need 3 – 5 small bodies or 1 – 2 big bodies to convince traders that the pullback has begun. Because the current price is far above the average, a selloff will likely take several weeks to get down to the average. Consequently, the odds are that this streak will surpass the earlier one in the cash index.<h4>Upcoming 20 Gap Bar buy signal</h4><p>The bulls have been so eager to buy that they have been willing to pay above the average price for more than a year. There is a gap below the low of ever bar and the moving average. This makes all of these bars “Gap Bars.” When a market stays above its 20 bar EMA for 20 or more bars, it creates a 20 Gap Bar buy setup. This means that the bulls typically buy at the EMA. They will likely do so when they get a chance within the next few months.<p>When a market stays above its average for 40 – 50 bars, it is usually exhausted. Consequently, the bulls often will not immediately buy at the moving average. They often wait 10 or more bars before buying aggressively again. As a result, the first pullback might last 2 – 3 months.<h4>Bull breakout above 9 year bull channel</h4><p>Because the bull channel is tight on the weekly chart, the odds are that the 1st reversal down will be minor. This means that it will either form a bull flag or a bear leg in a trading range. If the selloff lasts a few months and falls 100 or more points, a trading range will be more likely.<p>There is a 70% chance that a bull breakout above a<em>broad</em>bull channel will fail within about 5 bars. While the current channel has lasted 9 years, it is not broad. Consequently, the odds are against a reversal down to the bottom of the channel over the next year. Yet, the top of the channel is resistance. Therefore, the rally will probably begin to pause.<h4>Why buy if a reversal is likely soon?</h4><p>Since the weekly chart is at resistance, the odds favor a sideways to down pullback beginning in the next month or so. However, many bulls will keep buying as the rally continues, despite the buy climax. They hope that the market keeps going up so that they can make an immediate profit. However, they know that the yearlong bull channel is tight. Consequently, the reversal has an 80% chance of forming either a bull flag or a bear leg in a trading range. In either case, if they manage their trade well and are willing to scale in, they have an 80% chance of making money, or of at least avoiding a loss.<p>A bull flag means that the bull trend will resume within 10 bars or so. A bear leg in a trading range means that the 1st selloff will be the start of a trading range. A trading range has legs up and down. Therefore, the 1st selloff will lead to a rally back up to the high. This will allow bulls who bought at the top to avoid a loss. If they bought more during the selloff and exited at the high, they could get out breakeven on their 1st buy and with a profit on their lower buy. As a result, there is not much risk of an experience trader losing money even if be buys at the top of this rally.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Trump Emini rally continuing in 2018, but more volatile</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/01/d.png\"><img loading=\"lazy\" src=\"2018-1-1-2.png\" alt=\"Emini parabolic wedge top and possible January effect\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart is in a strong bull trend. Because the wedge top does not have a good shape, the probability of a reversal is less. Friday was a bear breakout, but the body was not very big and the bar had a prominent tail below.<p>The daily S&amp;P500 Emini futures candlestick chart is in a strong bull trend. The size and number of bear bars increased in December. This is a sign of selling pressure and it increases the chances of a pullback. Friday was a bear reversal bar, but is was not very big and it closed above its low. While it might be the start of a 3 – 10% correction, the bears need to do more. If the bears get consecutive big bear bars or 3 – 5 consecutive average bear bars, traders will be more willing to sell.<p>All pullbacks in 2017 in the Emini and the cash index have been less than 3%. As of Friday, the last trading day in 2017, there have been 423 calendar days and 289 trading days since the last 3% correction. This is by far the longest streak in the 94 year history of the S&amp;P500 stock index. Consequently, there is a 70% chance of a 3% correction within the next few months.<h4>Does a correction need a catalyst?</h4><p>The market often has a catalyst that leads to or coincides with the start of a pullback. Sometimes it clearly causes the pullback. It frequently is impossible to tell if it is simply a coincidence in an overbought market that was likely to pullback. If a pullback is 5% or more, traders correctly conclude that the catalyst was not enough of a reason for the selloff. Instead, traders were simply taking profits in an overbought market.<p>The January 19 congressional vote on the budget is the next obvious candidate. However, any unexpected event can be a catalyst as well. In addition, many selloffs begin without a clear catalyst. Furthermore, they often begin with good news. Consequently, even if the budget vote leads to a strong 1 – 2 day rally, the bulls might use it as an excuse to take profits.<h4>Seasonal tendencies are mostly coincidences</h4><p>Throw a deck of card up in the air, and then find the ones that land face up. Throw those up again, and again repeat the process until there is only one card that lands face up. Let’s say it took 7 tries, and the final face up card was the 4 of hearts. You might then conclude that there is maybe a 90% chance that the 4 of hearts will always be the final card. Or, with a little thought, you might conclude that the 4 of hearts has only one chance in 52 of being the final card if you keep repeating the game.<p>I bring this up because there are countless similar games that you can play as a trader. If October 16 is higher than the day before or the month before or 3 months before in 18 of the past 20 years, is there really something special about October 16, or is it the 4 of hearts?<h4>Geese don’t lay Golden Eggs</h4><p>Sometimes mathematical things seem perfectly simple and clear, but are often much more complex. Just think about this for a moment. If there was a Golden Goose laying golden eggs, how long would it be before institutions discovered they are constantly giving you money? Not long. Consequently, the majority of even the best calendar trades are difficult to trade profitably. Why does Buffet buy and hold for years? It’s because he knows that timing in and out based on calendar tendencies is a losing strategy.<p>Everyone knows the math behind “Sell in May and Go Away.” The math is clear (not really). If a trader buys in the middle of October and exits all of his positions in early May, he will make more money than if he held for years. At least, that is the theory. In fact, when researchers consider many variables, they conclude that buy and hold is a better strategy. Therefore, even the best, most revered, most discussed calendar trade is a fraud.<h4>List of January tendencies… for entertainment only!</h4><p>I want to begin by saying I do not believe in calendar trades. I would never trade any of the tendencies below. However, as a trader, it’s fun to know they exist. Knowing some secret handshakes like these can make you feel more like one of the guys or gals on Wall St.<p>Since 1927, there has been a 68% chance that the close of December 31 of any year will be higher than the close of the prior December 31, and a 32% chance of it being lower. Remember, the stock market has been in a bull trend on the yearly chart for centuries, which means that the odds favor the bulls.<br>January, like most months, is usually up, and it is up 65% of the time. The January tendency to rally after yearend tax selling is called the “January Effect.”<br>In any 5 day period, there is a 56% chance of the market being up.<br>The last 5 days of the year have a 77% chance of being up, and 10 times more gain than the average 5 day period.<br>If the 1st 5 days of January are up, January is up 76% of the time. However, all months are up 65% of the time. This therefore is only a small improvement.<br>When the first 5 days are negative, January is down 60% of the time, instead of only 35%. This is called the “January Barometer.”<br>If January is up, the year is up 82% of the time, and the average gain from February to December is 8.5%.<br>When January is down, the average gain from February to December is only 1.7%, and the year has a 58% chance of being down, instead of the usual 32%.<br>If January is down 6%, then the entire year is down 5%. As a result, the rest of year is up only 1%, so the gain is small.<br>In January over the past 90 years, small cap stocks are up 4% and large caps are up only 1.5%. It is better to focus on small caps.<br>In Election years, even if only congressional elections, most of the gains occur in the final 12 weeks, starting in mid-September, and most of the year is usually a trading range.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-1-1"
    }
  ],
  "6": [
    {
      "data": [
        "<article class=\"post-74024 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Trump corporate tax cut rally might be January barometer  Emini weekend update: January 6, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Trump corporate tax cut rally might be January barometer<br>Emini weekend update: January 6, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-01-06T00:30:09-08:00\">January 6, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Strong bull trend</h2><div class=\"wp-block-image\"><figure class=\"aligncenter\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/01/m-2.png\"><img loading=\"lazy\" src=\"2018-1-6.png\" alt=\"Monthly Emini trump tax cut rally continuing\"></a></figure></div><p class=\"caption\">For the past 14 months, every bar on the monthly S&amp;P500 Emini futures candlestick chart had a low above the low of the prior month. This is a very strong bull trend, but unsustainable and therefore climactic.<p>A bull micro channel is a series of bars where every low is at or above the low of the prior bar. This means that the trend does not have a pullback. The monthly S&amp;P500 Emini futures candlestick chart now has a 15 bar bull micro channel. There has never been one this long in the 95 year history of the S&amp;P cash index. Because this has never happened before, it is unsustainable and therefore climactic. Yet, a climax can extend for far more bars than what traders think is possible. Until there is a top, there is no top, and the odds continue to favor higher prices.<p>Because the bulls have been so eager to buy, they will be happy to finally have a chance to buy a pullback. Consequently, there are bulls looking to buy below last month’s low. In addition, the bears do not want to sell with stops below the low of the prior bar because they cannot even make money selling will limit orders above the high of the prior bar. As a result, the 1st time there is a pullback, it will probably be small and only last 1 – 3 months.<p>Even if it lasts 6 months and falls 20%, the bulls will still buy it. The selloff will therefore still be minor, although big. The odds would still favor a test back up to the high before the bears would have a reasonable chance of creating a bear trend.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Big bull breakout</h2><div class=\"wp-block-image\"><figure class=\"aligncenter\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/01/w-2.png\"><img loading=\"lazy\" src=\"2018-1-6-1.png\" alt=\"Emini weekly chart has parabolic wedge nested within monthly chart's parabolic wedge\"></a></figure></div><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart had a big bull trend bar this week. However, it is in a parabolic wedge rally since the August low.<p>The weekly S&amp;P500 Emini futures candlestick chart had a big bull trend bar this week. But, it was the biggest bull bar late in a bull trend. It is therefore more likely an exhaustive move than the start of a stronger leg up. Most exhaustion bars lead to a pause in the trend and not a reversal into an opposite trend. It was a big enough bar so traders expect slightly higher prices. Yet, the rally should stall within 1 – 3 weeks. There is often a pause bar and then one more climax bar before there is a 5 – 10 bar pullback.<p>This week is also the 3rd leg up in a tight bull channel that began in August. The rally is therefore a parabolic wedge top. This makes about a 10 bar, 2 legged pullback likely to begin within a few weeks. Because the bull channel is tight with no big bear bars, the odds are that the pullback will be a bull flag. By a bull flag, I mean that the bull trend will be more likely to resume up than reverse down.<p>Less likely, the pullback will keep growing. If it lasts 20 bars, there would be a 40% chance of a bear break below the bull flag, and then a measured move down. Without that, there is a 70% chance that the 1st reversal down will lead to a new high. This is true even if the selloff is 10% and lasts 3 months.<h4>What does a blow-off top look like?</h4><div class=\"wp-block-image\"><figure class=\"aligncenter\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/01/QCOM.png\"><img loading=\"lazy\" src=\"2018-1-6-2.png\" alt=\"QCOM blow-off top in tech wreck of 2000\"></a></figure></div><p class=\"caption\">In 2000, many tech stocks rallied in parabolic wedge tops. These blow-off tops led to huge corrections. This weekly chart of QCOM is an example. The Emini will NOT fall this far. However, the chart shows the components of a blow-off top. There is a parabolic rally, a sudden, big reversal, a trading range, and then a 2nd, weaker leg down, but it can last a long time.<p>With the weekly chart of the Emini forming a parabolic wedge rally and a likely final buy climax, this is a good time to talk about blow-off tops. The Emini weekly chart looks like it might form a blow-off top. However, because the monthly chart is in a protracted bull micro channel, the reversal down on the weekly chart will be minor. It could quickly correct 5 – 10%, but the bulls will buy the selloff, unlike in the QCOM example above.<p>The Emini will likely have a relatively sharp initial selloff, followed by a trading range, and then a 2nd leg down. However, the entire reversal will probably last only 2 – 3 months and not fall more than about 5%. The odds are that the bulls will buy the selloff and the Emini will be at a new all-time high within a few months.<h4>Why do blow-off tops form?</h4><p>These tops form because the weak bears who have been shorting repeatedly, believing the rally cannot go much higher, finally give up. They buy back their shorts at the market and don’t care that their loss will be huge. They cannot take the pain any longer.<p>The weak bulls who have been waiting for a pullback are afraid that one will never come. As the Emini accelerates up, they buy. This is a FOMO (Fear Of Missing Out) rally. With both the weak bulls and weak bears buying out of fear the market might go a lot higher, the market accelerates up.<p>At some point, the strong bulls are very happy about their sudden extreme profit. They use the rally to exit their longs that they bought from much lower. The strong bears know that a blow-off top and reversal are likely. They sell when the rally is at its most extreme. These are strong bears. They will never give up. In fact, they will sell more if the rally continues because they know the odds of a correction are high.<p>The strong bull bought months ago. When they exit, they are not looking to buy a few days later. They know that blow-off tops can lead to deep corrections. Consequently, they wait for the correction to have 10 or more bars and at least 2 legs down. If the selloff does not look strong, the strong bulls will buy again, the strong bears will take profits on their shorts, and the rally will resume.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Trump corporate tax cut rally might be January barometer</h2><div class=\"wp-block-image\"><figure class=\"aligncenter\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/01/d-1.png\"><img loading=\"lazy\" src=\"2018-1-6-3.png\" alt=\"Daily emini canldestick chart has possibly blow of top buy climax.\"></a></figure></div><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart has rallied strongly this week. It is testing the top of a wedge bull channel that began with the November 30 high, and the top of channel that began in August.<p>The daily S&amp;P500 Emini futures candlestick chart is accelerating up to the top of a 3 month bull channel. While this rally is climactic, there is no top yet. The bears usually need at least a micro double top before they can get a 2 – 3 week reversal. Consequently, the best they probably can get over the next few days is a trading range.<p>On January 19, Congress votes on the budget. If they fail to pass or extend the budget, the government will run out of money. This would cause a sharp selloff. If they pass the budget, the Emini still might sell off because traders have such big profits that they might use the budget vote as an excuse to take profits. For example, if there is a 30 point rally after the budget vote, many bulls will think about taking profits.<p>Once the bulls who bought months ago decide to take profits, they are not going to look to buy again 3 days later. Instead, they will wait for at least 10 bars and 2 legs sideways to down. They would want to see how strong the bears will be. If the bears are unable to get a strong reversal within a few weeks, the bulls will buy again, expecting a new high.<h2>Buy climaxes on the daily, weekly, and monthly charts</h2><p>The Emini has been in existence for 20 years. There have never been buy climaxes this extreme on the daily, weekly, and monthly charts. Traders therefore need to look at the S&amp;P500 cash index for comparisons.<p class=\"has-background has-luminous-vivid-amber-background-color\">The S&amp;P500 was created in 1923, and the current buy climaxes are the most extreme in its history.&nbsp;The Dow Jones index started in 1896, and there have never been buy climaxes that are this extreme.<p>The monthly S&amp;P500 cash index’s 15 bar bull micro channel is the longest in history. The 2nd longest was 13 months in 1995 and 1996.<p>The weekly chart has not touched its 20 week exponential moving average in 60 weeks. It got to within 2 ticks in August. The longest streak in history was 62 weeks in 1995 and 1996. Since the Emini and cash index are now far above their averages, it will take several weeks to get down to the averages.<p>In 1996, the top was at the 55th week and it took 7 weeks for the market to go sideways to down to the average. Consequently, the current streak will last longer. It is already the longest without the start of a pullback (remember, the 1996 pullback began at 55 weeks).<p>The daily chart has not had a 3% pullback in 430 calendar days and 296 trading days. This is by far the longest stretch in history.<p>While the stock market can continue to do something it has never done before, it probably cannot get much more extreme. Therefore, the odds favor at least a 100 point or 5% correction beginning within the next couple of months. The pullback in 1996 was 4.6%. This one will likely be similar.<h2>January barometer</h2><p>Every January, TV pundits like to talk about how the behavior in January, especially in early January, can predict how the year will end. I gave a<a href=\"https://www.brookstradingcourse.com/analysis/trump-emini-rally-continuing-2018-more-volatile/\" target=\"_blank\" rel=\"noopener noreferrer\">list of these tendencies at the bottom of last weekend’s update</a>. I believe they are useless to traders and are only for entertainment.<hr class=\"wp-block-separator\"><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener noreferrer\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noopener noreferrer\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener noreferrer\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noopener noreferrer\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2018-1-6"
    }
  ],
  "20": [
    {
      "data": [
        "<article class=\"post-74591 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini forming blow-off top leading to giving back 2018 gainsEmini weekend update: January 20, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini forming blow-off top leading to giving back 2018 gains<br>Emini weekend update: January 20, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-01-20T00:30:18-08:00\">January 20, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Emini forming blow-off top leading to giving back 2018 gains</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/01/m-3.png\"><img loading=\"lazy\" src=\"2018-1-20.png\" alt=\"Emini blowoff top before government shutdown vote\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart this month so far is a big bull trend bar in a parabolic wedge bull trend.<p>The monthly S&amp;P500 Emini futures candlestick chart has not had a pullback since November 2016. This means the current rally is a 15 bar bull micro channel. That has never happened in the history of the S&amp;P500 or the Dow Jones Industrial Index. It is therefore extreme, which means unsustainable and climactic. While this makes a pullback likely within the next few months, the micro channel represents extremely eager bulls. Consequently, the bulls will buy below the low of the prior month once they finally get an opportunity.<p>The result will be a brief pullback, lasting 1 – 3 months. Furthermore, the bars on the monthly chart are about 100 points tall. Therefore, when the market finally pulls back below the prior month’s low, the selloff will be 100 – 150 points below the high. Hence, it will be about a 5% correction.<h4>Stock market in blow-off top</h4><p>Since the micro channel is extreme and the rally is now accelerating up in a parabolic curve, it is a blow-off top. A top does not mean that the Emini will reverse into a bear trend. Instead, it means that the bulls are exhausted. Once they finally take profits, they might wait as long as 5 – 10 bars before they will buy again. While this is unlikely, traders have to be aware that extreme buy climaxes often lead to a long pause before the bulls buy again.<p>While a blow-off top sometimes leads to a bear trend, the odds are against it without the Emini entering a trading range 1st. Consequently, the downside risk over the next few months is probably 5 – 10%. The odds are that the bulls will buy the 1st selloff, resulting in a test of the prior high.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Weak follow-through buying</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/01/w-3.png\"><img loading=\"lazy\" src=\"2018-1-20-1.png\" alt=\"Emini parabolic wedge buy climax before government shutdown vote\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart formed a doji bar this week after 2 big bull trend bars.<p>The weekly S&amp;P500 Emini futures candlestick chart had 2 consecutive big bull trend bars over the 2 prior weeks. Since this is the biggest pair of bull bars late in a bull trend, it probably is an exhaustive buy climax. While there is often a small 2nd leg up after an exhaustion move, there is usually not much more than that before there is a TBTL Ten Bar, Two Legged pullback.<p>This means that the odds are that the Emini will begin to pull back within a few weeks. The 1st target is the bottom of the buy climax, which is the low of 3 weeks ago. It is also around the open of the year. Consequently, the pullback will probably erase all of the January rally. However, the weekly chart is so strongly bullish that the bulls will buy the pullback. As a result, it will likely lead to a rally back up to the all-time high.<h4>An exhaustive buy climaxes usually leads to a pullback, not a bear trend</h4><p>Can an exhaustive buy climax lead to a bear trend reversal? While it is possible, it is unlikely without the bull trend 1st transitioning into a trading range. That means that the bears will probably have to stop the rally for 2 – 3 months before they have a reasonable chance of taking control.<p>The pullback usually enters a tight trading range around the final buy climax low. That is the low of 3 weeks ago. The bulls will try to form a double bottom with that low. The bears want a breakout below that low and then a measured move down based on the height of the buy climax. If the bears get their reversal, the correction will be around 10%. The odds are against this, given how strongly bullish the weekly and monthly charts are.<h4>20 week exponential moving average (EMA)</h4><p>The weekly chart has not touched its 20 week EMA in 62 weeks. It is far enough above so that the bears will probably need several weeks of selling before the pullback reaches the average price.<p>This is the longest streak in the 95 history of the S&amp;P500 index. While records are meant to be broken, they usually do not get broken by much. The current record of 62 weeks was in 1995, and the pullback began with the 57th week. While there is no top yet, the odds are against this rally continuing much longer before touching the 20 week EMA. The average is about 150 points below, but it is rising rapidly. Therefore a selloff of 100 – 120 points over three weeks would probably finally reach the average.<h4>20 Gap Bar buy setup</h4><p>For the pasts 62 weeks, there has been a gap between the low of every bar and the moving average. When 20 bars have gaps and the pullback finally reaches the moving average, this is a 20 Gap Bar buy setup.<p>The bulls have been so eager to buy that they have been willing to pay an above average price for more than a year. Consequently, they will probably be happy to buy at the average price once they get a chance.<p>When the price stays above its average for 50 or more bars, the bulls often wait for the pullback to stabilize at the EMA before they will buy again. They want to be sure that the climax will not lead to a 10 – 20% correction. They know that when the buy climax is unusually extreme, the pullback can be deeper and last longer than it typically does. Consequently, the selloff might have to fall 20 – 50 points below the average price before the bulls buy again.<br><h2>Daily S&amp;P500 Emini futures candlestick chart:<br>SUMMARY</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/01/d-2.png\"><img loading=\"lazy\" src=\"2018-1-20-2.png\" alt=\"emini buy climax without 3% or 5% correction in over 1 year\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart has formed a 4 day tight trading range after an extreme rally.<p>The daily S&amp;P500 Emini futures candlestick chart’s strong rally is losing momentum. However, there is no clear top yet. The bears have a micro double top, but no reversal down. They will need consecutive big bear bars before traders begin to believe that a correction has begun. Without that, the odds continue to favor at least slightly higher prices indefinitely.<p>The daily chart has not had a 3% correction in 444 calendar days and 299 trading days. This is by far the longest streak in history. While this can continue forever, it will not. It will probably end within the next few weeks. Furthermore, the correction will probably be at least 5% and not just 3%.<p>However, because the bull trend is so strong, the 1st selloff will probably be a minor reversal. This means that a bull flag or trading range is more likely than a bear trend. Since the weekly and monthly charts will probably fall 100 – 150 points, that would be a bear swing on the daily chart. Consequently, the selloff on the daily chart will probably be a bear leg in what will become a trading range instead of a bull flag. This is true even though the selloff will be a bull flag on the monthly chart and maybe the weekly chart as well.<h4>Possible government shutdown</h4><p>Congress will decide this weekend if they will fund the government. They can put the vote off again, pass the budget, or shut the government down. No one knows how the market will react. Everyone knows that shutting down the government will hurt consumer confidence. Therefore, it is bearish. What no one knows is whether that has already been fully discounted. If so, the Emini could even rally on Monday if there is a government shutdown. Traders simply have to wait to see what the market will do.<p>If it does rally, the rally will probably last only a week or two because of the 2 week exhaustion move on the weekly chart. If it sells off, the market will probably find support at the open of the year, which is the bottom of the 2 week exhaustion breakout.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-1-20"
    }
  ],
  "27": [
    {
      "data": [
        "<article class=\"post-74880 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini parabolic wedge buy climax ahead of Trump’s Mueller testimonyEmini weekend update: January 27, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini parabolic wedge buy climax ahead of Trump’s Mueller testimony<br>Emini weekend update: January 27, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-01-27T00:30:22-08:00\">January 27, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Blow-off top</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/01/m-4.png\"><img loading=\"lazy\" src=\"2018-1-27.png\" alt=\"Monthly Emini candle stick chart in blow-off top while Trump speaks at Davos World Economic Forum\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has the biggest bull trend bar in more than 20 bars so far this month. In addition, there has been no pullback below a prior month’s low in 14 months.<p>The monthly S&amp;P500 Emini futures candlestick chart is in a strong bull trend. This month’s low is above last month’s low. In addition, the low of every month for the past 14 months is above the low of the prior month. Hence this is a 15 bar bull micro channel. It is a sign of very confident bulls, but it is now extreme.<p>The longest prior micro channel in the history of the S&amp;P index was 13 months, in 1995. The odds are against this streak lasting much longer. However, since the bulls have been so eager to buy above the prior month’s low, they will be happy to buy below the prior month’s low once they get the opportunity.<p>Typically, the bulls will immediately buy below the low of a bar in a micro channel that lasts 5 – 10 bars. But, when one lasts longer, traders know that the risk of a violent pullback is greater. Consequently, they will hesitate, waiting to be sure that the pullback will not be a fast, deep, climatic reversal. As a result, they often wait 2 – 3 bars (here, months). Once they are confident that the pullback will not fall far and fast, they buy again. Since this bull trend is exceptionally strong, the odds are that the pullback will lead to a new all-time high within a few months.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Exhaustive buy climax</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/01/w-4.png\"><img loading=\"lazy\" src=\"2018-1-27-1.png\" alt=\"Weekly Emini candlestick chart has consecutive buy climaxes ahead of Trump's testimony before Mueller.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart got to within a point of the 20 week exponential moving average in August. However, it has not touched the EMA in 64 weeks. The consecutive big bull trend bars in early January will probably be the start of an exhaustive buy climax.<p>The weekly S&amp;P500 Emini futures candlestick chart has never gone 64 weeks without touching its 20 week exponential moving average. In fact, the cash index has never had a streak that long in its 95 year history. Furthermore, the weekly Dow Jones Industrial Index has never had a comparable streak in its 122 year history. While this streak can continue forever, it will not. In addition, since it is much longer than any prior streak, the odds are that the weekly chart will begin to turn down within the next few weeks. Since it is so far above its average price, it might take 5 or more weeks to get down to the 20 week EMA.<p>Because the bull channel is so tight, there is only a 20% chance of an immediate reversal into a bear trend. The pullback will probably be only about 5%. However, even if it is 10% and lasts several months, there is a 70% chance that it will lead to a new high within a few month of turning back up.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Emini parabolic wedge buy climax ahead of Trump’s Mueller testimony</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/01/d-3.png\"><img loading=\"lazy\" src=\"2018-1-27-2.png\" alt=\"Emini parabolic wedge buy climax ahead of Trump's Mueller testimony\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart rallied strongly in January in a series of 3 buy climaxes. Since the channel is tight, this is a parabolic wedge. The odds favor about 10 days of sideways to down trading.<p>The daily S&amp;P500 Emini futures candlestick chart has gone 399 trading days without a 5% correction. In addition, it has not had a 3% correction in 451 calendar days and 304 trading days. All 3 streaks are the longest in the 20 year history of the Emini, the 95 year history of the S&amp;P index, and the 122 year of the Dow Jones Industrial Index.<p>Markets reflect human behavior and therefore usually do not go far beyond what they have done in the past. This means that the odds favor a 5% pullback soon. However, because the weekly and monthly charts are so strongly bullish, any reversal will likely be a bull flag on those charts and not a bear trend. Yet, if the selloff lasts 3 months and falls 10%, the daily chart would probably be in a bear trend temporarily.<h4>Parabolic wedge top</h4><p>The Emini has been in a tight bull channel in January. In addition, the rally has had 3 surges. It is therefore a parabolic wedge. If the Emini begins to pull back next week, the high will be a parabolic wedge top.<p>Since the weekly and monthly charts are in tight bull channels, the bulls will quickly buy reversals. This even includes sharp reversals, like 5% in 3 days, if this were to happen.<h4>Volatility index</h4><p>The volatility index has drifted up over the past 2 weeks while the Emini keeps making new highs. This increase in volatility might be a warning that the Emini will soon begin to have 2 – 5 % pullbacks within a month or two. Furthermore, it increases the chance of a 2 – 3 day 100 point selloff. This would still be a pullback in a bull trend and not a trend reversal. It is important to understand that the word “pullback” means that the bull trend is still intact. The odds are that any selloff will lead to a new high.<p>I have made the point many times that the odds of a “trend reversal” on the weekly and monthly charts are small without those charts 1st transitioning into trading ranges. A trend reversal means that the bull trend has ended and a bear trend has begun. There is only a 20% risk of a trend reversal on the weekly and monthly charts in the next several months. Traders will buy any selloff. Consequently, a selloff will be a pullback and not a trend reversal.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-1-27"
    }
  ]
}