{
  "7": [
    {
      "data": [
        "<article class=\"post-76958 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini weak double bottom and Trump’s China trade warEmini weekend update: April 7, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weak double bottom and Trump’s China trade war<br>Emini weekend update: April 7, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-04-07T00:30:46-07:00\">April 7, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Should test below 20 month EMA around 2480</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/04/m.png\"><img loading=\"lazy\" src=\"2018-4-7.png\" alt=\"Monthly Emini chart in pullback after buy climax\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has pulled back for 3 months after an extreme buy climax. There is no bottom yet, and the 20 month exponential moving average around 2480 is a magnet below.<p>The monthly S&amp;P500 Emini futures candlestick chart has pulled back for 3 months in a strong bull trend. There were 15 consecutive months where every low was above the low of the prior month. This was the longest micro channel in the 100 year history of the stock market.<p>A micro channel is unsustainable and therefore climactic. Since this is the most extreme micro channel buy climax in history, the correction might last longer and fall deeper than what usually happens in a strong bull trend. The typical pullback after a 5 – 10 bar micro channel lasts 1 – 3 bars. Since this streak is longer, the bulls are probably more exhausted. It therefore might take them more time before they are willing to buy aggressively again.<p>I wrote last weekend that this week would trade below the March low and probably try to reverse up. It tried, but did not reverse up strongly. In addition, this week’s low is getting close to the 20 month EMA. It is close enough so that it probably cannot escape the gravitational pull of that support. Consequently, there is now at least a 50% chance of the selloff falling below the 20 month EMA. Furthermore, there is a 40% chance of the Emini falling 20% and the correction lasting 6 months.<h4>Monthly support levels</h4><p>The next support is the 20 month exponential moving average, which is currently around 2480. A test would probably fall at least 30 – 100 points below. The support below that is the start of the parabolic bull channel. That is the March 2017 low of 2321.75.<p>A strong break below that would then test the bottom of the 15 month buy climax. That is the November 2015 low of 2074.50, which is also at the top of the 2014 – 2015 trading range. There is currently only a 20% chance that this selloff will get there before resuming up to test the all-time high.<p>Finally, the bottom of that range is around 1800. While the Emini will probably test that level within 5 years, it is unlikely to get there this year.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Emini weak double bottom, but double top bear flag and Trump’s China trade war</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/04/w.png\"><img loading=\"lazy\" src=\"2018-4-7-1.png\" alt=\"The weekly Emini chart is forming a wedge bottom and a double bottom with the February low.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart reversed up modestly this week after falling below last week’s low. It is the 2nd consecutive doji bar and therefore not strongly bearish.<p>Last week was a pullback from a huge selloff from a Low 2 bear flag. However, last week was a bull doji. It was therefore a weak follow-through bar and a weak sell signal bar. This week was the entry bar below that 1 bar bear flag. Since this week had a big tail below, it was not strongly bearish. Furthermore, it closed above last week’s low, and its low was above the February low.<p>While the past 2 weeks have not been particularly good for the bears, they have not been good for the bulls either. The bulls want a double bottom with the February low. In addition, they also have a 6 bar wedge bull flag.<p>However, they need 2 consecutive strong weeks up before traders will conclude that the bull trend is resuming. Without that, the odds favor more sideways to down trading. Since the January high, the weekly chart has reversed every 2 weeks. That is trading range price action and not the look of a bull or bear trend.<p>If the Emini does not reverse up within the next couple of weeks, it will probably have another leg down. At the moment, it does not look like it is about to reverse up. Therefore, the odds favor break below the February low. The bottom of the buy climax is the November low of 2421.75 and that is the next target on the weekly chart.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Double bottom and wedge bottom, but too many big bear bars</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/04/d-1.png\"><img loading=\"lazy\" src=\"2018-4-7-2.png\" alt=\"The daily chart has been in a wedge bear channel for a month. The bulls want a reversal up from the 200 day moving average.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart is trying to reverse up from a test of the February low. This is therefore a double bottom. Furthermore, the selloff since the March 13 high is in a wedge bear channel. A bear channel is a bull flag. Finally, the bulls are trying to rally from the 200 day moving average. However, the bears want the selloff from the double top bear flag to lead to a 100 point measured move down.<p>The daily S&amp;P500 Emini futures candlestick chart is struggling to reverse up from a wedge bottom and a double bottom. In addition, it is at the support of the 200 day moving average. However, the bulls need a strong breakout above the 2 week double top. If they get a strong rally above it next week, there will be a 60% chance that the low is in. That means that the Emini would then likely go sideways to up to a new high over the next several months.<p>The bulls see Friday as a pullback from Wednesday’s breakout above the wedge bear channel. However, Friday was a big bear day. Furthermore, there have been many big bear bars in this 10 day trading range. It is now more likely that the Emini will break below the April 2 bottom of the wedge.<h4>Double top bear flag for a test of 2450</h4><p>The Emini formed a double top with the March 27 and April 5 highs. The rally to the 2nd high in a double top bear flag is typically strong. That is the danger for the bulls. They believe that the reversal up is the start of a bull trend. Then, they are trapped into buying too high in what turns out to be a bear flag.<p>The bears sell aggressively and the bulls are usually stopped out below the neck line. That is the April 2 low of 2552.00. They are so surprised and disappointed that they usually will not buy again for many bars. The result is that the selloff usually has at least a couple of legs.<p>In addition, it typically falls for about a measured move based on the height of the bear flag. Since the 10 day range is 100 points tall, the bears want a test down to around 2450. That is also around the 20 month EMA and the bottom of the buy climax on the weekly chart. At the moment, there is at least 50% chance that the daily chart will get there within a couple of months.<p>The bulls are trying to create a double bottom with the February 9 low. The height to the March 13 neck line is about 250 points. In addition, the selloff from the March 13 high is a wedge. If the Emini strongly breaks below the February low, it would be a failed wedge bottom. The bears would try for a 250 point measured move target. That would be around 2300. If the Emini were to fall to that target, it would probably reverse up strongly. That would also be close to a 20% correction.<p>In conclusion, there is better than a 50% chance of the Emini testing below the 20 month EMA and down to the bottom of the weekly buy climax. A reasonable target is around 2450 over the next month or two.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-4-7"
    }
  ],
  "14": [
    {
      "data": [
        "<article class=\"post-77274 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini bulls want measured move up and bears want Leg 1 = Leg 2 down Emini weekend update: April 14, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini bulls want measured move up and bears want Leg 1 = Leg 2 down<br>Emini weekend update: April 14, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-04-14T00:30:44-07:00\">April 14, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>Trying to resume up after a 3 month pullback</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/04/m-1.png\"><img loading=\"lazy\" src=\"2018-4-14.png\" alt=\"Monthly Emini bull reversal bar ahead of Syria bombing and Russia's response.\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart so far this month is a bull reversal bar. The odds favor a resumption of the strong bull trend either this month or next. Yet, the 20 month exponential moving average (EMA) is a magnet and it is not far below. Consequently, the pullback might continue down to the 2450 area before the bull trend resumes.<p>The monthly S&amp;P500 Emini futures candlestick chart has pulled back for 3 months in a strong bull trend. Through January, the bulls had 15 months without a pullback. While unsustainable and therefore climactic, it also means that the bulls were aggressive. The odds are that the current reversal down will fail and the bulls will buy again soon.<p>Normally, the 1st pullback from a bull micro channel lasts only 1 – 3 months. Because the stock market has never been this overbought in its 100 year history, the pullback could last longer. If April closes on its high, it will be a buy signal bar for May. Furthermore, it would probably be the end of the pullback.<p>Alternatively, if the Emini collapses into the end of the month, then it will probably fall to the 20 month EMA. Since it would probably go at least a little below, a minimum target would be about 2450.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Emini bulls want measured move up and bears want Leg 1 = Leg 2 down</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/04/w-2.png\"><img loading=\"lazy\" src=\"2018-4-14-1.png\" alt=\"Emini bulls want measured move up and bears want Leg 1 = Leg 2 down\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart had a bull trend bar this week. It is a buy signal bar for next week for a double bottom with the February low.<p>The weekly S&amp;P500 Emini futures candlestick chart reversed up this week after last week’s higher low double bottom with the February low. Furthermore, there was a 6 week wedge bull flag at last week’s low. If the bulls get a strong bull trend bar next week, then the odds are that the rally will continue up to the March 13 lower high at around 2800. That is around a measured move up based on the height of the 3 week tight trading range.<h4>The bears want a Leg 1 = Leg 2 measured move down</h4><p>The bears need more than a reversal down next week. They need a strong break below the February low before traders believe that the Emini will have another leg down. Their 1st target would be a Leg 1 = Leg 2 measured move. Leg 1 ended with the February 9 low, and it was 345 points tall. Leg 2 began with the March 13 high of 2807.25. The leg 2 target therefore would be around 2462.25. Hence it would be around the 20 month EMA, which is a target on the monthly chart.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Triangle just above the 200 day moving average</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/04/d-2.png\"><img loading=\"lazy\" src=\"2018-4-14-2.png\" alt=\"Daily Emini triangle ahead of 1st quarter earnings.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart today reversed down from a small break above a 3 week triangle. It is still in Breakout Mode.<p>The daily S&amp;P500 Emini futures candlestick chart has been sideways for 3 weeks. Today reversed down from a small breakout above the triangle. But, it closed back above yesterday’s low. The chart is still in breakout mode until there is a clear breakout up or down. The next few days will give information about what the next couple of weeks will do.<p>The bulls want a reversal up from a test of the February low and the 200 day moving average. However, the bulls need consecutive bull bars closing near their highs and above the triangle. If they get that, the odds would favor a test of the March 13 major lower high, which is above 2800.<p>The bears want consecutive big bear bars next week for a break below the triangle. That would make a test of the February low likely. If there is a selloff next week and it is strong, the odds would favor a break below the triangle and the February low. A measured move down would be around the 2430 area, which is also a target zone on the weekly and monthly charts.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-4-14"
    }
  ],
  "21": [
    {
      "data": [
        "<article class=\"post-77409 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Weak Emini breakout above 2700 Big Round Number on strong earningsEmini weekend update: April 21, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Weak Emini breakout above 2700 Big Round Number on strong earnings<br>Emini weekend update: April 21, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-04-21T00:30:04-07:00\">April 21, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>April is reversing up after a 3 month bull flag</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/04/m-2.png\"><img loading=\"lazy\" src=\"2018-4-21.png\" alt=\"Monthly Emini chart has small bull flag.\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart so far this month has a bull reversal bar. If it closes near its high, it will be a strong buy signal bar for May.<p>The monthly S&amp;P500 Emini futures candlestick chart reversed up in April, as I have been saying was likely. There are still 6 trading days left, and there is plenty of time left for a strong reversal back down. However, after a 15 month bull micro channel, the odds have been for a bull flag that would end by the 3rd month. So far, this looks to be the case.<p>But, because the stock market has never been as overbought in its 100 year history as it was in January,&nbsp; the correction could last 6 months. There is still only a 20% chance of a bear trend on the monthly chart without at least a small double top.<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Weak Emini breakout above 2700 Big Round Number on strong earnings</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/04/w-3.png\"><img loading=\"lazy\" src=\"2018-4-21-1.png\" alt=\"Weak Emini breakout above 2700 Big Round Number on strong earnings\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart had a bear doji this week. It is a weak sell signal for next week.<p>The weekly S&amp;P500 Emini futures candlestick chart has been in a tight trading range for 4 weeks. It is also in the middle of a 3 month trading range. This means that it is searching for direction.<p>This week was a doji bear reversal bar, which is a weak sell signal for next week. Consequently, next week will probably be another small bar, similar to the past 4 weeks.<p>Because there was a strong bull trend prior to this 3 month trading range, the odds still favor a bull breakout. However, the weekly chart needs consecutive strong trend bars up or down before traders believe that the trading range is converting into a trend.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Pullback from weak breakout above 4 week island bottom</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/04/d-3.png\"><img loading=\"lazy\" src=\"2018-4-21-2.png\" alt=\"Daily emini chart has 3 bear bars in a bull channel.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart is pulling back from a breakout above a four week island bottom. The bears, however, have 3 consecutive bear bars. If the selling continues next week, the chart will test the April low.<p>The daily S&amp;P500 Emini futures candlestick chart gapped up this week. This therefore created a 4 week island bottom. Also, the April low formed a double bottom higher low with the February low.&nbsp;<p>However, it gapped back down on Thursday and therefore created a 2 day island top. In addition, it did so after a 50% retracement of the March selloff. Furthermore, it is reversing down after closing the gap below March 21. Finally, the past 3 days had bear bars and the bodies are getting bigger. This means that the momentum down is accelerating. That increases the chance of at least a small 2nd leg down.<p>Island tops and bottoms are common in trading ranges. The 4 week island bottom was bigger than the island top. In addition, if followed a double bottom with the February low. Furthermore, the monthly chart is in a strong bull trend. Consequently, the odds favor a test of the March high above 2800 over another test of the February low.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noopener\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-4-21"
    }
  ],
  "28": [
    {
      "data": [
        "<article class=\"post-77543 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini in triangle ahead of FOMC meeting despite strong earnings  Emini weekend update: April 28, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini in triangle ahead of FOMC meeting despite strong earnings<br>Emini weekend update: April 28, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-04-28T00:30:13-07:00\">April 28, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Monthly S&amp;P500 Emini futures candlestick chart:<br>April is buy signal bar in bull flag</h2><p>a<br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/04/m-3.png\"><img loading=\"lazy\" src=\"2018-4-28.png\" alt=\"Monthly Emini chart in bull flag ahead of FOMC meeting.\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart is forming a bull reversal bar for April with one trading day remaining. It is the 3rd month in a bull flag after a very strong bull trend, and a buy signal bar for May.<p>The monthly S&amp;P500 Emini futures candlestick chart so far this month is a buy signal bar in a 3 bar bull flag. Once February traded below the January low, the 15 month bull micro channel ended. Since the rally was the most overbought in the history of the stock market, it was a buy climax. However, a strong bull trend only has a 20% chance of becoming a bear trend without at least a micro double top. Therefore, the 3 month selloff is much more likely to be a bull flag than the start of a bear trend.<p>The 1st correction in after a micro channel typically lasts 1 – 3 bars. Because this is the most extreme buy climax in history, the bulls are more exhausted that after prior buy climaxes. Consequently, they may want more time before buying again. As a result, this pullback could last several more months. Yet, the odds still favor a test of the all-time high. In addition, that test will probably take place in the next few months.<p>If April closes on its high on Monday, it will increase the odds of a rally in May. The all-time high is close enough so that a strong rally in May could exceed it. Even if the 3 month pullback continues through the summer, the odds still favor a new high this year. Furthermore, sooner is more likely that later.<h4>The bear case on the monthly chart</h4><p>There is always a bear case. Since there is only a 20% chance of a bear trend on the monthly chart without a test of the January high, what is left for the bears? They could simply delay the resumption of the bull trend, and they can make the pullback continue down further. While the correction could last 10 – 20 bars, that is unlikely.<p>What about a deep correction? The 20 month exponential moving average (EMA) is just below 2500 and the monthly chart has not touched it since March 2016. That is a long time to stay above the average price and therefore the odds favor a pullback to the average within a year or so. In addition, it is support, and support is a magnet. The April low might be close enough so that the Emini might not be able to escape its magnetic pull. If that is true, the rally will not resume until the monthly chart dips below the 20 month EMA.<p>When a chart stays above its average price for 20 months, the bulls are strong. There is a gap between the low of every bar and the moving average. Once traders finally get an opportunity to buy at the average price, they usually take it. I call that a 20 Gap Bar Buy Signal.<p>Consequently, there are buyers below 2500. In fact, there are probably so many that the chart will probably not fall more than 50 – 100 points below its average price before the bulls regain control.<h4>Support at start of parabolic buy climax at the November 2016 low</h4><p>If the bears break below that support, the next support is the March 2017 low of 2321.75. That was the 1st pause after the very strong 4 month rally that began with the November 2016 Trump election. It was the start of the parabolic buy climax that ended 3 months ago. Traders will want to see if the bulls will again buy aggressively there. However, the odds are that the Emini will 1st make a new high before it tests that low. That test will more likely come 12 – 24 months from now.<p>&nbsp;<h2>Weekly S&amp;P500 Emini futures candlestick chart:<br>Emini in triangle ahead of FOMC meeting despite strong earnings</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/04/w-5.png\"><img loading=\"lazy\" src=\"2018-4-28-1.png\" alt=\"Emini in triangle ahead of FOMC meeting despite strong earnings.\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart formed a double bottom with the February and April lows. The bulls see this week’s selloff as a test of the double bottom. Furthermore, this week is a failed breakout below a triangle, where last week was the sell signal bar.<p>The weekly S&amp;P500 Emini futures candlestick chart is in a 3 month trading range in a bull trend. It has been sideways for 3 months with lower highs and and higher lows. That is a triangle. This week traded below last week’s low and triggered a sell signal. Since the 1st breakout attempt from a triangle fails 50% of the time, it is no surprise that this past week reversed up.<p>This week is now a buy signal bar for next week. However, the weekly chart has been reversing every 1 – 2 weeks for 3 months. Therefore, betting on a breakout into a trend is a low probability bet. The setup is good for the bulls, but they need a strong rally next week before traders will believe that the bull trend is resuming.<h2>Daily S&amp;P500 Emini futures candlestick chart:<br>Reversing up from higher low major trend reversal</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/04/d-4.png\"><img loading=\"lazy\" src=\"2018-4-28-2.png\" alt=\"Daily Emini chart at apex of triangle.\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart sold off strongly this week, but reversed up equally strongly since Wednesday. The bulls see the 5 day selloff that ended on Wednesday as a pullback from the April breakout above the February and March bear channel.<p>The daily S&amp;P500 Emini futures candlestick chart tested the February and April double bottom this week and reversed up strongly. If it can create several strong bull bars next week, traders will conclude that the correction is over and that the bull trend is resuming.<p>It is important to remember that the daily chart is still in a 3 month trading range. Trading ranges repeatedly disappoint traders. Consequently, the odds will favor a continuation of the trading range over a resumption of the bull trend until the bulls are able to get 3 – 5 big bull bars closing nears their highs.<p>With the uncertainty surrounding Wednesday’s 11 a.m. PST FOMC announcement, the Emini might go sideways into the report. However, the report could be a catalyst for a strong rally that confirms that the bull trend is resuming.<h4>Lower highs mean possible bear trend</h4><p>A trading range always has both bull and bear setups. The Emini has been forming lower highs since January. If it turns down sharply this week from below the April high, the odds will favor another test of the bottom of the 3 month range. If the bears get a strong breakout below, they will try for a 250 point measured move down.<p>This is based on the height of the February and April double bottom. The March high is the neck line and it is about 250 points above the low. Since a trading range is a breakout mode pattern, traders are looking for a 250 point breakout up or down. At the moment, the bull case is more likely, but the probabilities can reverse after any day in a trading range.<hr><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noopener\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-4-28"
    }
  ]
}