{
  "1": [
    {
      "data": [
        "<article class=\"post-83700 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini Christmas rally within yearlong trading rangeWeekend market update: December 1, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini Christmas rally within yearlong trading range</strong><br>Weekend market update: December 1, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-12-01T00:30:28-08:00\">December 1, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2><strong>Monthly S&amp;P500 Emini futures candlestick chart:</strong><br>1st pullback to 20 month EMA in more than 20 months</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-monthly-candlestick-chart-pattern-is-bull-inside-bar-and-20-Gap-Bar-buy-setup.png\"><img loading=\"lazy\" src=\"2018-12-1.png\" alt=\"Emini monthly candlestick chart pattern is bull inside bar and 20 Gap Bar buy setup\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart pulled back to the 20 month EMA in October. November had a bull body and it is a buy signal bar for December. However, since it is only a small bull doji bar, it is probably not strong enough to reverse October.<p>The monthly S&amp;P500 Emini futures candlestick chart reversed up from the 20 month EMA in November. However, the candlestick was a small bull doji. That is probably not a strong enough foundation to support a sustained rally. This is especially true after the big bear bar in October.<p>That bar was the biggest bear bar in the 10 year bull trend. It is therefore a bear Surprise Bar. A Surprise Bar typically has at least a small 2nd leg sideways to down. If the bulls get 2 more bull bars closing near their highs, that will be enough to make traders believe that the bull trend is resuming. Without that, it is more likely that the yearlong trading range will continue.<p>The rally after a Surprise Bar is usually a pullback in the minor bear trend reversal. Sometimes it will last 5 or more bars. But it typically fails at or below the top of the Surprise Bar. Therefore, even though the bulls have a 20 Gap Bar buy setup, the rally will probably be a bull leg in the yearlong trading range. A bull leg in a trading range usually leads to a bear leg. Consequently, traders will exit longs in the upper half of the trading range where they will begin again to look to sell.<p>In a trading range, traders buy low, sell high, and take quick profits. This is because they know that most trading range breakout attempts fail. They make more money by taking quick profits. Once there is a strong breakout up or down, they will resume trend trading.<h4>Bears want a measured move down to monthly trend line around 2350</h4><p>Can the bears get a measured move down to around the 10 year bull trend line? Of course, they can. However, at the moment, they only have a 40% chance of a strong break below the February low. This is because the 10 year bull trend was exceptionally strong. A strong bull trend typically needs a clear major trend reversal pattern before the bears can create a bear trend.<p>While the bears have a higher high in September, the trading range has lasted only about 10 bars. That is likely too small to lead to a bear trend. Consequently, even if the bears get a reversal down to below 2400, the selloff will probably simply be a deep pullback in the bull trend on the monthly chart.<h2><strong>Weekly S&amp;P500 Emini futures candlestick chart:</strong><br>Micro double bottom at bottom of yearlong trading range</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-weekly-candlestick-chart-pattern-is-micro-double-bottom-at-close-of-last-year.png\"><img loading=\"lazy\" src=\"2018-12-1-1.png\" alt=\"Emini weekly candlestick chart pattern is micro double bottom at close of last year\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart this week reversed last week’s selloff. This reversal is forming a micro double bottom with the low from 4 weeks ago. But, the bulls need a strong breakout above the high from 3 weeks ago. That is the neck line of the micro double bottom. Until there is a breakout, there is no breakout.<p>The weekly S&amp;P500 Emini futures candlestick chart totally reversed last week’s strong selloff. The two weeks therefore formed a two bar reversal. That reversal is a micro double bottom with the low from 4 weeks ago. Furthermore, it is near the bottom of a yearlong trading range. However, the bulls need a strong breakout above the 20 week EMA.<p>In addition, the high from 3 weeks ago is the neck line of the micro double bottom. The bulls need either one big bull bar closing far above that high or 2 small bull bars closing above that high. If they get that, traders will believe that the double bottom will lead to a test of the all-time high.<p>However, the weekly chart has had many strong rallies and selloffs this year. This is typical when the chart is in a trading range. Most of these small trends reverse, even though one eventually will breakout and lead to a sustained trend. Therefore, it is better to bet that every strong move up or down will reverse than be the start of a trend.<p>While the micro double bottom is good for the bulls, the rally will probably simply be a bull leg in the yearlong trading range. A bull leg leads to a bear leg.<p>Because this past week rallied strongly and there is a micro double bottom, there will probably be follow-through buying for a 1 – 3 weeks. This is especially true because there is a bullish bias in December. However, most traders see their longs as trades, not investments. They know that the odds favor a continuation of the yearlong trading range.<h4>What about the Fed and China?</h4><p>The Fed statement this week is helpful for the bulls. In addition, if Trump wins the tariff and trade war with China, that would be bullish as well. However, a trader has to look at the charts. There is important news all year long. Yet, it quickly gets priced in and then traders look ahead to the next catalyst.<p>Yes, it would help the bulls if Trump gets a good deal with China. But, the chart is telling us that the price over the past year is just about right. Consequently, the market will tend to gravitate around the middle of the range. This is true even if there is a sharp 2 – 3 week rally from a resolution of the trade war.<h2><strong>Daily S&amp;P500 Emini futures candlestick chart:</strong><br>Emini Christmas rally within yearlong trading range</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-daily-candlestick-chart-pattern-is-bull-leg-in-triangle.png\"><img loading=\"lazy\" src=\"2018-12-1-2.png\" alt=\"Emini daily candlestick chart pattern is bull leg in triangle\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart has rallied with 5 bull candlesticks from a higher low double bottom. However, there is also a lower high double top. Therefore, the daily chart is in a triangle.<p>The daily S&amp;P500 Emini futures candlestick chart has rallied for 5 days from a higher low double bottom. The rally is strong enough take make bulls buy the 1st 1 – 3 day reversal down. They know that a bear trend is unlikely without at least a micro double top. Therefore, the downside risk over the next few days is small.<p>As strong as the past 5 days have been, there is a minor problem. Look at the past year. How many times have there been 7 consecutive bull trend days? Zero. The computers know this and therefore Monday or Tuesday will probably have a bear body. As a result, the bears will look to sell a rally in the 1st half of the day, betting that the day will close below the open. But, as I said, the 1st reversal down will be minor. The bulls will probably take some profits on Monday or Tuesday and the bears will sell. Whatever pullback that results from this will be a bull flag.<p>The higher low this week followed a lower high in the 3 month trading range. When a trading range has a lower high and a higher low, traders will begin to look for a triangle. Whether or not a good looking triangle forms over the next few weeks is not important. After a double top and a double bottom, traders already believe that the 2 month trading range is a breakout mode pattern. The 1st breakout has a 50% chance of reversing. Furthermore, there is a 50% chance that the eventual successful breakout will be up and a 50% chance it will be down.<p>Until there is a breakout, there is no breakout. consequently, as strong as the past 5 days have been, the odd favor at least a minor lower high within the next 2 weeks.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-12-1"
    }
  ],
  "3": [
    {
      "data": [
        "<article class=\"post-83698 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini end of the year triangle and breakout modeIntraday market update: Monday December 3, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini end of the year triangle and breakout mode</strong><br>Intraday market update: Monday December 3, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-12-03T06:20:50-08:00\">December 3, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini end of the year triangle and breakout mode</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Friday was the 5th consecutive bull trend day after a higher low major trend reversal. The chart pattern was also a head and shoulders bottom. While the reversal is strong, it is now in the top half of a month-long trading range. In addition, Friday was the 5th consecutive bull trend bar on the daily chart.<p>Look at the streaks over the past year. The odds are that today or tomorrow will have a bear body on the daily chart. That means a close below the open. Consequently, traders will look for a reversal down after a morning rally.<p>Obviously, 5 consecutive bull days means that the bulls are strong. However, the stop is now far below and many bulls will take profits. They will look to buy again after a 1 – 3 day pullback.<h4>Testing the November high and 2800 Big Round Number</h4><p>Because this is strong buying pressure, the bears will probably need at least a micro double top before they can begin a reversal down lasting more than a few days. But, the Emini has been in a trading range for a month. Therefore, most breakouts fail. The Emini’s gap up today will be a test the November high and the 2800 Big Round Number. Traders will expect at least a minor reversal down this week. As a result, the bears will begin to look to sell for a 1 – 3 day pullback.<p>Because of the bull micro channel, the bulls will look to buy after 1 – 3 days down. Traders know that the trading range is more likely to continue than to break into a trend. They both will therefore take profits after any move goes 1 – 3 days. The result will likely be a continuation of the trading range for at least several more days.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 42 points in the Globex session. Although there will be a gap on the daily and weekly charts, there will not be a gap on the monthly chart. When there is a big gap up on the daily chart, there is an increased chance of a trend day up or down. Typically, the odds slightly favor a trend in the direction of the gap. Here, that would be a bull trend. However, after 5 bull days, today or tomorrow will probably be a bear day. Consequently, traders will look to sell a rally either today or tomorrow.<p>A big gap up means eager bulls. However, traders do not like buying far above the average price. Today will open far above the 5 minute EMA. There is only a 20% chance of a bull or bear trend from the open that lasts all day. There is an 80% chance of at least one reversal in the 1st 90 minutes, even if today ends up in a trend. The bulls will look to buy a wedge bottom or double bottom near the EMA. However, the bears want an early top. They will sell a wedge rally or double top on the open and hope for an early high of the day.<p>If the opening range has a strong leg before a reversal, the odds of a big trend day go down. Traders will look for a weaker trend day. They therefore will be willing to take some trades in the opposite direction. Furthermore, they will look for at least a minor reversal in the 2nd half of the day.<h2>Friday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-late-bull-breakout.png\"><img src=\"2018-12-3.png\" alt=\"Emini late bull breakout\"></a><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex head and shoulders bottom and double top bear flag</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/EURUSD-Forex-head-and-shoulders-bottom-and-double-top-bear-flag.png\"><img loading=\"lazy\" src=\"2018-12-3-1.png\" alt=\"EURUSD Forex head and shoulders bottom and double top bear flag\"></a><p class=\"caption\">The EURUSD daily Forex chart has been in a trading range for a month. Therefore, there is always both credible buy and sell setups. The bears have a double top bear flag and the bulls have a head and shoulders bottom. Neither has a good signal bar.<p><br>After reversing down from a failed breakout above a 6 month trading range, the EURUSD daily Forex chart has sold off from 3 months. It reversed up from a wedge bottom after breaking below the range. That reversal up formed a wedge bull flag at support on the weekly chart. Additionally, the chart had lower highs and a higher low in November. This is a triangle.<p>For the past month, traders have been deciding whether the bulls will get a reversal or a continuation of the bear trend. Neither the bulls nor the bears have an advantage.<p>Traders see the November trading range as a Breakout Mode pattern. The bulls want the head and shoulders bottom to begin a bull trend. However, the bears see a double top bear flag in a bear channel and want a new low.<p>Until there is a breakout, traders will look for reversals every few days, take profits and then trade in the opposite direction for the next few days.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute chart sold off 60 pips overnight, and then rallied 30 pips. Neither trend was strong. Furthermore, today’s high is below Friday’s high, and today’s low is above Friday’s low. Consequently, today is an inside day in the middle of a month-long trading range. Traders believe that the price is just about right. When that is the case, they sell rallies, buy selloffs, and take quick profits. The result is a continuation of the month-long trading range. In addition, it increases the chance of days that have a lot of trading range price action.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-sold-off-from-big-gap-up-and-entered-trading-range.png\"><img loading=\"lazy\" src=\"2018-12-3-2.png\" alt=\"Emini sold off from big gap up and entered trading range\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>After a huge gap up, the Emini sold off, but held above Friday’s high, as expected. It rallied from a wedge bottom and entered a trading range day. Also, as I said was likely, today closed below the open. This was the 1st bear day in 6 days.<p>The bears want a gap down tomorrow or this week. That would create an island top. However, after 5 bull days, the odds are that the bulls will buy the 1st 1 – 3 day pullback. The rally was climactic. Consequently, this week might go sideways into Friday’s unemployment report.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-12-3"
    }
  ],
  "4": [
    {
      "data": [
        "<article class=\"post-83863 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini testing 2800 Big Round Number and November highIntraday market update: Tuesday December 4, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini testing 2800 Big Round Number and November high</strong><br>Intraday market update: Tuesday December 4, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-12-04T06:20:12-08:00\">December 4, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini testing 2800 Big Round Number and November high</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Yesterday had a bear body, despite the huge gap up. I wrote on Friday that this was likely because a 6th bull day would be unusual. The bears want a lower high compared to the November high, and another failure at 2800. However, the 5 bulls days signify strong bulls. Consequently, the bulls will buy the 1st 1 – 3 day pullback. Therefore, there are probably buyers not far below today’s low.<p>Since the rally was climactic and the Emini is at resistance, the odds favor 1 – 3 sideways to down days. This is especially true with an unemployment report coming on Friday.<p>If the Emini gaps down this week, it will form another island top. However, island tops and bottoms are minor reversal setups.<p>What about the China trade news? Who cares? I am only interested in the charts, which reflect the composite of institutional opinion. They tell me if more dollars are buying or selling, and I want to do what the institutions are doing. They cannot hide it. The charts show us.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 7 points in the Globex session. Today will therefore probably open in the middle of yesterday’s range. While yesterday had a bear body, it held above Friday’s low. It was therefore a pause day, but not a pullback.<p>The Emini now has had 6 days without a pullback. While that is a sign of strong bulls, it is also becoming climactic. Consequently, the odds of a pullback are increasing. Yesterday’s bear body increase the chance of a pullback today. There will probably be a pullback today or tomorrow. In addition, Friday’s high is not far below. It is the bottom of yesterday’s gap up and therefore a magnet.<p>Six days without a pullback is a 7 day bull micro channel. That is a sign of persistent and strong bulls. They typically will buy the 1st 1 – 3 day pullback. Consequently, there are probably buyers not far below yesterday’s low.<p>Yesterday was a trading range day in a buy climax. Friday’s unemployment report is a catalyst. The odds are that today will be another mostly sideways day.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-sold-off-from-big-gap-up-and-entered-trading-range.png\"><img src=\"2018-12-4.png\" alt=\"Emini sold off from big gap up and entered trading range\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex nested head and shoulders bottom</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/EURUSD-Forex-nested-head-and-shoulders-bottom.png\"><img loading=\"lazy\" src=\"2018-12-4-1.png\" alt=\"EURUSD Forex nested head and shoulders bottom\"></a><p class=\"caption\">The EURUSD daily Forex chart has been in a trading range for a month. The bears want the bear channel to break to a new how. But, the bulls have a head and shoulders bottom. The right shoulder is a smaller head and shoulders bottom.<p><br>The EURUSD daily Forex chart has a nested head and shoulders bottom. That slightly increases the odds of a break above the November highs, which form the neck line. If there is a strong breakout, the rally will likely continue up to the October 16 top of the 2 month bear channel.<p>Until the bulls begin to form higher highs, the chart is still in a bear channel. That means a bear trend. But, the chart pattern is good for the bulls. In addition, it is forming at support on the weekly chart.<p>Traders always want high probability trades. When the chart is in a trading range, those trades cannot exist. The chart is sideways because the bulls and bears are balanced. However, the odds are slightly better for the bulls. But, one or two big bear days would flip the odds in favor of the bears.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart rallied 70 pips over night. It has been in a 30 pip trading range for 5 hours. As a result, day traders have been scalping.<p>Since the daily chart is trying to break above a head and shoulders bottom, today’s close is important. The bulls need signs of strength. One sign is a preponderance of bull trend days. In addition, they need those days to close near their highs. Furthermore, they need some of them to close above the high of the prior day and above minor lower highs.<p>For example, if the bulls can close today above yesterday’s high and above last week’s high, that would be a sign of strength. If not, it would be a sign of strength for the bears.<p>Therefore, both will fight over those 2 highs today. The bulls will buy 20 – 30 pip selloffs and the bears will sell near those highs. If either can create a strong trend day, which is unlikely, the daily chart will be more favorable for them.<p>The daily chart has been reversing every few days over the past month. Most days have spent most of their time in trading ranges. Friday’s unemployment report is important. Finally, the overnight rally was weak. These factors make today likely to be another trading range day.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-strong-bear-trend-testing-2017-close.png\"><img loading=\"lazy\" src=\"2018-12-4-2.png\" alt=\"\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>The Emini crashed on the 5 minute chart today. It closed the gaps on the daily and weekly chart. Now, the daily chart has a Big Up, Big Down pattern, which creates confusion. Confusion typically leads to a trading range, and that is likely Thursday. Last year’s 2689.25 close has been a magnet all year. The Emini might oscillate around it for the remainder of the year.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-12-4"
    }
  ],
  "6": [
    {
      "data": [
        "<article class=\"post-83867 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini sell climax after buy climax creates confusionIntraday market update: Thursday December 6, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini sell climax after buy climax creates confusion</strong><br>Intraday market update: Thursday December 6, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-12-06T06:20:15-08:00\">December 6, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini sell climax after buy climax creates confusion, which typically results in a trading range</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Tuesday was a huge bear day after a buy climax in late November. Big Up, Big Down creates Big Confusion. Traders buy low, sell high, and take quick profits. This generally results in a trading range.<p>The Emini has been in a trading range for a year, and in a tight range for 2 months. There is no breakout until there is a breakout, despite strong moves up and down.<p>Last year’s close has been a magnet all year. The Emini might oscillate around it for the rest of the year. Today will open below last year’s close. Therefore, the Emini might get vacuumed back up there in the remaining days of 2018.<h4>Options gamma and sell vacuum test of support</h4><p>Tuesday collapsed on the 5 minute chart. It was a quick down to the support of last year’s close. Whenever there is an intraday crash, about half of it is caused by option selling firms having to hedge their short puts. As the market falls, the losses from their short puts rapidly increase. Gamma is the measure of the speed of those losses.<p>When the gamma increases rapidly, those firms have to protect themselves. They can do this by selling stocks and futures. Their selling adds to the selling from the bearish institutions. The result is a bigger bear day than what the fundamentals would indicate. Gamma-related selling is often about half of the selling in sell climax days, like Tuesday.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 40 points in the Globex session. It will therefore gap down below last year’s close. The Emini will once again be down on the year. But, it is still in the 2 month trading range.<p>When there is a big gap, there is only a 20% chance of a trend from the open up or down that lasts all day. Typically, there is at least one reversal in the 1st hour. The bulls will try to create a double bottom or a wedge bottom. If there is an early rally, the bears will look for a wedge rally or double top near the EMA.<p>In either case, the early trading range reduces the chance of a big trend day. While there typically is a trend, it is usually not as strong as a trend that comes when there is not a huge gap.<h2>Tuesday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-strong-bear-trend-testing-2017-close.png\"><img src=\"2018-12-6.png\" alt=\"\"></a><p class=\"caption\">Here are several reasonable stop entry setups from Tuesday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex triangle and nested head and shoulders bottom</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/EURUSD-Forex-nested-head-and-shoulders-bottom-2.png\"><img loading=\"lazy\" src=\"2018-12-6-1.png\" alt=\"EURUSD Forex nested head and shoulders bottom\"></a><p class=\"caption\">The EURUSD daily Forex chart sold off strongly in September. It has been in a trading range for 2 months and in a triangle for 1 month. The bulls want a rally from a nested head and shoulders bottom. However, the chart still has lower highs and is in a bear channel.<p><br>The EURUSD daily Forex chart has a month-long head and shoulders bottom. The right shoulder is a smaller headed and shoulders bottom nested within the larger one. The weekly chart has a wedge bull flag (not shown) at support. This is good for the bulls.<p>However, the daily chart is still making lower highs and is therefore still in a bear channel. But, there are now the higher lows for the past month in addition to the lower highs. Therefore, the chart is in a triangle. That is a sign of a balanced market. There is a 50% chance of a successful breakout up or down. Furthermore, there is a 50% chance that the 1st breakout will fail.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart rallied 45 pips over the past 3 hours. In addition, it traded above yesterday’s high. That triggered a buy signal on the daily chart for the 2nd time in 3 days. The bulls want this to be the start of a rally to above the November high.<p>If they will succeed, they will start to create bull bars on the daily chart. Consequently, if they truly are taking control, they will buy 20 – 30 pip pullbacks and try to get most days to close near their highs. If they are successful, other bulls will buy as the market goes up.<p>The bears do not want to see a series of bull trend days on the daily chart. They therefore will sell every new intraday high. If there is a strong bull breakout, the bears will wait for a micro double top or a wedge top before selling. They need to create big bear days to regain control. If they do not begin to get bear days within the next few days, the odds will favor a rally to the November high.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-bull-trend-reversal-day.png\"><img loading=\"lazy\" src=\"2018-12-6-2.png\" alt=\"Emini bull trend reversal day\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>Today gapped down and sold off to below last month’s low and last week’s low. By going below last week’s low, this week is now an outside down week. It reversed up from a wedge bottom and parabolic wedge bottom below the November low and last week’s low. It rallied into the close and formed a good buy signal bar for tomorrow. With tomorrow’s unemployment report, tomorrow might gap up and form an island bottom. The report could create a big trend day up or down.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-12-6"
    }
  ],
  "7": [
    {
      "data": [
        "<article class=\"post-83869 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini outside down week testing November lowIntraday market update: Friday December 7, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini outside down week testing November low</strong><br>Intraday market update: Friday December 7, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-12-07T06:20:12-08:00\">December 7, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini outside down week testing November low</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>By breaking below last week’s low, the Emini turned this week into an outside down week. The Emini reversed up yesterday from below last week’s low and last month’s low.<p>Because yesterday was a big bull bar closing on its high, it is a good buy signal bar for today. The bulls want a reversal up from the bottom of the 2 month range.<p>However, the rally on the 5 minute chart lacked the relentlessness that typically comes at major bottoms. The bulls therefore need several bull days before traders will believe that yesterday was the bottom.<p>Today is Friday and therefore weekly support and resistance are important. This is especially true at the end of the day today. The most significant weekly price is last week’s low.<p>The bears want this week to close below last week’s low. That would be a more bearish outside down week.<p>The bulls want a close above last week’s low. There is a small chance of a huge bull trend today with this week getting back above last week’s high.<h3>Overnight Emini Globex trading</h3><p><br>Since yesterday’s was a strong buy setup on the daily chart, today will probably go above yesterday’s high. That will trigger the buy signal.<p>But, traders will pay careful attention to what happens next. The daily chart is in a trading range for 2 months and therefore buy and sell signals are less reliable. There have been many surprisingly big moves up and down. This increases the chance of a surprise up or down today. One surprise might be that today does not go above yesterday’s high. Also, it could go above and then sell off.<p>After an overnight pullback in the Globex session, the Emini rallied to around yesterday’s high on this morning’s unemployment report. Today therefore might gap up. If the gap is small, it will probably close in the 1st hour.<p>Unless there is a strong early rally, today will probably be spend a lot of time around last year’s close, yesterday’s high, or last week’s low today. That means there is an increased chance of a trading range day today, despite yesterday’s strong rally.<p>Yesterday was a buy climax and therefore there is only a 25% chance of a big bull trend day today. This is true even with the strong buy signal bar on the daily chart. The day after a buy climax has a 75% chance of at least 2 hours of trading range trading that starts by the end of the 2nd hour. There is a 50% chance of some follow-through buying on the open.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-bull-trend-reversal-day.png\"><img src=\"2018-12-7.png\" alt=\"Emini bull trend reversal day\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex chart at apex of triangle so Breakout Mode</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/EURUSD-Forex-chart-at-apex-of-triangle-so-Breakout-Mode.png\"><img loading=\"lazy\" src=\"2018-12-7-1.png\" alt=\"EURUSD Forex chart at apex of triangle so Breakout Mode\"></a><p class=\"caption\">The EURUSD daily Forex chart has been in a trading range for 2 months. Over the past month, it has formed a triangle. The chart is therefore in Breakout Mode. The bulls have a head and shoulders bottom and the bears have a bear channel.<p><br>The EURUSD daily Forex chart has been forming lower highs and higher lows for a month. This is a triangle, which is a Breakout Pattern. The probability of a successful breakout up or down is 50%. Furthermore, the 1st breakout has a 50% chance of reversing. Because the triangle is now very tight, there will probably be a breakout attempt within a week.<p>Today is Friday and therefore the weekly chart (not shown) is important. Last week was the 2nd buy signal bar in 3 weeks. But, it had a bear body and therefore did not attract many buyers this week. If the bulls can get this week to close on its high, traders will be more willing to buy above this week’s high next week.<p>The bears always want the opposite. At a minimum, they want today and this week to close below last week’s 1.1403 high.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart was in a tight trading range overnight. It rallied 50 pips to above last week’s high on this morning’s unemployment report. However, it then reversed back down 40 pips.<p>Traders are paying attention to last week’s high. With the Big Up, Big Down move of the past 20 minutes, today might be a trading range day. Then, toward the end of the session, traders will decide whether to close the week above or below last week’s high.<p>While any day can be a strong trend day, the overnight price action is neutral. In addition, the daily chart is at the apex of a triangle. Consequently, day traders will continue to scalp until there is a strong breakout up or down.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-bear-channel-and-outside-down-week.png\"><img loading=\"lazy\" src=\"2018-12-7-2.png\" alt=\"Emini bear channel and outside down week\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>The Emini reversed down from above yesterday’s high. However, it could not break below yesterday’s low. While it reversed yesterday’s big bull trend, today failed to become an outside down day.<p>It spent most of the day around last week’s low. Since today closed below last week’s low, this week was an outside down week. That is a sign of strong bears. This week is therefore a sell signal bar for next week on the weekly chart.<p>However, the Emini is at the bottom of a 2 month trading range. That is a bad location for selling with stops. The bears want a break below this week’s low and then a test of the February low. Since the bulls want the opposite, they will try to create a reversal.<p>Trading ranges represent balance. Consequently, the probability for anything is around 50%. Therefore, the daily chart does not have a high probability trade up or down.<p>Since yesterday was a sell climax on the 5 minute chart, the odds favor at least a couple hours of sideways to up trading Monday.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-12-7"
    }
  ],
  "8": [
    {
      "data": [
        "<article class=\"post-83901 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini sell vacuum test of 2017 closeWeekend market update: December 8, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini sell vacuum test of 2017 close</strong><br>Weekend market update: December 8, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-12-08T00:30:51-08:00\">December 8, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2><strong>Market Overview</strong></h2><p>The<strong>Emini</strong>has oscillated around last year’s close all year, and it therefore is a very important price. Friday was a big bear day and last week was an outside down week. But, trading ranges resist breaking out. Therefore, the year probably will end up closing within the year’s trading range, either a little above or below last year’s close.<p>The<strong>crude oil</strong>futures market had a sell climax. The bears are either exhausted or nearly exhausted. The chart will probably be in a $10 trading range for several weeks.<p>The<strong>EURUSD</strong>daily Forex chart is at the apex of a triangle. Because the weekly chart has a wedge bull flag at support, the odds are slightly better for a measured move up to 1.18 than a measured move down to 1.09.<h2><strong>Crude oil Futures market:</strong><br>Sell climax evolving into trading range</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Crude-oil-futures-daily-chart-in-tight-trading-range-after-sell-climax-1.png\"><img loading=\"lazy\" src=\"2018-12-8.png\" alt=\"Crude oil futures daily chart in tight trading range after sell climax\"></a><p class=\"caption\">The crude oil futures daily chart is in a strong bear trend. After a wedge bottom at the $50 Big Round Number, it has begun to enter a trading range.<p>The crude oil futures market crashed over the past 2 months on the daily chart. It is now pausing at the $50 Big Round Number.<p>The 3 sell climaxes over the past month have created a wedge bottom. When there is a reversal up from a sell climax, traders typically look for at least 2 small legs up to around the 20 week EMA. In addition, they expect a test of the top of one or more of the sell climax bars.<p>Finally, when a sell climax is as extreme as this one has been, the bears are exhausted. This makes them resistant to selling again for anything other than a 1 – 5 day trade. The bulls know this and will therefore buy selloffs, looking for 3 – 5 day rallies.<p>With traders buying low, selling high, and taking quick profits, the chart evolves into a trading range. This process started 2 weeks ago. There is no sign yet that it is about to end. The odds are that the chart will stay sideways for at least a couple more weeks.<h4>Only minor reversal up</h4><p>The selloff was in a tight bear channel. There is therefore an 80% chance that the 1st reversal up will be minor. A minor reversal means a bear flag or a bull leg in a trading range.<p>A strong bear trend only has a 20% chance of reversing up into a bull trend without at least going sideways and forming a major trend reversal pattern. Consequently, the upside over the next month is probably only $10 – $15.<p>Can there be a strong break below $50? Probably not. The longer the daily chart goes sideways, the more traders will believe that the current price is just about right. The price will therefore be a magnet.<p>If there is a bear breakout the market might fall or a $5 – 10 measured move down. But a tight trading range late in a bear trend is often the Final Bear Flag. It is a magnet, and a breakout up or down usually gets drawn back to the range within 10 – 20 bars.<h2><strong>EURUSD Forex weekly candlestick chart:</strong><br>Triangle at support</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/EURUSD-daily-Forex-chart-at-apex-of-triangle-1.png\"><img loading=\"lazy\" src=\"2018-12-8-1.png\" alt=\"EURUSD daily Forex chart at apex of triangle\"></a><p class=\"caption\">The EURUSD daily Forex chart sold off strongly from the September high. It has been in a trading range for 2 months. The bears still have lower highs and lows. However, the bulls have a wedge bottom. The past month has formed a triangle.<p>The EURUSD daily Forex chart is in Breakout Mode. Over the past month, there have been 2 lower highs and 2 higher lows. This is a triangle, and it is a sign of a balanced market. When there is a triangle, there is a 50% chance that the 1st breakout up or down will fail.<p>In addition, once there is a successful breakout, there is about a 50% chance that it will be up and a 50% chance it will be down. The odds are probably slightly better for the bulls because the weekly chart (not shown) has a wedge bull flag at support.<p>Finally, the triangle is 300 pips tall. Traders will look for either a measured move down to 1.09 or up to 1.18 at the September high.<p>Does the market tip its hand before the breakout? Sometimes, but it is usually more profitable to take quick trades up and down until there is a breakout. Then, traders will be willing to hold for a bigger profit.<h2><strong>Monthly S&amp;P500 Emini futures candlestick chart:</strong><br>3 month tight trading range above 20 month EMA</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-monthly-candlestick-chart-forming-another-bear-bar-just-above-EMA-1.png\"><img loading=\"lazy\" src=\"2018-12-8-2.png\" alt=\"Emini monthly candlestick chart forming another bear bar just above EMA\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has a bear bar so far in December. While it broke below the November low, it is holding at the 20 month EMA. Also, November was a doji bar with a bull body. It is therefore a weak sell signal bar.<p>The monthly S&amp;P500 Emini futures candlestick chart is in a trading range after a strong 10 year bull trend. October formed the biggest bear bar in over 100 bars on the monthly chart.<p>But, it had a tail on its bottom and held above the 20 month EMA. In fact, it was the 1st pullback to the 20 month EMA in more than 20 months. That is a 20 Gap Bar buy setup.<p>For almost 2 years, the bulls have been buying above the average price. There is a gap between the low of each bar and the moving average. In October, they finally got to buy at the average price instead of above it. The tail on the bottom of the October bar and the modest rally in November indicate that many bulls took the opportunity.<p>Yet, November did not close on its high. In addition, its bull body was small compared to the big bear body in October. This indicates that the bulls bought the 20 month moving average, but were not eager to buy much higher.<p>It also indicates that there were not many follow-through buyers. Furthermore, the weak close means that many bulls bought for a brief trade. They exited with a quick profit. Therefore, they are not confident that the reversal up from the average price will result in a resumption of the bull trend.<h4>Weak buy setup</h4><p>November had a bull body. In addition, it was an inside bar after a pullback to the EMA. It is therefore a High 1 buy signal bar for December. If December trades above November’s high, it will trigger the buy signal.<p>But, November did not close near its high. In addition, its body was small compared to the big bear body of October. This is a weak buy setup. A weak buy setup typically does not lead to a strong bull trend. There are usually more sellers than buyers not far above the buy signal bar.<p>As a result, most of the bulls who buy above November’s high plan to take quick profits. They plan to exit within 1 – 3 bars. Since this is a monthly chart, that means within a few months. Most will probably exit below the September high. This is because they expect that the bears will get at least a small 2nd leg sideways to down after the big bear bar in October.<h4>Weak sell setup</h4><p>Since November was an inside bar, it represents balance. Traders are expecting a breakout up or down. Because it had a bull body and closed above the EMA, it is a weak sell signal bar. Most traders will not sell on a stop below November’s low. When Thursday fell below November’s low, it triggered the sell signal. But, the Emini reversed up sharply. On Friday, it again broke below the November low, but closed only slightly above it.<p>If December closes near its low, it would be a higher probability sell signal bar for next month. This is especially true if it closes below the 20 month EMA. Traders would then expect a test of the February low.<h4>Trading ranges represent balance</h4><p>The monthly chart has been in a trading range for a year. Trading ranges resist breaking out. Therefore, traders tend to take quick profits and bet on reversals (buy low, sell high, scalp). Even if there is a strong break below the February low and a test of the bull trend line at around 2,400, the selloff will probably reverse back up within a few months.<p>Likewise, if there is a break above the range, it will probably reverse back down within a few months.<p>A trading range in a bull trend is a bull flag. Consequently, the September high will probably not be the top of the bull market. But, trading ranges can last a long time. Therefore, the bulls might need 6 – 12 more months before they get their new high.<p>The bears know that the 9 bar double top is probably too small to reverse a bull trend that has lasted 100 bars. However, they want a strong minor reversal down to the monthly trend line. Will they get it? At the moment, they have a 40% chance.<p>Most likely, the trading range will continue for at least a few more months. The bulls do not yet have a good buy setup. And, a bear breakout will probably not last long.<h2><strong>Weekly S&amp;P500 Emini futures candlestick chart:</strong><br>7 week tight trading range with double top and double bottom</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-weekly-candlestick-chart-has-big-outside-down-sell-signal-bar-in-bear-flag.png\"><img loading=\"lazy\" src=\"2018-12-8-3.png\" alt=\"Emini weekly candlestick chart has big outside down sell signal bar in bear flag\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart traded above last week’s high and below last week’s low. This past week was therefore an outside down week. However, the chart is in a 7 week tight trading range. That range is in the middle of a yearlong trading range. There is no sign of a breakout up or down.<p>The bears see the October selloff on the weekly S&amp;P500 Emini futures candlestick chart as the start of a bear trend. November and December have formed a double top bear flag. This candlestick this week was an outside down bar. It is therefore a sell signal bar for next week. If next week trades below this week’s low, it would trigger the sell signal.<p>But the weekly chart has been sideways for 7 weeks. A trading range resists breaking out. Therefore the bears need a big bear bar next week before traders will believe that the October bear trend is resuming.<p>Without that, the odds continues to favor more sideways price action. Until there is a breakout, there is no breakout. Traders will bet on reversals and take quick profits until there is a clear, strong breakout up or down. If there is a breakout, it will probably fail within a few weeks.<p>A tight trading range is a limit order market. The bears are selling strong bull closes near the top and above bars near the top. The bulls are buying bear closes near the bottom and below bars near the bottom. Both are taking quick profits, doubting that any reversal will last more than a bar or two.<h2><strong>Daily S&amp;P500 Emini futures candlestick chart:</strong><br>Emini sell and buy vacuum tests of 2017 close</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-daily-candlestick-chart-has-big-bear-sell-signal-bar-at-bottom-of-trading-range.png\"><img loading=\"lazy\" src=\"2018-12-8-4.png\" alt=\"Emini daily candlestick chart has big bear sell signal bar at bottom of trading range\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart has had 3 lower highs and 3 lows in a trading range over the past 2 months. It is oscillating around the 2017 close. Friday was a big bear day, which increases the chance of a bear breakout next week.<p>The daily S&amp;P500 Emini futures candlestick chart has been sideways for 2 months since the October selloff. I wrote repeatedly in the 1st half of the year the the chart was oscillating around last year’s close. It rallied to a new high in September, but collapsed back to last year’s close in October.<p>In early October, I once again began to talk about how important the market believes last year’s close is. If a market keeps coming back to a price, it is a strong magnet.<p>The bulls want 2018 to be another positive year. That would increase the chance of higher prices next year.<p>Yet, after a 10 year bull trend, the bears know that the bulls are getting exhausted. The bears want to create evidence that they are now strong. That would increase the chance of a swing down. One sign of strength would be a December close below last December’s close. The bears would then have able to erase all of the 2018 gains. It would increase the chance of an additional selloff in 2019.<h4>Triangle</h4><p>After the reversal down from the November 7 lower high, I said that there might be a reversal up from above the October low. That would be a higher low after a lower high and it could lead to a triangle. I wrote that the bears would need one more rally to reverse down. They got their reversal down on Tuesday.<p>Since Thursday and Friday broke below the November low, the triangle is having a bear breakout. When there is a breakout of a Breakout Mode pattern, there is a 50% chance that the 1st breakout will reverse.<p>While Friday was a big bear day, if there is no follow-through selling early next week, the bear breakout will fail. Once there is a successful breakout, traders look for a measured move. Because the range is about 200 points tall, the breakout target is either 3000 or 2400.<h4>The importance of waiting until the end</h4><p>When day trading on a 5 minute chart, traders will often notice that a bar dramatically changes its appearance in the final seconds. A strong bull bar can quickly reverse down and close on the low, turning the bar into a strong bear bar. A developing bear bar can suddenly become a strong bull bar.<p>This is true on all time frames. For example, if the day has been a trading range day, the market will often get quickly drawn to the open of the day in the final hour.<p>Traders will see this behavior on any higher time frame chart. At the end of the week or month, the market often gets pulled to weekly or monthly support or resistance.<p>While I do not have a yearly chart of the Emini, the same idea applies. The open of the year has been important all year. We are now at the end of the year. Tuesday’s selloff was a sell vacuum test of the open of the year. Thursday’s rally tested it from below.<p>In situations like this, the chart often oscillates around the magnet until the final 4 – 5 bars. It then either rallies strongly above it or sells off far below. Therefore, the final week of the year could have a surprisingly big move up or down.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-12-8"
    }
  ],
  "10": [
    {
      "data": [
        "<article class=\"post-83871 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini outside down week just above February lowIntraday market update: Monday December 10, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini outside down week just above February low</strong><br>Intraday market update: Monday December 10, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-12-10T06:20:15-08:00\">December 10, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini outside down week just above February low</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>After Thursday’s big rally, Friday was a big bear trend day. It is a sell signal bar for today, but it is at the bottom of a 7 week trading range. The bears have momentum, but the bulls have support. This is a Breakout Mode situation.<p>Also, last week was an outside down week that closed near its low. It is therefore a sell signal bar on the weekly chart. However, when there is a big outside down bar, there is an increased chance that the next bar will be an inside bar. This is especially true because of the 7 week tight trading range. Therefore, the bulls will look for a possible rally up from above last week’s low. The bears instead want a BO below.<p>Friday was in a bear channel on the 5 minute chart. A bear channel is a bull flag. Consequently, the odds favor a bull breakout. A channel typically evolves into a trading range. That increases the chance of trading range trading today. This is particularly true since Friday spent a lot of time going sideways, even though it was in a bear channel.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 7 points in the Globex session. It will therefore open around Friday’s low and last week’s low. The bulls will try to create an early low of the day and low of the week from around last week’s low. There is therefore an increased chance of a bull trend day, or at least a trading range day with an early low.<p>While the bears want a big bear day, it is unlikely after a sell climax day at the bottom of a 7 week trading range. However, the biggest trend days come when they are least likely. Consequently, if there is a strong break below last week’s low and the Emini stays below the EMA, traders will sell all day.<p>Most likely, today will reverse up from around last week’s low and test Friday’s bear breakout point around 2665. That is the top of Friday’s double top bear flag.<h2>Friday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-bear-channel-and-outside-down-week.png\"><img src=\"2018-12-10.png\" alt=\"Emini bear channel and outside down week\"></a><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD daily Forex chart has weak breakout above triangle</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/EURUSD-daily-Forex-chart-has-weak-breakout-above-triangle.png\"><img loading=\"lazy\" src=\"2018-12-10-1.png\" alt=\"EURUSD daily Forex chart has weak breakout above triangle\"></a><p class=\"caption\">The EURUSD daily Forex chart has been in a triangle for a month. It is breaking above the bull trend line, but the breakout is weak. There is also a nested head and shoulders bottom.<p><br>The EURUSD daily Forex chart has been sideways for 2 months. While there is a nested head and shoulders bottom, the bulls do not yet have a breakout above the 1.15 neck line.<p>They do, however, have a break above the top of the month-long triangle. But, the breakout has been weak. Furthermore, 50% of triangle breakouts fail. The daily chart is therefore still in breakout mode, deciding between a 300 pip measured move up to 1.18 and down to 1.09.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart has been in a 50 pip trading range overnight. Because the bulls are getting a breakout above the triangle on the daily chart, they need to convince traders that the breakout will succeed. They can do that by having a series of bull bars on the daily chart that close near their highs.<p>Without that, they will give up this week and the bears will then begin a reversal down. They need a break below the November 28 right shoulder of the nested head and shoulders bottom. Then, they have to break strongly below the November low.<p>Since most breakout attempts fail, the 2 month trading range will likely continue for at least another week or two. Because trading ranges on the daily chart have lots of trading range days, there is an increased chance of a continuation of the overnight trading range. Traders have been scalping reversals for 10 pips, hoping for a strong breakout up or down.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-bull-trend-reversal-day-1.png\"><img loading=\"lazy\" src=\"2018-12-10-2.png\" alt=\"Emini bull trend reversal day\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>The Emini began with follow-through selling from Friday. It reversed up from below the October low and 2600. This was likely since most trading range breakouts fail.<p>Today was a bull trend reversal day and a failed breakout below support. It also closed near its high. It is therefore a buy signal bar for tomorrow. It is a 3 day High 2 bottom nested withing a month-long High 2 bottom.<p>But the 5 day bear channel is tight. Consequently, the reversal up will probably be minor.<p>Until there is a series of 3 – 4 trend bars up or down, traders will continue to bet on reversals rather than successful breakouts.<p>The rally on the 5 minute chart had many bear bars and pullbacks. That reduces the chances of a strong bull trend day tomorrow. The Emini will probably test Friday’s double top around 2665 tomorrow. Unless the bulls strongly break above it, there will probably be a test down to 2615, which was the beginning of today’s bull channel after the initial bull breakout.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-12-10"
    }
  ],
  "11": [
    {
      "data": [
        "<article class=\"post-84136 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini minor reversal up from October low and 2600 Big Round NumberIntraday market update: Tuesday December 11, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini minor reversal up from October low and 2600 Big Round Number</strong><br>Intraday market update: Tuesday December 11, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-12-11T06:20:26-08:00\">December 11, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini minor reversal up from October low and 2600 Big Round Number</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini yesterday reversed up from below the October low and the 2600 Big Round Number. Because the day closed near its high, it is a reasonable buy signal bar for today. The bulls want the failed breakout to begin a yearend rally.<p>However, the 5 day bear channel has been tight. In addition, yesterday’s body was relatively small. Finally, reversals in trading ranges typically disappoint traders who are hoping for a trend. Consequently, while the odds favor at least slightly higher prices, the bulls need many bull bars closing near their highs. Without that, any rally from here will probably fail within 1 – 3 days.<p>The reversal up from major support is bad for the bears. However, it is consistent with the weekly chart being in a trading range and the monthly chart forming a bull flag.<p>Disappointing breakouts and reversals are more common in trading ranges than in trends. While the Emini has sold off strongly over the past week, the selloff is still probably a bear leg in a big trading range.<p>The Emini is in search of a bottom. Because legs in a trading range often fall further than what might be likely, this selloff might continue to the monthly bull trend line below 2400 before reversing.<p>Although yesterday is a buy signal bar on the daily chart, the bulls will need several bull days before traders believe that yesterday is the final low.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 33 points on the Globex chart. Today will therefore probably gap above yesterday’s high. That will trigger the buy signal on the daily chart. Because the daily chart is oversold and reversing up from support, the big gap up has an increased chance of leading to a bull trend day.<p>When a gap up is big, the Emini is far above the EMA. Many traders do not like to buy far above the average price. However, it also reduces the chance of a big bear day. Consequently, there is only a 20% chance of a strong bull or bear trend from the open that lasts all day.<p>Most of the time, the Emini has at least one reversal in the 1st hour. The bulls look to buy a double bottom or wedge bottom near the EMA.<p>The bears want any early rally to form either a double top or a wedge top. They want to see several bear bars closing near their lows. That would be a sign of strong bears and increase the chance of a bear trend.<p>A big gap up increases the chance of a bull trend day. The bulls want the Emini to hold above the EMA for at least the 1st couple of hours. In addition, they will look for High 1, 2, and 3 bull flags just above the EMA. Finally, they like to see gaps and body gaps. These are all signs of a strong bull trend. If the develop, the bulls will swing trade.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-bull-trend-reversal-day-1.png\"><img src=\"2018-12-11.png\" alt=\"Emini bull trend reversal day\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/EURUSD-Forex-pullback-from-weak-breakout-above-triangle-bottom.png\"><img loading=\"lazy\" src=\"2018-12-11-1.png\" alt=\"EURUSD Forex pullback from weak breakout above triangle bottom\"></a><p class=\"caption\">The EURUSD daily Forex chart has been sideways for 2 months. It is still in a bear channel. But, the bulls have a nested head and shoulders bottom. In addition, last weeks small rally broke above the top of a triangle. They hop that yesterday’s was only a pullback from that breakout.<p><br>The EURUSD daily Forex chart had a weak breakout above a month-long triangle last week. Yesterday was a big bear day that closed on its low. It is therefore a sell signal bar for today.<p>The bears want the bull breakout to fail and reverse down to a bear breakout. They then want the bear trend to resume. If today trades below yesterday’s low, that will trigger the sell signal.<p>But, since the chart is in a tight trading range, stop entries are low probability bets. Consequently, even though yesterday is a strong sell signal bar, the context is bad. Therefore, there are probably more buyers than sellers below yesterday’s low.<p>So far, today’s low tested yesterday’s low exactly to the pip. Today reversed up without triggering the sell signal. That is a sign of strength buy the bulls. However, without several consecutive bull bars and a close far above the November 7 1.1501 high, the 2 month trading range will still be intact.<p>Day traders will continue to mostly scalp, betting that any trend up or down will not go far. Reversals are more likely than breakouts. Until there is a strong breakout above 1.15 or below 1.12, there is no breakout.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart reversed up from yesterday’s low overnight. It tested the low to the pip. The bulls prevented the sell signal on the daily chart from triggering.<p>But the rally up from yesterday’s low has only been 50 pips. In addition, most of the bars were small and had prominent tails. Also, there were reversals down every few bars. The rally lacked consecutive big bull trend bars.<p>Traders correctly see the rally as weak. They therefore are willing to sell rallies in addition to buying dips. This is a bull leg at the apex of the month-long trading range on the daily chart.<p>If today trades below yesterday’s low, it would trigger a sell signal on the daily chart. However, because of the tight trading range over the past several weeks, most bears will not sell on a stop below yesterday’s low. Instead, they will wait to see if the breakout is big. Without that, traders will look for another reversal, which is more likely.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-small-pullback-bear-trend-then-Final-Bear-Flag-reversal.png\"><img loading=\"lazy\" src=\"2018-12-11-2.png\" alt=\"Emini small pullback bear trend, then Final Bear Flag reversal\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>The Emini reversed down from a big gap up. It sold off in a Small Pullback Bear Trend. The bulls again got a reversal up from the November low and last week’s low. Although today was the entry day for the bulls, the bear body disappointed the bulls.<p>The odds are that the Emini will stay near the close of last year for the remainder of this year. Reversals are still more likely than breakouts.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-12-11"
    }
  ],
  "12": [
    {
      "data": [
        "<article class=\"post-83865 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini weak buy entry bar after test of October lowIntraday market update: Wednesday December 12, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini weak buy entry bar after test of October low</strong><br>Intraday market update: Wednesday December 12, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-12-12T06:20:20-08:00\">December 12, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini weak buy entry bar after test of October low</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini had a big gap up yesterday, but sold off in an endless pullback. There was a strong rally from a Final Bear Flag reversal late in the day. It reversed up from a test of last week’s low and the November low.<p>Yesterday was a Small Pullback Bear Trend day. Because it closed below its midpoint, it is a sell signal bar on the daily chart for today. But, the big tail below makes it a weak sell setup. The bulls see yesterday as a 50% pullback from Monday’s strong rally.<p>The Emini is still at the bottom of its 2 month trading range. In addition, the close of last year is nearby. As I have been saying for 2 months, the Emini might stay sideways around last year’s close and then decide on the final day of the year whether to close a little below it or a little above it.<p>Because of all of the big reversals over the past 2 months, traders will continue to look for reversals.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 32 points in the Globex session. The pullback from yesterday’s strong reversal up is therefore a higher low major trend reversal.<p>Today might gap above yesterday’s high, which would be good for the bulls. However, if the gap is small, it will probably close in the 1st hour.<p>The bulls are hoping that Monday’s strong reversal up from below the October low is the start of a yearend rally. If it is, there will be many bull days over the next few weeks.<p>Bull days tend to form an early low of the day. Consequently, day traders will be looking for an early low. In addition, they will watch to see if the Emini is staying mostly above the EMA. If so, they will be more willing to swing trade their longs.<p>Alternatively, if the rally reverses down from around Friday’s high, the bears will have a micro double top bear flag on the daily chart. That would increase the chance of a test of the February low. The next few days will likely tell traders if the bottom is in.<p>I keep saying that the year has been unable to escape the magnetic pull of last year’s close. Therefore, the single most likely outcome is a continuation of the 2 month range and more oscillation around last year’s 2689.75 close.<p>Day traders have getting good opportunities to swing trade up and down. There is no sign that this is about to end.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-small-pullback-bear-trend-then-Final-Bear-Flag-reversal.png\"><img src=\"2018-12-12.png\" alt=\"Emini small pullback bear trend, then Final Bear Flag reversal\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex pullback from breakout above triangle</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/EURUSD-Forex-pullback-from-breakout-above-triangle.png\"><img loading=\"lazy\" src=\"2018-12-12-1.png\" alt=\"EURUSD Forex pullback from breakout above triangle\"></a><p class=\"caption\">After reversing down from a breakout above the triangle, the EURUSD daily chart is testing the bottom of the triangle.<p><br>The EURUSD daily Forex chart has been in a trading range for 2 months and a triangle for 6 weeks. It broke above the triangle last week and reversed down. However, yesterday’s low was at the bottom of the triangle and today so far has reversed up. That makes the 2 day selloff more likely a pullback from the breakout than a failed breakout and reversal down. In addition, the reversal up is forming a double bottom with last week’s low. This is slightly more better for the bulls, but the bears can get the advantage with even one big bear day.<p>However, until there is a breakout of the 1.12 to 1.15 range, every strong move up or down will continue to end within a few days. The odds favor reversals until there is a strong breakout.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart reversed up from above yesterday’s low at the bottom of the triangle on the daily chart. There was a bull breakout an hour ago, but a deep pullback. The deep pullback erased much of the bullishness of the breakout.<p>If today remains an inside day, it will be a Breakout Mode day for tomorrow. The bears will see it as a buy signal bar for the pullback from last week’s break above the triangle. Yet, the bears see Monday and Tuesday as a reversal down and therefore the start of a bear trend. For them, today is a pullback in an early bear trend. Consequently, today is a small bear flag.<p>If today closes near its high, it would increase the chance of a bull breakout tomorrow. Alternatively, if it closes nears its low, it helps the bears. The fight today will be over today’s close. Bulls will buy selloffs and bears will sell rallies. This will continue over the next several days until there is a strong breakout up or down. The daily chart is at the apex of a triangle. That makes a strong breakout attempt likely within a few days.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-bear-trend-reversal-day.png\"><img loading=\"lazy\" src=\"2018-12-12-2.png\" alt=\"Emini bear trend reversal day\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>The Emini rallied for the 1st half of the day. It then reversed down from a wedge top just below the 2017 close. It closed near the low and therefore is a sell signal bar for tomorrow. Because the Emini has been sideways for 5 days, there is a reduced chance of a big bear day tomorrow.<p>Last year’s close has been a magnet all year. The Emini will probably continue to stay near it until the last few days of 2018.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-12-12"
    }
  ],
  "13": [
    {
      "data": [
        "<article class=\"post-84138 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini weak Christmas rally testing 2017 closeIntraday market update: Thursday December 13, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini weak Christmas rally testing 2017 close</strong><br>Intraday market update: Thursday December 13, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-12-13T06:20:34-08:00\">December 13, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini weak Christmas rally testing 2017 close</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini rallied in a weak bull channel yesterday. It then reversed down from just below the close of last year. Since it closed near its low, it is a good sell signal bar for today. Today will probably fall below yesterday’s low to trigger the sell signal.<p>However, the Emini has been sideways for 5 days. In addition, the close of last year will continue to be a strong magnet for the rest of the year. Therefore, there is a reduced chance of a big selloff from here. The bulls are still hoping that the past 2 bear days are forming a pullback from a reversal up from the October low.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 6 points in the Globex market. While yesterday was a bear trend reversal, the weekly chart has been sideways for 8 weeks. Consequently, there is nothing to reverse. Therefore, there might be more buyers than sellers below yesterday’s low.<p>I have been saying for 2 months that the Emini might stay around last year’s close until the final day or two of the year. Then, decide whether this year will be minimally up or down. There is no evidence to the contrary. Traders do not expect follow-through from the prior day. Therefore, today is as likely to rally as selloff.<p>Furthermore, the daily ranges have been big. This has allowed swing traders to make a nice profit every day. This will continue indefinitely.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-bear-trend-reversal-day.png\"><img src=\"2018-12-13.png\" alt=\"Emini bear trend reversal day\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/EURUSD-Forex-apex-of-triangle-so-Breakout-Mode.png\"><img loading=\"lazy\" src=\"2018-12-13-1.png\" alt=\"EURUSD Forex apex of triangle so Breakout Mode\"></a><p class=\"caption\">The EURUSD daily Forex chart has been in a tight trading range for 2 weeks at the apex of a triangle. Therefore, there is always a credible buy and sell setup. It is still in Breakout Mode.<p><br>The EURUSD daily Forex chart broke slightly above the triangle last week, but pulled back into it. It is still in Breakout Mode. The probability of a successful bull breakout is the same as for a bear breakout.<p>When the market is in a trading range for a long time, traders expect a measured move up or down. Since the trading range is 300 pips tall, the choice is between a rally to 1.18 or a selloff to 1.09.<p>Until there is a breakout, there is no breakout. Traders are looking for brief, small trades. They correctly expect reversals every 1 – 3 days.<p>Once there is a big trend bar or 2 – 3 consecutive trend bars with strong closes, they will switch to swing trading. However, many would take partial profits at the top or bottom of the triangle, fearful of a reversal. The bulls will try to create a double bottom at 1.12. The bears would want a double top at 1.15. Consequently, a measured move to either 1.18 or 1.09 will likely take at least a couple of months.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart has been in a 30 pip trading range overnight. Day traders will continue to scalp reversals. When there is a breakout, they hold for 30 – 40 pips and then take profits. They are unwilling to swing trade until there is a very strong breakout with follow-through.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-broad-bear-channel-and-sell-entry-bar-after-yesterdays-sell-signal-bar.png\"><img loading=\"lazy\" src=\"2018-12-13-2.png\" alt=\"Emini broad bear channel and sell entry bar after yesterday's sell signal bar\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>The Emini sold off from a double top on the open. It then traded down in a broad bear channel. By falling below Wednesday’s low, the Emini triggered a sell signal on the daily chart.<p>Despite repeatedly falling below that low, the bulls kept getting reversals up. This means that the bears did not have a strong conviction about their sell signal. However, the day closed slightly below yesterday’s low, which increases the chance of lower prices.<p>Traders are thinking about the end of the year. With last year’s close nearby, the Emini will probably have a hard time going very far up or down. This year will likely close around last year’s close.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-12-13"
    }
  ],
  "14": [
    {
      "data": [
        "<article class=\"post-84140 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini Low 1 bear flag sell signal triggered on ThursdayIntraday market update: Friday December 14, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini Low 1 bear flag sell signal triggered on Thursday</strong><br>Intraday market update: Friday December 14, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-12-14T06:20:40-08:00\">December 14, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini Low 1 bear flag sell signal triggered on Thursday</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>By going below Wednesday’s low yesterday, the Emini triggered a sell signal on the daily chart. However, the day then went sideways around Wednesday’s low for several hours. Because the day closed slightly below Wednesday’s low, there is an increased chance of lower prices today.<p>The bulls are hoping that the past 3 days are a pullback from Monday’s strong reversal up. However, the bears want this week’s rally to be a pullback in their bear trend.<p>Both have equally good arguments. That usually results in a trading range. The Emini has been sideways for 2 months and it will probably stay around last year’s close for the rest of the year.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 22 points in the Globex market. It will probably gap below yesterday’s low. If the gap is small, it will probably close in the 1st hour. If it is big, the Emini will probably have at least one reversal in the 1st hour. The bulls will try for a double bottom or wedge bottom, looking for an early low. The bears want a double top or wedge top near the moving average, hoping for a bear trend day.<p>Today is Friday and therefore the weekly support and resistance are important. Since this week triggered a sell signal on the weekly chart, the minimum goal for the bears is a close below the 2635.25 open of the week. Their next goal is a close below last week’s 2625.25 low. A sell signal is stronger if the entry bar closes below the sell signal bar. Finally, they would like the week to close on its low and below the October 2607.00 low.<p>The bulls always want the opposite. They will try to create a reversal up today. A rally today would create a micro double bottom with Tuesday’s low. Today would then be a buy signal bar for Monday.<h4>Trading range trading increases the chances of more trading range price action</h4><p>The Emini had a lot of trading range trading yesterday. Also, it has been in a tight trading range for 6 days. Moreover, it is at the bottom of a yearlong trading range. Finally, last year’s 2693.25 close has been a strong magnet all year.<p>These factors reduce the chance of a big selloff from here. They increase the chances of more trading range trading today. Today will probably stay near the open of the week until the final hour, and then decide whether to close a little above or below it. This would create a doji bar on the weekly chart, which represents a neutral market.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-broad-bear-channel-and-sell-entry-bar-after-yesterdays-sell-signal-bar.png\"><img src=\"2018-12-14.png\" alt=\"Emini broad bear channel and sell entry bar after yesterday's sell signal bar\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex bear breakout below triangle after failed bull breakout</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/EURUSD-Forex-bear-breakout-below-triangle-after-failed-bull-breakout.png\"><img loading=\"lazy\" src=\"2018-12-14-1.png\" alt=\"EURUSD Forex bear breakout below triangle after failed bull breakout\"></a><p class=\"caption\">The EURUSD daily Forex chart today is breaking below the triangle after a failed breakout above.<p><br>The EURUSD daily Forex chart had been in a triangle for a month. Last week’s bull breakout failed. Today so far is a big bear bar breaking below the triangle. When a breakout fails and there is then an opposite strong breakout, that 2nd breakout is more likely to be successful.<p>If the bears can close today near its low, the odds will favor lower prices. If tomorrow also is a big bear day, the selloff will probably continue down to the November low. Two strong closes below that low will make traders look for a 300 pip measured move down to 1.09.<p>The daily chart is still in a trading range. But the bear breakout after a bull breakout increases the odds of at least 2 small legs down over the next several days. The bulls will try for a double bottom with either the November 28 or November 12 lows.<p>However, if today remains a big bear day, the bulls will probably need a micro double bottom as well. Therefore, the odds favor at least a couple small legs down before the bulls have a reasonable chance of a reversal.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute chart had a strong bear breakout overnight. After a 5 hour trading range, the bears are now getting another leg down.<p>However, the 5 hour trading range means that traders feel that the price is just about right. Therefore, the odds are against much lower prices today.<p>The fight will be over the appearance of the bar on the daily chart. The bears will sell rallies and try to get today to close near its low.<p>If there is a credible bottom on the 5 minute chart, the bulls will buy it. They would like a 30 pip rally before the end of the day. That would create a tail on the bottom of today’s candlestick on the daily chart. Traders would then see the daily chart as less bearish. The bulls will then hope for a reversal up tomorrow. That would be a double bottom with the November 28 low of 1.1265.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-bear-channel-with-close-below-October-low.png\"><img loading=\"lazy\" src=\"2018-12-14-2.png\" alt=\"Emini bear channel with close below October low\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>The Emini sold off in a bear channel today. It reversed down repeatedly from the EMA. The week was a decent entry bar for the bears after last week’s sell signal bar.<p>Traders are paying attention to the end of the year. The bulls want a reversal back above last year’s close. However, the momentum down is good for the bears. They will try to continue the selling and close the year at its low, below the February low. Most likely, the year will end above the February low and below last year’s close.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-12-14"
    }
  ],
  "15": [
    {
      "data": [
        "<article class=\"post-84145 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini in trading range between 2017 close and February lowWeekend market update: December 15, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini in trading range between 2017 close and February low</strong><br>Weekend market update: December 15, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-12-15T00:30:05-08:00\">December 15, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Overview</h2><p>The lack of consensus over what the market wants to do has resulted in a trading range for the past 2 months. Traders are taking quick profits and are unwilling to bet on a breakout.<p>While the Emini might dip below the February low within a week, it will probably end the year in the trading range. Consequently, it will probably close above the February low and below last year’s close. Since the Emini is near the bottom of the range, it will probably reverse up to the middle or top of the range before then end of the year.<h2><strong>Monthly S&amp;P500 Emini futures candlestick chart:</strong><br>2nd leg down is testing bottom of trading range</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-monthly-candlestick-chart-testing-February-low.png\"><img loading=\"lazy\" src=\"2018-12-15.png\" alt=\"Emini monthly candlestick chart testing February low\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has a big bear bar so far in December. The bears want a breakout below the February low. However, trading ranges resist breaking out and therefore a bounce is more likely. If they get a breakout, the next support is the bull trend line below 2400.<p>The monthly S&amp;P500 Emini futures candlestick chart turned down from a double top in October. October had the biggest bear body of any bar in over 100 bars. It therefore has an increased potential to lead to several more months of sideways to down trading.<p>After staying above the 20 month EMA for more than 20 months, the Emini dipped slightly below it in October. November and December also tested below. However, the bears do not have a close below it yet. If they get 2 closes at least a little below the EMA or a huge bear bar closing far below, the Emini will probably fall to the bull trend line below 2400.<p>Without that, the Emini will probably stay in its yearlong trading range for at least a few more months. If it can’t go down, it will probably test up. But, that huge bear body in October will make it difficult for the bulls to get a quick rally to a new all-time high.<p>Strong selling like that typically does not reverse up sharply. There is usually at least 3 – 5 sideways bars when the market transitions from the bears being in control to a small trading range. Once the bulls are confident that the bears have lost control, they will be willing to buy again. At that point, they could create a rally to test the old high.<h2><strong>Weekly S&amp;P500 Emini futures candlestick chart:</strong><br>Follow-through selling after outside down week, testing February low</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-weekly-candlestick-chart-follow-through-selling-but-bottom-of-trading-range.png\"><img loading=\"lazy\" src=\"2018-12-15-1.png\" alt=\"Emini weekly candlestick chart follow through selling but bottom of trading range\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart had a huge outside down bar last week. This week triggered a sell signal by trading below last week’s low. However, the week had a big tail below. It was therefore making it a weaker entry bar for the bears. This reduces the chance of a successful break below the February low before the end of the year.<p>The weekly S&amp;P500 Emini futures candlestick chart triggered a sell signal this week by trading below last week’s low. Last week was a big outside down bar and it closed below the low of the prior week. That is good for the bears.<p>But, the bar is in a tight trading range, which is a Limit Order Market. This means there are usually more buyers below bars and sellers above. This is true even when there are strong trend bars. Last week was a huge bear trend bar, but there was not strong selling below its low this week.<p>Look back over the past 2 months. Traders sold above big bull bars and bought below big bear bars. They are buying low, selling high, and taking quick profits. This created the trading range of the past 8 weeks.<p>The bears need consecutive closes below the October low. In addition, if those 2 bars are big bear bars closing near their lows, their breakout below the 2 month range will probably lead to a 200 point measured move down. That is near the bull trend line on the monthly chart. The selloff would probably get drawn down to that magnet before the bulls would look for a reversal up.<h2><strong>Daily S&amp;P500 Emini futures candlestick chart:</strong><br>Emini in trading range between 2017 close and February low</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-daily-candlestick-chart-fhas-small-double-top-bear-flag.png\"><img loading=\"lazy\" src=\"2018-12-15-2.png\" alt=\"Emini daily candlestick chart fhas small double top bear flag\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart has had several big moves up and down over the past 2 months. It is oscillating above and below last year’s close. The bears want a breakout below the February low. However, the year will probably end above the February low and below last year’s close.<p>The daily S&amp;P500 Emini futures candlestick chart has tested last year’s close repeatedly for the 1st 5 months of the year and for the past 2 months. The chart is telling us that traders are debating whether this year will have a small gain or loss.<p>When the Emini spends a lot of time around one price going into the end of the day, week, month, year, it often does not decide whether to close above or below the price until the very end.<p>I did not post a year chart. If I did, you would see that it has a small body. That is neutral. The Emini might wait for the last 1 – 2 trading days before making a quick move slightly above or below last year’s close.<h4>How important is the close of 2018?</h4><p>Does it matter if this year’s close is a little above or below last year’s close? It is a minor sign of strong bulls or strong bears. That means it does not have significant predictive power for next year. A close around the open of the year represents balance between the bulls and the bears. Traders will have to wait for 2019 before there are early clues that tell them if the next move will be up or down.<p>Everyone wants high probability bets. In a trading range, the market is neutral. Consequently, the bulls and bears have the same probability of a successful breakout. Until there is a breakout, traders will bet on reversals. Furthermore, they will take profits after 1 – 3 days. There is no evidence yet that this is changing.<p>The FOMC is a catalyst on Wednesday. But, last year’s close is more important. Consequently, even if there is a big move on Wednesday, it will probably not have more than a day of follow-through. The Emini will probably close the year above the February low and below last year’s close. Since it is now oversold and near the bottom of the range, it will probably bounce in the next 2 weeks.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-12-15"
    }
  ],
  "17": [
    {
      "data": [
        "<article class=\"post-84142 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini bears will probably not get Christmas bear trendIntraday market update: Monday December 17, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini bears will probably not get Christmas bear trend</strong><br>Intraday market update: Monday December 17, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-12-17T06:20:35-08:00\">December 17, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini bears will probably not get Christmas bear trend</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>The Emini sold off on Friday in a bear channel. Last week was a bear bar on the weekly chart and it closed below the prior week’s low. The bears are tyring to close the year on its low, below the February low.<p>But, the Emini is near the bottom of a yearlong trading range. Also, the close of last year is a magnet. The bulls might get a rally back to it in the final days of the year.<p>While the momentum down on the daily chart is good for the bears, the location at the bottom of the yearlong trading range is good for the bulls. Trading ranges resist breaking out. The Emini will probably finish the year above the February low and below last year’s close. Since the Emini is at the bottom of its trading range, the odds favor a rally back to the middle and possibly the top over the final 2 weeks.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 6 points in the Globex session. It will therefore open as a continuation of Friday’s bear channel. But a bear channel is a bull flag. The odds favor a bull breakout. In addition, channels on the 5 minute chart rarely last more than 3 days. Consequently, the odds favor at least a 20 – 30 point rally today or tomorrow.<h2>Friday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-bear-channel-with-close-below-October-low.png\"><img src=\"2018-12-17.png\" alt=\"Emini bear channel with close below October low\"></a><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex double bottom higher low major trend reversal setup</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/EURUSD-Forex-doubble-bottom-higher-low-major-trend-reversal.png\"><img loading=\"lazy\" src=\"2018-12-17-1.png\" alt=\"EURUSD Forex doubble bottom higher low major trend reversal\"></a><p class=\"caption\">The EURUSD daily Forex chart has been in a trading range for 2 months. The month-long triangle had a bull breakout and then a bear breakout. There is now a double bottom higher low major trend reversal (DB HL MTR) buy setup.<p><br>The EURUSD daily Forex chart has been sideways for 2 months. Trading ranges resist breaking out. There is always both a bear setup and a bull setup. Most fail to lead to a breakout. Instead, the trading range keeps adding bars and forming new patterns.<p>The month-long triangle has evolved into a double bottom higher low major trend reversal. If today closes near the high of the day, it would be a buy signal bar for tomorrow.<p>A major trend reversal setup has a 40% chance of leading to a swing trade. The minimum goal is a test of the October 16 high and a 2nd leg up from the November 12 low.<p>But, there is a 60% chance that either the trading range or the bear channel (lower highs) will continue. Since the reward is at least twice the risk, if today closes near the day’s high, this would be a reasonable buy setup.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD rallied 50 pips overnight. Because the bulls want a good buy signal on the daily chart, they will buy 20 – 30 pip selloffs today. Some will hold part of their position for a test of the November 1.15 high or the October 1.16 high.<p>The bears want the 3 month bear channel to continue. They do not want today to become a good buy signal bar. They therefore will sell rallies and try to make today close be at least below its midpoint.<p>However, the overnight bull channel has been tight. As a result, the bears have not even been able to make 10 pip scalps. They need deeper pullbacks before most day traders will begin to sell.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-new-low-of-year-after-breaking-below-February-low.png\"><img loading=\"lazy\" src=\"2018-12-17-2.png\" alt=\"Emini new low of year after breaking below February low\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>The big story today is that the Emini broke below the February low. Today is therefore the new low for the year, even though it closed slightly above the old low.<p>The bulls want a strong reversal back up to the close of last year by yearend. However, as I wrote over the weekend, this year will probably close down. I also sad that the Emini will probably close above the February low.<p>Today’s momentum down increases the chance of the year closing on its low.<br>But, the Emini is only slightly below the February low. A minor bounce this week or next will result in a close above the February low.<p>Can the Emini close the year below the monthly bull trend line below 2400? Unlikely because that is far below and there are only 9 trading days left In addition, the week between Christmas and New Year’s is typically quiet.<p>Today was the 5th consecutive bear trend day on the daily chart. That is unusual and therefore climactic. Also, today was the 3rd day in a bear channel. A 4th day is rare. The bulls will probably get a bull body tomorrow or Wednesday.<p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-12-17"
    }
  ],
  "18": [
    {
      "data": [
        "<article class=\"post-84332 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini sell climax test of February and 2018 lowIntraday market update: Tuesday December 18, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini sell climax test of February and 2018 low</strong><br>Intraday market update: Tuesday December 18, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-12-18T06:20:44-08:00\">December 18, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini sell climax test of February and 2018 low</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Yesterday, the Emini bears broke below the February low and formed a new low of the year. It closed slightly above. I wrote over the weekend that the year will probably close above the February low and below last year’s close. That is still likely, given that the year is a trading range.<p>Yesterday was the 5th consecutive bear trend day on the daily chart. That is unusual for 2018 and therefore unsustainable. It makes it likely that today or tomorrow will be a bull day.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 16 points in the Globex session. While yesterday was in a strong bear trend, it was climactic. It was probably just a sell vacuum test of the February low. Yesterday’s late reversal up was strong and probably the start of a trading range.<p>When a market breaks below major support, it usually pulls back. However, it usually falls again below that support. At that point, traders watch to see if the breakout will continue or if it will reverse up a second time. Therefore, traders expect another test of the February low today.<p>Because yesterday was a sell climax, there is a 75% chance of at least 2 hours of sideways to up trading today, beginning by the end of the 2nd hour. There is also a 50% chance of follow-through selling in the 1st 2 hours.<p>But, there is only a 25% chance of another big bear day. This makes sense because of the uncertainty of tomorrow’s FOMC announcement. That is a potential catalyst. The Emini might wait until then before deciding whether to collapse down to the monthly bull trend line below 2400 or reverse up.<p>After 5 bear days on the daily chart, today or tomorrow will probably be a bull day. Therefore, the bulls will look for buy setups if today falls below the open. This is especially true in the final hour.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-new-low-of-year-after-breaking-below-February-low.png\"><img src=\"2018-12-18.png\" alt=\"Emini new low of year after breaking below February low\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex double bottom higher low major trend reversal ahead of FOMC</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/EURUSD-Forex-double-bottom-higher-low-major-trend-reversal-ahead-of-FOMC.png\"><img loading=\"lazy\" src=\"2018-12-18-1.png\" alt=\"EURUSD Forex double bottom higher low major trend reversal ahead of FOMC\"></a><p class=\"caption\">The EURUSD daily Forex chart triggered a buy signal today by going above yesterday’s high. There is a double bottom higher low major trend reversal. However, the chart is still in a trading range and therefore neutral.<p><br>The EURUSD daily Forex chart has been in a tight trading range for 8 weeks. It therefore has both buy and sell signals. Yesterday was a good buy signal bar for a double bottom higher low major trend reversal. This is a credible buy setup. However, the probability of a swing up is only 40%. Traders wanting higher probability will wait for a strong breakout above the December 12 lower high of 1.1444.<p>The bears want this breakout to reverse, like all of the other breakouts up and down for the past 2 months. They then want a breakout below the double bottom and then the November low.<p>Tomorrow’s FOMC announcement is a potential catalyst for a big move up or down. Furthermore, currencies sometimes begin moves around the 1st of the year that last for months. Consequently, traders should be ready to switch from trading range trading to trend trading within the next few weeks.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart rallied 70 pips overnight in a tight bull channel. It broke above yesterday’s high and triggered a buy signal on the daily chart.<p>However, it then sold off 30 pips in a tight bear channel. That creates a Big Up, Big Down move, which means Big Confusion. A strong minor reversal usually leads to a trading range. The odds are that there will be a test of the overnight high today.<p>But, the bars are small and most overlap several other bars. This is not how a strong breakout typically looks. Therefore, while the daily chart triggered a buy signal, the 5 minute chart will probably be in a range today. Traders might be waiting for tomorrow’s FOMC announcement.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-double-top-and-then-close-below-February-low.png\"><img loading=\"lazy\" src=\"2018-12-18-2.png\" alt=\"Emini double top and then close below February low\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>The Emini was in a trading range for a few hours. Then, the bears got a double top lower high major trend reversal. The selloff fell below the February low and yesterday’s low. After a strong rally that failed to get back to the open, the Emini collapsed into the low. By closing below the February low, today was the new low and low close of the year.<p>Tomorrow’s 11 a.m. PST FOMC announcement will probably create a big move. It can be up, down, or both. Traders should be flat going into the report and not trade again until at least 10 minutes later. Because the Emini has had many big reversals over the past 2 month, there is an increased chance of a big trend day up or down.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-12-18"
    }
  ],
  "22": [
    {
      "data": [
        "<article class=\"post-84334 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini breakout below 2018 head and shoulders topWeekend market update: December 22, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini breakout below 2018 head and shoulders top</strong><br>Weekend market update: December 22, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-12-22T23:30:53-08:00\">December 22, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2><strong>Market Overview</strong></h2><p>The<strong>30 year Treasury bond futures</strong>monthly chart is in a strong enough bear rally to test the 2017 lower high. However, the nested wedge top and the strong 1st leg down in 2016 make the rally likely to fail. The bond market will probably be in a bear trend for 20 years.<p>The<strong>US Dollar</strong>monthly futures chart has rallied in 2018. But, the rally is at the top of a 15 year trading range. Trading ranges resist change and reversals are more common than breakouts. It will therefore likely reverse back down within the next 6 months.<p>The<strong>Emini</strong>selling this week was from the bulls finally giving up. This is a major change in market psychology. The daily and weekly charts are now in a bear trend and no longer in a trading range.<p>When the bulls give up, there is usually at least a small 2nd leg down. In addition, there are bull trend lines and measured move targets between 2,300 and 2,400. Support is a magnet. The strong momentum down makes lower prices likely.<p>Since there is a sell climax on the daily chart, the Emini might rally for a week or so. However, a bear flag is more likely than a bull trend reversal.<h2><strong>Monthly 30 year Bond futures candlestick chart:</strong><br>Bear rally to double top lower high major trend reversal after wedge top</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Bond-futures-monthly-chart-bear-rally-to-double-top-bear-flag.png\"><img loading=\"lazy\" src=\"2018-12-22.png\" alt=\"Bond futures monthly chart bear rally to double top bear flag\"></a><p class=\"caption\">The monthly 30 year Treasury Bond futures candlestick chart has been in a trading range for 2 years after a massive nested wedge top. November was a buy signal bar for a lower low double bottom. December so far is a big bull bar. The rally will probably form a double top bear flag with the September 2017 lower high.<p>The 30 year Treasury Bond futures chart has been in a trading range for 2 years. This follows a 10 year nested wedge top. The selloff in 2016 was strong enough to have a 2nd leg down. While the selloff from the September 2017 high is a 2nd leg down, it is probably not enough.<p>November was a buy signal bar for a lower low double bottom with the March 2017 low. The bulls see December as the entry bar for the breakout of that double bottom. They are hoping that it is a 2 legged pullback from the wedge top. Obviously, they want the 20 year bull trend to resume.<p>However, a 2 legged pullback from a wedge top usually has about half as many bars as there were in the wedge. When the pullback is much smaller, like the current one, it typically is a complex 1st leg down.<p>Consequently, the 2 month rally is probably only part of a 2 legged pullback (bear rally) from the 1st leg down in March 2017. Traders should expect the rally to fail around the September 2017 high. If there is a reversal down from there, the bears would have a double top bear flag. In addition, there would be a double top lower high major trend reversal.<p>A wedge top often has a strong bounce after the 1st leg down. If the bear trend resumes, that bounce is usually the right shoulder of a head and shoulders top. In this case, the left shoulder is the January 2015 high.<h4>Most trend reversals fail, but not this one</h4><p>Most major reversals fail. Most tops involve trading ranges in bull trends. Since markets have inertia, the odds favor a resumption of the bull trend.<p>Why is this top different? First, the nested wedge rally had a classic wedge shape. Next, the rally from the June 2015 higher low was climactic. Finally, the 1st leg down in late 2016 was remarkably strong. These factors make a 2nd leg down likely.<p>The two legs down from the 2016 top are too small in terms of the number of bars and the depth of the selling to adequately relieve the buy climax. Consequently, the odds favor a 2nd leg down over the next several years. A measured move down would be below 100 and test the 2011 higher low.<p>There is always a bull case. Without a strong break above the September 2017 right shoulder, the bulls have only a 40% chance of a new high before a bigger 2nd leg down.<h2><strong>Monthly US Dollar futures candlestick chart:</strong><br>15 year trading range with head and shoulders bottom and double top</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/US-Dollar-monthly-candlestick-chart-has-head-and-shoulders-bottom-1.png\"><img loading=\"lazy\" src=\"2018-12-22-1.png\" alt=\"US Dollar monthly candlestick chart has head and shoulders bottom\"></a><p class=\"caption\">The monthly US Dollar futures candlestick chart has been in a trading range for 15 years. It is therefore in breakout mode. A reversal down from here would create a 4 year head and shoulders top and a 15 year double top. A selloff from above the 2017 high would form a 4 year expanding triangle top. The bulls need consecutive closes above the 2017 high to shift the probability in favor of a successful breakout.<p>The US Dollar monthly futures chart sold off strongly in 2001 and then entered a trading range for 15 years. This is a breakout mode pattern. Every trading range has both reasonable buy and sell setups. The bears want the 2018 rally to fail around 100 at the top of the 15 year range. A reversal down from the current level would create a 4 year head and shoulders top.<p>If the bulls break above the trading range, but the breakout reverses down, there would be a 4 year expanding triangle top. Traders would then look for at least a 10 bar selloff. Since this is a monthly chart, that would be about a year.<p>A break below the 2018 low would trigger a failed head and shoulders bottom. The bears would then hope for about a $10 measured move down to the bottom half of the 15 year range.<p>The bulls need 2 strong closes above the 2017 high before traders will believe that the bottom is in. If so, their goal would be a measured move up. Since the 15 year range is about $30 tall, the bulls would hope for a $25 – $30 rally back to the 2001 high.<h4>How to trade the monthly chart</h4><p>Traders do not trade the monthly chart. Investors make investments based on the chart. Traders are looking for moves that last minutes to weeks. If a trader is willing to hold a position for 6 months to years, he is then considered to be an investor and not a trader.<p>Most people reading this are traders. Consequently, they are simply looking for breakouts or reversals on the monthly chart, but are entering on the daily or weekly charts. They plan to exit within a few days to a couple weeks. Then, they look for the next trade up or down.<p>Swings on the monthly chart can last for years. During those swings, there are always many good trades in the opposite direction on smaller time frame charts. That is the case here. While it is interesting to watch the monthly chart unfold, the monthly chart is for investors and not traders.<h2><strong>Monthly S&amp;P500 Emini futures candlestick chart:</strong><br>Sell vacuum test of bull trend lines</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-monthly-candlestick-chart-breaking-below-neck-line-of-double-top-2.png\"><img loading=\"lazy\" src=\"2018-12-22-2.png\" alt=\"Emini monthly candlestick chart breaking below neck line of double top\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart so far has a huge bear body in December. The momentum down is likely to drive the monthly chart to at least one of the bull trend lines. The measured move target from the double top is at 2,146, which is just below both lines.<p>The monthly S&amp;P500 Emini futures candlestick chart has a huge bear bar with one week remaining. The big bear bars in October and December indicate strong momentum down. Consequently, most bulls will wait for at least a micro double bottom before betting that the selloff has ended. That typically would take at least 2 more months to form. There is currently a 70% chance of at least a break below the green trend line. I drew it using the October 2011 and January 2016 lows.<p>There is another less important bull trend line just below. The spacing between the 1st 2 points is small compared to that between the 2nd and 3rd points. When the shape is bad like this, fewer computers use it in their decision making.<h4>2014 – 2015 Final Bull Flag?</h4><p>The Emini began a strong bull trend in January 2016. The 2 year rally was in a tight bull channel. In fact, until January 2018, there was an 15 bar bull micro channel. That was the most extreme buy climax in the 100 year history of the stock market. That is why I said in January that at least 5 – 10% correction was imminent.<p>I also wrote many times during the 2 year buy climax that the odds were at least 60% that the rally would ultimately reverse down to 1,800 at the bottom of the 2014 – 2015 range. I said that it might take 5 years to achieve the goal, but that 2 year range was a strong magnet. It held the Emini in a tight range for 2 years. Since it formed late in a bull trend, it was a good candidate for the Final Bull Flag. Its low around 1,800 is the typical goal for the reversal down.<h4>Magnet at bottom of 2016 – 2017 buy climax</h4><p>The bottom of the Final Bear Flag is also the bottom of the 2016 – 2107 buy climax. When a buy climax reverses strongly like this one is doing, the bears try to get all of the way to the start of the buy climax. That is the January 2016 low just below 1,800.<p>That would totally erase all of the gains of the Trump years. Since markets are the alpha male of capitalism, they tend to humble everyone. This especially includes a president who implies that he can control the market and make it go up, unlike anyone else.<p>Prior to December, the Emini was likely to to have one more new high before reversing down. If December closes on its low, it will close around the midpoint of the 2016 – 2017 buy climax. The momentum down will make it more likely to continue down to the 1,800 buy climax low before making a new high.<p>If December rallies this week and puts a prominent tail on the bottom of the December candlestick, or if January is a big bull bar, the odd will favor a new high before a test of 1,800.<h4>Can the bear breakout fail?</h4><p>When there is a strong bear breakout, everyone believes that the Emini will continue to fall at least a little lower. This is especially true because of the magnetic pull of the bull trend lines and the measured move target below.<p>However, experienced traders know that when something is obvious, the exact opposite is more likely than what most traders believe.<p>Currently, the bulls have only a 30% chance that December will be the low of the correction. But, if January is a bull bar closing near its high, the probability of a failed bear breakout will rise to 40%. This is particularly true if January is a big bull bar closing near its high.<h2><strong>Weekly S&amp;P500 Emini futures candlestick chart:</strong><br>Emini Bear Surprise Bar breakout below 2018 head and shoulders top</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-weekly-candlestick-chart-breaking-below-neck-line-of-head-and-shoulders-top.png\"><img loading=\"lazy\" src=\"2018-12-22-3.png\" alt=\"Emini weekly candlestick chart breaking below neck line of head and shoulders top\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart formed a huge bear bar this week. It is a breakout below the neckline of a hear and shoulders top.<p>The weekly S&amp;P500 Emini futures candlestick chart broke strongly below a 50 bar trading range after a 500 bar (10 year) buy climax. The bear candlestick was unusually big and unexpected. It is therefore a Bear Surprise Bar, which has a 60% chance of at least a small 2nd leg sideways to down. There is a 30% chance of a 3 – 5 bar bounce before the 2nd leg down begins.<p>The surprise bar represents a change in perspective. The bulls this week had become desperate and were selling out at any price. They were giving up (the Surprise Bar here is also a Give Up Bar). They did not want to wait for a rally to sell because they were afraid that the rally might come from much further down and not get back to the current level.<p>The bears became much more aggressive. There were selling at the market and at the low. This is because they are now confident that one of 2 things will happen. Either the selloff will continue and they can take profits. Or, there will be a minor reversal up. They would sell more, confident that there would be at least a test of the prior low.<p>This would allow them to get out of their 1st short at around breakeven. They could also exit their higher short with a profit.<h4>Head and Shoulders top and lower high major trend reversal</h4><p>Some traders will call the December 3 high the right shoulder of a head and shoulders top. Others will think of it as a lower high major trend reversal.<p>More important than the name is the size of this week’s bear breakout. The bigger a breakout bar is and the more it closes on its low, the more likely the selloff will fall for about a measured move down. There is currently about a 60% chance reaching at least around 2,300. That is also near the monthly bull trend line.<p>There are always multiple ways to draw measured move projections. A popular approach is to use the highest and lowest points in the range, or any major high with any major low. No matter how a trader draws his lines, the target is between 2,200 and 2,300.<h4>Will the bulls reverse the sell climax next week?</h4><p>This week is the 2nd leg down from the September high. Swings in a trading range often end after a 2nd leg down. The 1st leg down was the October low. If the 3 month selloff is simply a bear leg in what will become a big trading range, the bulls will probably get a reversal next week.<p>However, because this past week was so unusually big, the bulls will seen several consecutive bull bars to reverse the selloff. A single strong bull bar will probably be a pullback. The bear trend would then reverse within a few weeks.<h4>2nd Leg Bear Trap</h4><p>When there is a huge bear bar in a 2nd leg down, the bulls have a 40% chance of a 2nd Leg Bear Trap. Bears often see the huge bar as a great opportunity to take partial profits. Their protective stop is far above. They therefore have big risk. Their risk managers will force them to reduce the risk.<p>The easiest way is to buy back part of their shorts. The bulls know this and often buy the close of a big bear bar in a 2nd leg down, hoping for a rally for a few days. Therefore, there is an increased chance that the bulls and bears might buy the open on Monday. This could lead to several days of higher prices.<p>But, unless the bulls get several consecutive bull trend bars, the odds are that any rally will be a bear flag. Lower prices are likely.<br><h2><strong>Daily S&amp;P500 Emini futures candlestick chart:</strong><br>Sell climax just above measured move target</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-daily-candlestick-chart-sell-climax-near-double-top-measured-move-target-1.png\"><img loading=\"lazy\" src=\"2018-12-22-4.png\" alt=\"Emini daily candlestick chart sell climax near double top measured move target\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart is in a strong bear breakout. There have been 9 consecutive bear bars, which is unsustainable and climactic. There will probably be a bounce this week from the measured move projection based on the October/November double top bear flag.<p>The daily S&amp;P500 Emini futures candlestick chart is accelerating down in its bear trend. However, 9 consecutive bear trend bars is very unusual. There will therefore probably be at least one bull bar this week. If the bulls get a micro double bottom, they could begin a rally that could last a week or two.<p>Whenever a market is in an unusual streak like this, it is unsustainable. It is therefore a sell climax. In addition, Friday had the biggest bear body of the 9 day streak. That is a sell climax within the 9 day sell climax.<p>A sell climax attracts profit-taking by the bears and buying by aggressive bulls. That is what is likely for at least a few days over the next 2 weeks.<p>Finally, the Emini is at the end of the month and the end of the year. The monthly and yearly charts are now at their extreme lows. Most big bear bars do not close on their extreme lows. That increases the chance of at least a 20 – 50 point rally above the low of the year before the end of December.<h4>Only minor reversal up</h4><p>The 1st rally after a sell climax is often strong enough to make traders wonder if the trend is reversing. There are often 2 – 3 consecutive big bull days closing near their highs. In addition, there is frequently a 2nd leg up.<p>But, when the bear channel is tight like this, the 1st reversal up has only a 30% chance of ending the bear trend. Instead, it has a 70% chance of being either a bear flag or a bull leg in what will become a trading range.<p>The bulls will take quick profits around the resistance of the EMA, the top of the 9 day bear breakout, and the breakout point. Different computers will consider the October low, the February low, or the December 10 low as the most important point. It does not matter. They are all around 2,600. If there is a 1 – 2 week rally, the bears will look to sell there.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-12-22"
    }
  ],
  "26": [
    {
      "data": [
        "<article class=\"post-84336 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini December stock market crash to monthly bull trend lineIntraday market update: Wednesday December 26, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini December stock market crash to monthly bull trend line</strong><br>Intraday market update: Wednesday December 26, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-12-26T06:20:29-08:00\">December 26, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini December stock market crash to monthly bull trend line</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Monday was the 10th consecutive bear trend bar on the daily chart. This has never happened in the 20 year history of the Emini. It did not even happen in the 50 – 60% selloffs in 2002 and 2008. It is therefore unsustainable. That makes it a sell climax.<p>It will likely end this week. The bears will sell the 1st bull bar. But, the bulls might get a micro double bottom a day or two later. The Emini will probably soon enter a 200 – 300 point tall trading range for many months.<h4>Stock market crash</h4><p>The Emini is crashing on the daily chart. At the end of Monday, it finally dipped below the monthly bull trend line. Most bear markets end at monthly bull trend lines.<p>But, the momentum down is strong. In addition, there is another monthly bull trend line around 2,100. That is near the top of the 2014 – 2015 trading range. Since 2015, I have been saying that that trading range would probably be the final bull flag.<p>Furthermore, I said the Emini would probably hit 1,800 within the next 3 – 5 years. Prior to this month, the odds favored a new high before reaching that target. At the moment, there is a 50% chance that this selloff will reach the target before making a new high.<p>Because the Emini has crashed down to monthly support, the bears will probably begin to take partial profits here. The bulls know that and will start to scale into longs. With both the bears and bulls starting to buy, the Emini could begin a 1 – 2 week bear rally. Traders will look for a reversal up this week. Until there is a clear reversal, they will continue to sell every small rally on the 5 minute chart.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 20 points in the Globex session. In addition, it reversed up 60 points from an early overnight selloff. Because a 1 – 2 week rally will probably begin this week, there is an increased chance that this is the start.<p>Friday ended in an extreme sell climax. There is therefore a 75% chance that today will have at least a 2 hour rally or trading range that begins by the end of the 2nd hour. There is a 50% chance of some follow-through selling in the 1st hour. But, the bears only have a 25% chance of another big bear trend day today.<p>The bulls will look for a swing up today. While the bears hope for another bear trend day, they know that the daily chart is in an extreme sell climax and that the monthly chart is below its bull trend line. Consequently, many bears will begin to take profits and wait to sell again near resistance on the daily chart. This reduces the chance of another big bear day.<p>Because the ranges have been huge, both the bulls and bears will probably have swing trades every day. However, the number and size of the bull swings will probably begin to get bigger than the bear swings.<p>The week between Christmas and New Year’s is usually the quietest of the year. However, this is relative. A quiet week after days that are 50 points tall could still have many days that are 30 – 50 points tall. Consequently, instead of lots of tight trading range trading, which is typical of this time of year, traders will probably still have many swing trades up and down.<h2>Monday’s setups</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-stock-market-crash-down-to-bull-trend-line.png\"><img src=\"2018-12-26.png\" alt=\"Emini stock market crash down to bull trend line\"></a><p class=\"caption\">Here are several reasonable stop entry setups from Monday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market in tight trading range at apex of wedge</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/EURUSD-Forex-charat-in-tight-trading-range-at-apex-of-wedge-bottom.png\"><img loading=\"lazy\" src=\"2018-12-26-1.png\" alt=\"EURUSD Forex charat in tight trading range at apex of wedge bottom\"></a><p class=\"caption\">The EURUSD weekly Forex chart has been in a tight trading range below the 20 week EMA for 9 weeks. In addition, it is at the apex of a wedge bottom. It is therefore in Breakout Mode.<p><br>The EURUSD weekly Forex chart is in a tight trading range, which is a Breakout Mode pattern. It is also at the apex of a wedge bottom, which is another Breakout Mode pattern. When there is a Breakout Mode pattern, there is a 50% chance that the 1st breakout up or down will fail. In addition, the probability of a bull or bear breakout is 50%.<p>Until there is a breakout, there is no breakout. Traders buy low, sell high, and take quick profits. As a result, as any bar is forming, the odds are greater that the pattern will continue to add more bars than break out.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart has been in a 20 pip range for the past 5 hours. That is so tight that scalpers have a difficult time making money.<p>The week between Christmas and New Year’s is typically the quietest of the year. However, Forex markets often break out in early January. Therefore, day traders are ready for a breakout in the coming days.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-wedge-higher-low-major-trend-reversal-and-FOMO-rally.png\"><img loading=\"lazy\" src=\"2018-12-26-2.png\" alt=\"Emini wedge higher low major trend reversal and FOMO rally\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>After a wedge selloff that tested Monday’s low, the bulls got a strong rally to above the 60 minute EMA. The open of the week is probably going to be the key price for the remainder of the week. This is because the bears want a bear bar after last week’s breakout below a 50 bar trading range. If the bulls instead get a bull bar, traders will begin to wonder if the bear breakout was a trap. If would increase the chance of a big rally over the next couple of weeks.<p>Since today closed near its high, it is a buy signal bar for tomorrow. The bulls want a strong reversal up from the monthly bull trend line. However, more likely, the 1st reversal up will be minor. But, at a minimum, it should test Friday’s high and 2,500 within a couple weeks.<p>Today was a FOMO (Fear Of Missing Out) short covering rally. It formed a Bull Surprise Bar on the daily chart. The odds favor at least 2 small legs sideways to up.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-12-26"
    }
  ],
  "27": [
    {
      "data": [
        "<article class=\"post-84536 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini FOMO rally from sell climax at monthly bull trend lineIntraday market update: Thursday December 27, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini FOMO rally from sell climax at monthly bull trend line</strong><br>Intraday market update: Thursday December 27, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-12-27T06:20:05-08:00\">December 27, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini bear rally from sell climax at monthly bull trend line</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Before the open yesterday, I said that yesterday would probably be a bull trend day. This is because there were 10 consecutive bear bars on the daily chart and that has not happened in the 20 year history of the Emini. Furthermore, the Emini poked below the monthly bull trend line on Monday, and there are usually buyers at a monthly bull trend line.<p>Yesterday’s rally was a strong short covering rally. In addition, FOMO bulls (Fear Of Missing Out) bought all day. It was surprisingly strong. As a result, bulls will buy the 1st pullback. The odds therefore favor at least a small 2nd leg up within a week.<h4>Bear rally and trading range likely over next several weeks</h4><p>A 10 day sell climax means the bears are strong. Consequently, even if the bulls get a 1 – 2 week rally, it will probably be minor. Typically, the bulls need at least a double bottom or a micro double bottom to reverse a bear trend.<p>But, a bear rally can be strong. The 1st target for the bulls is Friday’s high. This is because it was the top of a 2 day sell climax. It will also be near the 20 day EMA and the 2500 Big Round Number. Last Wednesday’s high is a higher sell climax high. There is also a bear trend line on the 60 minute chart around the 2500 Big Round Number.<p>The bulls might need 1 – 2 weeks to get one or all of these targets. In addition, there is a 50% chance of another 1 – 3 day sell climax before the bear rally begins. Many bulls want at least a micro double bottom before buying.<p>The confusion that happens after a climax usually results in a trading range. Big Down, Big Up creates Big Confusion. That is what is likely over the next 2 weeks.<p>The bulls want a bull bar on the weekly chart when this week’s candlestick closes tomorrow. Therefore, they will buy dips below the open of the week. The bears do not want a strong buy signal bar on the weekly chart. They will therefore sell rallies, trying to put a tail on the top of this week’s candlestick.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is down 36 points in the Globex session. Since yesterday was a buy climax, there is a 75% chance of at least 2 hours of sideways to down trading today that starts by the end of the 2nd hour. Even if today is a trading range day, the legs will probably be big enough to swing trade.<p>When there is a buy climax into the close, there is a 50% chance of at least some follow-through buying in the 1st 2 hours. But, there is only a 25% chance of a strong trend day up or down. Day traders expect at least one swing trade up and one down today. Because this is Christmas week, there is an increased chance of protracted tight trading range trading, despite yesterday’s strong trend.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-wedge-higher-low-major-trend-reversal-and-FOMO-rally.png\"><img src=\"2018-12-27.png\" alt=\"Emini wedge higher low major trend reversal and FOMO rally\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex BO Mode with double top bear flag and double bottom higher low major trend reversal</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/EURUSD-Forex-double-top-bear-flag-and-double-bottom-trend-reversal.png\"><img loading=\"lazy\" src=\"2018-12-27-1.png\" alt=\"EURUSD Forex double top bear flag and double bottom trend reversal\"></a><p class=\"caption\">The EURUSD daily Forex chart has been in a tight trading range for 2 months. It is therefore in Breakout Mode.<p><br>The EURUSD daily Forex chart is in a tight trading range. A trading range always has a credible buy and sell signal. Here, the bulls have a double bottom higher low major trend reversal. For the bears, it is a double top bear flag. Until there is a breakout, traders are buying low, selling high, and taking profits every 1 – 3 days.<p>Currency markets sometimes have breakouts on or shortly after New Year’s Day. Since this tight range has gone on for an unusually long time, there is an increased chance that traders are expecting a New Year’s breakout. When one comes, it can sometimes lead to a move that lasts many months.<p>When a market is in Breakout Mode, there is a 50% chance that the 1st breakout will fail and reverse within a few days. In addition, there is a 50% chance that the successful breakout will be up or down.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart has been alternating small trends up and down for several days. It rallied 60 pips last night, but retraced about half of that over the past 2 hours.<p>Day traders are scalping for 10 – 20 pips, as they have been for 2 months. However, tight trading ranges do not last forever. Two months is an unusually long time on the daily chart. Consequently, day traders will be quick to switch to swing trading once they see a big, sustained breakout on the 5 minute chart. That would correspond to a breakout on the daily chart.<p>But, until there is a breakout, there is no breakout. They will make more money scalping while they continue to wait.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-bull-trend-reversal-up-from-test-of-open-of-week.png\"><img loading=\"lazy\" src=\"2018-12-27-2.png\" alt=\"Emini bull trend reversal up from test of open of week\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>After a big gap down, today entered a trading range. Trading ranges are common between Christmas and New Year’s. After a late failed breakout below the open of the week, the bulls got a strong rally. Because there are now consecutive big bull bars, the odds favor higher prices over the next few days. The February low is a target since it is the breakout point.<p>As I have been saying all week, the open of the week is an important magnet, especially on Friday. This is because the bears want a bear bar on the weekly chart. That would be follow-through selling, and it would increase the chance of lower prices over the next few weeks.<p>However, the bulls want a bull bar. They would then see this week as a buy signal bar on the weekly chart for a failed bear breakout. Today tested the open and reversed up strongly. This increases the chance of higher prices next week.<p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-12-27"
    }
  ],
  "28": [
    {
      "data": [
        "<article class=\"post-84538 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini sell signal bar but after sell climaxIntraday market update: Friday December 28, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini sell signal bar but after sell climax</strong><br>Intraday market update: Friday December 28, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-12-28T06:20:16-08:00\">December 28, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini sell signal bar but after sell climax</h2><p class=\"caption\">I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p><br>Yesterday was a 2nd consecutive big bull trend day after an extreme sell climax down to the monthly bull trend line. This increases the chance of higher prices. In addition, the bears will want a micro double top. Consequently, there will probably be at least 2 small legs up. Traders will buy the 1st reversal down.<h4>The importance of the open and high of the week</h4><p>As I have been saying all week, the open of the week is the most important price this week. Today is Friday. The bulls want the candlestick this week to be a bull bar closing on its high. It would then be a reasonable buy signal bar on the weekly chart for next week for a failed breakout below a 50 bar trading range.<p>The bears, however, want a bear body. That is less likely after today’s strong rally from a test of the open of the week. They would then see it as confirmation of last week’s breakout. This would increase the chance of lower prices over the next several weeks.<p>Because the open of the week is so important, if the Emini is within 10 – 20 points of it in the final hour, it will probably get drawn to it to test it again. At the moment, this week will probably close near its high. That means that today will probably be either mostly sideways or a little up.<h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 10 points in the Globex session. It therefore might gap up. If so, the gap will likely be small. While the bulls would want a measured move up, most small gaps close within the first hour.<p>While the week between Christmas and New Year’s typically has lots of tight trading ranges, this time is different. The Emini is reversing up from the most extreme sell climax on the daily chart in its 20 year history. So far, the days have had big swings. That increase the chance of additional big days over the next few days.<p>The bulls currently have all that they need from this week. If today simply goes sideways here, this week’s candlestick on the weekly chart will be a strong buy signal bar. This increases the chance of a tight trading range today. The bulls have been strong and all they need to do is hold their gains.<p>The bears want this week to close below its open, but that is very unlikely after yesterday’s rally The open of the week is about 100 points below.<h4>A buy climax means exhausted bulls</h4><p>Because yesterday was a buy climax, many bulls are exhausted. They will wait for a pullback before buying again. There is therefore a 75% chance of at least 2 hours of sideways to down trading that begins by the end of the 2nd hour.<p>However, there are magnets above and the 2 day momentum up has been strong. There is therefore an increased chance of another strong bull trend.<p>After a buy climax, there is usually only a 25% chance of a strong trend day up or down. With the extreme move up or down, the probability is 40% today.<h2>Yesterday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-bull-trend-reversal-up-from-test-of-open-of-week.png\"><img src=\"2018-12-28.png\" alt=\"Emini bull trend reversal up from test of open of week\"></a><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex tight trading range New Year’s breakout likely</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/EURUSD-Forex-tight-trading-range-N-ew-Years-breakout-likely.png\"><img loading=\"lazy\" src=\"2018-12-28-1.png\" alt=\"EURUSD Forex tight trading range New Year's breakout likely\"></a><p class=\"caption\">The EURUSD daily Forex chart has been in a tight trading range for more than 20 bars. Because this is extreme, it is unsustainable. There will probably be a breakout within a couple of weeks.<p><br>The EURUSD daily Forex chart continues to add bars to its tight trading range. It is about at long as the Breakout Mode Patterns in early 2018 and in the summer. The odds are that the breakout will come soon.<p>Since Forex markets often begin trends in January, traders need to be prepared to switch to trend trading soon. It is important to note that the longer a tight trading range continues, the bigger the breakout is likely to be.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute chart has been in a 40 pip range overnight. The swings are barely big enough to scalp. Since today is at the top of the 2 month trading range, traders are looking to sell rallies. However, the moves have been small and they continue to scalp.<p>There is an increased chance of a breakout within the next couple of weeks. Consequently, if there is an unusually big and relentless move above 1.15 or below 1.13, day traders will switch to swing trading.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-trading-range-day.png\"><img loading=\"lazy\" src=\"2018-12-28-2.png\" alt=\"Emini trading range day\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>The Emini formed a trading range day today. Since it has a bear body, it is a sell signal bar for Monday. Because the week closed near its high, the weekly chart has a buy signal. Conflicting signals usually results in a trading range. That is also likely after the 2 big bull days after the 10 day sell climax.<p>The odds are that the daily chart has begun a trading range. In addition, Monday will probably have a lot of trading range trading. This is in part because New Year’s Eve is typically a trading range day as well.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-12-28"
    }
  ],
  "29": [
    {
      "data": [
        "<article class=\"post-84542 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini reversed up from sell vacuum test of bull trend lineWeekend market update: December 29, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini reversed up from sell vacuum test of bull trend line</strong><br>Weekend market update: December 29, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-12-29T00:30:56-08:00\">December 29, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2><strong>Market Overview</strong></h2><p>The<strong>Emini daily chart</strong>had an extreme sell climax, but reversed up this week. Traders should expect the bear rally to create a trading range for several weeks. Then, there will probably be a break to a new low.<p>The<strong>bond futures monthly chart</strong>is in a bear rally. This could last for several months before the bear trend resumes.<p>The<strong>EURUSD weekly Forex chart</strong>is at the apex of a nested wedge. There will probably be a strong breakout up or down within the next few weeks.<p>The<strong>crude oil futures weekly chart</strong>crashed in a exhaustive sell climax. It will probably enter a $10 trading range for several months.<h2><strong>US Bond futures monthly candlestick chart:</strong><br>Bear rally in head and shoulders top</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/US-Bond-futures-monthtly-candlestick-chart-forming-bear-rally-in-head-and-shoulders-top-1.png\"><img loading=\"lazy\" src=\"2018-12-29.png\" alt=\"US Bond futures monthtly candlestick chart forming bear rally in head and shoulders top\"></a><p class=\"caption\">The Bond futures monthly chart has consecutive bull trend bars and a double bottom bull flag. But, the nested wedge top will probably lead to a break below within the coming year.<p>The US 30 year bond futures candlestick chart has a massive nested wedge top. The odds are that interest rates have made the low and bonds have made their high for the next 20 – 30 years.<p>That does not mean that bonds collapse. As you can see, the monthly chart has been sideways for 2 years. Furthermore, the past 2 months have rallied. The rally will probably reach the September 2017 high area. At that point, the bears will sell again. That would create a double top lower high.<p>Because of the nested wedge top, the probability is that there would be a selloff below the March 2017/October 2018 double bottom. That is also the neck line of the Head and Shoulders top. Then, over the course of several years, there would be about a measured move down.<p>The first major target would be the September 2013 higher low. This is because it was the 1st pullback after a strong rally and it is around a measured move down.<h2><strong>EURUSD Forex market:</strong><br>Tight trading range at apex of nested wedge bottom</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/EURUSD-weekly-Forex-chart-at-apex-of-nested-wedge-bottom.png\"><img loading=\"lazy\" src=\"2018-12-29-1.png\" alt=\"EURUSD weekly Forex chart at apex of nested wedge bottom\"></a><p class=\"caption\">The EURUSD weekly Forex chart has been in a tight trading range for 9 weeks. It is therefore in breakout mode. It is also in Breakout Mode because it is at the apex of a nested wedge bottom.<p>The EURUSD weekly Forex chart is tightly balanced in a 9 week tight trading range. Prior tight trading ranges broke out after a similar duration. Therefore a breakout is imminent. Furthermore, the tight range is at the apex of a nested wedge bottom. Finally, Forex markets have a tendency to begin major moves just after New Year’s Day.<p>Consequently, traders need to be prepared for a breakout and a trend that could last many months. The first target for the bulls is the top of the 7 month trading range at 1.18. The bears initially want a 300 pip measured move down to 1.09 based on the height of the 9 week trading range.<p>It is important to realize that the initial breakout from a Breakout Mode pattern fails and reverses 50% of the time. In addition, there is a 50% chance of the eventual successful breakout being up or down. Once there is a clear breakout, it will probably last several months.<h2><strong>Crude oil market:</strong><br>Probable Final Bear Flag in exhaustive sell climax</h2><p><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Crude-oil-futures-weekly-chart-has-Final-Bear-Flag-and-exhaustive-sell-climax.png\"><img loading=\"lazy\" src=\"2018-12-29-2.png\" alt=\"Crude oil futures weekly chart has Final Bear Flag and exhaustive sell climax\"></a><p class=\"caption\">The crude oil weekly chart had a doji bar this week following a big bear bar last week. The 3 prior weeks were in a tight trading range. That range is a likely Final Bear Flag in a sell climax.<p>The crude oil futures weekly chart crashed over the past 3 months. This past week was a pause bar after a strong breakout from a 3 bar tight trading range. A tight trading range late in a bear trend is often the Final Bear Flag.<p>The odds are that the bears are exhausted. Exhausted bears typically take profits and wait several bars before selling again.<p>This sell climax is a test of the June 2017 low. It is therefore a good location for profit taking. The profit taking causes a short covering rally. If it is strong, bulls will begin to buy for a bear rally back to the Final Flag. Additionally, other bears will begin to panic out of their shorts. The result is often a quick move up to the target.<p>Because the 3 month bear trend is steep, the 1st reversal up is typically minor. Traders look for a test of resistance, like the Final Bear Flag or the 20 week EMA.<p>Once there, the bulls take profits and the bears begin to sell again. However, since sell climaxes usually evolve into trading ranges, the bears will take profits and the bulls will buy again around this week’s low. The result of bulls and bears buying low, selling high, and taking quick profits is a trading range.<p>After an extreme sell climax, the range could last several months. Its height initially will be about $10, from around this week’s low to the Final Flag high.<h2><strong>Monthly S&amp;P500 Emini futures candlestick chart:</strong><br>Big bear trend bar, but big tail below</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-monthly-candlestick-chart-has-huge-bear-bar-that-is-testing-bull-trend-line-and-20-selloff.png\"><img loading=\"lazy\" src=\"2018-12-29-3.png\" alt=\"Emini monthly candlestick chart has huge bear bar that is testing bull trend line and 20% selloff\"></a><p class=\"caption\">The monthly S&amp;P500 Emini futures candlestick chart has a big bear body this month with one trading day remaining. The low broke slightly below the bull trend line connecting the 2011 and 2016 lows and bounced.<p>The monthly S&amp;P500 Emini futures candlestick chart has sold off sharply over the past 3 months. But, it bounced from the monthly bull trend line at the end of the month.<p>It also fell barely below a 20% selloff from the high. By convention, that means the stock market officially is in a bear market. However, a 3 month selloff on the monthly chart is not a bear trend. It is still simply a strong minor reversal.<p>All big selloffs end at monthly bull trend lines. However, they often need a micro double bottom or small double bottom before there is a trend reversal back up.<p>Furthermore, there are often 2 – 3 bull trend lines. Here, there is a lower trend line from the 2009 and 2011 lows. The space between those 2 lows is much smaller than the space between the 2011 low and current low. That lack of symmetry makes traders see it as a weaker magnet. Therefore, they are willing to buy now, believing that the Emini does not necessarily have to fall to the lower line.<h4>This time is different!</h4><p>I can’t count the number of times I have heard this over my 31 years as a trader. Every time the market does something unusual, you will hear some guy with 15 years of experience announce on TV that from his analysis, the market has changed.<p>It has not changed. This selloff will probably behave like all of the others. The odds are against an immediate resumption of the bull trend.<h4>Computer algorithms do not create market moves</h4><p>I have studied charts from over the past hundred years and have watched just about every tick for 31 years. The advent of computers can accelerate the movement, but it does not create the movement.<p>Just look back a couple of years ago. There were countless small days. If the computers could create big moves, they would have done it because they would have made more money.<p>Markets move based on logic. That has always been the case. There have been smart, rational buyers and sellers since markets were invented. If you chart out their trades, the charts from 10,000 years ago would be the same as those today.<p>Computers are not more logical than a group of tens of thousands of expert traders. The patterns today are the same as when I started and as they were 100 years ago.<p>If you don’t believe me, look at charts from the 1920s, but remove the time and price axes. Those charts look exactly as they do today. Both are a reflection of rational human behavior and have to look the same.<h4>20% usually means 30%</h4><p>Suppose you wrote a program that highlights every time the market rallies 6% from a low. What is the probability that it will immediately reverse back down to the start of the move? It is low. Most of the time, it will go at least a little higher before reversing.<p>The same is true for selloffs. Write a program to find all of the times it fell 5%. Then, how much further did each of those selloffs fall before going back to the old high? What you will discover is that if it falls 5% or any % that you choose, it usually will fall about 50% further before reversing. This is true for any size small to moderate selloff or rally.<p>The Emini fell 20% from the high this week and reversed up. Old timers know that it has fallen 20% 32 times since 1927. Of those times that it fell 20%, most fell at least a little further.<p>In fact, once the market falls 20%, the average final low is usually about 30% before there is a new high. Therefore, the final low in the current selloff will probably be below the December low.<h4>Can the Emini test the 2014 – 2015 Final Bull Flag?</h4><p>The odds are that this week’s strong rally will fail and there will be a new low within 1 – 3 months. For the past several years, I have said that the 2014 – 2015 trading range would probably be the Final Bull Flag. This is because a trading range late in a bull trend usually ends up being the final flag.<p>Typically, the bull breakout reverses back to the bottom of the flag. That low is around 1760, which is a 40% drop from the high. I still think the Emini will get there, but I have been saying that there might be one more new high 1st. In addition, the Emini might take a few years to reach the target.<p>As big as a 40% correction is, similar corrections come every 10 years or so. For example, the S&amp;P fell 49% in 2002 and 57% in 2009. Therefore, 40% is not terribly unusual.<p>But, even with all of the selling over the past 3 months, the Emini is only halfway there. One more new high is still more likely before the Emini reaches that target. However, if the Emini continues down to 30% within the next few months, it will probably fall to the 1,800 target area.<br><h2><strong>Weekly S&amp;P500 Emini futures candlestick chart:</strong><br>Emini reversed up from sell vacuum test of bull trend line</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-weekly-candlestick-chart-has-High-2-bull-flag-after-20-selloff-to-bull-trend-line.png\"><img loading=\"lazy\" src=\"2018-12-29-4.png\" alt=\"Emini weekly candlestick chart has High 2 bull flag after 20% selloff to bull trend line\"></a><p class=\"caption\">The weekly S&amp;P500 Emini futures candlestick chart formed a big bull trend reversal bar after last week’s strong breakout below a 50 bar trading range. This week is a buy signal bar for next week. The tail on top of the bar makes it less reliable. Because the selloff was strong, any reversal up will probably be minor.<p>The weekly S&amp;P500 Emini futures candlestick chart formed a big bull buy signal bar this week. The bears broke far below a 50 bar trading range last week. If this week was a big bear bar, the bears would likely have gotten a 400 point measured move down.<p>Instead, this week was a big bull trend reversal bar. The bulls hope that last week’s bear breakout will fail. Furthermore, they want the climactic reversal to continue up to a new all-time high.<h4>Minor reversal more likely than major reversal</h4><p>The 3 week selloff was surprisingly strong. In addition, the prominent tail on the top of this week’s bar weakens the buy setup. Consequently, the 1st reversal up will probably be minor. A minor reversal means that the rally will either form a bear flag or begin a trading range.<p>A resumption of the bull trend would be a major trend reversal. The bulls currently have a 40% chance of achieving that goal without one more new low. Typically, they would need at least a small double bottom before they can get a major trend reversal. That means they will probably need a test back down to around this week’s low before they can resume the bull trend.<h4>Trapped bulls above</h4><p>All of the bulls who bought during 2018 are now holding losing positions. They expected the trading range to have a bull breakout. Many did not exit on the breakout below the February low because they thought it would fail. Instead, the Emini sold off relentlessly and much lower than they thought was likely.<p>Many were distracted by the holidays. They now are desperate to exit with a smaller loss. They want to sell out of their longs on a pullback to around the February low.<p>There are other bulls who bought the sell climax. They know that the reversal up is minor. They, too, want to sell to take profits at the resistance of the bottom of the yearlong trading range.<p>The bears expect a 2nd leg down after a big bear breakout. They took windfall profits on the collapse to the bull trend line. They will sell again around resistance.<p>Everyone wants to sell around the February low. That makes a successful breakout below the trading range more likely than a failed breakout.<p>The odds are that the rally over the next 1 – 3 weeks will end around the February low. There will then be a test of this week’s low. That test will probably lead to a new low. It might fall much further than what traders think is likely.<h2><strong>Daily S&amp;P500 Emini futures candlestick chart:</strong><br>Sharp bear rally after from extreme sell climax</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-daily-candlestick-chart-has-weak-Low-1-bear-flag-after-climactic-reversal.png\"><img loading=\"lazy\" src=\"2018-12-29-5.png\" alt=\"Emini daily candlestick chart has weak Low 1 bear flag after climactic reversal\"></a><p class=\"caption\">The daily S&amp;P500 Emini futures candlestick chart reversed up sharply after 10 consecutive bear trend bars. That selloff was a parabolic wedge sell climax that tested the 7 year bull trend line (see weekly and monthly charts).<p>The daily S&amp;P500 Emini futures candlestick chart crashed down to the 7 year bull trend line on Monday, but reversed up violently on Wednesday. This was a parabolic wedge sell climax. The 1st targets for the bulls are the December 12 sell climax high, the 20 day EMA, the bottom of the 2018 trading range, and possibly the December 12 lower high, which was the start of the parabolic selloff.<h4>A sell climax usually ends with a sharp reversal and then a trading range</h4><p>The selloff had 10 consecutive bear trend bars. This has never happened in the 20 year history of the Emini. It was therefore unsustainable and climactic. The odds favored a sharp reversal.<p>This is similar to the buy climaxes on the daily, weekly, and monthly charts late last year. The S&amp;P was the most overbought in its 100 year history on all 3 time frames. That is why I said that a correction was likely. When there was that final surge in January, I said that the top was likely within weeks. This is because the stock market has always behaved this way.<p>Extreme climaxes usually get extreme reversals. Typically, the market enters a trading range for at least 10 bars. While the current selloff has been extreme, the monthly chart has only gone sideways to down for 11 months. It will probably be in a trading range for at least another 10 bars or more. That means at least a year. It probably has not yet found the bottom.<h4>Trading range more likely than bull trend</h4><p>This week’s rally was dramatic. However, a Big Down move followed by a Big Up move creates Big Confusion. Confusion is the hallmark of a trading range. Traders buy selloffs, sell rallies, and take quick profits.<p>All that they think is likely is that every move will soon reverse instead of breaking into a trend. The exact location of the reversals is rarely clear in advance. The legs up and down often go further than what seems likely. Also, the reversals can be abrupt. Many traders use wide stops and scale in.<p>Buying low, selling high, and taking quick profits creates a trading range. That is what is likely on the daily chart after the current sell climax. The trading range could last 20 or more bars. It will probably have at least 2 legs up. The momentum up this week is strong enough to make higher prices likely over the next week or two.<p>But, since the rally is in a bear trend, the odds favor a new low within the next month or two.<h4>Extreme moves scare buyers</h4><p>There is one more important point. The violent moves up and down scare investors. While it is good for traders, investors are not eager to buy. This makes a resumption of the bull trend unlikely until after the volatility returns to normal for at least a couple months.<p>Many traders were shaken by December, but decided to wait for the new year to exit positions. They were hoping for a Christmas rally. However, most will conclude that 2 days up was disappointing. Consequently, there is a risk that many traders will give up in January. If they do, there could be another big leg down.<h4>What do the bulls need for a major trend reversal up to the old high?</h4><p>If the developing trading range lasts 20 or more bars, the bulls will have some type of a double bottom. At that point, there would be at least a 40% chance of a bull breakout.<p>This is true on the monthly chart as well. There, the Emini had a<em>buy</em>climax and then a 20% reversal down. Consequently, the monthly chart will probably be in a trading range for a year or more.<p>Can the Emini simply continue up to the old high? Probably not. When the selling has been as strong as it has been, the bears are confident and the bulls are scared. The result is that both will sell rallies.<p>Bear rallies can be surprisingly strong. Yet, a lower high is more likely than a new high. If, however, the bulls get 4 or 5 consecutive big bull bars closing near their highs, the odds would shift in favor of a new all-time high.<p>But, after all of the abrupt moves up and down this year, the new high would probably fail. All that the bulls would be doing is making the trading range a little taller. A trading range for many more months and possibly several years is what is likely at the moment.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" title=\"Emini intraday market update\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-12-29"
    }
  ],
  "31": [
    {
      "data": [
        "<article class=\"post-84540 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini weekly buy signal bar on New Year’s EveIntraday market update: Monday December 31, 2018\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini weekly buy signal bar on New Year’s Eve</strong><br>Intraday market update: Monday December 31, 2018</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2018-12-31T06:20:21-08:00\">December 31, 2018</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini weekly buy signal bar on New Year’s Eve</h2><p class=\"caption\">I will update again at the end of the day.<p>Friday was a bear bar on the daily chart after a 2 day pullback from a sell climax. It is therefore a sell signal bar in the bear rally. However, the 2 day rally was very strong. The odds favor at least 2 legs up. Consequently, there will probably be buyers not too far below Friday’s low.<p>The Emini will likely test last Monday’s high this week or next. It was a bear bar and therefore a bad buy signal bar. It was reasonable for bears to sell its high and scale in higher. Reasonable trades usually allow traders to avoid a loss. The Emini typically tests the entry price.<p>Today is New Year’s Eve. The Emini often spends a lot of time in tight trading ranges on this day. However, even if it does, the computers are still there. Look at the final hour of 2009 to see an example of a quiet New Year’s Eve that had a huge bear breakout in the final 30 minutes.<h4>Weekly buy signal</h4><p>Last week was a buy signal bar on the weekly Emini chart. The bulls are hoping that the breakout below the yearlong trading range will fail. However, that bear breakout from 2 weeks ago was big. That increases the chance of a 2nd leg down.<p>But, if the bulls can get a big bull bar this week, they will have erased the bear breakout. Even that is not enough to conclude that the bull trend has resumed. The 3 week selloff was extremely strong. The bulls therefore need to reverse most or all of it to make the weekly chart neutral again. Until then, the odds are that there will be at least a test of last week’s low within a month or two.<p>Because last week is a reasonable buy signal bar, this week will probably trigger the buy signal. That means that this week will likely trade above last week’s high. What traders will find out this week is whether there are more buyers or sellers above last week’s high. Traders have to be ready for a big move up or down.<h4>Conflicting signals usually means confusion and a trading range</h4><p>With the daily sell signal and the weekly buy signal, traders will be confused. Both signals will probably trigger, but fail to go far. The odds favor a trading range for at least a few weeks.<h2>Pre-Open market analysis</h2><h3>Overnight Emini Globex trading</h3><p><br>The Emini is up 19 points in the Globex session. New Year’s Eve is often very quiet. There is an increased chance of a tight trading range for most of the day.<p>Remember, Friday was a trading range day. The recent big days have been exhausting both the bulls and the bears. They will get worn out and more resistant to trading.<p>Furthermore, all of the computers will have switched to high volatility algorithms. This will reduce the number of computers willing to take the other side. Consequently, the high volatility programs will work less well and computers will start using other types of programs. This will result in less volatility.<p>But, even extremely quiet days can have big swings. This is especially true in the final 30 – 60 minutes. Therefore, day traders might get a quick, big profit in the final hour if they are ready to trade a strong breakout up or down.<h2>Friday’s setups</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-trading-range-day.png\"><img src=\"2018-12-31.png\" alt=\"Emini trading range day\"></a><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex chart will breakout soon</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/EURUSD-Forex-chart-will-breakout-soon.png\"><img loading=\"lazy\" src=\"2018-12-31-1.png\" alt=\"EURUSD Forex chart will breakout soon\"></a><p class=\"caption\">The EURUSD daily Forex chart has been in a tight trading range for 2 months. It will probably break out within a couple weeks.<p><br>The EURUSD daily Forex chart has been sideways in a tight range for 2 months. However, the bears have not had 3 consecutive bear bars. The bulls however currently have 3 consecutive bull bars and the had 4 two weeks ago. This is a slight advantage for the bulls.<p>But, it is not enough reason to be holding a swing trade, expecting a bull breakout. It is a sign of buying pressure. It therefore makes a bull breakout slightly more likely than a bear breakout.<p>However, until there is a breakout, there is no breakout. It is better to continue to bet on reversals until there is a strong breakout up or down. That means that traders are looking for reversals.<p>Since Forex markets often begin trends at the 1st of the year, there is an increased chance of a breakout within the next couple of weeks. In addition, the current tight range has lasted about 2 months. Over the past 3 years, breakouts typically came after around 2 months. Traders need to be ready to change from reversal trading to trend trading once the breakout begins.<h3>Overnight EURUSD Forex trading</h3><p><br>The EURUSD 5 minute Forex chart has been in a 45 pip range overnight. Most of the bars have been small, had prominent tails, and overlapped several prior bars. This is quiet, trading range trading. Day traders have been are looking for 10 pip scalps. Because of the worldwide holiday, this quiet trading is likely to continue all day.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p><br><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2018/12/Emini-trading-range-and-close-above-2500-on-final-day-of-2018.png\"><img loading=\"lazy\" src=\"2018-12-31-2.png\" alt=\"Emini trading range and close above 2500 on final day of 2018.png\"></a><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<p><br>Today was the last day of the month and year. The bulls got a close above 2,500. But, both the month and the year closed below their midpoints.<p>On the daily chart, today was a small inside day after a climactic reversal up. The rest of the week is still a holiday week around the world. Therefore, Wednesday has an increased chance of being another trading range day.<p>The daily chart is probably going to form a trading range for the next month. Consequently, traders will buy selloffs, sell rallies, and take quick profits.<p>The sell signal on the daily chart and the buy signal on the weekly chart will probably both trigger within a week. But, since a trading range is likely, the breakouts will be minor. The breakouts will probably reverse within a few bars for the next month.<br><p>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly candlestick chart and for what to expect going into next week.<hr><h4>Trading Room</h4><p class=\"caption\">Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noopener\">2 day free trial</a>.<h4>Charts use Pacific Standard Time</h4><p class=\"caption\">When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a title=\"Emini intraday market update\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Intraday Market Update</a>page.<hr></div></article>"
      ],
      "dateId": "2018-12-31"
    }
  ]
}