{
  "1": [
    {
      "data": [
        "<article class=\"post-87315 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini streak might reach 10 consecutive weeks upIntraday market update: Friday March 1, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini streak might reach 10 consecutive weeks up</strong><br>Intraday market update: Friday March 1, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-03-01T06:20:09-08:00\">March 1, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini streak might reach 10 consecutive weeks up</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Today is the 1st day of March. January and February were strongly bullish. The bulls want the rally to continue throughout March.<p>Today is also the last day of the week. The 2808.00 open of the week is very important. The bulls have 9 consecutive bull bars on the weekly chart. I only found one instance of a streak of more than 9 in the 20+ years history of the Emini. Consequently, the bears will probably get a bear bar this week. That means a close below 2808.<p>When there is a key price like that at the end of the day, week, or month, the chart often hovers around it until the final 30 minutes. Traders then decide on whether the close will be above or below.<p>The bulls will buy below 2808, believing that the Emini will try to get there today. However, there will be many bears selling there.<p>Does the Emini have to get there today? No, but the bears want at least a micro double top with Monday’s high before they will look for a 2 – 3 week pullback. Therefore, the Emini will probably test this week’s open today and this week’s high next week.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 15 points in the Globex session. It is just above the important 2800 Big Round Number and about 8 points below the open of the week. It is close enough to the open to make a test of 2808.00 likely today.<p>Today will open far above yesterday’s close. When there is a big gap up, there is an increased chance of a trend day. Furthermore, a bull trend is more likely than a bear trend.<p>However, a big gap up means that the open is far above the EMA. Most traders do not like to pay far above an average price. Consequently, the chart usually has to test close to the EMA at some point in the 1st hour.<p>Therefore, a big gap up usually leads to a trading range in the 1st hour. The bulls look for a double bottom or wedge bottom near the EMA. On the other hand, the bears want a double top or a wedge top and then a trend down.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/02/Emini-trading-range-day-and-doji-day.png\"><img src=\"2019-3-1.png\" alt=\"Emini trading range day and doji day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/EURUSD-Forex-wedge-bear-flag-in-middle-of-trading-range.png\"><img loading=\"lazy\" src=\"2019-3-1-1.png\" alt=\"EURUSD Forex wedge bear flag in middle of trading range\"></a></figure><p>The EURUSD daily Forex chart has rallied in a wedge bull channel to the middle of its 4 month trading range. A wedge is a climax. The chart typically breaks below the bull trend line (not shown) below the wedge. It can do so by going sideways or by going down.<p>Because the February selloff was unusually strong, there will probably be a test down. It should start within a few days.<p>However, there is always a 40% chance of a bull breakout above a bear flag. If the bulls get one or two big bull bars closing above this week’s high, the rally will probably continue up to the top of the 4 month range.<p>The chart has been sideways for 4 days. Traders are deciding on the direction of the breakout. Trading ranges are more likely to continue than breakout. Therefore, this 4 day range will probably continue today. Traders will then decide next week on the direction of the breakout of the wedge.<p>There is no reason to have an opinion about the direction of the breakout of the 4 month trading range. The probability of a bull breakout is the same as for a bear breakout.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart reversed up from below yesterday’s low. It is back into the middle of the 4 day range.<p>While it has rallied for the past 6 hours, the rally has only been 40 pips. It is therefore just a bull leg in the 4 day tight trading range. Despite the 6 hour rally, day traders are not making more than 20 pips on a trade. Consequently, today will probably continue to be a scalping market.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-bull-trend-reversal-day.png\"><img loading=\"lazy\" src=\"2019-3-1-2.png\" alt=\"Emini bull trend reversal day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini gapped up, but reversed down from a test of the open of the week. During the selloff, I repeatedly said that it looked more like a leg in a trading range than in a bear trend. I mentioned how almost every bar in the 1st 2 hours had a tail below, and that the odds favored a reversal up.<p>The bulls got a midday reversal and once again tried to get back above the open of the week. However, it was too far above. While they got near their target, they could not get the close above the open of the week.<p>This week was the 1st bear bar in 10 weeks. It ended the streak of 9 consecutive bull bars. The odds favor 2 – 3 weeks of sideways to down trading. This is true even if next week trades briefly above this week’s high.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-3-1"
    }
  ],
  "2": [
    {
      "data": [
        "<article class=\"post-87321 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Weekly End of streak of 9 weekly Emini bull barsWeekend market update: March 2, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Weekly End of streak of 9 weekly Emini bull bars</strong><br>Weekend market update: March 2, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-03-02T00:30:33-08:00\">March 2, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2><strong>Market Overview</strong></h2><p>The<strong>Emini</strong>began to pull back this week after a parabolic wedge buy climax on the daily chart. It is at the resistance of the October-November-December triple top and 2800. The streak of 9 consecutive bull bars on the weekly chart ended as well. Traders should expect 2 – 3 weeks of sideways to down trading, even if there is a small breakout above this week’s high first.<p>The<strong>crude oil</strong>futures daily chart turned down on Friday after a parabolic wedge rally. It will probably work down to around $50 over the next few weeks.<p>The<strong>EURUSD</strong>daily Forex chart is in the middle of its 4 month trading range. Traders continue to look for reversals every 2 – 3 weeks. They are waiting for news on Brexit before they will bet on a breakout beyond the range.<h2><strong>Crude oil Futures market:</strong><br>Parabolic wedge buy climax might lead to pullback to 50</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Crude-oil-daily-chart-has-outside-down-bar-and-double-top-3.png\"><img loading=\"lazy\" src=\"2019-3-2.png\" alt=\"Crude oil daily chart has outside down bar and double top\"></a></figure><p>The crude oil futures chart had a strong rally up from the December low. It has been in a tight bull channel for 7 weeks. Since the channel has had 3 pushes up, it is a parabolic wedge buy climax.<p>A buy climax usually means that the bulls are exhausted and will begin to take profits. Typically, the profit taking will last at least 10 bars. In addition, the selloff usually has at least 2 legs. Friday’s outside down move might be the start of the profit taking.<p>If so, reasonable targets are the start of the channel (which is the January 14 low, a 50% pullback (which is around $50), and a Big Round Number (like 50). Therefore, the odds are that either crude oil has begun a pullback to around $50, or there will be sellers not far above this week’s high, and then there will be a pullback.<p>The upside from here is probably minimal without a pullback first. Even then, the chart will probably be in a $20 trading range for many months. The top of the range will probably be between 60 and 65.<h2><strong>EURUSD weekly Forex chart:</strong><br>Trading range, waiting for Brexit news</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/EURUSD-weekly-Forex-chart-at-apex-of-wedge-in-Breakout-Mode.png\"><img loading=\"lazy\" src=\"2019-3-2-1.png\" alt=\"EURUSD weekly Forex chart at apex of wedge in Breakout Mode\"></a></figure><p>The EURUSD weekly Forex chart formed a 2nd consecutive bull bar this week. However, the bars were small and they are in a 4 month trading range. There has been a reversal every 2 – 3 weeks. Therefore, this week will probably not be bullish. More likely it will be sideways to down.<p>The daily chart has rallied for 3 weeks in a wedge bull channel. A wedge rally is a bear flag. A bear break below the bull trend line is more likely than a breakout above the top of the wedge.<p>But the dominant feature is the 4 month trading range. Therefore, the direction of the breakout of the 3 week wedge is not particularly important. Much more important is the reality that every strong move up or down has reversed for 4 months. Consequently, traders do not expect a big move either way. They will continue to bet on reversals.<h3>Trading ranges do not last forever</h3><p>Every trading range for over 2 years broke out after about a couple of months. Since this one has lasted 4 months, it will break out soon. Traders are waiting for news about Brexit.<p>No matter what the news is, there is a 50% chance that the breakout will be up and a 50% chance that it will be down. Furthermore, there is a 50% chance that the 1st breakout will fail and reverse.<p>Traders want to see a breakout up or down that has 2 strong trend bars and consecutive closes beyond the range. Once they see that, they know that the odds will favor about 300 – 400 pip measured move, and a trend with at least 2 legs.<h2><strong>Monthly S&amp;P500 Emini futures chart:</strong><br>March follows 2 consecutive strongly bullish months</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-monthly-chart-has-consecutive-bull-bars-in-middle-of-trading-range.png\"><img loading=\"lazy\" src=\"2019-3-2-2.png\" alt=\"Emini monthly chart has consecutive bull bars in middle of trading range\"></a></figure><p>The monthly S&amp;P500 Emini futures chart&nbsp;rallied unusually strongly in January and February. It reversed up from an 8 year bull trend line after a December sell climax.<p>The rally is testing the top of the December huge bear bar. Despite the strong rally, the chart is still only in the middle of a yearlong trading range. In addition, a Big Down, Big Up move typically creates Big Confusion. Since confusion is a hallmark of a trading range, the trading range is likely to continue. This is true even if the Emini breaks above the all-time high.<p>In addition to confusing traders, trading ranges also disappoint them. The bears were disappointed by the rallies after the 2 big selloffs in February and December last year. In addition, the bulls were disappointed by the reversals down from strong rallies in January and September.<p>After 2 strong months up, the bulls are hopeful that the rally will continue up to a new high. However, what would disappoint them? Either a sideways bar or a bear bar on the monthly chart in March or April. Since the chart is still in a trading range, that is what is likely.<h2><strong>Weekly S&amp;P500 Emini futures chart:</strong><br>End of streak of 9 weekly Emini bull bars</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-weekly-chart-has-1st-bear-bar-in-10-weeks-so-end-of-streak.png\"><img loading=\"lazy\" src=\"2019-3-2-3.png\" alt=\"Emini weekly chart has 1st bear bar in 10 weeks so end of streak\"></a></figure><p>The week S&amp;P500 Emini futures chart finally had a bear body this week. The body was small and therefore the bar was just a doji bar. However, the close was below the open.<p>Prior to this week, the weekly chart had 9 consecutive bull trend bars. I found only one instance of a longer streak in the 20+ year history of the Emini. In every prior streak of 8 or more bull bars, once there was a bear bar, the chart went sideways to down for 3 or more weeks. Consequently, that is what is likely now.<p>Not only have there been 9 consecutive bull bars, every low has been above the low of the prior week. This is a 10 bar bull micro channel. It tells traders that the bulls have been so eager to buy that they are not waiting for a pullback below the prior week’s low.<p>When bulls are this aggressive, they typically are happy to get a chance to finally buy below the low of the prior week. As a result, the 1st pullback usually only lasts 1 – 3 weeks.<p>Furthermore, it is typically not deep. Consequently, the Emini will probably pull back 50 – 100 points in early March. This will attract buyers. The rally will then likely once again test the December high and above 2800.<h3>Bulls will buy even a strong selloff</h3><p>The year will not continue up in a tight bull channel. There will be at least one strong reversal down at some point. It will probably last at least a couple months.<p>But, after a strong reversal up from the monthly bull trend line, the bulls will buy the pullback. This is true even if it is strong and reverses more than 50% of the rally.<p>Whenever there is an exceptionally strong trend reversal, the odds are that there will be at least a 2nd leg sideways to up. This means that the pullback will lead to a rally that will test the top of the 1st leg up.<p>That is the minimum goal. With the rally as strong as it has been and with the monthly chart in a bull flag, the Emini will probably test the all-time high at some point in 2019.<h2><strong>Daily S&amp;P500 Emini futures chart:</strong><br>Parabolic wedge buy climax at 2800 resistance</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-daily-chart-in-parabolic-wedge-buy-climax-at-resistance.png\"><img loading=\"lazy\" src=\"2019-3-2-4.png\" alt=\"Emini daily chart in parabolic wedge buy climax at resistance\"></a></figure><p>The daily S&amp;P500 Emini futures chart has been in a tight bull channel since the January 12 low. This followed a strong reversal up (a bull spike) from the December low.<p>The 6 week tight bull channel has had at least 3 pushes up in it. A tight bull channel with 3 pushes up is a parabolic wedge. That is a type of buy climax. The stop for the bulls is far below. Many bulls will begin to reduce their risk by taking some profits.<p>This past week had a good sell signal bar on Monday. It reversed down from above 2800 and the December high. Friday tested Monday’s high. This is a small double top and a reasonable candidate for the start of a 2 – 3 week, 50 – 100 point pullback.<p>What happens if next week breaks above this week’s high? The daily chart is still at major resistance and it is in a buy climax. There will therefore probably be sellers not far above. A 2 – 3 week pullback is probably underway, or it will begin within a couple of weeks.<h3>Trading ranges sometimes have several highs at the top</h3><p>There is an interesting behavior that is common in trading ranges. If there are 2 or more resistance level that are close to one another, a rally often goes above some of the prior highs, but then fails to go above the highest high. This might be happening now.<p>The Emini went above the December high, but it has not yet gone above the October or November highs, which are just a little higher. The daily chart is in a yearlong trading range. There is therefore an increased chance of the Emini turning down from here for a few weeks.<h3>The importance of 2800</h3><p>The bulls will probably begin to take some profits now that the Emini is testing major resistance. The bulls have been trying to break strongly above 2800 for over a year. Despite July reaching 2950, the bulls could not hold above 2800. The rally collapsed to far below 2800.<p>The bulls failed in October, November, and December to get above 2800. They failed and formed a triple top. The stock market crashed in December down to the monthly bull trend line.<p>However, this bull trend reversal has been exceptionally strong. As a result, the bulls are very eager to buy. Even if the profit taking lasts several months and retraces half of the rally, the odds are that there will be at least one more leg up.<h3>Why do traders buy in a buy climax?</h3><p>Traders are willing to buy in a buy climax because they know the chance of a bear trend near-term is small. They believe they will make money even if they buy at what turns out to be the high of this 1st leg up.<p>Either the current rally will continue up far enough for them to make money, or there will be a pullback and then a test back up to this level. That would create a trading range.<p>In the trading range scenario, they will look for any selloff to reverse back up from a higher low. Many will therefore buy more as the selloff continues or on the reversal up. They then can exit their original buy around breakeven, and they will have a profit on their lower buy.<hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-3-2"
    }
  ],
  "4": [
    {
      "data": [
        "<article class=\"post-87318 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini 9 week bull bar streak converting into small pullbackIntraday market update: Monday March 4, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini 9 week bull bar streak converting into small pullback</strong><br>Intraday market update: Monday March 4, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-03-04T06:20:18-08:00\">March 4, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini 9 week bull bar streak converting into small pullback</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>On the weekly chart, the bears finally got their 1st bear bar after a streak of 9 consecutive bull bars. In the 20 year history of the Emini, there have been many streaks of 8 or more bull bars. Once there was a bear bar, the Emini then went sideways to down for a few weeks. That is likely here, even if the Emini goes a little above last week’s high.<p>Nine consecutive bull bars is a sign of strong bulls. Consequently, the odds are against a big selloff. Many bulls will take some profits and then wait to see how far down the selloff goes. Once it stalls, they will buy again. The selloff will probably only last a few weeks and not be deep.<p>Less likely, there will be an Endless Pullback that lasts 2 – 3 months. That is a bull flag that just keeps adding bars in a gentle bear channel. It is a common type of pullback after a Small Pullback Bull Trend like the bulls have had for 2 months.<p>Since the Emini will likely begin to go sideways for a few weeks, there will be more trading range trading on the 5 minute chart. Furthermore, if the Emini rallies or sells off for a day or two, traders will look for a reversal.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 10 points in the Globex session. It will probably gap up on the weekly chart, like it did last week. However, last week’s gap up closed. Since small gaps typically close quickly, today’s gap up will probably close today or tomorrow.<p>The bulls are trying to break strongly above the October high. While they will probably succeed at some point this year, there will probably be a pullback 1st. Since that target is only about 10 points higher, the pullback will likely begin within a week.<p>Ten consecutive weeks is extremely unusual. Many bulls will probably begin to take profits this week or next. That will result in a 2 – 3 week pullback of at least 50 – 100 points.<p>However, until the bears can get 2 – 3 consecutive big bear bars on the 5 minute chart and 2 – 3 consecutive bear days closing on their lows on the daily chart, traders will correctly continue to bet on higher prices.<p>While the strong bull trend is continuing, almost every day has had at least one swing up and one swing down. In addition, there have not been many big trend days up or down on the 5 minute chart. Day traders will continue to bet that this price action will continue.<h2>Friday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-bull-trend-reversal-day.png\"><img src=\"2019-3-4.png\" alt=\"Emini bull trend reversal day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Wedge-bear-flag-in-middle-of-trading-range.png\"><img loading=\"lazy\" src=\"2019-3-4-1.png\" alt=\"Wedge bear flag in middle of trading range\"></a></figure><p>I wrote last week that the EURUSD daily Forex chart would pull back early this week. This is because the 3 week rally was in a wedge, which is a buy climax. Buy climaxes lead to exhausted bulls, who then take profits.<p>Furthermore, I said that the 3 week rally was strong enough so that the 1st leg down would likely stall about half way down. There is support at the February 19th and 22nd lows. The overnight selloff is near that support. In addition, the chart has been in a tight trading range for 9 days. That February 19th low at around 1.13 is the bottom of the range. Therefore, the daily chart will probably work sideways to down a little more this week.<p>I have repeatedly made the point that the chart has had many strong legs up and down, but that each one was more likely to reverse than to begin a trend. There is no sign that the 4 month range is about to break into a trend. Consequently, traders will continue to look for reversals every 2 – 3 weeks.<p>Because this 4 month range is unusually long, there will probably be a breakout within a month. Traders are waiting for information on Brexit, which has been very slow to resolve.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart sold off 45 pips overnight. It therefore broke below the bull trend line of the past 3 weeks. However, the overnight selloff was not strong. It is therefore unlikely to be the start of a move down to the February low. Instead, the bulls will probably buy again between 1.1250 and 1.13.<p>Since the daily chart has been in a 100 pip range for 9 days, there is no sense of urgency. Traders think the price is just about right. When that is the case, they buy low and buy more lower, they sell high and sell more higher, and they take small profits. They do not believe that any leg up or down will go far. Day traders have been looking for reversals and brief breakouts. They have been scalping for 10 – 20 pips.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-outside-down-week.png\"><img loading=\"lazy\" src=\"2019-3-4-2.png\" alt=\"Emini outside down week\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini went above Friday’s high, which was last week’s high. It sold off to below Friday’s low and below last week’s low. Today is therefore an outside down day and this week is an outside down week. The strong midday rally creates confusion. It therefore increases the chance that tomorrow will be a sideways day. It might be an inside day, which often follows an outside day.<p>Because the selloff was big, there will probably be at least a small 2nd leg down within a week or so. Less likely, the Emini will get back above last week’s high later this week. That would convert the outside down week into an outside up week.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-3-4"
    }
  ],
  "5": [
    {
      "data": [
        "<article class=\"post-87542 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini outside down week in 10 week bull micro channelIntraday market update: Tuesday March 5, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini outside down week in 10 week bull micro channel</strong><br>Intraday market update: Tuesday March 5, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-03-05T06:20:04-08:00\">March 5, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini outside down week in 10 week bull micro channel</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday traded above Friday’s high and above last week’s high. It sold off below Friday’s low and last week’s low. Therefore, yesterday was an outside down bar on the daily chart. In addition, this week is an outside down bar on the weekly chart.<p>The rest of the week will be a fight over where the week will close. The bulls want it to close back above last week’s high and the bears want it to close below last week’s low. It will most likely do neither, and it will probably close in the lower half of the week’s range.<h3>1st pullback in 10 weeks</h3><p>By going below last week’s low, the Emini had its 1st pullback on the weekly chart in 10 weeks. The bulls have been so eager to buy that they have not waited for a pullback. They now have a chance to buy a pullback. Many will take it. As a result, there is a 30% chance that this week will go back above last week’s high and become an outside up week.<p>More likely, the Emini will pull back for at least another week. A first target is the 20 day EMA. The bears want at least 2 legs down on the daily chart. Yesterday was a Bear Surprise Bar on the daily chart. It therefore will probably lead to at least a couple legs sideways to down. However, after a Bear Surprise Bar, there is often about a 5 bar tight trading range before the 2nd leg down begins. Therefore, the Emini might be mostly sideways over the next week.<p>The bears want a big selloff today. After yesterday’s big rally, that is unlikely. The bulls want today to be a bull bar on the daily chart. It would then be a buy signal bar for Wednesday. They then want the week to go back above last week’s high. The odds favor more sideways to down instead.<p>One possibility for today is a bull inside bar, which often follows a bear outside bar. The rally at the end of yesterday was enough to confuse traders. Most likely, the Emini will be sideways for at least a day or two.<h3>2 month pullback after one more new high</h3><p>I mentioned yesterday that the pullback could last a couple of months since the buy climax is so extreme. There almost certainly will be at least a couple months of sideways to down trading that starts within the next few months.<p>However, the momentum up over the past 2 months was strong enough to make the 1st reversal down likely to be minor. Therefore, the bulls will probably get one more new high after a 2 – 3 week pullback. Then, the 2 -3 month pullback will begin.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 4 points in the Globex session. The bulls hope that yesterday’s late rally will lead to a new high. However, it is more likely that it was the start of a 2 – 3 week pullback. Consequently, the late rally will probably be a bear flag.<p>The resistance of 2800 has been strong for over a year. This rally will likely stall today or tomorrow around that target.<p>Yesterday’s big bear breakout on the 60 minute chart is a good candidate for a spike down in a Spike And Channel Bear Trend. The channel typically has at least 3 pushes. Yesterday’s selloff was the 1st. Traders should expect at least 2 more legs down on the 60 minute chart over the next couple of weeks.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-outside-down-week.png\"><img src=\"2019-3-5.png\" alt=\"Emini outside down week\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/EURUSD-Forex-1st-leg-down-from-wedge-bear-flag.png\"><img loading=\"lazy\" src=\"2019-3-5-1.png\" alt=\"\"></a></figure><p>The EURUSD daily Forex chart sold off from a wedge bear flag over the past 4 days. There will typically be at least a small 2nd leg down from a wedge. Therefore, traders will sell the 1st 1 – 3 day bounce.<p>However, the market is near the bottom of its 4 month range so traders expect a reversal up after the 2nd leg down. This would be a higher low major trend reversal setup. But, because the legs in the 4 month range have lasted only 2 – 3 weeks, the best the bulls will probably get is a rally toward the top of the range.<p>Since the range has lasted much longer than all prior ranges over the past couple of years, it will probably break out on some Brexit news within a month. In the meantime, traders will continue to bet on reversals.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 25 pip range overnight. This is so tight that it is difficult even for scalper’s to make money.<p>It is in the buy zone that I mentioned yesterday. That is around the February 22 low and the 1.13 Big Round Number.<p>A wedge usually has at least a small 2nd leg down. Today tested yesterday’s low. That meets the minimum requirement. It then typically evolves into a trading range. It has been doing that over the past 2 weeks.<p>The 3 week bull channel was strong on the daily chart. Therefore, there will probably be a bounce beginning this week to test last week’s high. However, there might be more of a pullback to below 1.13 first.<p>The chart is in a 4 week trading range at the bottom of a 4 month trading range. Most days on the 5 minute chart will continue to be trading range days within these bigger trading ranges on the daily chart.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-trading-range-day-below-2800-magnet-after-outside-down-day.png\"><img loading=\"lazy\" src=\"2019-3-5-2.png\" alt=\"Emini trading range day below 2800 magnet after outside down day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>As was likely, today was a trading range day within yesterday’s range. The daily chart now has an ioi breakout mode pattern. Because the daily chart is at resistance and in a buy climax, the odds are that yesterday is the start of a 2 – 3 week pullback. Therefore, there will probably be more sellers above yesterday’s high and last week’s high.<p>Since today was a doji inside bar, it is not a strong buy or sell signal bar for tomorrow. Therefore, tomorrow might be another sideways day.<p>The market might be waiting for Friday. The close of this week is important. If the week closes below last week’s low, it would increase the chance of lower prices next week.<p>If it closes back above last week’s high, the Emini will probably go at least slightly higher before pulling back for 2 – 3 weeks.<p>Most likely, the week will disappoint both the bulls and the bears and close in the middle.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-3-5"
    }
  ],
  "6": [
    {
      "data": [
        "<article class=\"post-87546 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini has ioi breakout mode pattern near 2800Intraday market update: Wednesday March 6, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini has ioi breakout mode pattern near 2800</strong><br>Intraday market update: Wednesday March 6, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-03-06T06:20:18-08:00\">March 6, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini has ioi breakout mode pattern near 2800</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>After Monday being a huge outside day that closed in its middle, yesterday was likely to be an inside day. And it was. An inside day after an outside day creates an ioi (inside-outside-inside) breakout mode pattern.<p>Because it is at resistance and after a buy climax on the daily chart, the upside is small. There will probably be more sellers than buyers above yesterday’s high and above the October-November-December triple top.<p>But, since the daily chart is in a buy climax at resistance, yesterday is a reasonable sell signal bar. Traders expect about 2 weeks and 2 legs of sideways to down trading.<p>Since yesterday was a doji bar on the daily chart, it is a weak signal bar for the bulls and bears. Therefore, the odds favor mostly sideways trading again today. However, the Emini will probably be sideways to down for a couple weeks.<h3>The importance of Friday’s close</h3><p>The next useful information comes once this week ends. The bears want the week to close below last week’s low. That would be a strong outside down bar on the weekly chart and increase the chance of lower prices next week.<p>The bulls want the week to close above last week’s high. It would then be an outside up week on the weekly chart after initially being an outside down week. That would increase the chance of higher prices next week. However, as I said, the upside over the next 2 weeks is probably small because of the buy climax at resistance.<p>Since both the bulls and bears have reasonable arguments, this week will probably close somewhere in the middle. If it closes near its low, the week will increase the odds that a 2 – 3 week pullback is underway.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 3 points in the Globex session. It will therefore likely open within yesterday’s tight trading range. Since traders are waiting for the end of the week to see how the week closes, there is not much incentive to break strongly from yesterday’s range. Consequently, the odds are that today will continue yesterday’s price action and be another trading range day.<p>Obviously, the bulls want a strong rally that will undo Monday’s damage. The bears want a strong 2nd leg down. One of the two will achieve their goal within a week or two. However, the odds are that not much will happen today.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-trading-range-day-below-2800-magnet-after-outside-down-day.png\"><img src=\"2019-3-6.png\" alt=\"Emini trading range day below 2800 magnet after outside down day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/EURUSD-Forex-higher-low-after-wedge-bear-flag-in-trading-range.png\"><img loading=\"lazy\" src=\"2019-3-6-1.png\" alt=\"EURUSD Forex higher low after wedge bear flag in trading range\"></a></figure><p>The EURUSD daily Forex chart yesterday fell into the buy zone around 1.13 yesterday. The wedge rally was strong, but it followed a strong selloff in early February. Therefore, the bulls would not continue to buy the 3 week rally without a test of the February low. This 4 day selloff is that test.<p>Traders expected a selloff to retrace at least half of the 3 week rally. Yesterday met that goal. The bulls will now try to stop the 4 day selloff and then rally from a higher low. After 5 bear days, they may need 2 – 3 sideways days to conclude that the selling has ended. If the bulls can get 2 – 3 bull days over the next few days, traders will buy for a test of the February 28 high above 1.14.<p>Since the 4 day selloff has been strong, it might continue down to the February low. It might even fall below that low. However, trading ranges resist breaking out. Consequently, there will probably be buyers below the February low.<p>Traders need to see consecutive closes beyond the 4 month range before they will conclude that a new trend is underway. While that is likely to happen within the next month, traders will continue to bet on reversals until it does.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 30 pip range overnight. The bears want the 4 day selloff to continue. However, the selloff retraced about half of the 3 week rally. As a result, the bulls will begin to look for reversals up from prior 5 minute lows. They prefer to see a strong move up that will allow them to swing trade. However, they know that small moves up and down are more likely. Consequently, they will be quick to take profits once they conclude that the move up from their buy is not strong.<p>Because the 4 day selloff has been weak, the bears will sell reversals down from rallies and not breakouts below prior low. They know that the bulls will buy around 1.13. As a result, the bears will take quick profits unless a selloff is surprisingly big.<p>With both the bulls and bears expecting quick profits today, today will probably be a trading range day. However, the odds favor a move above 1.1350 this week.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-bear-channel-testing-Mondays-low.png\"><img loading=\"lazy\" src=\"2019-3-6-2.png\" alt=\"Emini bear channel testing Monday's low\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini sold off and tested Monday’s sell climax low. While it bounced from a slightly higher low, the rally was not strong. The double bottom with Monday’s low could lead to a trading range through Friday. Yesterday’s high might be the top and today’s low could be the bottom.<p>However, all that really matters over the next 2 days is the location of the close of the week. If the week closes near the low, the odds will favor lower prices for at least a couple weeks. If it closes in the middle, the Emini might go sideways before pulling back for a couple weeks.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-3-6"
    }
  ],
  "7": [
    {
      "data": [
        "<article class=\"post-87549 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini profit taking at 2800 and triple topIntraday market update: Thursday March 7, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini profit taking at 2800 and triple top</strong><br>Intraday market update: Thursday March 7, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-03-07T06:20:11-08:00\">March 7, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini profit taking at 2800 and triple top</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday sold off, but held just above Monday’s low and last week’s low. The bulls hope that the selloff was a test of those lows. They therefore want a micro double bottom on the daily chart, and then a resumption of the 2 month bull trend.<p>However, Monday’s selloff was exceptionally strong. Furthermore, it came at major resistance at the October-November-December triple top and 2800. Finally, the weekly chart is in an extreme buy climax. Therefore, Monday is probably the start of at least a 2 – 3 week pullback.<p>Because the bull trend has been so strong, the Emini might have to spend more time going sideways before traders conclude that the price is too high. But, the Emini will likely trade sideways to down for at least a couple more weeks. This is true even if it trades back above 2800 over the next week.<p>The key piece of information remaining this week is the close of the week. If the week closes near its low, the odds of a 2 – 3 week selloff will be greater. If instead the week closes in its middle, the Emini might go sideways for another week or two before pulling back.<p>It is possible that the Emini will break above the triple top before pulling back. However, the odds of a strong leg up from here are small without a 2 – 3 week pullback first.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 3 points in the Globex session. It tested last week’s low yesterday. Since this week is the 1st pullback in 10 weeks, there are probably many bulls who are eager to buy the pullback. That could lead to a rally today up from last week’s low.<p>Additionally, yesterday was a bear channel. A bear channel is a bull flag. Traders expect a breakout above yesterday’s bear trend line today. That would probably end yesterday’s selling. Therefore, today will probably be either a bull trend day or a trading range day.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-bear-channel-testing-Mondays-low.png\"><img src=\"2019-3-7.png\" alt=\"Emini bear channel testing Monday's low\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/EURUSD-Forex-breakout-of-wedge-bear-flag.png\"><img loading=\"lazy\" src=\"2019-3-7-1.png\" alt=\"EURUSD Forex breakout of wedge bear flag\"></a></figure><p>The EURUSD daily Forex chart broke below a wedge bear flag last week. The 6 day breakout has been strong. Furthermore, the 4 month trading range will likely break out within a month and have about a 300 pip measured move.<p>Because a breakout is likely soon and the momentum down is good, there is an increased chance that this week’s selloff is the start of a bear trend. However, trading ranges resist breaking out. There have been many strong legs up and down over the past 4 months. Each has reversed. Consequently, despite the momentum down, the odds continue to favor reversals instead of breakout.<p>The bulls tried to form a higher low yesterday on the 60 minute chart. Overnight, the chart broke to the downside. It is now testing the trading range low.<p>Even if the bulls get a double bottom with the February low, they will probably need a 2 – 3 day micro double bottom first. Typically, the chart needs to stop the selling for a few days before the buying can begin.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 60 minute Forex chart tried to form a higher low and reversal up yesterday. However, the 5 minute chart broke strongly below that bottom overnight. The selloff has been strong enough to make at least a small 2nd leg down likely later today or tomorrow.<p>While the odds still favor a reversal up from the 1.12 bottom of the 4 month range, this trading range has been unusually long. Therefore, traders know that a breakout up or down is likely within a month. The bears need 2 closes below the bottom of the 4 month range to convince traders that a bear trend is underway.<p>If it is, most days will be bear days. Traders will look to sell rallies and breakouts. In addition, day traders will look for 30 – 50 pip swing trades. The selloff over the past hour is an example.<p>Is the character of the market changing on the daily chart from a trading range to a bear trend? If the 5 minute chart begins to have several days with bear swings of 50 or more pips, like today, it probably is.<p>Can today reverse up? Probably not. The best the bulls can probably get today is a small trading range. Day traders will look to sell rallies until a trading range forms. Once one does, they will also scalp reversals up.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-bear-trend-resumption.png\"><img loading=\"lazy\" src=\"2019-3-7-2.png\" alt=\"Emini bear trend resumption\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini sold off strongly on the open, but then rallied for several hours. The bears got trend resumption down to a new low later in the day. However, there was late profit-taking rally, and there is now a wedge bull flag on the 60 minute chart.<p>Tomorrow is important. The week is outside down. The bears want the week to close below last week’s low. If they succeed, the odds of a deeper and longer pullback will increase. The bears do not need the market to sell off any further tomorrow. If they simply keep the Emini around its current level, they will have accomplished their goal.<br><p>Since the bulls always want the opposite, they will try to create a rally to above last week’s low by tomorrow’s close. They also want the week to close above the 20 day EMA. With today forming a wedge bull flag, there is an increased chance of a rally tomorrow.<p>Whatever happens tomorrow, the odds are that the Emini will go more sideways to down for at least a couple weeks.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-3-7"
    }
  ],
  "8": [
    {
      "data": [
        "<article class=\"post-87552 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini outside down week is starting pullbackIntraday market update: Friday March 8, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini outside down week is starting pullback</strong><br>Intraday market update: Friday March 8, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-03-08T06:20:34-08:00\">March 8, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini outside down week is starting pullback</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>During yesterday’s strong selloff, I said that there would probably be a reversal up yesterday or today. Yesterday’s early reversal failed, but the bulls will likely try again today. This is because this week is the 1st pullback on the weekly chart. Many bulls are looking to buy the 1st pullback in 10 weeks.<p>This week’s selloff went far below last week’s low. But yesterday ended with a wedge bull flag on the 60 minute chart. With last week’s low and the 20 day EMA being strong magnets above, there is an increased chance of a rally today.<p>This is especially true because it is the last day of the week. What the Emini does today affects the appearance of the weekly chart. The bears will probably take profits at some point today. This might happen in the final hour. That short covering rally would put a conspicuous tail on the bottom of this week’s candlestick on the weekly chart. A tail would reduce the bearishness of this week.<p>Less likely, today will be another strong trend day and close on it low. That would increase the chance of a deeper pullback, maybe to the around 2600 and the November low.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 19 points in the Globex session. Today will therefore likely gap down. However, the gap down will be the 4th leg down on the 60 minute chart. That is a wedge bear channel, which is a climax pattern.<p>A sell climax usually results in exhausted bears. They then take some profits. This short covering can be strong. Therefore, there is an increased chance of at least a 2 hour rally at some point today. It could come on the open and last all day. Less likely, today will be another big bear trend day.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-bear-trend-resumption.png\"><img src=\"2019-3-8.png\" alt=\"Emini bear trend resumption\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex breakout below trading range needs confirmation</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/EURUSD-Forex-breakout-below-trading-range-needs-confirmation.png\"><img loading=\"lazy\" src=\"2019-3-8-1.png\" alt=\"EURUSD Forex breakout below trading range needs confirmation\"></a></figure><p>The EURUSD daily Forex chart yesterday formed a big bear bar. It closed below the bottom of the 4 month trading range. But, the bears need additional bear bars to convince traders that the breakout will be successful.<p>Look at the January 10 high. The day before was a big bull day that broke above what was the top of the range. The breakout failed.<p>The current situation is similar. If today is a bull day that closes near its high, the bears will exit and bulls will buy above today’s high. That would increase the chance of a failed breakout. Traders would see the 2 month selloff as a wedge bottom.<p>Even if today closes on its high, the bears can still get a successful breakout. They would then need 2 – 3 bear bars closing near their lows early next week to establish a bear trend.<p>Consequently, the next few days are important. Will the bulls get 2 – 3 big bull days and reverse the breakout? Or, will the bears get 2 -3 big bear days and convince traders that the trading range has successfully evolved into a bear trend?<h3>Overnight EURUSD Forex trading</h3><p>So far, today is a bull day on the daily chart. Today’s close is important. The bears want another bear trend day. However, the 5 minute chart has trended up 60 pips in a tight bull channel since yesterday’s low.<p>Since the channel is tight, the buying is strong. Consequently, the bulls are buying even very small pullbacks. So far, the bears have not been selling. Not even the bear scalpers have been able to make money overnight.<p>Because yesterday’s selloff was extremely strong, the overnight rally is probably forming a Big Up after a Big Down pattern. That typically creates Big Confusion, which is a hallmark of a trading range. Therefore, today will probably convert into a trading range on the 5 minute chart.<p>The fight will be over how the day closes. The more it closes on its high, the better today will be as a buy signal bar for Monday. If there is a big tail on top, the bears will be more willing on Monday to sell above today’s high. Monday would then be a Low 1 bear flag on the daily chart.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-higher-low-major-trend-reversal.png\"><img loading=\"lazy\" src=\"2019-3-8-2.png\" alt=\"Emini higher low major trend reversal\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>Today was a trading range day. By closing near its high, is a buy signal bar for next week. It is possible that this is the end of the selloff, but not likely.<p>The selloff got near the February 11 high, but did not close that gap on the daily chart. Because it is a magnet and nearby, the Emini will probably close it within a week or so.<p>Furthermore, because this week was a big bear bar on the weekly chart, the odds favor at least slightly lower prices next week. But after a 10 bar bull micro channel, this selloff will probably end within a couple weeks.<p>What happens if next week is a bull inside bar on the weekly chart? It would be a buy signal bar for the following week. The Emini would then probably break above the October high.<p>However, the 2 month buy climax is so extreme that a rally from here will probably not get far. The Emini will probably have to go mostly sideways for at least a few weeks before the bulls will become aggressive again.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-3-8"
    }
  ],
  "9": [
    {
      "data": [
        "<article class=\"post-87560 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Weekly Emini big outside down week after buy climax at 2800Weekend market update: March 9, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Weekly Emini big outside down week after buy climax at 2800</strong><br>Weekend market update: March 9, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-03-09T00:30:23-08:00\">March 9, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2><strong>Market Overview</strong></h2><p>The<strong>Emini</strong>formed a big outside down week this week. After 10 weeks without a pullback, this selloff will probably end within a couple more weeks.<p>The daily<strong>crude oil</strong>chart is forming a bull flag. A rally from here would be a 3rd leg up. That would be a wedge buy climax and probably lead to a test of $51 over the next 2 months.<p>The<strong>EURUSD</strong>daily Forex chart broke below the 4 month trading range. However, Friday reversed up, which creates confusion. The chart will probably be sideways for a few days before traders will conclude that the trading range will continue or a bear trend is underway.<h2><strong>Crude oil Futures market:</strong><br>Slightly higher before pullback to $51</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Crude-oil-small-bull-trend-late-in-bull-trend.png\"><img loading=\"lazy\" src=\"2019-3-9.png\" alt=\"Crude oil small bull trend late in bull trend\"></a><figcaption>The crude oil daily chart has a 6 day wedge bull flag. Since this is late in the bull trend, there might be one small leg up before a pullback to the $51 beginning of bull channel (red line).</figcaption></figure><p>The crude oil futures daily chart has been in a tight range for 3 weeks. That small range is just above a bigger 4 week range. There is a Wall St. saying that a small range on top of a bigger range usually collapses back into that bigger range.<p>However, the 3 month rally has been exceptionally strong. In addition, the bears are failing to get consecutive big bear bars. Therefore, the 3 week range is probably a wedge bull flag. Traders should expect at least one more brief leg up to $60 over the next couple of weeks.<p>Since that would be a 3rd leg up, a reversal down after that would be a wedge top. Traders would look for a test of the beginning of the wedge bull channel. That is the January 14 low at around $51.<p>The huge reversal up after the extreme sell climax creates confusion. This typically leads to a trading range. Traders do not believe the rally will retrace the entire selloff.<p>They also believe that the bottom is in. They will therefore sell rallies and buy selloffs. This will probably result in a trading range between $40 and $60 to $65 for at least several months.<p>While a week or two of higher prices is likely, the daily chart will probably test down to $51 over the following 2 months.<h2><strong>EURUSD weekly Forex chart:</strong><br>Weak breakout below the 4 month range</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/EURUSD-weekly-Forex-chart-has-weak-breakout-below-trading-range.png\"><img loading=\"lazy\" src=\"2019-3-9-1.png\" alt=\"EURUSD weekly Forex chart has weak breakout below trading range\"></a><figcaption>EURUSD weekly Forex chart has weak breakout below 4 month trading range.<br>This week closed above the low of the range.</figcaption></figure><hr class=\"wp-block-separator\"><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/EURUSD-daily-Forex-chart-has-weak-breakout-below-trading-range.png\"><img loading=\"lazy\" src=\"2019-3-9-2.png\" alt=\"EURUSD daily Forex chart has weak breakout below trading range\"></a><figcaption>The EURUSD daily Forex chart formed a big bull bar after yesterday’s breakout below<br>the 4 month trading range. The bulls also have a possible wedge bottom.<br>However, a 2 – 3 day bounce might form a bear flag next week.</figcaption></figure><p>The EURUSD daily Forex chart broke below the 4 month range on Thursday. However, Friday was a big bull bar and it closed on its high. It is therefore a buy signal bar for Monday. The bulls see the selloff as a wedge bottom with the January and February lows. Also, they want a failed breakout below the range.<p>This would be the opposite of what took place at the January high. There was a strong breakout above what was at the time the top of the range. The next day was a bear day. Then, the market sold off for 2 months.<h3>Friday created confusion</h3><p>Will the daily chart rally for 2 months? Unlikely. However, the strong bull day on Friday reduces the chances of a strong bear trend from here.<p>The chart will probably go sideways for a few days and then traders will decide if the trading range will continue or if a bear trend has begun. The bulls want a micro double bottom. In addition they need to see several strong bull trend bars over the next week.<p>Since the bears always want the opposite, they will try to prevent big bull bars from forming. In addition, they want any pullback to have a bear body closing near its low. That would then be a pullback from the breakout. They would sell below that bar, which would be a Low 1 bear flag sell signal bar.<h2><strong>Monthly S&amp;P500 Emini futures chart:</strong><br>Disappointing follow-through after 2 strong months</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-monthly-chart-has-bear-bar-at-2800-resistance.png\"><img loading=\"lazy\" src=\"2019-3-9-3.png\" alt=\"Emini monthly chart has bear bar at 2800 resistance\"></a><figcaption>The Emini monthly chart has a small bear bar so far this month after 2 big bull trend bars.</figcaption></figure><p>The monthly S&amp;P500 Emini futures chart&nbsp;so far has a bear trend bar in March. I have been saying repeatedly over the past 2 months that the rally is strong, but it is still within a yearlong trading range. Furthermore, I said that March would probably disappoint the bulls who were hoping for a 3rd strong month. This is because trading ranges repeatedly disappoint traders.<p>The 2 month rally was surprisingly strong. When there is a pair of Bull Surprise Bars, traders expect a 2nd leg up. As a result, even if the Emini were to trade down for 2 months, the bulls would buy the selloff. A pullback from the 2 month rally is more likely that a lower high.<h3>Head and shoulders top and bottom</h3><p>The bears want the lower high. There would then be a head and shoulders top on the monthly and weekly charts.<p>However, a 2 month selloff that reverses up would create a head and shoulders bottom. Because the monthly chart has been in a trading range, there is always going to be both a credible buy and sell setup. But, in a trading range, the probability is never as high as traders want. The result is usually more bars in the trading range and not a breakout into a trend.<p>This is true even if this year’s rally makes a new all-time high. Most trading range breakouts fail. Consequently, there will probably be more sellers than buyers above the September high.<p>Markets have inertia and resist change. Therefore, traders should expect a continuation of the trading range for at least a few more months.<h2><strong>Weekly S&amp;P500 Emini futures chart:</strong><br>Outside down week and 1st pullback in 10 weeks</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-weekly-chart-has-1st-pullback-in-10-weeks.png\"><img loading=\"lazy\" src=\"2019-3-9-4.png\" alt=\"Emini weekly chart has 1st pullback in 10 weeks\"></a><figcaption>The Emini weekly chart has a big outside down bear bar after 9 consecutive bull bars.<br>This is a minor reversal.</figcaption></figure><p>The weekly S&amp;P500 Emini futures chart traded above last week’s high and then below its low. This week therefore is an outside down week. Since it is in a buy climax at resistance, it is a sell signal bar for next week.<p>However, it is the 1st pullback in 10 weeks. The bulls have been so eager to buy that they have not been waiting for a pullback. For 10 weeks, they were willing to buy above the low of the prior week. They now finally have a chance to buy below the prior week’s low. They will likely begin to take that opportunity within a couple weeks.<h3>Bulls taking profits</h3><p>This week formed a big bear trend bar closing on its low. That means that there were more bulls taking profits after the buy climax than there were other bulls buying below last week’s low. There were also bears selling, expecting a minor reversal down.<p>However, the bulls who did take profits are looking to buy again. They simply want to see how far down the pullback will go. Once the Emini stops going down, the bulls will begin to buy again.<p>After a strong rally like the one we just had, they typically will wait 2 – 3 weeks and then look to buy. Therefore, this pullback will probably last at least another week or two. Since the rally was so extreme, the pullback might even last a couple months. But, that is unlikely.<h3>Bear trend or pullback?</h3><p>There is always a bear argument. But, the probability is low, at least for several more weeks.<p>The bears are hoping that the rally was just a buy climax test of the December high and 2800. The Emini has tested 2800 many times for more than a year and has been unable to hold above it. They see the 2 month rally as the right shoulder in a head and shoulders top. The January 2018 high is the left shoulder.<p>When a micro channel lasts more than 5 bars, the odds are that the 1st reversal will be minor. The bulls will buy it. This bull micro channel lasted 10 bars. That is a sign of especially strong bulls. It increases the odds that the selloff is just a pullback, which will lead to a 2nd leg sideways to up.<p>If the Emini does continue down, it will probably find support around 2600. That was support many times over the past year. A reversal up from there would form a head and shoulders bottom.<h3>What’s next?</h3><p>Whenever there is a big outside down bar, there is an increased chance that the next bar will be an inside bar. That means next week might open above this week’s low and stay above the low all week. In addition, it would not go above last week’s high. If it has a bull close, it would be a buy signal bar for the following week.<p>The end of March has a bullish tendency, as does the end of every quarter. Therefore, a bull inside bar next week would probably lead to at least a week or two of higher prices.<p>This week was an unusually big outside down bar. In addition, it closed near its low and below last week’s low. It is a sign of strong selling. Therefore, next week could either gap down and sell off, or simply sell off.<p>But, the 10 week bull micro channel will probably draw bulls back in within a few weeks. Any selloff will probably form a higher low and lead to at test of this week’s high and 2800.<h2><strong>Daily S&amp;P500 Emini futures chart:</strong><br>5 day sell climax at support</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-daily-chart-pullback-in-strong-bull-trend.png\"><img loading=\"lazy\" src=\"2019-3-9-5.png\" alt=\"Emini daily chart pullback in strong bull trend\"></a><figcaption>The Emini daily chart pulled back for 5 days after testing 2800. Friday is a buy signal bar for Monday. After a buy climax, there will probably be at least a small 2nd leg sideways to down.</figcaption></figure><p>The daily S&amp;P500 Emini futures chart sold off strongly this week. I have been saying that a minimum goal was to dip below the February 5 high. The pullback was likely to overlap that most recent breakout point, and it did on Friday.<p>The selloff has been in 5 bar micro channel. When there are no pullbacks for 5 days, the first reversal back up usually fails. The bulls typically want to see at least a test of the low. That would create a micro double bottom.<p>A reversal up at that point would have a better chance of resuming the bull trend. Therefore, even if the Emini gaps up on Monday, the rally will probably form a lower high after a few days.<p>The 2 month rally was incredibly strong. It is important for traders to realize that the selloff might have ended on Friday.<h3>Sell climax should end soon</h3><p>The 2 month rally on the daily chart is unlikely to reverse into a bear trend without a better looking double top. In addition, there is a wedge bottom on the 60 minute chart. Therefore, even though the 5 day selloff has been surprisingly strong, the bears will probably begin to take profits early in the coming week. This will probably create a 1 – 3 day bounce.<p>Because the selloff was so strong, there will probably be at least a small 2nd leg down. Traders will look to sell a 1 – 3 day rally. But, the downside is minimal over the next few weeks. As I said above, it might continue down as far as 2,600, but the bulls will likely be happy to buy. They know the odds are that any selloff will be followed by another leg up.<h3>30% chance of Endless Pullback or double top bear flag</h3><p>There is a 30% chance that this week began either an Endless Pullback or a double top bear flag.<h4>Endless pullback</h4><p>An Endless Pullback is common after a parabolic wedge buy climax. In an Endless Pullback, the selloff is not particularly strong. It looks like a bull flag and not a bear trend.<p>Yet, it continues to add bars and work gradually lower. After 20 or more bars, there can suddenly be 2 – 3 big bear bars closing near their lows. That is a bear breakout below the bull flag.<p>If that happens, the pullback is converting into a bear trend. Those bear bars represent bulls giving up and bears selling aggressively. Traders then will see those bars as the possible middle of what is now a bear trend. There is often a measured move down.<h4>Double top bear flag</h4><p>Whenever there is a strong rally that stops at a prior lower high, traders have to wonder if the rally will form a double top with that lower high. If so, the pattern is a double top bear flag.<p>The rally is often surprisingly strong, and it is easy to conclude that there is a new bull trend. However, unless it breaks strongly above that earlier high (here, the December high), traders have to understand that the market can work below the neck line (the December low) and fall for about a measured move down.<p>A measured move down is around 1900, which is back in the 2015 – 2016 trading range. While the Emini will probably get there within 3 years, the odds are that the bulls will buy the current selloff. Furthermore, the yearlong trading range will probably continue for several more months before the bears can create a significant risk of a major selloff.<hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-3-9"
    }
  ],
  "11": [
    {
      "data": [
        "<article class=\"post-87556 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini outside down week at 2800 is sell signal barIntraday market update: Monday March 11, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini outside down week at 2800 is sell signal bar</strong><br>Intraday market update: Monday March 11, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-03-11T06:20:18-07:00\">March 11, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini outside down week at 2800 is sell signal bar</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Last week was an outside down week on the weekly chart. It turned down from the 2800 Big Round Number and the October-November-December triple top. The odds favor at least a 2 – 3 week pullback.<p>It was the 1st pullback in 10 weeks on the weekly chart. The bulls are finally getting an opportunity to buy below the low of the prior bar. Many will take that opportunity. That will reduce the chance of a big selloff lasting more than a few weeks.<h3>Possible ioi Breakout Mode pattern</h3><p>An inside bar often follows an outside bar. There is therefore an increased chance that this week will open within last week’s range and not break below last week’s low. That is especially true after Friday’s strong, late rally. Friday is a good by signal bar for today.<p>If this week is an inside bar on the weekly chart, there would be a ioi (inside-outside-inside) pattern. That is a breakout mode setup.<p>But, the 2 month buy climax reduces the chance of a big move up from here without more of a pullback. The strong momentum up on the weekly chart minimizes the chance of a big sell. Consequently, the Emini might simply go a little sideways to down for a couple of weeks. Then, the bulls will try again to get above the triple top.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 7 points in the Globex session. It might therefore gap above Friday’s high. Friday’s late rally was strong enough to make traders believe that there will be at least some follow-through buying today or tomorrow.<p>Friday broke above the wedge bear channel on the 60 minute chart. That channel began on March 5 from just above 2800. When a wedge reverses, the rally typically tries to test the start of the channel. At that point, the chart usually enters a trading range and is again in Breakout Mode.<p>The wedge sell climax likely exhausted the bears. Also, that magnet is strong. Consequently, the Emini will probably try to work higher over the next few days.<h2>Friday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-higher-low-major-trend-reversal.png\"><img src=\"2019-3-11.png\" alt=\"Emini higher low major trend reversal\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/EURUSD-Forex-weak-breakout-below-4-month-trading-range.png\"><img loading=\"lazy\" src=\"2019-3-11-1.png\" alt=\"EURUSD Forex weak breakout below 4 month trading range\"></a></figure><p>The EURUSD daily Forex chart broke below the 4 month trading range last week, but had a bull bar closing near its high on Friday. In addition, the bulls have a wedge bear channel. That is a bull flag. They hope that the selloff is just another failed breakout attempt.<p>But, the bull trend reversal bar on Friday had a prominent tail on top. It did not close on its high. In addition, is was not especially big compared to the 6 day selloff. Consequently, many bulls will want to see a micro double bottom this week before they will be willing to buy. That limits the upside today and tomorrow.<p>The bears need follow-through selling. Friday was not a 2nd consecutive big bear day closing on its low and below the November low. The bears therefore were not strong enough to create a consensus that a bear trend was underway.<p>Today will be a Low 1 bear flag sell signal bar for tomorrow. If today closes on its low, bears will sell below today’s how and try again to establish a successful breakout.<p>More likely, today will disappoint the bears and a small trading range will form this week. That means that there will be both a micro double bottom and a micro double top. That would give both the bulls and bears a credible setup. One side will win, and it will control the next leg for at least several days.<h3>Brexit will probably be postponed</h3><p>Trading ranges are notoriously successful at preventing successful breakouts. Markets have inertia and tend to continue to do what they have been doing. While the bear breakout slightly increases the chance of a bear trend, the bears need to do more. Since the final decision on Brexit will probably be postponed again, the breakout will probably have to wait at least several more weeks.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 25 pip trading range for overnight. Most of the time, the range was only 10 – 15 pips. That makes it difficult even for scalpers to make month. Since the next few days will probably be sideways, day traders will look for reversals and 10 – 20 pip scalps.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Bull-Trend-From-The-Open-1.png\"><img loading=\"lazy\" src=\"2019-3-11-2.png\" alt=\"Bull Trend From The Open\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>Today gapped up and rallied in an extremely strong Bull Trend From The Open. The rally is unsustainable and therefore a climax. Consequently, there is a 75% chance that tomorrow will have at least 2 hours of sideways to down trading that starts by the end of the 2nd hour.<p>Today’s rally was a reversal up from a wedge bottom on the 60 minute chart. Friday was also a test of a gap on the daily chart. The 60 minute wedge bottom should lead to at least 2 legs up to above 2800. Traders will therefore look to buy a reversal up from a higher low. The odds favor higher prices, even if there is a pullback today or tomorrow.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-3-11"
    }
  ],
  "12": [
    {
      "data": [
        "<article class=\"post-87846 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini strong reversal up to 2800 after gap testIntraday market update: Tuesday March 12, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini strong reversal up to 2800 after gap test</strong><br>Intraday market update: Tuesday March 12, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-03-12T06:20:23-07:00\">March 12, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini strong reversal up to 2800 after gap test</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>I wrote before yesterday’s open that the wedge bottom on the 60 minute chart would probably lead to a rally yesterday. The reversal up was from a test of the February 12 gap. This rally is another attempt to break strongly above 2800. That has been resistance for over a year.<p>Yesterday’s rally was extreme and therefore unsustainable. That makes it a buy climax. Buy climaxes created exhausted bulls who take profits. The Emini will probably go sideways to a little down for a day or two starting today or tomorrow.<p>But, the momentum up is strong. The bulls will buy pullbacks. They expect the rally to continue to above the 2800 start of the bear channel on the 60 minute chart.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 4 points in the Globex session. There might be a small gap up on the open. Small gaps typically close in the 1st hour.<p>Yesterday was a buy climax. Today therefore has a 50% chance of follow-through buying on the open. The next target is the 2800 Big Round Number. However, there is only a 25% chance of another strong bull trend day that lasts all day.<p>There is a 75% chance of at least 2 hours of sideways to down trading that will start by the end of the 2nd hour. While it is possible that today will be a bear trend day, it is more likely that the best the bears will get is a trading range.<p>Since there were 3 legs up yesterday, there is a wedge bull channel. The bears might be able to test the bottom of the 1st or 2nd pullbacks in the wedge. That would be a test down to around 2800.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Bull-Trend-From-The-Open-1.png\"><img src=\"2019-3-12.png\" alt=\"Emini small pullback bull trend and buy climax\"></a><figcaption>Emini small pullback bull trend and buy climax</figcaption></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/EURUSD-Forex-weak-breakout-of-bottom-of-trading-range.png\"><img loading=\"lazy\" src=\"2019-3-12-1.png\" alt=\"EURUSD Forex weak breakout of bottom of trading range\"></a></figure><p>The EURUSD daily Forex chart so far has its 3rd consecutive bull bar after the bear breakout below the 4 month range. The selloff from the January 10 high is also in a wedge bear channel. A bear channel is a bull flag. That means there is usually a bull breakout.<p>However, the 6 day selloff to the new low was strong enough to make most bulls want to see a micro double bottom. Therefore, this 3 day rally will probably have a pull back within a few days to test last week’s low.<p>The bears see the 3 day rally as a pullback from the breakout below the 4 month range. But, there has been no follow-through selling. In addition, most breakout attempts fail. They need consecutive closes at a new low to make traders believe that this bear breakout is the start of a bear trend. Without that, the odds are that it is just another strong leg in the 4 month range.<p><br>The 3 day rally is strong enough so that the bears will probably need a micro double top before they can attempt again to break below the range. With the bears needing a micro double top and the bulls needing a micro double bottom, the next few days will probably be sideways.<br><br><h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 35 pip range overnight. The bulls are trying to erase the March 7 sell climax. Its high is therefore a magnet. It is only about 30 pips above today’s current high. The momentum up over the past 3 days is strong enough for the bulls to reach that target this week. If they do, the daily chart will be back to neutral after being slightly bearish last week.<p>Because this 3 day rally has not been particularly strong, it will probably lead to several sideways days instead of a bull trend. Day traders will expect to scalp for 10 – 20 pips, as they have been doing for most days over the past 4 months.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-trading-range-day-at-top-of-wedge.png\"><img loading=\"lazy\" src=\"2019-3-12-2.png\" alt=\"Emini trading range day at top of wedge\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>As I said before the open, after yesterday’s extreme buy climax, there was a 75% chance of at least 2 hours of sideways trading that would begin by the end of the 2nd hour. Today spent several hours in a tight range. Because it was a bull day, it was follow-through buying.<p>However, it is stalling at the top of the channel on the 60 minute chart and at the 2800 Big Round Number. Also, the bulls have already achieved their goals on the weekly chart. They prevented this week so far from falling below last week’s low and triggering a sell signal. In addition, the week might be a bull ioi buy signal on the weekly chart.<p>Since they do not need to do more, the Emini might continue today’s trading range for the rest of the week. Less likely, the Emini will continue up to above the March high.<p>Tomorrow might gap down, but an island top is a minor reversal.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-3-12"
    }
  ],
  "13": [
    {
      "data": [
        "<article class=\"post-87843 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini testing 2800 and top of 60 minute wedgeIntraday market update: Wednesday March 13, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini testing 2800 and top of 60 minute wedge</strong><br>Intraday market update: Wednesday March 13, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-03-13T06:20:26-07:00\">March 13, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini testing 2800 and top of 60 minute wedge</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini spent most of yesterday in a trading range. It tested the March 5 top of the wedge bear channel on the 60 minute chart. The bulls want a strong breakout above that high and then above the October-November-December triple top.<p>However, there is a buy climax on the daily and weekly charts. Buy climaxes typically get a 2nd leg sideways to down. Consequently, the bulls will have a difficult time breaking above that resistance without more of a pullback.<p>If today gaps down, yesterday will be a one day island top. However, an island top is a minor reversal pattern. More likely, there was enough momentum up for a test of the December high today or this week.<p>So far, this week is a bull inside bar. If the week closes near its high, it will be a buy signal bar for next week on the weekly chart.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 7 points in the Globex session. It is testing 2800 and the March 5 top of the wedge bear channel on the 60 minute chart. The rally is strong enough to continue up to the March high.<p>However, when there is a wedge reversal that reaches the top of the wedge, the rally typically pauses. Therefore, the odds are against a big bull day. In addition, when a rally is extremely strong, it usually does not reverse into a bear trend without first transitioning into a trading range. Consequently, today will probably be mostly sideways.<p>Less likely, the bulls will get a surprise day up to the March high or a sharp reversal down for a day or two. Traders will assume that the day will have trading range price action. They will take quick profits and bet on reversals until there is a strong breakout up or down.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-trading-range-day-at-top-of-wedge.png\"><img src=\"2019-3-13.png\" alt=\"Emini trading range day at top of wedge\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/EURUSD-Forex-weak-reversal-from-trading-range-breakout-1.jpg\"><img loading=\"lazy\" src=\"2019-3-13-1.jpg\" alt=\"EURUSD Forex weak reversal from trading range breakout\"></a></figure><p>The EURUSD daily Forex chart has rallied for 4 days after breaking below the 4 month trading range. The rally is testing the top of the March 7 sell climax, the 20 day EMA, and a 50% retracement. After 4 bull days, traders will buy the 1st pullback.<p>The chart has been in a bear channel since January 10. The bears hope that this rally is just another bull leg in the bear channel. They want a lower high and then more new lows.<p>But, until they get consecutive bear closes below the prior low, the odds are that the bear channel will have a swing up. A bear channel is a bull flag. There is a 75% chance of an eventual bull breakout and a conversion into a trading range.<p>Because the bear channel has had 3 legs down, it is also a wedge bottom. The bulls are trying to get a trend reversal up to the top of the trading range. While they might achieve that goal, the odds are still slightly better for the bears getting a new low. However, most likely, the trading range will continue. Traders will continue to bet on reversals. Everyone is waiting on Brexit.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 25 pip range overnight. The rally did not quite reach the 1.1320 top of the March 7 sell climax. Since that is a strong magnet, the bulls will probably get there today or tomorrow. Because it is resistance, the 4 day rally will probably stall here for at least a day or two. Then, the odds favor a test down.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-bull-trend-with-late-profit-taking.png\"><img loading=\"lazy\" src=\"2019-3-13-2.png\" alt=\"Emini bull trend with late profit taking\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini today rallied in a Small Pullback Bull Trend from the open to above last week’s high. It got to within a couple points of the October high. The momentum up is strong enough to break above the daily triple top this week.<p>However, that is a resistance zone. Also, the daily chart has been in a trading range for 15 months. Therefore, there is an increased chance of a reversal down. Furthermore, after 4 strong bull days, the chart is in a buy climax. Finally, the bulls achieved their goal of reversing last week’s selloff.<p>Consequently, the Emini will probably trade sideways to down tomorrow and wait for the final hour of the week. It will then decide whether to close above last week’s high and the October high. That would be a sign of strength and increase the chance that the rally will continue up to the all-time high.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-3-13"
    }
  ],
  "14": [
    {
      "data": [
        "<article class=\"post-87850 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini reversed last week’s outside down bar and again at 2800Intraday market update: Thursday March 14, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini reversed last week’s outside down bar and again at 2800</strong><br>Intraday market update: Thursday March 14, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-03-14T06:20:45-07:00\">March 14, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini reversed last week’s outside down bar and again at 2800</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini rallied for the 4th day yesterday to just above last week’s high. It has now totally erased that selloff. I have been writing for the past 2 months that the Emini would probably pull back for 2 – 3 weeks after the weekly buy climax. This week could be the end of the pullback.<p>But, the bulls still need to break strongly above the October high before traders will believe that the rally will make a new high. Furthermore, the rally is already extreme and it is a leg within a 15 month trading range. Also, the Emini is at resistance. All of this makes a bigger pullback likely, even if the rally continues for another couple weeks.<p>The 4 day rally is unsustainable and therefore a buy climax. That increases the chance of a 1 – 2 day pause. This is especially true since the bulls have already reached their target of last week’s high.<p>The next decision is how the week will look once it closes on Friday. Since the bulls have met their goals, the Emini might go sideways until the final hour of Friday. Then, traders will decide if they can close the week on its high and above last week’s high.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 1 point in the Globex session. Yesterday began as a bull trend but spent most of the day in a trading range. An early rally today that reverses down from around yesterday’s high could form a major trend reversal on the 5 minute chart. The minimum goal for the bears would be at least 2 hours and 2 legs down.<p>In strong bull trends, surprises are more likely to be rallies than selloffs. Consequently, there is an increased chance of a strong breakout above the 2018 triple top on the daily chart. More likely, though, is a pullback beginning today or tomorrow.<p>Since yesterday was sideways for the final 5 hours and the Emini is at resistance, today will probably be sideways as well. Traders will likely wait until next week to decide on whether this rally will break strongly above the October high.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-bull-trend-with-late-profit-taking.png\"><img src=\"2019-3-14.png\" alt=\"Emini bull trend with late profit taking\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/EURUSD-Forex-1st-leg-up-from-wedge-bottom-in-bear-channel.png\"><img loading=\"lazy\" src=\"2019-3-14-1.png\" alt=\"EURUSD Forex 1st leg up from wedge bottom in bear channel\"></a></figure><p>The EURUSD daily Forex chart rallied for 4 days from a wedge bottom. A rally from a wedge bottom typically has a 2nd leg up. Therefore, the odds are that the bulls will buy a 3 – 5 day pullback. The 2nd leg up should test today’s high and the top of the 3 month bear channel.<p>The bears want another lower high and then a new low. However, after 4 bull days, they will probably need a micro double top or a double top. Consequently, the 1st reversal down will probably form a higher low.<p>The 4 month trading range continues to have strong legs up and down. Traders are simply waiting for news from Brexit. Until then, they will keep looking for 3 – 5 day legs and then reversals.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute chart sold off 40 pips overnight from above yesterday’s high. Today will probably be a bear day after a 4 day rally. Therefore, traders will sell rallies today.<p>The overnight bars are small and have prominent tails. This indicates a lack of energy. Day traders are looking for 10 pip scalps.<p>There will continue to be occasional 30 pip breakouts on minor Brexit news. But, until there is a major announcement, day traders will look for reversals.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-trading-range-day.png\"><img loading=\"lazy\" src=\"2019-3-14-2.png\" alt=\"Emini trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>As I said was likely, today was a trading range day. On the open, I said that today would probably close below the open after 4 bull days. That is because the Emini has been forming a bear day after every few bull days all year. Today was the 1st bear day in 4 days, but it was a trading range day. Tomorrow will probably also be quiet.<p>Tomorrow is Friday and weekly support and resistance are important. The most important price is last week’s high. Last week was a strong bear bar on the weekly chart. This week broke above its high. If the Emini is within about 5 points of last week’s high after 11 a.m. PST tomorrow, it will probably rally to test it.<p>Less likely, today will break strongly above the 2018 triple top or reverse down strongly. Traders would need a very big day up or down to change the week’s current appearance, and that is therefore unlikely.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-3-14"
    }
  ],
  "15": [
    {
      "data": [
        "<article class=\"post-87854 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini strong rally stalling at 2018 triple topIntraday market update: Friday March 15, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini strong rally stalling at 2018 triple top</strong><br>Intraday market update: Friday March 15, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-03-15T06:20:53-07:00\">March 15, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini strong rally stalling at 2018 triple top</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>After Wednesday broke above last week’s high, yesterday was an inside day and a trading range day. It is a High 1 bull flag, but just below the resistance of the 2018 triple top and it had a bear body. There might be more sellers than buyers above the bear buy signal bar at resistance.<p>But, the odds favor another trading range day today. Today is Friday so the weekly chart is important. The bulls want this week to close above last week’s high. However, the bears want a big tail on this week’s candlestick to make traders wonder if the 2 month rally will fail.<p>Most likely, the week will close near its high and today will not do anything to change that. There is not much incentive for either the bulls or bears to be aggressive today. They would each need a huge trend day to alter what the week has already done. Since that is unlikely, today will probably be another trading range day. It might get drawn to last week’s high in the final hour.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 13 points in the Globex session. There might be a small gap up on the open. A small gap typically closes in the 1st hour. It might open within a few points of the October high, which is the highest of the 3 tops in last year’s triple top. It may even gap above that important resistance.<p>However, the daily chart has been in a trading range for 16 months. Consequently, most breakouts fail. Therefore, a break above the triple top is likely to fail. But, the breakout could continue to go up for a couple weeks before there is a reversal down.<p>Therefore, day traders should be ready for a surprise up or down today. There is an increased chance of a big trend up above resistance. In addition, there is also an increased chance of a big reversal down, especially since yesterday is a bad buy signal bar for today.<p>What is most likely? Today will be another trading range day, even if it goes above the October high. This is because the bulls have already accomplished enough for the week. There is no incentive to do a lot more. They probably cannot reach the all-time high today, which is the next target, and they therefore will likely just be happy to close the week near its high.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-trading-range-day.png\"><img src=\"2019-3-15.png\" alt=\"Emini trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/EURUSD-rally-in-bear-channel.png\"><img loading=\"lazy\" src=\"2019-3-15-1.png\" alt=\"EURUSD rally in bear channel\"></a></figure><p>The EURUSD daily Forex chart yesterday formed a bear reversal bar. But, it had a big tail below. In addition, the 4 day rally has been strong and the bear trend line at the top of the 3 month bear channel is nearby. It is a magnet and the chart might not be able to escape its pull. Consequently, the chart might go sideways to up for at least a few more days to get there. Alternatively, there will be a test down and then a rally to the bear trend line.<p>The bulls hope that the wedge bottom and failed break below the 4 month range is the start of a bull trend. Wedge bottoms typically have a 2nd led sideways to up. Therefore, the bulls will buy a 2 – 5 day selloff.<p>They hope that they can create a higher low. It would be a higher low major trend reversal buy setup. That would increase the chance of a test of the February high above 1.14 and possibly the top of the 4 month range.<p>If today remains a bull inside bar, it would be a buy signal bar for Monday. That would increase the chance of a test of the bear trend line next week.<h3>The 4 month trading range is continuing</h3><p>For 4 months, the legs up and down have reversed every 2 – 3 weeks. Traders will expect a reversal down from the bear trend line. If next week goes above today’s high and reverses, the bears would have a micro double top. That would likely lead to a 2 – 5 day test back down. The bears want a break to a new low, but a higher low is more likely after a wedge bottom.<p>There is no sign that the trading range is about to convert into a trend up or down. Traders are waiting for news from Brexit before they will bet on a new trend.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 20 pip range overnight. Therefore, today will probably be another trading range day. The bulls want today to close near its high so that it will be a good buy signal bar for Monday.<p>However, the bears see the 6 day bull micro channel as extreme. They expect a pullback Monday or Tuesday. They would like today to close near its low. If it does, it would be a stronger sell signal bar. That would increase the chance of several days down instead of just 1 – 2 days down and then a rally to the bear trend line on the daily chart.<p>Because of the significance of a bear or bull body today, day traders will fight over the close of the day. Since having a big bull or bear day adds little predictive value to what will happen next week, today will probably not be a strong trend day up or down.<p>More likely, it will continue yesterday’s trading range price action. Traders will then wait for next week to decide whether to test down to a higher low or up to the bear trend line.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-breakout-above-October-triple-top.png\"><img loading=\"lazy\" src=\"2019-3-15-2.png\" alt=\"Emini breakout above October triple top\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini broke strongly above the October-November-December triple top today to a new 6 month high. It reversed back down after a Spike and Wedge Bull Channel at the measured move target but rallied into the close.<p>By closing above its midpoint, today is a weak sell signal bar for Monday on the daily chart. However, it had a bull body and the momentum up has been strong over the past week.<p>At the moment, the odds are that there will be at least a small 2nd leg up after such an important breakout. But, the Emini should reverse down for at least several weeks beginning within a couple weeks.<p>The daily chart has been in a trading range for 16 months. Most breakouts fail. Consequently, this breakout will probably reverse down within a couple of weeks rather than continuing straight up to the all-time high.<p>Monday is the follow-through day. If it is a bear day closing on its low, the bears might take control next week. If it is a bull day, there will probably be at least another small leg up. But if it goes up, the rally will probably just last 1 – 2 weeks. The odds favor at least a few weeks down beginning soon.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-3-15"
    }
  ],
  "16": [
    {
      "data": [
        "<article class=\"post-87861 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini 3 month rally stalling at 2820 triple top Weekend market update: March 16, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini 3 month rally stalling at 2820 triple top</strong><br>Weekend market update: March 16, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-03-16T00:30:50-07:00\">March 16, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2><strong>Market Overview</strong></h2><p>The<strong>Emini</strong>finally broke above the late 2018 triple top to a new 6 month high. However, the daily chart has been in a trading range for 16 months. Traders should therefore expect disappoint. This bull breakout will probably fail within 2 weeks.<p>The<strong>crude oil</strong>futures contract is getting close to a 50% retracement of the bear trend. It will probably get there within a couple weeks. That is also at the top of the bull channel and around the $60 Big Round Number. Once there, it will then probably trade down to around $51 over the following 2 months.<p>The<strong>EURUSD</strong>Forex market is awaiting a Brexit resolution. While it is in a bear channel, the channel is basically a 4 month tight trading range. Traders will continue to bet on reversals every 2 – 3 weeks.<h2><strong>Crude oil Futures market:</strong><br>3rd leg up in a wedge rally to above $60</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Crude-oil-futures-daily-chart-is-bull-channel-near-60-and-50-retracement.png\"><img loading=\"lazy\" src=\"2019-3-16.png\" alt=\"Crude oil futures daily chart is bull channel near $60 and 50% retracement\"></a></figure><p>The crude oil futures market is near the top of its bull channel. In addition, it is just below the 50% retracement of the bear trend and the $60 Big Round Number. I wrote last week that this week would be up. There is still room to the magnets above. There is only a 25% chance of a successful bull breakout above a bull channel. With the other resistance slightly higher, the rally will probably stall soon.<p>Because the bull channel is tight, the 1st reversal down will likely be minor. However, a bull channel with 3 or more legs functions as a wedge, which is a buy climax.<p>A reversal from a buy climax typically has at least 2 legs sideways to down. In addition, it usually has about half as many bars as there were in the bull channel. Finally, traders should expect a test of the start of the channel. That is the January 14 low of 51.01.<p>There is no top yet and room to the targets above. Therefore, the chart rally will probably go above $60 before the bulls will take profits and the bears will begin to sell. The reversal will probably begin within 3 weeks.<p>The selloff will probably be sideways to down for a month or two. Traders expect it to end around $51. At that point, the bulls will buy again and the bear will take profits. The bull channel will then have transitioned into a trading range.<h2><strong>EURUSD weekly Forex chart:</strong><br>Weak bear channel, awaiting Brexit news</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/EURUSD-weekly-Forex-chart-in-weak-bear-channel.png\"><img loading=\"lazy\" src=\"2019-3-16-1.png\" alt=\"EURUSD weekly Forex chart in weak bear channel\"></a></figure><p>The EURUSD weekly Forex chart has been in a weak bear channel for 9 months. The past 4 months have been essentially in a tight trading range. There have been many minor breakouts up and down, but the chart continues to reverse every 2 to 3 weeks. There is no technical reason to expect a strong breakout up or down.<p>Everyone knows that this mostly sideways trading is due to the uncertainty of Brexit. Consequently, at some point there will be clarity. Once there is, the chart will again trend.<p>No one knows the direction. When a market is in a tight range, traders should assume that the probability of a bull breakout is the same as for a bear breakout. Additionally, they must understand that there is a 50% chance that the 1st breakout up or down will fail and reverse.<p>Until there is a breakout, there is no breakout. Traders will continue to look for reversals every 2 – 3 weeks.<h2><strong>Monthly S&amp;P500 Emini futures chart:</strong><br>3rd consecutive bull trend bar</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-monthly-chart-in-bull-leg-in-trading-range.png\"><img loading=\"lazy\" src=\"2019-3-16-2.png\" alt=\"Emini monthly chart in bull leg in trading range\"></a></figure><p>The monthly S&amp;P500 Emini futures chart so far this month is forming a 3rd consecutive bull trend bar. However, the rally is back to the 2825 area. That has been major resistance for 16 months.<p>There have been two strong breakouts above this level and both reversed down strongly. In addition, there have been many tests of this resistance that failed. The strong 3 month rally is another attempt to break above.<p>The momentum is strong enough to make traders believe that the rally will continue up to the all-time high. But, look to the left. The monthly chart has been in a trading range for 16 months.<p>One of the hallmarks of a trading range is that traders repeatedly become disappointed by the lack of follow-through. No matter how strong selloffs and rallies have been, every one reversed after a few months.<p>Will this one be different? Is the 3 month rally the resumption of the 9 year bull trend? Or, is it just another strong leg in the trading range?<h3>My 80% rule on inertia</h3><p>Markets have inertia. They resist change. When the market is<em>trending</em>, 80% of attempts to end a trend fail. The reversal typically becomes a flag and the trend then resumes.<p>Similarly,<em>trading ranges</em>,like this one, have inertia as well. My 80% rule on inertia also applies to them. Traders should expect that 80% of attempts to break into a trend will fail, and the trading range will continue.<p>That is what is likely here on the monthly Emini chart. Even if the bulls get a new high, the odds are that it will fail and reverse down. This is just like the strong selloff in December that broke below the February 2018 low. Traders should expect reversals and a continuation of the trading range.<p>Every trading range eventually breaks into a trend. As strong as this leg has been, it is still more likely to be a leg in the 16 month trading range instead of a resumption of the 9 year bull trend. Therefore, the trading range will probably continue for at least several more months. Until there is a clear breakout with consecutive closes above or below the range, the odds favor reversals.<h2><strong>Weekly S&amp;P500 Emini futures chart:</strong><br>Strong rally, but at 2820 resistance</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-weekly-chart-with-small-breakout-above-2825-resistance.png\"><img loading=\"lazy\" src=\"2019-3-16-3.png\" alt=\"Emini monthly chart in bull leg in trading range\"></a></figure><p>The weekly S&amp;P500 Emini futures chart completely reversed last week’s selloff. It closed at a new 6 month high, above the October-November-December triple top.<p>In mid-February, I wrote many times that 9 consecutive bull trend bars on the weekly chart is extremely unusual. Typically, that leads to exhausted bulls who take some profits. I said that the odds favored a 2 – 3 week sideways to down move beginning within 1 – 2 weeks. The past 3 sideways weeks met that minimum goal.<p>Therefore, the bulls have a reasonable chance at resuming the bull trend. That is especially true since the past week rallied to above the top of the late 2018 triple top.<p>Last week was a big outside down bar on the weekly chart. It was a sell signal bar for this week. But, instead of this week trading below the prior week’s low and triggering the sell signal, the week rallied strongly and broke above the bear outside down bar. That is a sign of strong bulls.<h3>Possible head and shoulders top</h3><p>If the Emini fails to continue its breakout above that October high next week, traders will begin to wonder if the breakout will fail. The bulls will begin to take profits and the bears will sell more aggressively. The result could be a break below the low of 2 weeks ago and then a measured move down to between 2600 and 2700. The bears will see the lower high as the right shoulder of a head and shoulders top.<p>Is that likely? The weekly chart is still below the all-time high. Whenever there is a strong rally, look to the left. If that strong rally stops around a prior lower high, it might be the 2nd leg up in a double top bear flag. Here, it would also be an head and shoulders top.<p>At the moment, despite the strong rally, there is still a 30% chance of a selloff from around this level to far below the December low. A measured move down from that low would be to around 1900.<h2><strong>Daily S&amp;P500 Emini futures chart:</strong><br>Emini 3 month rally stalling at 2820 triple top</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-daily-chart-has-week-breakout-above-2018-triple-top.png\"><img loading=\"lazy\" src=\"2019-3-16-4.png\" alt=\"Emini daily chart has week breakout above 2018 triple top\"></a></figure><p>The daily S&amp;P500 Emini futures chart broke strongly above the October-November-December triple top on Friday. That level has been strong resistance for 16 months. Even though the bulls broke far above it in January and July last year, both breakouts led to huge reversals down.<p>The momentum up over the past 3 months is a sign that bulls are eager to buy. Consequently, even if there is a strong reversal down to 2600 over the next 2 months, the bulls will be buying.<p>The 3 month tight bull channel is strong enough so the 1st reversal down will be minor. That means it will probably lead to a higher low. In addition, the rally from that low will likely test the top of the current rally.<p>The bears will try to create a double top at that point. That will be at least a couple months from now. Until then, the down side will probably be limited to around a 50% retracement of the 3 month rally. That means a test of 2600.<h2>New all-time high without first getting a 2 month pullback?</h2><p>What about the upside? The bulls want the rally to continue up to a new all-time high. The momentum up is strong enough to achieve that. However, the context is bad. The rally is still a leg in a trading range. Consequently, traders should expect disappointing follow-through buying.<p>Since that is likely, this rally will probably fail within a couple of weeks. Once it reverses, the Emini will try to test the most recent higher low. That is the March 8 low of 2726.50. That is the neck line of the possible double top with the March 4 high.<p>If the selloff breaks below that low, it could continue for a measured move down to the January 23 low. That was the start of the tight bull channel. In addition, it is around a 50% pullback and the 2600 Big Round Number.<p>There is no top yet. This week closed at a new 6 month high. While the Emini probably will go at least a little higher, it will probably then reverse down for a couple months.<p>The bears need a strong sell signal bar. There is none yet. However, the bulls will probably begin to take profits within a couple of weeks. Since the rally is so extreme, the profit taking could last 1 – 2 months and fall to near the January 23 low at around 2600.<hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-3-16"
    }
  ],
  "18": [
    {
      "data": [
        "<article class=\"post-87857 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini breakout above October triple top needs follow throughIntraday market update: Monday March 18, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini breakout above October triple top needs follow through</strong><br>Intraday market update: Monday March 18, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-03-18T06:20:56-07:00\">March 18, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini breakout above October triple top needs follow through</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Friday broke above the top of the October-November-December triple top. It was therefore a new 6 month high.<p>However, the daily chart has been in a trading range for 16 months. Most breakouts fail. The next target for the bulls is the all-time high, which is far above.<p>The 3 month rally has been unusually strong with only a 2 week pullback. That is typically not enough to rest exhausted bulls. Therefore, the breakout will probably pull back more within a couple of weeks.<p>Many bulls will want several more weeks of sideways to down trading to be certain that there are not enough strong bears to create a lower high major trend reversal on the weekly chart. If there is no strong selloff after a few weeks, the bulls will buy again and try for a new all-time high.<h3>The bulls need follow-through buying</h3><p>Will the bulls get follow-through buying today? The odds are against a strong bull trend day because the next target, the all-time high, is probably out of reach without more of a pullback. If there is follow-through buying, it will probably be limited to a few days. Also, after Friday’s buy climax, today will probably have at least a couple hours of sideways to down trading.<p>The bears who gave up on the breakout above the October high will sell again soon. They want to make the breakout fail.<p>The bar after a breakout is always important. If the bears can create a strong bear bar today, today would be a sell signal bar for tomorrow. Traders will wonder if the breakout will fail and reverse down. There is therefore an increased chance of a bear day today. Most likely, today will be neutral.<h3>Risk of blow-off top</h3><p>The pain trade is still up. Because a pullback from above the 2825 resistance is likely, traders are beginning to position themselves for one. The bulls will start to take profits and the bears will short.<p>When that is the case, if the Emini does not turn down, both the bulls and bears will buy. This is because the bulls will be trapped out and the bears will be trapped in. They might do so in a panic. That increases the chances of a surprisingly big bull trend day this week. A Surprise Bar late in a bull trend is more likely to be an exhaustive buy climax than the start of a measured move up.<h2>Overnight Emini Globex trading</h2><p>The Emini is up 1 point in the Globex session. While Friday broke above important resistance, the daily chart is still in a yearlong trading range. Traders should expect breakouts to fail, even when the rally has been exceptionally strong.<p>Consequently, there will likely be another pullback beginning within a couple of weeks. In addition, it will probably be deeper than the one that ended last week. That means that there is a growing chance of bear trend days.<p>However, the daily chart has rallied strongly for 3 months. Most days therefore have closed above their open and many were strong bull trend days. In a bull trend, bull days are more likely than bear days. Day traders are continuing to buy selloffs.<p>With the Emini going sideways for 5 hours after breaking above the October high on Friday, the odds are that today will be mostly sideways as well. However, the chart is at a very important price. As a result, there is an increased chance of a big trend day up or down.<p>Also, even if today is a trading range day, the legs will probably last at least a couple hours, which is long enough for swing trades.<h2>Friday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-breakout-above-October-triple-top.png\"><img src=\"2019-3-18.png\" alt=\"Emini breakout above October triple top\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/EURUSD-Forex-testing-bear-trend-line-and-lower-high-2.png\"><img loading=\"lazy\" src=\"2019-3-18-1.png\" alt=\"EURUSD Forex testing bear trend line and lower high\"></a></figure><p>The EURUSD daily Forex chart has rallied for 7 days and is now testing the 3 month bear trend line. More importantly, it is also testing the February 28 lower high. A bear trend needs lower highs. If the bulls can break above 1.1420, there will then be a higher high. That would make it likely that the 3 month bear trend has ended. Instead, the chart would be back to a trading range.<p>The 3 month bear channel reversed up from a wedge bottom. That is a sell climax, which typically leads to at least a 2nd leg up. Therefore, the bulls will buy the 1st 1 – 2 week selloff, expecting a higher low.<p>If they get a selloff with a good buy signal bar, there will be a higher low major trend reversal. A major pattern has a 40% chance of leading to a swing up. The target would be the top of the 4 month range at 1.1570.<p>With every strong selloff and rally over the past 4 months, I have said trading ranges resist breaking out. Furthermore, I said that traders should expect reversals and not the start of a trend. This continues to be the case. Traders are waiting for clear information from Brexit before they look for a trend up or down.<h2>Overnight EURUSD Forex trading</h2><p>The EURUSD 5 minute Forex chart rallied 40 pips overnight in a tight bull channel. It is being drawn up to the bear trend line, which is only 5 pips above today’s high. However, the tight bull channel makes a bear trend day unlikely. Consequently, the best the bears will probably get today is a 30 pip tall trading range.<p>A more important target is the February 28 lower high. Since it is 50 pips above today’s high, the bulls will probably not get there today. In addition, today is a 2nd leg up from the small pullback on Thursday. Therefore, the bears will try to get a reversal down this week from below the February lower high.<p>That would be a micro double top. But, even if they can begin a 1 – 2 week selloff, the bulls will buy it, expecting a 2nd leg sideways to up after the March wedge bottom.<h3>Entering the sell zone</h3><p>Because the bulls will take profits around the bear trend line or just above the February 28 lower high, this rally will probably end this week. However, it has been strong. In addition, after the March 7 wedge bottom, a higher low from below 1.13 is likely within a couple weeks.<p>Can the rally continue up to above the top of the 4 month range without more than a 2 – 3 day pullback? Yes, but that probably will not happen because the daily chart is still in a trading range. Every strong leg up and down has reversed within 2 – 3 weeks.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-trading-range-day-that-closed-on-its-high.png\"><img loading=\"lazy\" src=\"2019-3-18-2.png\" alt=\"Emini trading range day that closed on its high\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>Today was a trading range day. After breaking above last week’s high, there was a strong selloff. But, it formed a higher low compared to the end of Friday. The bulls then got a 2nd swing up to close the day on its high.<p>The Emini has been in a trading range for 16 months. Most breakouts fail when a market is in a trading range. The bulls broke above the resistance of the 2825 triple top on the daily chart. Consequently, last week’s breakout will probably fail within the next 2 weeks.<p>The minimum target for the bears is the most recent higher low on the daily chart. That is the March 8 low of 2726.50. The bulls want a new all-time high, which is about the same distance away.<p>What about the next few days? Since the breakout was not big, the bulls are disappointed. That makes them hesitant to buy. The bears did not want the breakout. They are hesitant to sell. This confusion typically results is sideways price action, which is likely for a few days. In addition, Wednesday’s FOMC report is another source of confusion and hesitation.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-3-18"
    }
  ],
  "19": [
    {
      "data": [
        "<article class=\"post-88062 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini weak follow-through buying after breakout above 2825 resistanceIntraday market update: Tuesday March 19, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini weak follow-through buying after breakout above 2825 resistance</strong><br>Intraday market update: Tuesday March 19, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-03-19T06:20:35-07:00\">March 19, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini weak follow-through buying after breakout above 2825 resistance</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini broke above last week’s high. That was the minimum objective for the bulls after a strong bull reversal last week. Despite being sideways all day, the day closed on its high. This is good for the bulls, and increases the chance of at least slightly higher prices today.<p>The Emini began the week almost exactly at the midpoint between the March 8 low and the all-time high. The momentum up favors a test of the all-time high.<p>But, the 3 month buy climax and the 16 month trading range are more important. As a result, the next 120 points could very well be down.<p>The break above the October high could continue for another 2 weeks before there is a reversal down. Furthermore, if the bulls get a couple consecutive bull bars closing near their highs, the probability of a new all-time high within a month or two will increase significantly.<p>Even if they get it, most trading range breakouts fail. Therefore, there will probably be more sellers there than buyers above the all-time high. This is because it is also the top of a 16 month trading range. The bears would look to sell a reversal down from a big expanding triangle on the weekly and monthly charts.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 10 points in the Globex session. It will therefore probably gap above yesterday’s high. This would be the 3rd gap up in the 8 day rally. That is a sign of strong bulls.<p>However, it is coming late in a 3 month strong bull trend. It therefore might also represent an exhaustion move. This is especially true after breaking above the 2825 major resistance. This increases the chance of a swing down on the daily chart.<p>But, when a rally is as strong as this 8 day rally has been, it usually has to transition into a trading range before a swing down can begin. Consequently, the bulls will probably buy the 1st 1 – 2 day selloff.<p>Most recent days have spent a lot of time within trading ranges. They also tended to close near their highs. Since markets have inertia, traders should always expect a continuation of what has been going on.<p>Despite the trading range price action, the legs up and down have been big enough for day traders to swing trade. The odds are that this will continue today. With tomorrow’s FOMC announcement being a potential catalyst, there is less chance of a big trend day today.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-trading-range-day-that-closed-on-its-high.png\"><img src=\"2019-3-19.png\" alt=\"\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/EURUSD-Forex-testing-bear-trend-line-and-lower-high-3.png\"><img loading=\"lazy\" src=\"2019-3-19-1.png\" alt=\"EURUSD Forex testing bear trend line and lower high\"></a></figure><p>The EURUSD daily Forex chart has rallied for 3 weeks. Today’s high so far is withing a few pips of the bear trend line that began with the January 10 high.<p>More importantly, it is only 58 pips below the February 28 lower high. As long as the chart continues to make lower highs, it is in a bear trend. If the bulls can break above that 1.1420 lower high, the bear trend will have ended.<p>When a bear trend ends, the chart is in a trading range and sometimes in a bull trend. There have been many strong rallies and selloffs over the past 4 months. Each was strong enough to be the start of at trend. However, during each, I always said that a leg in the trading range was more likely than the start of a trend.<p>That is still true. Until there are consecutive closes above or below the 4 month range, every strong rally or selloff is more likely to reverse than begin a trend.<h3>Still in trading range so expect reversals</h3><p>Every rally or selloff over the past 4 months has reversed within about 3 weeks. This current rally has lasted 8 days and it is now near resistance. The odds are it will reverse.<p>But, in trading ranges, reversals often occur after going beyond support or resistance. Consequently, the reversal will probably take place only after the rally goes above the bear trend line or the February 28 lower high.<p>Because the daily chart has a wedge bottom, the bulls will buy a selloff that retraces above half of the 2 week rally. The odds favor a 2nd leg up on the daily chart after a 1 – 2 week selloff to a higher low.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart continued yesterday’s weak rally. There is now a small double top on the 5 minute chart just below the bear trend line on the daily chart.<p>This is also the 3rd push up on the 60 minute chart. Consequently, the rally is a buy climax at resistance.<p>But, the daily chart is in a trading range. When a rally is very close to resistance, it usually goes beyond the resistance before reversing. Therefore, the 5 minute chart will probably get above the bear trend line this week before trading down for a week or so. It might even have to go above the February 28 lower high as well.<p>Because the 5 minute chart has been in a 30 pip range for the past 6 hours, day traders have been scalping. However, since the rally is near resistance on the daily chart, traders expect a 100 pip selloff to begin within a week. They therefore will begin to look for swing trades from a reversal down. But, they 1st need to see bigger bars and bigger legs on the 5 minute chart. Until then, they will continue to scalp.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-expanding-triangle-top.png\"><img loading=\"lazy\" src=\"2019-3-19-2.png\" alt=\"Emini expanding triangle top\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini broke above an early trading range, but the breakout reversed down from an expanding triangle top. Despite a big midday bounce, the selloff continued down to the 60 minute EMA.<p>Tomorrow also has an 11 am PST FOMC announcement. That is a potential major catalyst. Day traders should exit positions ahead of the report. They should wait for at least 10 minutes after the report before looking to trade again.<p>The daily chart is in an 8 bar bull micro channel. That is a buy climax late in a 3 month rally. Since today closed near its low, it is a sell signal bar for tomorrow. The odds are that tomorrow will trade below today’s low. Furthermore, the Emini might begin pulling back to the March 8 low tomorrow or within a week.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-3-19"
    }
  ],
  "20": [
    {
      "data": [
        "<article class=\"post-88065 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini buy climax ahead of March FOMC announcement Intraday market update: Wednesday March 20, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini buy climax ahead of March FOMC announcement</strong><br>Intraday market update: Wednesday March 20, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-03-20T06:20:00-07:00\">March 20, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini buy climax ahead of March FOMC announcement</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The 2 dominant forces today are the buy climax on the daily chart and the 11 am FOMC announcement. The daily chart has rallied in a bull micro channel for 8 days. That is unusual and therefore a buy climax. It is coming 3 months into a climactic rally.<p>Yesterday closed below its low and it is therefore a sell signal bar for today. Today will probably trigger the sell signal by trading below yesterday’s low. However, after 8 bars without a pullback, the 1st reversal down might be minor. It could last just a day or two. The bears might need a micro double top before they can begin a 1 – 2 week leg down.<p>The Emini has been in a trading range for 16 months. Consequently, the odds are that the breakout above the 2018 triple top at 2825 will fail. A failure does not mean a bear trend. It simply means a temporary end of the rally.<p>The momentum up has been strong. Therefore, the rally might continue for another week or two before there is at least a 3 week selloff to around the March 8 higher low.<h3>FOMC announcement at 11 am PST</h3><p>The FOMC is the other major force today. It is always a potential major catalyst for a big move up or down. Day traders should exit positions before the 11 am PST announcement and wait for at least 10 minutes after the report before trading again. Then, they should be open to anything.<p>Since the 60 minute chart has not touched its 20 bar EMA about 50 bars, the odds are that it will get there tomorrow. If it does not reach the target before the report, there will probably be a selloff after the report that gets there.<h2>Overnight Emini Globex trading</h2><p>The Emini is up 1 point in the Globex market. Yesterday’s bear trend reversal was exceptionally strong. It might dominate the price action for several days. Day traders should be aware that a lower high could lead to a big swing down. Therefore, if there are 2 – 3 consecutive bear bars, especially if they are big and close near their lows, day traders should try to swing part of their short position.<p>Day traders should trade normally until about 30 minutes ahead of the 11 am PST report. Then, they have to be careful, and they should exit positions before the report.<p>In addition, they should wait at least 10 minutes after the report before trading again. This is because there is typically a quick move in the wrong direction within the 1st few minutes. The Emini usually needs at least 10 minutes to establish a trend.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-expanding-triangle-top.png\"><img src=\"2019-3-20.png\" alt=\"Emini expanding triangle top\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/EURUSD-daily-Forex-chart-in-micro-wedge-at-bear-trend-line.png\"><img loading=\"lazy\" src=\"2019-3-20-1.png\" alt=\"EURUSD daily Forex chart in micro wedge at bear trend line\"></a></figure><p>The EURUSD daily chart has rallied in a bull micro channel for 10 days. That is a sign of strong bulls. They typically will buy the 1st pullback below the prior day’s low.<p>There is a micro wedge at the bear trend line. That is a buy climax at resistance. While that usually would result in a 1 – 2 week selloff, the bears will probably need a micro double top 1st.<p>In addition, because the daily chart is in a trading range, low probability events have a higher probability of happening. The market often goes beyond support or resistance before reversing. The January 10 rally and the March 7 selloff are examples. Consequently, this rally might go above the February 28 lower high before there is a 1 – 2 week selloff.<p>The 2 week rally is strong and it followed a wedge bottom. When that is the case, the bulls usually will get a 2nd leg sideways to up after the 1st selloff. Therefore, if there is a 50% selloff to around 1.1350, it will probably reverse up from a higher low.<p>It is important to remember that there have been many strong legs up and down over the past 4 months. Each reversed after 2 – 3 weeks. There is no evidence that the pattern has ended.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has rallied 30 pips over the past 4 hours. However, day traders have been making money selling above the prior day’s high for 5 days. That has created a micro wedge on the daily chart. The overnight rally is not strong enough to deter the bears from doing the same today.<p>Since the daily chart has rallied for 10 days, the bulls continue to buy 20 – 30 pip selloffs. Because the daily range has been small for 5 days, day traders have been scalping.<p>There is an FOMC announcement at 11 am PST today. Day traders should exit positions ahead of the report. In addition, they should wait for at least 10 minutes after the report before trading again. This is because there is usually a quick reversal within the 1st several minutes after the report. It usually takes at least 10 minutes for a trend to become clear.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-bull-breakout-on-FOMC-but-deep-pullback.png\"><img loading=\"lazy\" src=\"2019-3-20-2.png\" alt=\"Emini bull breakout on FOMC but deep pullback\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini reversed up on the FOMC report, but sold off to the middle of the range at the end of the day. Today was the 1st pullback after an 8 day bull micro channel. The odds were that traders would buy below yesterday’s low.<p>Today is now a High 1 bull flag and a buy signal bar for tomorrow. But, today was a bear doji day and therefore a weak buy signal bar. Also, since the daily and weekly charts are in buy climaxes, the upside is probably not very big over the next few days.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-3-20"
    }
  ],
  "21": [
    {
      "data": [
        "<article class=\"post-88068 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Weak Emini High 1 bull flag after March FOMC announcement Intraday market update: Thursday March 21, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Weak Emini High 1 bull flag after March FOMC announcement</strong><br>Intraday market update: Thursday March 21, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-03-21T06:20:02-07:00\">March 21, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Weak Emini High 1 bull flag after March FOMC announcement</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday reversed up on the FOMC announcement, but sold off into the close. By trading below Tuesday’s low, it became the 1st pullback after an 8 bar bull micro channel on the daily chart. The odds favored only a 1 – 3 day pullback before the bulls would buy again.<p>Yesterday is a High 1 bull flag and a buy signal bar for today. But, its bear body means that there will probably be more sellers than buyers above its high.<p>In addition, the daily and weekly charts are still in a buy climax at resistance. Consequently, the upside from here is probably only another week or so. A tight trading range for a few days is more likely than a resumption of the bull trend.<p>The odds favor at least a month of sideways to down trading that begins within a couple of weeks. It might have already started.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 10 points in the Globex session. Today might therefore gap below yesterday’s low. If so, the gap will be small. A small gap typically closes in the 1st hour.<p>The 60 minute chart had a wedge top that turned down on Tuesday. This selloff will probably test the start of that wedge bull channel. That is the March 18 low of 2808.50.<p>The 8 day bull micro channel on the daily chart means the bulls have been strong. Even if it is a climactic top of the 3 month rally, the bears will probably need a micro double top. Therefore, this 1st leg down will probably get at least a 1 day bounce back up within the next few days.<p>There have been many big reversals over the past few days. This has allowed swing traders to make more profit than usual. Since markets tend to continue to do what they have been doing, today will probably have at least one swing up and one swing down as well.<p>Because the 1st selloff after an 8 day bull micro channel typically only lasts a few days, today will probably not be a big bear trend day. Also, after 2 bear days, there is now a Big Up, Big Down pattern on the 60 minute chart. That usually results in a trading range. Therefore, a big bull trend day is also unlikely. Day traders should look for at least one reversal after the 1st 1 – 3 hours.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-bull-breakout-on-FOMC-but-deep-pullback.png\"><img src=\"2019-3-21.png\" alt=\"Emini bull breakout on FOMC but deep pullback\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/EURUSD-Forex-breakout-above-major-lower-high.png\"><img loading=\"lazy\" src=\"2019-3-21-1.png\" alt=\"EURUSD Forex breakout above major lower high\"></a></figure><p>The EURUSD daily Forex chart had a big bull trend day yesterday. By breaking above the February 28 major lower high, it ended the bear trend that began on January 10. The chart is once again neutral.<p>Yesterday was a big day and it was late in a rally. It was therefore a buy climax. Bulls will start to take profits and bears will begin to short.<p>However, the rally has not had a pullback in 10 days. A 10 day bull micro channel is a sign of strong bulls. Typically, the 1st reversal down will be minor. The bears usually will need at least a micro double top before they can start a 2 – 3 week leg down.<p>The 1st targets of a selloff are yesterday’s buy climax low, the 20 day EMA, and a 50% pullback. All are usually close to one another.<p>Since the bears typically need a micro double top after a strong rally, the bulls will buy the 1st 1 – 3 day pullback. That will limit the downside for a few days.<p>Because yesterday was a buy climax in a 4 month trading range and every leg for 4 months has lasted 2 – 3 weeks, the upside is probably limited as well for a few days. The result will probably be a few sideways days.<h3>Overnight EURUSD Forex trading</h3><p>After breaking above the February 28 major lower high yesterday, the EURUSD 5 minute chart has sold off 50 pips. This was likely because the daily chart is still in a trading range, and a buy climax typically attracts profit takers. It usually transitions into a trading range. Consequently, the next few days will probably be sideways.<p>The range is currently big enough for day traders to scalp for 20 pips. However, that will probably shrink to 10 pips as the day goes on. The odds favor a 100 pip tall trading range for several days.<p>Can the rally continue up to the top of the range? Probably not without at least a 1 week pullback. They bulls will likely need a test of the March low. That would create a higher low major trend reversal.<p>Can a reversal from here continue down for 2 weeks? After 10 days without a pullback, the bulls will be eager to buy below the low of the prior day. The 1st reversal down will probably only last a few days.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-Bull-Trend-From-The-Open.png\"><img loading=\"lazy\" src=\"2019-3-21-2.png\" alt=\"Emini Bull Trend From The Open\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>Today was a huge Bull Trend From The Open day. Because today’s rally was so strong, it was climactic. Therefore, there is a 75% chance of at least a couple hours of sideways to down trading tomorrow that starts by the end of the 2nd hour.<p>Yesterday was a bear day and therefore a weak buy signal bar on the daily chart. Consequently, there might be more sellers than buyers above yesterday’s high. If so, tomorrow might form a micro double top with Tuesday’s high. Since the 3 month rally will probably end within the next 2 weeks, the bears are waiting for a micro double top before selling.<p>Less likely, the strong 3 month bull trend will continue up to the all-time high without 1st pulling back for a few weeks.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-3-21"
    }
  ],
  "22": [
    {
      "data": [
        "<article class=\"post-88071 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Yesterday’s strong Emini rally might form micro double top Intraday market update: Friday March 22, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Yesterday’s strong Emini rally might form micro double top</strong><br>Intraday market update: Friday March 22, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-03-22T06:20:45-07:00\">March 22, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Yesterday’s strong Emini rally might form micro double top</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday was a strong bull trend day. By going above Wednesday’s high, it triggered a buy signal on the daily chart. But, Wednesday had a bear body and therefore was a weak buy signal bar. That increases the chances of a failed breakout and a small trading range over the next few days.<p>The bulls want this breakout above the October high to continue up to a new all-time high. While a new high is likely this year, this buy climax is extreme. It is also testing major resistance at the 2825 triple top. Consequently, despite the strong bull trend, there is still a 50% chance of a reversal down from below the all-time high.<p>While yesterday was a good entry bar for the High 1 bull flag, Wednesday was a bad buy signal bar. Therefore, there will probably be sellers above Wednesday’s high.<p>The odds are against today being another strong bull day. However, if it is, the odds will shift in favor of a new all-time high within the next several weeks.<p>Since yesterday was a buy climax day, there is a 50% chance of follow-through buying in the 1st 2 hours. But, there is only a 25% chance of a strong bull trend day. Finally, there is a 75% chance of at least a couple hours of sideways to down trading that starts by the end of the 2nd hour.<h3>Nested buy climaxes</h3><p>Yesterday was a buy climax within a 10 day buy climax. This is nested within a 3 month buy climax. I see this as a variation of a parabolic wedge top. Therefore, there is a 40% chance that yesterday will end up as the final leg up in a 3 month rally, and the start of a 1 – 2 month selloff.<p>The odds will go up if today closes near its open and is a doji day. They will go up more is today closes near its low, And, they will go up more if there are 3 consecutive bear days next week.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 18 points in the Globex session. Today is unusually important. If the bulls get a big bull day closing near its high, the odds will favor a move up to the all-time high. If not, the Emini will probably go sideways for a few days. Then, traders will look for a reversal from an extreme buy climax. Since it is a nested buy climax, it is a parabolic wedge rally.<p>Can today totally reverse yesterday? That sometimes happens, but it is rare. More likely, today will be neutral. The bulls will be exhausted and the bears will be hesitant to sell after a huge bull day. But, what happens over the next few days determines what the next 2 months look like.<p>With yesterday’s range being so big, today will probably have at least one swing up or down. A trading range day is likely. Then, next week gets interesting.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-Bull-Trend-From-The-Open.png\"><img src=\"2019-3-22.png\" alt=\"Emini Bull Trend From The Open\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/EURUSD-Forex-2-day-collapse-on-Brexit-news-1.png\"><img loading=\"lazy\" src=\"2019-3-22-1.png\" alt=\"EURUSD Forex 2 day collapse on Brexit news\"></a></figure><p>After rallying for 10 days without a pullback, today is the 2nd consecutive huge bear trend day on the EURUSD daily Forex chart. Big Up, Big Down creates Big Confusion and typically results in a trading range. Consequently, the daily chart will probably begin to go sideways for several days.<p>I mentioned yesterday that there would probably be a pullback and it could retrace about half of the 10 day rally. The overnight selling did that. Can this continue down to below the March low? Of course, but after a 10 day rally, a higher low and a bounce is likely. This is especially true after the 2 month wedge bottom.<p>Trading ranges repeatedly disappoint bulls and bears. Failed breakouts are more common than successful breakouts. The breakout above the February 8 major low high is failing. This is just like the January breakout above the November high and the March breakout below the November low.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart collapsed 100 pips in less than an hour at the start of the European session. It has been in a 20 pip trading range since. It is also at the support of a 50% retracement of the 10 day rally.<p>The selloff was a Dominant Feature. When there is something that is dominant, it typically dominates the rest of the day. Therefore, today will probably not reverse the selloff. In addition, such dominant price action usually has some follow-through for several days. Therefore, the 1st reversal up will likely fail. Traders will be more inclined to sell rallies for at least a couple days.<p>Can today simply be a climactic test of support at a 50% retracement? Sometimes the 1st leg up in a bull trend has a shockingly big selloff that quickly reverses back up and forms a higher low major trend reversal. That is unlikely without the selling stopping for at least a couple days.<p>Most likely, the 4 hour tight range will continue today, and it will be difficult to make more than 10 – 20 pips on a trade.<p>Since the 10 day rally was strong, the bulls will try to get the day to close above its low, despite the strong selloff. Therefore, day traders will be willing to buy, despite the crash on the 5 minute chart.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-Bear-Trend-From-The-Open.png\"><img loading=\"lazy\" src=\"2019-3-22-2.png\" alt=\"Emini Bear Trend From The Open\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini sold off in a Bear Trend From The Open. It reversed up from a higher low major trend reversal. But, the rally was weak and it failed near the open of the week. The week closed below its open and at the low. This week is a sell signal bar on the weekly chart for next week.<p>The next several days will tell traders whether the rally will continue up to the all-time high without more of a pullback, or if the Emini might be beginning a 1 – 2 month selloff.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-3-22"
    }
  ],
  "23": [
    {
      "data": [
        "<article class=\"post-88078 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini weekly sell signal and daily parabolic wedge top Weekend market update: March 23, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini weekly sell signal and daily parabolic wedge top</strong><br>Weekend market update: March 23, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-03-23T00:30:26-07:00\">March 23, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2><strong>Market Overview</strong></h2><p>The<strong>Emini</strong>has been rallying strongly for 3 months. But, there is parabolic wedge buy climax at resistance on the daily chart and a strong sell signal bar on the weekly chart. If the bulls do not resume their rally next week, the odds will begin to favor a 1 – 2 month selloff.<p>The<strong>crude oil</strong>futures contract has rallied in a parabolic wedge bull channel for 2 months. It is testing the 50% retracement of the late 2018 bear trend. The odds favor at least a pullback to 51 – 55 beginning within 2 weeks.<p>The<strong>EURUSD</strong>daily Forex chart ended its 2 month bear trend this week by breaking above the February 8 major lower high. After the strong selloff on Thursday and Friday, the chart will likely go sideways for several days.<h2><strong>Crude oil Futures market:</strong><br>The 3rd leg up is testing the 50% retracement</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Crude-oil-wedge-bull-channel.png\"><img loading=\"lazy\" src=\"2019-3-23.png\" alt=\"Crude oil wedge bull channel\"></a></figure><p>The crude oil futures market has rallied strongly for 3 months after a huge bear trend in late 2018. For the past several weeks, I have been writing that the daily chart would likely have one more leg up to test the 50% retracement of last year’s bear trend and the $60 Big Round Number. This 3rd leg has lasted for 3 weeks. It is now testing that 50% retracement, which is 60.77 in the April contract.<p>In addition, crude oil is at the top of its 2 month bull channel. Three legs up in a tight bull channel is a parabolic wedge top. The bulls have now tried 3 times to accelerate up. If there is a bear bar closing near its low next week, the bulls might give up. The odds favor a selloff beginning within 2 weeks.<p>That is how wedge tops work. If the market tries to do something 3 times and fails, it then typically tries to do the opposite. If the bears get a reversal next week, the typical goal is at least 2 legs down to the start of the bull channel. That is the January 14 low of 51.31.<p>A higher probability target is the bottom of the pullback from the 2nd leg up. That is the March 8 low of 54.82. In either case, a break below a tight bull channel usually leads to a trading range and not a bear trend.<h3>Possible bull breakout above the 2 month bull channel</h3><p>It is important to realize that the bears do not have a sell setup yet, even though the rally is now in the sell zone. There is always a 25% chance of a successful bull breakout above a bull channel. By successful, I mean 2 or more big bull bars closing on their highs and above the bull channel. When that happens, the odds favor at least 2 legs up.<p>The rally often continues for a measured move based on the height of the channel. The channel began with the January 14 low of 51.31. If the breakout begins next week, the breakout point would be this week’s high. It is 60.39. Therefore, a measured move up would be 69.47. Again, the odds favor a selloff and not a rally.<h2><strong>EURUSD daily Forex chart:</strong><br>Bear trend ended with break above major lower high</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/EURUSD-daily-Forex-chart-has-deep-pullback-from-bull-breakout.png\"><img loading=\"lazy\" src=\"2019-3-23-1.png\" alt=\"EURUSD daily Forex chart has deep pullback from bull breakout\"></a></figure><p>The EURUSD daily Forex chart this week broke above the February 28 major lower high. A bear trend needs lower highs and lows. Once a rally breaks above a major lower high, the bear trend has ended. The chart is then back in a trading range, and possibly a bull trend.<p>After big bear days on Thursday and Friday, the bulls are as disappointed as the bears were by the break above the February 28 lower high. That typically results in several sideways days.<p>Through Wednesday, there were 10 bars with every low above the low of the prior bar. That represents eager bulls. Consequently, they will probably take this opportunity to finally buy below the low of the prior bar. Despite the strong 2 day selloff, there will probably be a 2nd leg sideways to up starting within a week.<p>This is especially true after the 2 month wedge bottom. A strong reversal up from a wedge bottom typically has at least 2 legs sideways to up. Traders should expect a 2nd leg starting next week.<h3>Still in a trading range</h3><p>There have been many strong moves up and down over the past 4 months. Some were very strong, and even broke beyond the trading range. This happened at the high in January and the low in March.<p>In every instance, I reminded traders of my<a href=\"https://www.brookstradingcourse.com/what-is-price-action/#80%Rule\">80% Rule on Inertia</a>. Trading ranges resist breaking out. The market has a strong propensity to continue what is has been doing.<p>That is why I have repeatedly written during strong rallies and selloffs that a reversal was more likely than a breakout into a trend. That is always the case until there are consecutive closes above or below the range.<p>Every trading range eventually breaks out. This range has lasted longer than any other over the past 2 years. It will probably break out up or down within a month or two. Traders are waiting for clarity on Brexit. Once there is a breakout, traders will look for a measured move up or down, based on the 400 pip height of the range.<h2><strong>Monthly S&amp;P500 Emini futures chart:</strong><br>3rd month up, but shrinking bodies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-monthly-chart-has-head-and-shoulders-top.png\"><img loading=\"lazy\" src=\"2019-3-23-2.png\" alt=\"Emini monthly chart has head and shoulders top\"></a></figure><p>The monthly S&amp;P500 Emini futures chart has a doji bar so far in March. If the month closes on its low, it will be a sell signal bar for next month. There are still 6 trading days left in March, and the bar might look different once it closes.<p>The bulls are hoping that the December selloff was just a sharp test of the bull trend line in the 10 year bull trend. Since the S&amp;P had never been as overbought as it was in January 2018, there was an increased chance of a deeper selloff that lasted more than a few bars. And that is what the bears got last year.<p>You can read<a rel=\"noreferrer noopener\" aria-label=\"my posts from early January 2018 (opens in a new tab)\" href=\"https://www.brookstradingcourse.com/analysis/emini-forming-blow-off-top-leading-giving-back-2018-gains/\" target=\"_blank\">my post from early January 2018.</a>It will tell you know what criteria I used at that time to say the bull trend had the most extreme buy climax in history. I also explained why a 5 – 10% correction was likely to begin within weeks. After rallying one more week after that post, the Emini crashed 12% down over the following 3 weeks.<h3>Is the 10 year bull trend resuming up to 3,600?</h3><p>The question at the moment is, “Will this rally continue to a new all-time high without a pullback?” The bulls are hoping that the February 2018 and the December 2018 lows were just 2 legs down in a strong bull trend. They see those lows as a double bottom bull flag. If they are right, they expect a new all time high within a couple of months.<p>Furthermore, they want the rally to continue up for a measured move. The neck line of the double bottom is the September high of 2956.00. Since the December low is about 600 points lower, they want a measured move up to above 3,600 over the next couple years.<p>No one is talking about this yet, but that is the bull case. If there is a strong break above 3,000, the TV pundits will begin to mention 3,600. At the moment, this is unlikely in the next couple years.<h3>Trading ranges resist breaking out</h3><p>Why do I believe this will not happen? First, the monthly chart has been in a trading range for over a year. Most strong legs up and down within a trading range reverse. Consequently, even if the bulls get a break above the September high, it would more likely reverse than continue up to the measured move target.<p>If there is a new high and then a reversal, the monthly chart would have an Expanding triangle top. That is a type of higher high major trend reversal.<p>If there is a reversal over the next few months from a lower high, there would be a lower high major trend reversal. Any major trend reversal with a decent sell signal bar has a 40% chance of a swing down.<p>At the moment, if there is a strong reversal down this year, there is a 30% chance of a break far below the December low. The next support is below 2,000 at the bottom of the 2015 – 2016 trading range.<h3>Will March close on its high?</h3><p>So what is most likely? My<a href=\"https://www.brookstradingcourse.com/what-is-price-action/#80%Rule\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">80% Inertia Rule</a>says that markets tend to continue to do what they’ve been doing. Since the Emini has been in a trading range, the odds are that it will continue for many more bars. This is true even if there is a break to a new high.<p>I mentioned that this month’s bar might look different once March ends. If there is a selloff in the final few days, March would be a strong sell signal bar. That would increase the chance of a 1 – 2 month selloff. Because the monthly chart has been in a trading range for 16 months, every leg up and down will likely reverse every 2 – 3 months, as has been the case.<h2><strong>Weekly S&amp;P500 Emini futures chart:</strong><br>2nd sell signal in 4 weeks</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-weekly-chart-has-head-and-shoulders-top.png\"><img loading=\"lazy\" src=\"2019-3-23-3.png\" alt=\"Emini weekly chart has head and shoulders top\"></a></figure><p>The weekly S&amp;P500 Emini futures chart rallied and reversed down this week after last week’s strong reversal up. I wrote throughout February that the pullback would only be 2 – 3 weeks after a 10 bar bull micro channel.<p>However, I also made the point that the bull trend resumption also typically only lasts a few weeks. At that point, the market often has a more protracted pullback.<p>Ten weeks without a pullback is a buy climax. The bulls were strong enough to get at least one more leg up. This past week met that minimum goal. But, the bulls were exhausted from the buy climax and took profits. If the profit taking continues next week, the bulls might wait for many bars before buying again.<p>For example, the bears might get 2 – 3 legs down over the following 10 – 15 weeks. That means that the Emini might begin to selloff into mid-summer.<p>This week closed on its low. It is a good sell signal bar for next week. It is also the 2nd sell signal at resistance in 4 weeks. This increases the odds of at least a minor reversal. However, the buy climax was so extreme that the reversal will probably be deeper and last longer than what the TV pundits will say.<p>A reasonable target is 2 legs down to 2600 over a couple months. The bulls will then look to buy to create a higher low and a rally into the end of the year.<h3>80% chance of at least 2 months of sideways to down trading this year</h3><p>It is important to understand that no year goes straight up. Traders should expect at least a couple months of sideways to down trading. That is what has happened in 80% of past years.<p>Because the 3 month rally has been extreme, the odds of the pullback beginning within a month are higher. Therefore, traders always have to consider the opposite of what they think is obvious.<p>Yes, the rally has been strong for months. And, it has been especially strong for a couple of weeks. Everyone on TV is only talking about a continuation up. I have been writing about a 1 – 2 month selloff from above the October high. If the next couple weeks are bull bars closing near their highs, I will change my stance and conclude that the Emini will probably make a new high in April.<p>More likely, this 2 week rally is an exhaustive end of the 3 month rally. If the bears get one or two big bear bars closing on their lows within the next few weeks, a bigger pullback will probably be underway. It could also begin with 3 or 4 unremarkable bear bars.<h3>What will a top on the weekly chart look like?</h3><p>If the 3 month rally has been a buy climax and ends with a reversal down, the bears will want to see a sell signal bar that is a big bear bar closing near its low. They got that this week. In addition, they will want the entry bar to also be a big bear bar closing on its low. They hope to get that next week.<p>Finally, they will want most of the upcoming bars to be bear bars, and they prefer to see them closing below their midpoints. Over the next month, we will find out if they succeed.<p>The bears see the rally as the right should of a head and shoulders top. The January 2018 rally is the left shoulder. Every head and shoulders top is a lower high major trend reversal. Every major reversal setup has a 40% chance of a swing down. The minimum goal is two legs and about 10 bars.<p>The neck line of the head and shoulders top is the December low. There is currently only a 30% chance of a strong break below that low.<h3>Likely continuation of the trading range</h3><p>The Emini has been in a trading range for 16 months. That will likely continue indefinitely. If there is a new high, the Emini will probably reverse down. If there is a selloff, it will probably reverse up from a higher low.<p>As I wrote above, major reversals actually lead to a new trend only 40% of the time. Consequently, they more often lead to a continuation of the trading range or a resumption of the bull trend. Therefore, even if the bears get a selloff, the Emini will probably stay within the 16 month range. The bears need 2 closes below the December low before traders believe that a bear trend is underway.<p>Similarly, the bulls need 2 closes above the September high before they will conclude that a measured move up has begun. A continuation of the trading range is what is most likely.<h3>Bulls will buy even a deep selloff</h3><p>If the bulls take profits and the bears get a selloff into the summer, the bulls will look to buy again after 2 – 3 legs down. Even though the 3 month rally is climactic, it represents strong bulls. Therefore, the bulls will look to buy the selloff.<p>This is true even if a selloff retraces more than half of the rally and the Emini drops below 2600. Their buying would create a higher low. That higher low would be the right shoulder of a head and shoulders bull flag. The November low would be the left shoulder. A rally from there in the 2nd half of the year would have a good chance of leading to a new all-time high.<h2><strong>Daily S&amp;P500 Emini futures chart:</strong><br>Emini weekly sell signal and daily parabolic wedge top</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-daily-nested-buy-climaxes.png\"><img loading=\"lazy\" src=\"2019-3-23-4.png\" alt=\"Emini daily nested buy climaxes\"></a></figure><p>The daily S&amp;P500 Emini futures chart has rallied strongly for 3 months. The bulls this week twice got a breakout above the October-November-December triple top. They hope that Friday’s selloff will be brief and that the rally will continue up to a new all-time high. If there are more bull bars closing near their highs next week, the bulls will likely achieve their goal. After Friday, this is now unlikely.<p>This rally has been unusually strong. It is therefore a buy climax. It is important to note that the Emini broke strongly above 2825 in January and July last year. It reversed down strongly both times.<p>Will this time be different? We will find out over the next couple weeks. Friday’s big bear trend bar closing on its low means that the rally reversed down from above 2825 for a 2nd time this week. Tuesday this week was the 1st time. A 2nd reversal has a higher probability of leading to a swing down. This is especially true if the bears get a big bear bar on Monday.<h3>Parabolic wedge buy climax</h3><p>Thursday’s buy climax was at the end of an 8 day bull micro channel, which is a buy climax. It was therefore nested within a bigger buy climax. Both are within a 3 month buy climax. Three nested buy climaxes in a tight bull channel is a type of parabolic wedge buy climax.<p>Remember, the Emini is still in a 16 month trading range, and most breakouts within trading ranges fail. What is taking place is consistent with a failed breakout above the 2018 triple top.<p>Thursday was an unusually big bull trend day. Friday’s big selloff means that Thursday formed a micro double top with Tuesday’s high. This is the minimum that the bears needed to begin a trend reversal down. With Friday closing on its low, it is a good sell signal bar for Monday.<p>Next week is unusually important. If the bulls get a couple closes above this week’s high, the odds will favor a new all-time high without more than a minor pullback. The bear case is now stronger.<p>If next week has 2 – 3 consecutive bear days, the odds will favor a 1 – 2 month pullback from a parabolic wedge buy climax. Next week could go sideways and put off the decision for another week or two. What is now taking place affects what the next 2 months look like. The bears finally have a chance to take control.<h3>What would a top on the daily chart look like?</h3><p>When a bull trend is strong, the bears usually have to stop the buying before they can begin the selling. This means that a bull trend typically transitions into a trading range for at least 5 – 10 bars before the bears can take control. At a minimum, the bears need a micro double top. They got that this week.<p>With the 2nd reversal down from above 2825 and the strong sell signal bar on Friday, the bulls might begin to aggressively take profits. This is because their profits are extreme and they do not want to risk giving them back.<p>Every bear trend begins with the bulls taking profits. If there are one or more very big bear days in the next couple of weeks, it would indicate that the bulls are panicking out of their longs. That will encourage the bears to sell, hoping that the profit taking could last for a couple of months.<p>But, even if it does, the top of an unusually strong rally like this usually gets tested. Therefore, the selloff will probably form a high low and the Emini would come back to this area within a few months.<p>The bulls have a good chance of a new all-time high at some point this year. However, unless the bulls break strongly above this week’s high with the next few weeks, the new high might not come until the fall.<hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-3-23"
    }
  ],
  "25": [
    {
      "data": [
        "<article class=\"post-88074 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini nested buy climaxes above 2825 resistanceIntraday market update: Monday March 25, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini nested buy climaxes above 2825 resistance</strong><br>Intraday market update: Monday March 25, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-03-25T06:20:53-07:00\">March 25, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini nested buy climaxes above 2825 resistance</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Friday completely reversed Thursday’s rally. Thursday was a buy climax. It followed an 8 bar bull micro channel, which is a bigger buy climax. Both are late in a 3 month buy climax. This is a set of 3 nested buy climaxes and it is therefore a parabolic wedge.<p>The context is good for the bears. There is a micro double top for a failed breakout above the 2018 triple top on the daily chart. The daily chart has been in a trading range for 16 months, and therefore failed breakouts are common. Finally, 80% of years have at least 2 months in the opposite direction.<p>Last week is a credible setup for the start of a 1 – 2 month sideways to down move. On the weekly chart, last week is a sell signal bar for a Low 2 rally. If the bears begin to get bear bars closing on their lows this week, the probability will go up.<p>If a 2 month selloff is beginning, it is coming after a parabolic wedge top. A selloff from a parabolic wedge often comes in the form of an Endless Pullback. That is a bull flag that just keeps adding bars. The market continues to drift down for 20 or more bars, looking like a bull flag, yet not resuming up. Then, after about 20 bars, there is a breakout up or down.<h3>This week is important</h3><p>What takes place this week will give traders clues about what the next 2 months will do. If the bulls quickly resume their rally and break above last week’s high, the odds will favor a new all-time high without much of a pullback beforehand. But, if the bears begins to get many bear bars, especially big bars closing on their lows, the odd will favor 1 – 2 months down, possibly to 2600 or lower.<p>When the bulls and bears both have credible expectations, the Emini usually has to go sideways for a few days before it decides on its direction. Unless the bulls quickly resume the rally, the odds will begin to shift in favor of the bears.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 4 points in the Globex session. Despite Friday’s strong reversal down, the bears need to break strongly below last week’s low to make traders believe that a swing down is beginning on the weekly chart.<p>There is no big bear bar on the daily chart breaking far below a support level. Therefore, the bulls have not yet given up. They hope that Friday was simply a pullback to the 20 day EMA.<p>This week will be important. At the moment, the odds favor at least a small 2nd leg down after Friday’s bear trend reversal. That means that traders expect a rally today or tomorrow.<p>Friday was in a trading range for the final 4 hours. The top of the range is just a few ticks below the October high of 2828.75. That has been resistance for 16 months and it is therefore a magnet early this week.<p>Since last week formed a good sell signal bar on the weekly chart, its low is also a magnet. Finally, Friday’s 4 hour trading range was an expanding triangle. That further increases the odds of more sideways trading. Consequently, the Emini might be mostly sideways today between 2800 and 2830.<h2>Friday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-Bear-Trend-From-The-Open.png\"><img src=\"2019-3-25.png\" alt=\"Emini Bear Trend From The Open\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/EURUSD-Forex-higher-low-major-trend-reversal.png\"><img loading=\"lazy\" src=\"2019-3-25-1.png\" alt=\"EURUSD Forex higher low major trend reversal\"></a></figure><p>The EURUSD daily Forex chart rallied for 10 days in a bull micro channel. It sold off sharply for 2 days last week. Whenever a market reverses down sharply after reversing up sharply, there is confusion (Big Up, Big Down creates Big Confusion). Confusion is a hallmark of a trading range.<p>I wrote on Friday the the daily chart would probably be sideways for several days this week. So far, today is a bull bar that is inside Friday’s range. It is within the 3 day tight trading range from 6 days ago. That increases the chance of more sideways trading today and tomorrow. The chart might enter a tight trading range while it waits for more Brexit news.<p>The bulls want the 2 day selloff to be a higher low major trend reversal. And it might be. They need today to close near its high to be a credible buy signal bar for tomorrow. Furthermore, they expect a 2nd leg sideways to up after a wedge bottom and a bull micro channel.<p>However, 2 days down is typically not enough to lead to a major reversal. Furthermore, even a perfect major reversal pattern only has a 40% chance of a swing up. Finally, every strong leg up and down for 4 months reversed. Therefore, a swing up would still probably not break far above the 4 month range. Trading ranges have a strong propensity to continue.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has rallied 35 pips overnight. However, there was a 20 pip pullback in the rally. While the daily chart has a bull trend bar, the 5 minute chart is in a bull channel. It has also been in a trading range for 5 hours.<p>The bulls need a strong breakout above the high from 3 hours ago. However, today’s bars are not big and many have prominent tails. This is trade action price action, and it reduces the chance of a big trend today. More likely, today might rally a little further, like up to Thursday’s low.<p>The bulls will continue to buy pullbacks because they want today to close on its high. That would make it a stronger buy signal bar for tomorrow on the daily chart.<p>Since the bears always want the opposite and the chart has been sideways for 5 hours, the bears will continue to sell rallies. Neither is looking for a trend at the moment. Day traders have been scalping for about 10 pips.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-trading-range-day-1.png\"><img loading=\"lazy\" src=\"2019-3-25-2.png\" alt=\"Emini trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>By trading below last week’s low, the Emini triggered the weekly sell signal today. However, the Emini is at support at the 2800 Big Round Number and the 20 day EMA. Today was a trading range day and therefore not a strong entry day for the bears.<p>Because today closed just above the open, it is a weak buy signal bar for tomorrow on the daily chart. But, Friday’s reversal down was strong enough to have at least a small 2nd leg down. Consequently, if there is a rally this week, it will probably form a lower high.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-3-25"
    }
  ],
  "26": [
    {
      "data": [
        "<article class=\"post-88280 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini weekly sell signal but at 20 day EMAIntraday market update: Tuesday March 26, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini weekly sell signal but at 20 day EMA</strong><br>Intraday market update: Tuesday March 26, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-03-26T06:20:14-07:00\">March 26, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini weekly sell signal but at 20 day EMA</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday traded below last week’s low and triggered a weekly sell signal. However, the day was a trading range day. Since it closed above its midpoint, it is a buy signal bar for today. The bulls are hoping that the 2 day selloff was simply a pullback to the 20 day EMA.<p>But, they have to undo the weekly sell signal. They probably need a couple daily closes above last week’s high to convince traders that the 3 month rally is resuming.<p>Friday’s selloff was exceptionally strong. In addition, the weekly sell signal is the 2nd one in 4 weeks. Furthermore, it is at the 2825 major resistance of the past 16 months. Consequently, the odds favor a 2nd leg sideways to down. This is true even if the Emini rallies for 2 – 3 days.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 12 points in the Globex session. It may have a small gap up open. Small gaps typically close in the 1st hour.<p>Yesterday was a buy signal bar on the daily chart. The bulls see the 2 day selloff as a pullback to the 20 day EMA. However, yesterday had a big tail on top and it followed a big bear day on Friday. There might be more sellers than buyers above yesterday’s high. Therefore, day traders will watch for a reversal down at some point today.<p>Because yesterday formed a double bottom, the bulls want a 25 point measured move up. That would be about a 50% retracement of last week’s selloff. Since the selloff came after a nested buy climax on the daily chart, the odds favor a 2nd leg down. Therefore, even if the bulls get a rally, it will probably reversed down within a few days and form a lower high on the daily chart.<p>Yesterday was a trading range day and the daily chart has a Big Up, Big Down pattern. Both increase the chance of another trading range today. At a minimum, there will probably be at least one reversal leading to a 2 – 3 hour swing in the opposite direction.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-trading-range-day-1.png\"><img src=\"2019-3-26.png\" alt=\"Emini trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/EURUSD-Forex-higher-low-major-trend-reversal-1.png\"><img loading=\"lazy\" src=\"2019-3-26-1.png\" alt=\"EURUSD Forex higher low major trend reversal\"></a></figure><p>The EURUSD daily Forex chart has an inside day yesterday. So far, today is a 2nd consecutive inside day. If it remains that way, there will be consecutive inside days, which is an ii Breakout Mode pattern.<p>Last week’s 2 big bear days formed the 1st pullback in 10 days. The bulls typically buy that. Consequently, the odds favor a test up within 2 weeks. At that point, the bears might form a double top with last week’s high. This would give them a better chance of breaking below the March low.<p>The bulls want this selloff to be a successful test of the March low. They want a rally to begin soon, which they will see as a higher low major trend reversal.<p>The bears always want the opposite. They are hoping that the weekly chart will continue to make lower highs and lows. In addition, they want a strong break below the March low, hoping that it will lead to an acceleration down.<p>At the moment, the daily chart is neutral. When that is the case, there is a 50% chance that the 1st move up or down from the 2 day selloff will reverse. Furthermore, there is a 50% chance of a bull breakout or a bear breakout from the 2 day trading range.<p>Finally, there have been many breakout attempts over the past 4 month and each has failed. As long as the chart is sideways, betting on reversals every 2 – 3 weeks is better than expecting a successful breakout. But, one will probably come soon once Brexit is resolved.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute chart has been in a 30 pip range overnight. It is still within yesterday’s range, which was within Friday’s range. Traders might try to keep today as a 2nd consecutive inside day. There might be Brexit news later this week, and traders might want to stay neutral ahead of it.<p>Because the range has been small, day traders have been scalping. Can today break strongly above or below yesterday’s range? Probably not. Consequently, there will probably be buyers around yesterday’s low and sellers around yesterday’s high.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-bear-channel-after-final-bull-flag.png\"><img loading=\"lazy\" src=\"2019-3-26-2.png\" alt=\"Emini bear channel after final bull flag\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini is still on its weekly sell signal. This 3 day reversal down might be the start of 2 months of sideways to down trading.<p>Because yesterday was a weak buy signal bar, there were likely to be more sellers than buyers above its high. Today gapped up and sold off, closing the gap.<p>On the 5 minute chart, today was a bear channel. A bear channel is a bull flag. The late rally today broke above the bear channel. Tomorrow will probably be sideways to up.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-3-26"
    }
  ],
  "27": [
    {
      "data": [
        "<article class=\"post-88283 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini weekly and daily sell signal bars after 3 month rallyIntraday market update: Wednesday March 27, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini weekly and daily sell signal bars after 3 month rally</strong><br>Intraday market update: Wednesday March 27, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-03-27T06:20:24-07:00\">March 27, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini weekly and daily sell signal bars after 3 month rally</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Since Monday was a weak buy signal bar, there were likely to be more sellers than buyers above Monday’s high. And there were. Although yesterday gapped up, it sold off for several hours and closed the gap.<p>In addition, it dipped below the open of the month before reversing up. The bulls want the March candlestick to have a bull body on the monthly chart when it closes on Friday.<p>Yesterday spent most of the day in a bear channel. A bear channel is a bull flag. There was a late breakout above the channel. That makes today more likely to be sideways to up.<p>But, the bears still want a lower high major trend reversal on the 60 minute chart. This week is currently on a sell signal after falling below last week’s low. The bears want to trigger the sell signal again by trading back below last week’s low.<p>There are nested buy climaxes at resistance on the daily and weekly charts. Therefore, the Emini is probably beginning a 2 month sideways to down move. The bulls need 2 daily closes above last week’s high to shift the probability back in their favor.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 3 points in the Globex session. Yesterday’s late reversal up was strong enough to have follow-through this morning. However, the odds are that the Emini has begun or will soon begin a 2 month correction. Consequently, traders will be looking to sell rallies.<p>For example, if today or tomorrow tests yesterday’s high and the bears get a reversal, the 60 minute chart will have a double top lower high major trend reversal sell setup. That could be a reasonable entry for put buyers, hoping for a 100 – 200 point selloff over the next 2 months.<p>Most days over the past 2 weeks have had at least one reversal. Day traders will therefore expect at least one swing up and one down again today.<h3>Open of the Month is a magnet</h3><p>There are only 3 trading days left in March. The bulls want a 3rd consecutive bull trend bar on the monthly chart. But, the bears want a bear body.<p>Yesterday dipped below the 2809.25 open of the month. That will probably be the most important magnet for the remainder of the week. The Emini might stay in a trading range near that price until the final hour on Friday. Then, traders will decide whether to close above or below it. A bear close would increase the chance of April trading below the March 2725.50 low.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-bear-channel-after-final-bull-flag.png\"><img src=\"2019-3-27.png\" alt=\"Emini bear channel after final bull flag\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/EURUSD-Forex-higher-low-major-trend-reversal-2.png\"><img loading=\"lazy\" src=\"2019-3-27-1.png\" alt=\"EURUSD Forex higher low major trend reversal\"></a></figure><p>On the daily chart, the EURUSD had 2 legs down from last week’s high. If today continues to have a bull body, it will be a buy signal bar for tomorrow.<p>After 10 bars without a pullback, this 5 day selloff is more likely a pullback than a bear trend. With a bull body, today would be a credible candidate for a buy signal. Traders would see the 5 day selloff as a buy setup for a higher low major trend reversal. They would consider the 5 days down as a test of the March low.<p>Will there be a major reversal up into a bull trend? Or, a strong break below the 4 month trading range? Yes, one will probably happen within a month once Brexit gets resolved. But, until there are consecutive closes above or below the 4 month range, traders will continue to bet on reversals every 2 – 3 weeks.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart had a small overnight range. It sold off to below yesterday’s low and reversed up. So far, it is a bull trend reversal day. But, the day is small. With the rally being less than 40 pips, day traders so far have been only scalping for 10 – 20 pips.<p>The chart has been in a 20 pip range for the past 3 hours. The bulls have already achieved their goal. They got a reversal up. They would like to have a bull body on the daily chart. Consequently, they will buy dips below today’s open.<p>Since the bears always want the opposite, they will sell reversals down from near the day’s high. However, the rally in the European session was strong enough to be a Dominant Feature. That means that it will probably dominate the remainder of the day. Traders will expect either a bull trend, or, more likely, a continuation of the 3 hour trading range. The reversal was strong enough to make a bear trend unlikely.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-sell-climax-and-reversal-up.png\"><img loading=\"lazy\" src=\"2019-3-27-2.png\" alt=\"Emini sell climax and reversal up\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>I wrote before the open that yesterday was a bad sell signal bar on the daily chart. I said that there would be buyers below its low. Although today crashed, the bulls bought the selloff. The Emini reversed up from below yesterday’s low and just above the low of the week.<p>The Emini has been trading around the open of the month and last week’s low for 3 days. Both are important, especially when the week and month close on Friday. Consequently, the Emini will probably trade sideways into Friday’s close. Then, in the final hour, we will know if the Emini closes the week and month below that support.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-3-27"
    }
  ],
  "28": [
    {
      "data": [
        "<article class=\"post-88286 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini at magnets of March open and low of last weekIntraday market update: Thursday March 28, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini at magnets of March open and low of last week</strong><br>Intraday market update: Thursday March 28, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-03-28T06:20:42-07:00\">March 28, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini at magnets of March open and low of last week</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>As I wrote before yesterday’s open, yesterday was a bad sell signal bar on the daily chart. Although the Emini triggered the sell, it reversed up. The Emini is waiting for the final hour on Friday.<p>Friday is the last day of the week and this week is the entry bar in a good sell setup on the weekly chart. The bears want the week to close near its low. At a minimum, they want the candlestick to have a bear body and close below last week’s low.<p>Friday is also the last day of the month, and the Emini is near the open of the month. Traders want to see if the month will have a bull body. If it does not, then April will probably test the March low. That means a 100 point selloff over the next month.<p>Furthermore, 80% of years have at least a 2 month move up and a 2 month move down. Therefore, the selloff could last a couple of months before the bulls will buy again.<p>The past several days have oscillated around the open of the week, the open of the month, and last week’s low. These are clearly important prices. Therefore, the odds are that this trading range will continue again today. However, there is an increased chance of either a rally to the high of the week or a selloff to the low of the week starting today or tomorrow.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 1 point in the Globex session. It therefore will probably open within yesterday’s 3 hour trading range. In addition, it increases the chance of trading range trading again today. However, most days over the past 2 weeks have had at least one swing up and one swing down.<p>There might be significant Brexit news tonight. That could result in a big gap up or down tomorrow and a big trend up or down tomorrow. The move would be especially important because it would affect both the weekly and monthly charts.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-sell-climax-and-reversal-up.png\"><img src=\"2019-3-28.png\" alt=\"Emini sell climax and reversal up\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/EURUSD-Forex-double-top-and-double-bottom-in-trading-range.png\"><img loading=\"lazy\" src=\"2019-3-28-1.png\" alt=\"EURUSD Forex double top and double bottom in trading range\"></a></figure><p>The EURUSD daily Forex chart sold off again overnight. It is now in its 7 day of a bear micro channel after a 10 day bull micro channel. The volatility is increasing, and this increases the chance of a breakout soon.<p>While the momentum down over the past 6 days favors the bears, there have been many strong legs up and down. Therefore, the probability is only slightly higher for the bears. They need consecutive closes below the range or one close far below the range to convince traders that the 4 month trading range has ended and a bear trend has begun.<h3>How does a double top work?</h3><p>The EURUSD had sold off strongly from its breakout above the February 28 high. There is a very important point about the strong rally to the March 20 high. It might be forming a possible double top with the February 28 high.<p>One of the reasons why a double top can lead to a strong bear trend is that there is often a very strong 2nd leg up. The March 20 rally was a 10 bar bull micro channel and it broke above the February 28 high. It qualifies as a strong rally. It therefore was likely to have a 2nd leg up after a pullback.<p>Because traders know that the probability favored a higher low this week, traders can find themselves trapped. For example, a bull who bought at any point during the 10 day rally theoretically has a stop below the March 7 low. Consequently, his risk is big and he is now trapped into a disappointing long trade. If the selloff drops below that low, he will sell out of his longs for a big loss.<p>Also, the bears know that a higher low has been likely. Many bears did not sell over the past 6 days. If the selloff breaks below that low, it would be an early sign of a possible strong bear trend. Those who are not short will be eager to sell.<p>Therefore, that strong rally will have trapped bulls into a bad long and trapped bears out of a good short. If there is a breakout, both will have an urgent need to sell. That heavy selling can lead to a fast and big move down. The first target is a 200 pip measured move, based on the height of the double top.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has sold off 40 pips overnight. While the selling this week has not been strong, it has been relentless. Day traders therefore are only scalping for 10 – 20 pips.<p>Because the selloff is now near the bottom of the 4 month range, there is an increased chance of either a strong bear breakout or a strong reversal up. The Brexit news is becoming increasingly important, and an announcement can come very soon that will lead to a trend up or down.<p>It might come out sometime early Friday morning during the European session. Once it comes out, day traders will probably have many days with big swing trades. Until the intraday ranges increase, day traders will continue to scalp.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-reversal-up-from-Final-Bear-Flag.png\"><img loading=\"lazy\" src=\"2019-3-28-2.png\" alt=\"Emini reversal up from Final Bear Flag\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini formed an inside day today. It is neutral going into tomorrow, which is the last day of the week and month. If the month closes around the open, it would increase the chance of a test of the March low. That low is about 100 points down.<p>This week is the entry bar for the bears on the weekly chart. The bulls instead want it to become a High 1 bull flag for next week. They therefore will try to get the week to close near its high.<p>There are several weekly and monthly magnets nearby. Each will be a magnet tomorrow, especially in the final hour.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-3-28"
    }
  ],
  "29": [
    {
      "data": [
        "<article class=\"post-88290 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini buy climax and final trading day in MarchIntraday market update: Friday March 29, 2019\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\"><strong>Emini buy climax and final trading day in March</strong><br>Intraday market update: Friday March 29, 2019</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-03-29T06:20:08-07:00\">March 29, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini buy climax and final trading day in March</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini formed an inside day yesterday. But, it closed near the high and there is a micro double bottom on the daily chart. Yesterday is therefore a buy signal bar for today.<p>Today is the last day of the week, month, and quarter. The close of the weekly and monthly candlesticks is unusually important. Since the bears had a sell signal on the weekly chart last week, they want a strong entry bar this week. The bulls instead want the week to close near its high so that it will be a High 1 bull flag for next week.<p>The monthly chart had bull bars in January and February. They want March to be the 3rd consecutive bull bar. However, if today closes around the open of the month, this month’s candlestick will be a doji bar. That would be neutral, and it would increase the chance of a test of the March low. A bear body would further increase the odds. That low is about 100 points below.<p>The Emini has been sideways for 4 days around the open of the month and the low of last week. That tells traders that those prices are important. Consequently, they will be magnets today, especially in the final hour.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 12 points in the Globex session. There is a 2 day micro double bottom on the daily chart, and yesterday was a decent buy signal bar. Yesterday’s rally was a potential start of a reversal up.<p>Today might gap above yesterday’s high. That would trigger a buy signal on the daily chart. Consequently, there is an increased chance of a bull trend day today.<p>However, the rally might stall around Tuesday’s lower high. If so, the daily chart would have a small double top in addition to this week’s micro double bottom. Traders are still deciding whether last week’s high was the high for the next 2 months or if the rally will continue up to a new all-time high.<p>Since yesterday was a buy climax, there is a 70% chance of at least 2 hours of sideways to down trading at some point today. Because yesterday’s buy climax lasted only half a day, the bulls might not yet be exhausted. That means the rally could continue for 2 or more hours and test Tuesday’s high before the bulls will begin to take profits. Since the Emini yesterday ended with a strong bull trend and there is room to the next resistance above, there is an increased chance of an early rally.<p>However, today is the last day of the week, month, and quarter. Consequently, traders have to be ready for either a strong rally or reversal down in the final hour.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-reversal-up-from-Final-Bear-Flag.png\"><img src=\"2019-3-29.png\" alt=\"Emini reversal up from Final Bear Flag\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/EURUSD-Forex-double-top-and-double-bottom-in-trading-range-1.png\"><img loading=\"lazy\" src=\"2019-3-29-1.png\" alt=\"EURUSD Forex double top and double bottom in trading range\"></a></figure><p>The EURUSD daily Forex chart has sold for 7 days off from a breakout above the February 28 high. There was an initial 2 day bear spike and then a 5 day tight bear channel. A bear Spike and Channel is a sell climax. Traders should expect a bounce over the next week.<p>The bulls want the selloff to be simply a deep pullback from their breakout. However, the bears hope that the March 20 high formed a double top with the February 28 high. They then want a strong break below the March 7 low and a 250 pip measured move down.<p>Trading ranges constantly form double tops and bottoms and wedge tops and bottoms. There is always both a reasonable buy and sell setup.<p>But, as strong as the legs up and down are, the odds favor reversals. Until there is a bull or bear breakout with consecutive closes beyond the range, traders will continue to bet on reversals.<p>Traders are waiting for Brexit information. It can come at anytime. That is a potential catalyst for the next trend. In the meantime, they will continue to look for reversals.<p>Since the current selloff has lasted 2 weeks and is now at the bottom of the range, a rally will probably start next week. But, a surprise from Brexit could instead lead to a huge bear breakout. The probability still favors reversals.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart sold off to below yesterday’s low in the European session, but reversed up 40 pips over the past 2 hours. Since the location on the daily chart is good for the bulls, there is an increased chance of a bull trend day today. Day traders will look to buy pullbacks. If there is a very strong bull breakout, they will buy at the market as well.<p>Since most days have been predominantly sideways, the bulls will probably scalp for 10 – 20 pips. However, if there is a sustained big breakout, they will swing trade.<p>Because almost every day has had a lot of trading range price action, the bears will look to scalp reversals down from around the prior intraday high. While a 40 pip rally is not major, it is enough to make a bear trend unlikely today. Therefore, it will probably be easier to make money today looking to buy pullbacks that selling rallies.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-trading-range-day-2.png\"><img loading=\"lazy\" src=\"2019-3-29-2.png\" alt=\"Emini trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini sold off for a few bars after a big gap up. It then entered a tight trading range. After a brief bull breakout at the end of the day, it pulled back to close near to test the open. It closed near the open and high, and today was a bull doji day.<p>On the monthly chart, March was a bull doji bar. This is more neutral than the prior 2 months.<p>The week closed near its high. Therefore, this week is a buy signal bar for next week. However, the buy climaxes on the daily and weekly chart make a 2 month sideways to down pullback more likely than a continued rally to new all-time high.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-3-29"
    }
  ],
  "30": [
    {
      "data": [
        "<article class=\"post-88297 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini parabolic wedge climax top and loss of momentum\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini parabolic wedge climax top and loss of momentum</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-03-30T00:30:00-07:00\">March 30, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2><strong>Market Overview: Weekend Market Update</strong></h2><p>The<strong>Emini</strong>has a parabolic wedge buy climax at the 2825 resistance level and a loss of momentum. A 2 month pullback is more likely than a continued rally to a new all-time high.<p>The<strong>crude oil</strong>futures chart is in a Spike and Channel bull trend. There is no reversal yet and there are magnets above between $60 and $62. However, once the rally tests that resistance, crude oil will probably pull back to below $55 over the following month.<p>The<strong>EURUSD</strong>Forex market has been in the longest trading range in 2 years. The increased volatility in March makes a breakout likely within the next month. It can be up or down.<h2><strong>Crude oil Futures market:</strong><br>Bull channel is near profit-taking zone</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Crude-oil-near-50-retracement.png\"><img loading=\"lazy\" src=\"2019-3-30.png\" alt=\"Crude oil near 50% retracement\"></a></figure><p>The daily chart of the crude oil futures market is in a Spike and Channel Bull Trend. The rally to the January 11 high is the spike. Once there was a pullback down to the January 14 low, the channel began.<p>There have been 3 legs up in the channel. But, the daily chart has been sideways for 2 weeks. In addition, there is no clear top for the 3rd leg up.<p>Finally, there are magnets above. The 50% retracement is at 60.77. A Leg 1 = Leg 2 measured move projection is around $62. Leg 1 ended at the January 11 top of the Spike and Leg 2 began with the low of the January 14 pullback. That is the start of the bull channel.<p>In addition, $60 is a big round number and a psychological magnet. And, the January 28 and February 11 double bottom bull flag has a measured move target in that area as well.<h3>Testing resistance</h3><p>The rally is close enough to the targets for traders to conclude that the resistance has been tested. That means a reversal down can begin at any time.<p>However, it is more likely that significant profit-taking will not begin until the rally goes above at least a couple of the targets. Traders should expect slightly higher prices within a couple of weeks and then a pullback to support. The nearest support is the March 8 higher low of 54.82.<h3>Bull channel is a bear flag</h3><p>A bull channel has only a 25% chance of a successful breakout above the top of the channel. If the daily chart accelerates up within the next few weeks, there is a 75% chance that the breakout above the channel will reverse down within 5 bars.<p>Because a bull channel typically has a bear breakout, traders should think of a bull channel as a bear flag. The first goal is a test of the bull trend line at the bottom of the channel. The selloff usually falls below that and tests lower highs in the channel.<p>The bull channel in a Spike and Channel bull trend typically evolves into a trading range. The bottom of the range is usually around the start of the channel. That is the January 14 low of 51.31. Since the rally from that low has lasted 2 months, a selloff back down will probably take at least a month. A minimum goal for the bears is a test of the March 8 higher low just below $55.<h2><strong>EURUSD daily Forex chart:</strong><br>Increasing volatility increases the chance of a breakout soon</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/EURUSD-daily-Forex-chart-has-deep-pullback-from-strong-rally.png\"><img loading=\"lazy\" src=\"2019-3-30-1.png\" alt=\"EURUSD daily Forex chart has deep pullback from strong rally\"></a></figure><p>The EURUSD daily Forex chart has been in a trading range for 4 months. This is the longest trading range in 2 years. Traders know that a breakout is likely within a month. This is especially true after unusually strong legs up and down over the past month. Increased volatility often precedes a breakout.<p>Everyone is waiting for Brexit news before they are willing to bet on a trend. In the meantime, traders continue to look for reversals every 2 – weeks. In addition, they expect breakouts above and below major points to fail, as they have done many times over the past 4 months.<p>Every trading range has reasonable buy and sell setups. There are always double tops and bottoms and wedge tops and bottoms. So far, every one of them led to a 2 – 3 week leg in the range and then another reversal.<p>Traders will continue to bet on reversals until there are consecutive closes above or below the range. Once that happens, the odds will shift in favor of a successful breakout.<h2><strong>Monthly S&amp;P500 Emini futures chart:</strong><br>Shrinking bodies means loss of momentum</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-monthly-chart-with-shrinking-bodies-and-head-and-shoulders-top.png\"><img loading=\"lazy\" src=\"2019-3-30-2.png\" alt=\"Emini monthly chart with shrinking bodies and head and shoulders top\"></a></figure><p>In March, the monthly S&amp;P500 Emini futures chart had a high above the February high and a low above the February low. Another bullish factor was a bull body. But, the bull body was small enough to make the candlestick qualify as a doji bar. That is a sign of a balanced market.<p>This small bull body followed a medium size bull body in February and a big bull body in January. Shrinking bodies represent a reduction in momentum. As a bull trend loses momentum, it begins to pull back. At some point, a bar trades below the low of the prior bar.<p>With March being close to neutral, the bull trend could pause more. April might be sideways. If so, its high could be around the March high and its low could test the March low. This is important because the March low is about 100 points below the March close. Therefore, there is an increased chance of a 100 point selloff in April.<h3>Strong 3 month rally, but still in a 16 month trading range</h3><p>With so many stocks up 20% or more this year, it is easy to forget that the stock market is still in a 16 month trading range. Trading ranges typically have pullbacks every few bars. Therefore, the Emini will probably either trade below the March low in April or the April low in May.<p>That does not mean that the selloff will be the start of a reversal down from a head and shoulders top. However, it would remind traders that the market is still in a trading range.<p>Trading ranges regularly disappoint bulls and bears. There are many strong legs up and down. Trend traders are always hoping that one will lead to a trend. But, when a market is sideways, reversals are more common than breakouts. Consequently, the Emini will likely disappoint the bulls within a month or two.<h3>2 month pullback coming soon</h3><p>Look back over the past 100 years. How often has a year trended without more than a one month pullback? The answer is less than 20%. Traders should therefore assume that there will be at least one sideways to down pullback this year that lasts 2 or more months.<p>With the buy climaxes on the daily and weekly charts, the 2825 resistance, and the loss of momentum on the monthly chart, April or May are good candidates for the start of a pullback.<p>A pullback can grow into a bear trend. But, this rally has been unusually strong. In addition, it began as a reversal up from an extreme sell climax at the monthly bull trend line. This combination makes a 2nd leg up likely. Consequently, even if the selloff lasts more than 2 months and retraces more than half of the 3 month rally, bulls will look to buy a reversal up.<p>At the moment, traders should begin to expect a pullback lasting at least a couple months. It might simply be a sideways pause, but it could be deeper and faster than what is currently likely.<h3>When will there be a new all-time high?</h3><p>The 3 month momentum up is strong. But, since the chart is in a trading range, there is only a 40% chance that this rally will make a new all-time high without at least a 2 month pullback.<p>Furthermore, if it did, the buy climaxes on the daily and weekly charts would be even more extreme. That would increase the chance of a deeper and longer pullback.<p>Without a pullback within the next few months, there will probably be sellers at a new high. The bulls will have huge profits and a stop that is far below. They will therefore take profits. In addition, the bears will begin to sell, betting that the bulls will take profits.<p>A reversal down from a new high would create an expanding triangle top, which is a type of higher high major trend reversal. It would probably lead to a selloff lasting several months.<h2><strong>Weekly S&amp;P500 Emini futures chart:</strong><br>Consecutive sell signals, but no clear reversal down yet</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-weekly-chart-has-head-and-shoulders-top-and-bull-flag.png\"><img loading=\"lazy\" src=\"2019-3-30-3.png\" alt=\"Emini parabolic wedge climax top and a head and shoulders top\"></a></figure><p>The weekly S&amp;P500 Emini futures chart triggered a sell signal this week by trading below last week’s low. Last week was the 2nd sell signal bar in the past 4 weeks. By closing near its low, it was a strong sell signal bar.<p>However, this week was the entry bar and it had a bull body. That reduces the chances of a sharp selloff. Instead, it increases the probability of the Emini going sideways for a couple weeks. Because the week closed near its high, it is a buy signal bar for next week. However, it is still on last week’s sell signal, and several other factors that I am discussing this week weaken the bull case.<h3>10 bar bull micro channel means exhausted bulls</h3><p>Because this week was a pullback and it had a bull body, it is a High 1 bull flag buy signal bar for next week. But, there is a problem. I have said several times that once a bull micro channel has 5 or more bars, the odds are that traders will buy the 1st pullback.<p>I also said that when the micro channel last about 10 bars, it is extreme. The bulls get exhausted. That is a problem for traders wanting quick, significantly higher prices.<p>Consequently, the rally from the 1st pullback typically struggles once it gets above the top of the micro channel. Traders expect a deeper, longer pullback to begin after a few bars up. As a guide, I look for about 10 bars and 2 legs sideways to down. That is about 2 months.<p>That is the case here on the weekly chart. The bear reversal bar from 2 weeks ago is a good candidate for the high for the next couple of months<h2><strong>Daily S&amp;P500 Emini futures chart:</strong><br>Emini parabolic wedge buy climax and loss of momentum</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/03/Emini-daily-chart-has-nested-buy-climaxes.png\"><img loading=\"lazy\" src=\"2019-3-30-4.png\" alt=\"Emini parabolic wedge climax top.\"></a></figure><p>The daily S&amp;P500 Emini futures chart has an interesting chart pattern. The March 21 huge bull bar was a one day buy climax. It followed an 8 bar bull micro channel, which is a bigger buy climax.<p>Look at the weekly chart. There was a 10 bar bull micro channel from the December low. That is an even bigger buy climax.<p>There are now 3 consecutive buy climaxes. Each is shorter in duration. This is a sequential buy climax pattern with the climaxes coming faster.<p>I think of it as a variation of an Emini parabolic wedge climax. A parabolic wedge rally is a tight bull channel with at least 3 legs. The daily chart is in a tight bull channel, and it has 3 buy climaxes. The climaxes are shrinking in duration, much as the legs in a wedge shrink.<p>As for a more traditional Emini parabolic wedge climax, the daily chart only has 2 clear legs up. The tops are the March 4 and 21 highs. If the Emini makes a new high within the next couple of weeks and reverses, the daily chart would then have a clear Emini parabolic wedge climax top. This is in addition to the sequential buy climaxes that currently exist.<h3>A top or one more minor new high</h3><p>What should traders expect over the next few weeks? There is already a credible top on the weekly chart. The daily chart has sequential buy climaxes. Also, it might have formed a micro double top and a lower high this week. The rally is stalling at 2825, where is has failed many times over the past 16 months.<p>Based on the weekly chart, a 2 month pullback has either begun or it will begin within a few weeks. The daily chart might also get one more new high to create a more traditional Emini parabolic wedge climax top.<p>These factors make it likely that either the high from 2 weeks ago is the start of a 2 month selloff, or there will be one more brief new high before the selloff begins.<h3>Can the bulls get a new all-time high soon?</h3><p>Can the rally continue up to a new all-time high without a 2 month pullback? Of course it can, and if it does, no one will be surprised. The 3 month rally is very strong and it came from a climactic reversal up from a monthly bull trend line.<p>However, remember that the Emini has been sideways for 16 months. My 80% rule says that 80% of strong legs in a trading range reverse. Also, the monthly chart is losing momentum as it tests the 2825 resistance. Therefore, there is better than a 50% chance of a 2 month pullback before there is a new all-time high.<p>Will the bulls get a new high this year? The 10 year bull trend has been incredibly strong. My 80% rule on inertia also applies to trends. Eighty percent of trend reversal attempts fail. Traders should therefore assume that there will be a new all-time high in the 2nd half of the year.<p>But, a trading range late in a bull trend is usually the Final Bull Flag. Therefore, the 2018 trading range will probably be the Final Bull Flag in the 10 year range. That means that there will probably be a major trend reversal down to around 2,000 that starts within 1 – 10 months after making a new all-time high.<hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-3-30"
    }
  ]
}