{
  "1": [
    {
      "data": [
        "<article class=\"post-91932 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini profit taking after first interest rate cut in 11 years\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini profit taking after first interest rate cut in 11 years</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-08-01T06:20:18-07:00\">August 1, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Thursday August 1, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini crashed on the 5 minute chart yesterday after the FOMC announcement, but reversed up and undid much of the selling. It has been oscillating around 3,000 for a month, and yesterday’s bounce failed near that magnet.<p>Since this week traded below last week’s low, this week is now a pullback in an 8 week bull micro channel. However, the 8 week rally had bear bars and small bars on the weekly chart. It was a weaker rally than the January micro channel. Therefore, the pullback will probably last at least another week or two.<p>I have been saying that the Emini would selloff to 2900 – 2950 within a couple weeks. Yesterday’s low of 2957 might be all that the bears get. More likely, there will be at least a small 2nd leg sideways to down down within a few days.<p>August should trade below the July low and test around 2900. Even if the selloff is deeper, the odds still favor a new high later this year.<h3>Yesterday’s selloff was in part due to options trading</h3><p>It is important to understand that about half of yesterday’s selloff was caused by options trading firms. As the stock market falls, the value of short puts increases at an increasing rate. This is the gamma. The option selling firms have to offset their risk by selling stocks and futures. This increases the collapse. Once they are fully hedged, the selling stops, and the bears buy back their shorts. Yesterday was an example of a strong short-covering rally after a gamma-related crash.<p>After yesterday’s Big Down, Big Up, there is now Big Confusion. The Emini might go sideways for a day or two before deciding whether to resume up or continue down. At the moment, the odds still favor 2 – 3 weeks down to 2900.<h2 id=\"options-related-selling\">Options related selling</h2><p>I posted this just before the close yesterday and I am repeating it here.<p>The Emini crashed after the Fed rate cut, but reversed up violently to around 3,000. About half of the selling was caused by the gamma in options. Hedge funds and institution hedge their stock positions in many ways.<p>A common way is to buy puts. For them to buy puts, other firms have to sell puts. There are huge option firms that specialize in selling puts and calls. They are essentially selling insurance to all of the firms that buy stocks.<p>When the stock market goes down, the firms that buy puts have their losses partially offset by the puts that they bought. These puts increase in value. That means that the options selling firms that sold the puts are losing money on their short puts.<p>The rate of loss accelerates as the stocks fall. It is not linear. Gamma measures how fast option prices change with the change in stock price. The gamma becomes big during a quick selloff.<p>That increasing gamma means that the options selling firms are losing money at an increasing rate. When the gamma rises, option selling firms have to reduce their risk. One way to to short stocks. If they short enough, the risk of a further drop in the stock market will not create additional losses for them. What they lose from their short puts, they make from their short stocks and futures.<p>When there is a big down day like today, about half of it is due to fundamentals, like the bulls taking profits and the bears shorting. The other half is created by option selling firms protecting themselves from losses on the puts they sold. Therefore, a big down day is actually not as bearish as it looks.<h3>Overnight Emini Globex trading</h3><p>The Emini is up one point in the Globex session. After yesterday’s huge reversal up, the Emini will probably be in a trading range today. It could go sideways for several days.<p>Furthermore, yesterday’s range was extremely big. Today will open at least 20 points above yesterday’s low and probably not break below yesterday’s low. That will make today an inside day.<p>Trading ranges have legs up and down. Since yesterday’s range was so big, the legs today will probably be big enough for swing trades.<p>While a trend day up or down is always possible, yesterday’s Big Down and Big Up created Big Confusion. Confusion typically leads to a trading range.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/07/Emini-crash-after-FOMC-Fed-rate-cut.png\"><img src=\"2019-8-1.png\" alt=\"Emini crash after FOMC Fed rate cut\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/EURUSD-Forex-breakout-below-head-and-shoulders-top.png\"><img loading=\"lazy\" src=\"2019-8-1-1.png\" alt=\"EURUSD Forex breakout below head and shoulders top\"></a></figure><p>The EURUSD daily Forex chart had a big bear trend bar yesterday and it closed far below the 5 month trading range. That is a Bear Surprise Bar, which typically has at least a small 2nd leg sideways to down. This is therefore likely to be a successful bear breakout. Success means at least a couple legs down to a measured move target.<p>Yesterday could be a measuring gap. A measured move down based on the height of the 5 month trading range is 1.0802. The measured move target based on the July 23 breakout below the head and shoulders top is at 1.0950.<p>If today remains a big bear trend day and it closes near its low, the probability of reaching the lower target goes up. But if today closes above its midpoint, the probability of reaching the lower target will be less.<h3>Can the bear breakout fail?</h3><p>Traders have to remember that the opposite of what is likely always has at least a 40% chance of happening. Therefore, there is a 40% chance that this breakout will fail.<p>For example, if the daily chart goes sideways for a few days and forms a micro double bottom, the bears will begin to take profits. If the profit taking is strong, traders will conclude that the bears are giving up and that the bulls are taking control. The result could be a failed breakout and a reversal up to the middle or top of the 5 month range over the next couple months.<p>The bulls want today to close above the midpoint. If they can get today to close at the high, it would reduce the chance of a successful breakout on the daily chart. While a 2nd leg would still be likely, it would probably be smaller. Furthermore, it might be more sideways rather than down.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute chart sold off strongly late yesterday after the FOMC announcement. That was a spike down. The selling continued since then in a bear channel. This is a Spike and Channel Bear Trend.<p>A channel is a weaker bear trend. Bears are beginning to wait for rallies before selling. They are no longer willing to sell at the low.<p>Traders expect the channel to transition into a trading range today. Once it becomes a trading range, the bulls will look for reversals up. The channel has been broad enough for the bulls to make several 10 pip scalps overnight.<p>While the bulls would like a major trend reversal up, the best they probably can get today is a rally to the start of the channel at around 1.1060.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-buy-climax-and-then-bear-trend-reversal.png\"><img loading=\"lazy\" src=\"2019-8-1-2.png\" alt=\"Emini buy climax and then bear trend reversal\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini rallied in a 19 bar bull micro channel on the open. The rally continued to above yesterday’s sell climax high.<p>After going sideways for more than an hour, it crashed again, like yesterday. It fell below yesterday’s low and the July low. Yes, the crash was news related, but it could not have happened if the market was not already looking for an excuse to selloff. I have been talking about this for 2 weeks. The buy climaxes on the daily and weekly charts are the excuse.<p>It is important to remember that there is an oo buy signal on the monthly chart. There is therefore a 60% chance of sideways to up trading into September. Consequently, even though the Emini will probably be sideways to down for another couple of weeks and test 2900, it should then make a new high.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-8-1"
    }
  ],
  "2": [
    {
      "data": [
        "<article class=\"post-91935 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini reversal down to 2900 within 2 weeks after July FOMC\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini reversal down to 2900 within 2 weeks after July FOMC</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-08-02T06:20:25-07:00\">August 2, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Friday August 2, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>After Wednesday’s big bear trend day, yesterday rallied strongly and it erased most of the selloff. However, it then sold of sharply after a Leg 1 = Leg 2 measured move up to Wednesday’s sell climax high. It fell below the low of the day, yesterday’s low, last month’s low, and my minimum target of 2950.<p>I have been saying for 2 weeks that there would be at least a 2 – 3 pullback on the weekly chart within a few weeks. This is because there was a wedge top on the daily chart. Furthermore, the 8 bar bull micro channel on the weekly chart was unsustainable. This week fell below last week’s low and it therefore ended the micro channel. The pullback has begun.<p>Can the bull trend resume up from here? I still think more sideways to down is likely because the bull channel on the weekly chart has not been strong for several weeks. While the Emini might go sideways for more days, the odds favor a test of 2900 within a couple weeks.<p>On the monthly chart, July is a minor sell signal bar. The Emini was likely to test below the July low in August, and it did yesterday. But after July triggered the monthly oo buy signal, there is a 60% chance of sideways to up trading for 3 months. Consequently, there will probably be buyers not far below the July low.<p>Today is Friday and therefore weekly support and resistance are important. The bears want this week to close below last week’s low. They also want it to close below the July 18 low, which is the neck line of the double top on the daily chart. The bulls always want the opposite. They would also like the week to close above 3,000, but that is probably too far above. These prices will be magnets today, especially in the final hour.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 13 points in the Globex session. It might gap down on the open today.<p>However, yesterday’s late trading range came after a sell climax. Consequently, it will probably be a Final Bear Flag. That means that day traders expect that a gap down below yesterday’s low will not lead to a big bear trend today. Instead, they will look for a reversal back up into yesterday’s trading range.<p>The Emini oscillated around 2950 for 2 hours yesterday. Day traders therefore see that as a fair price. If today trades below it, they might see the price as unfairly low. That could attract buyers and lead to a move back to yesterday’s trading range.<p>Since the 8 week bull micro channel on the weekly chart is a sign of strong bulls, the bulls might try to show today that they are still willing to buy. Day traders know that today might rally and the week could close back above last week’s low of 2975.75.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-buy-climax-and-then-bear-trend-reversal.png\"><img src=\"2019-8-2.png\" alt=\"Emini buy climax and then bear trend reversal\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><img loading=\"lazy\" src=\"2019-8-2-1.png\" alt=\"EURUSD Forex head and shoulders top and wedge bottom\"></figure><p>The EURUSD daily Forex chart broke to a new 52-week low in a yearlong bear channel. The selloff is also from a head and shoulders top. The minimum goal for the bears is a test of the 1.0950 measured move down and the 1.10 Big Round Number.<p>Yesterday was a disappointing day for the bears. It was the follow-through day after Wednesday’s big bear breakout. But it had a bull body and closed near its high. It is therefore a buy signal bar.<p>This makes traders wonder if the breakout will fail, like every other bear breakout over the past year. The bears need the next few days to stall and become a bear flag. They then need some bear bars. Without that, the breakout will fail.<p>The bulls see yesterday as a sign that the breakout is failing. It is a buy signal bar for the bulls. They have a wedge bottom over the past month and an expanding triangle bottom since April.<p>But they need a strong reversal up. Most prior reversals up over the past year came from either a micro double bottom or a double bottom. Consequently, if the bulls do not get a strong reversal up today or Monday, they will then likely need a test of yesterday’s low before they can begin a swing up. Their target is the start of the wedge a the July 11/July 19 double top.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute chart rallied 45 pips overnight. By breaking above yesterday’s high, the bulls triggered a buy signal on the daily chart.<p>But the bull body so far is small on the daily chart. If the bulls can get a strong trend today, traders will conclude that the bear breakout will fail.<p>However, the 5 minute chart had a buy climax 5 hours ago. It has been in a 20 pip range since then. It is hovering around yesterday’s high and just above today’s open. This is trading range price action and it makes a trading range likely today.<p>At a minimum, the bulls will buy selloffs and try to get today to close above the open. That would create a bull body on the daily chart. They would like today to close above yesterday’s high and on the high of the day. They know that a big bull trend today is now unlikely.<p>The bears hope that the rally from yesterday’s low is simply a pullback in a bear trend on the daily chart. If they can get today to close near its low, today would be a credible Low 1 bear flag sell signal bar on the daily chart.<p>The 2 day reversal up is strong enough to lower the probability for the bears. That means traders are now uncertain. Confusion usually results in a trading range for at least a day or two.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-bull-trend-reversal-after-sell-climax.png\"><img loading=\"lazy\" src=\"2019-8-2-2.png\" alt=\"Emini bull trend reversal after sell climax\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini sold off again today but reversed up at the June 26 low. That was the bottom of the wedge bull channel and a target for the bears after the wedge top. The Emini then entered a trading range.<p>I have been saying for 3 weeks that 2900 was a reasonable target. It is close enough to have the Emini within its gravitational pull. It will probably be tested next week. Because the selling has been extreme, the bears will begin to take some profits. This should create at least a 1 – 2 day bounce next week.<p>This week formed a surprisingly big bear bar on the weekly chart. Traders will expect at least a small leg sideways to down after the 1st 3 – 5 day bounce. Since the selling has been exceptional, it might continue down to the June low below 2750 before the bulls return.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-8-2"
    }
  ],
  "3": [
    {
      "data": [
        "<article class=\"post-91943 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini strong minor reversal after July Fed interest rate cut\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini strong minor reversal after July Fed interest rate cut</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-08-03T00:30:16-07:00\">August 3, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Market Overview: Weekend Market Update</h2><p>The<strong>Emini</strong>had its 1st pullback on the weekly chart in 8 weeks. The selloff will probably last at least a couple more weeks and end between 2800 and 2900.<p>The 30 year<strong>Treasury Bond Futures</strong>market is continuing up from the October low. The rally is a test of the July 2016 nested wedge top. There will probably be a reversal down starting within 6 months and lasting at least 10 years.<p>The<strong>EURUSD</strong>daily Forex chart broke strongly below its 5 month trading range. If there is no follow-through selling next week, this breakout will end up like all of the others over the past year. Traders will begin to look for a 3 week rally back into the 5 month range.<h2><strong>30 Year Treasury Bond Futures market:</strong><br>Strong rally testing July 2016 nested wedge top</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/30-year-treasury-bond-monthly-chart-with-nested-wedge-tops-1.png\"><img loading=\"lazy\" src=\"2019-8-3.png\" alt=\"30 year treasury bond monthly chart with nested wedge tops\"></a></figure><p>The 30 year Treasury Bond futures monthly chart has rallied strongly since the October low. The September 2017 high was the right shoulder of a head and shoulders top. Once May broke above that high, the top failed. May might now be a measuring gap. A measured move up from the October 9 low to the March high is 165 14/32.<p>Why is that important? Because the July 11, 2016 all-time high is 165 8/32. A measured move would be at a new all-time high.<p>Why does that matter? The monthly chart had nested wedge tops on July 11, 2016. There were several levels of nesting over the prior 9 years, and that increases the probability that it is a major top. Major trends in the bond market last 10 – 30 years. If this rally reaches its target, then the top will have failed.<h3>What happens if the 2016 nested wedge top fails?</h3><p>It is important to realize that trend reversals often fail, but then succeed after a 2nd attempt. The theoretical stop for the bears is 1 tick above that July 2016 high.<p>When a rally breaks above an obvious stop level, my general rule is that there is a 50% chance of a swing up. There is also a 50% chance of a failed breakout and a 2nd reversal down. I adjust the odds based on context.<p>Since the nested wedge top is so reliable, a breakout above it may only have a 40% chance of a strong move up from there. Consequently, if the bulls get their new high, traders will again look for another attempt at a major reversal down. That would be a higher high major trend reversal.<p>A major reversal down can also come from below the prior high. It would then be a lower high major trend reversal. While the 10 month rally is strong, traders will be looking for a major top within the next 6 months.<h2><strong>EURUSD daily Forex chart:</strong><br>Strong bear breakout but weak follow-through</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/EURUSD-Forex-expanding-triangle-and-wedge-bottoms.png\"><img loading=\"lazy\" src=\"2019-8-3-1.png\" alt=\"EURUSD Forex expanding triangle and wedge bottoms\"></a></figure><p>After Wednesday’s FOMC announcement, the EURUSD daily Forex chart broke strongly below the 5 month trading range. The bears wanted strong follow-through selling on Thursday. Instead, Thursday was a bull doji reversal day and Friday was a small bull trend day. That is a sign that the bear trend is not nearly as strong as it could have been had Thursday been a big bear bar closing on its low.<p>It is a reminder that the yearlong pattern of reversals up from new lows might still be intact. Traders will now look for a reversal back up over the next week. If the bulls can rally back above Wednesday’s high, traders will begin to believe that the bear breakout was just another leg in the yearlong bear channel.<p>The bears need big bear bars within the next week. They want a measured move down from the June/July head and shoulders top bear flag. That target is 1.0950. Furthermore, they are hoping that Wednesday’s break below the 5 month trading range will result in a measured move down to 1.0802.<p>But unless they get their strong follow-through selling over the next week, the bears will begin to take profits and the bulls will buy, expecting a 2 – 3 week, 200 – 300 pip bull leg in the bear channel. A rally from here would create an expanding triangle bottom with the April 26 and May 23 lows. In addition, there is a month-long wedge bottom. The first target would be the July 11/July 19 double top, which was the start of the wedge.<h2><strong>Monthly S&amp;P500 Emini futures chart:</strong><br>Expanding triangle top, but minor reversal down</h2><figure class=\"wp-block-image\"><img loading=\"lazy\" src=\"2019-8-3-2.png\" alt=\"Emini monthly chart expanding triangle top\"></figure><p>The monthly S&amp;P500 Emini futures chart&nbsp;broke above consecutive outside bars in July. That is a buy signal with a 60% chance of 3 months of sideways to up trading.<p>The bears see July as the 3rd leg up in a 19 month expanding triangle top. In addition, they hope that the breakout above the September/May double top is failing.<p>July was a small bar on the weekly chart. Because it closed below its midpoint, it is a sell signal bar for August. When Thursday, August 1, traded below the July low, it triggered the monthly sell signal.<p>But a small bear doji is a weak sell signal bar. Also, the context favors sideways to up trading into at least September. Consequently, there will probably be more buyers than sellers not too far below the July low.<p>What happens if August grows into a huge bear trend bar closing on its low? That would make a trend reversal more likely than simply a pullback in a bull trend.<p>What if August is a small bear bar and September trades below the August low? Unless either August or September is a big bear bar, the odds will still favor a new high within a few months.<h2><strong>Weekly S&amp;P500 Emini futures chart:</strong><br>Expanding triangle top</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-weekly-candlestick-chart-has-expanding-triangle-top.png\"><img loading=\"lazy\" src=\"2019-8-3-3.png\" alt=\"Emini weekly candlestick chart has expanding triangle top\"></a></figure><p>After 8 weeks in a bull micro channel, the weekly S&amp;P500 Emini futures chart finally traded below the low of the prior week. That is a pullback and it ends the micro channel.<p>Eight weeks without a pullback is unsustainable. It it therefore a buy climax. Buy climaxes eventually attract profit-takers. This week’s big selloff was a sign that the bulls were finally taking some profits.<p>Eight weeks without a pullback is also a sign of strong bulls. Traders therefore expect the bulls to buy again soon.<p>Compare this 8 week bull micro channel with the one that began at Christmas. That one lasted 10 weeks and the pullback was only a single bar.<p>Will the Emini do the same this time? Probably not. There was a big bear bar 2 weeks ago and 2 small dojis a few weeks earlier. The current rally is not nearly as strong as the one from Christmas. Traders should therefore expect a deeper pullback and one that lasts longer.<p>The 8 week rally is strong enough to make a bear trend a low probability bet. But a 2 – 3 week pullback at a minimum is more likely than one that ends after only one week. The pullback might last longer. However, the bull trend is strong enough so that a bull flag or trading range is still more likely than a bear trend. This is true even if this pullback tests all of the day down to the June 2732.75 low.<h3>When will the bulls buy?</h3><p>The bulls will probably take control somewhere above the June low. Both legs up this year were strong enough to make at least one more leg up likely. If there is then a reversal down from a new high, there would be a wedge top in addition to an expanding triangle top. If the rally turns down from a lower high, there would be a head and shoulders top, which is a lower high major trend reversal. In either case, the bears would have a better chance of a deeper and more prolonged selloff at that point.<p>It is important to remember that the Emini has been in a trading range for 19 months. Markets have inertia and resist change. There is no credible evidence that there will be a successful breakout from the range any time soon.<h2><strong>Daily S&amp;P500 Emini futures chart:</strong><br>Bear Surprise Bars so at least 2 legs down likely</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-daily-candlestick-chart-has-strong-reversal-down-from-wedge-top.png\"><img loading=\"lazy\" src=\"2019-8-3-4.png\" alt=\"Emini daily candlestick chart has strong reversal down from wedge top\"></a></figure><p>The daily S&amp;P500 Emini futures chart had surprisingly big bear bars on Wednesday and Thursday. Bear Surprises Bars trap bulls in and bears out. Both are hoping for a bounce. The bulls who are trapped into a bad long want to get out with a smaller loss. The bears who missed the short want a rally that will allow them to enter with less risk.<p>When both the bulls and bears are looking for a rally to sell, there will typically be at least a small 2nd leg sideways to down. That is the minimum objective. Sometimes the 2nd leg is just sideways. Sometimes there are many legs down. Since the weekly chart will probably pull back for at least 2 – 3 weeks, the daily chart should have at least 2 legs down.<h3>Wedge tops</h3><p>It is important to remember the consecutive wedge tops on the daily chart. I have been saying for 4 weeks that a wedge rally is a buy climax. A buy climax eventually attracts profit takers.<p>When the bulls take profits, they are not looking to buy again just a few days later. If that were the case, they would not take profits. Instead, they take profits because they are becoming increasingly concerned about a deep pullback or even a trend reversal. They do not want to buy again until they are confident that the selling will not be deep and not last a long time.<p>They want to see if the bears are strong enough to take control. This process usually takes at least a couple weeks. The bulls typically wait for a least a couple legs sideways to down before looking to buy again. They wait longer if the selling is still strong.<h3>When will the pullback end?</h3><p>Because the selloff on the weekly chart will probably last at least a couple more weeks, there is little incentive for the bulls to buy at the moment. Furthermore, the wedge top on the daily chart will probably have at least 2 legs sideways to down.<p>This week’s selloff is still only the 1st leg down. The bears will take some profits soon and the bull scalpers will buy. That will create a 2 – 5 day bounce. Then, the bull scalpers will take profits and the bears will sell again. This will create a lower high and begin a 2nd leg down.<p>What can go wrong with this scenario? Everything. The Emini could crash or quickly reverse back up to a new high. Neither is likely. A selloff down to 2800 – 2900 or lower over the next few weeks is what traders should expect. Then, there will probably be another new high in September or October.<hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-8-3"
    }
  ],
  "5": [
    {
      "data": [
        "<article class=\"post-91938 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini bear surprise bar on weekly chart after July FOMC\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini bear surprise bar on weekly chart after July FOMC</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-08-05T06:20:24-07:00\">August 5, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Monday August 5, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Last week’s bar on the weekly chart was surprisingly big. A Bear Surprise Bar typically has at least a small 2nd leg sideways to down. However, after the 8 week bull micro channel, this reversal down will probably be minor on the weekly chart. A trading range for a month or two is still more likely than a bear trend.<p>I have been saying for 3 weeks that 2900 was a reasonable minimum target. The strength of last week’s selloff increases the chance that the reversal might continue down to the June low before the bulls return.<p>Because the selling has been extreme for 3 days, there will probably be a pause or a bounce for a few days this week. But traders should expect the 1st 30 – 50 point rally to fail. Traders are looking to sell the 1st strong rally.<p>With last week closing near its low, the Emini might gap down on the weekly chart today.<h3>Overnight Emini Globex trading</h3><p>The Emini us down 43 points in the Globex session. It will probably gap down on both the daily and weekly charts.<p>The momentum down on the daily chart is strong, but the Emini is now at the support I have been talking about for several weeks. The bull channel began with the June 12 low of 2879.25.<p>I have been saying that this is a reasonable target after the wedge top. It is also below the 2900 Big Round Number and near a 50% pullback from the 2 month rally. Furthermore, it is around a measured move down from the July 31 low.<p>How much longer can this extreme selling last? The Emini is probably near the end of its 1st leg down on the daily chart. Day traders expect a short-covering rally this week.<p>There is no bottom yet and this sell climax could last longer. But the bears have extreme profits. They will likely begin to buy back some of their shorts today or tomorrow. The short-covering could create a strong bull trend day for a day or two. Traders will sell the rally.<h2>Friday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-bull-trend-reversal-after-sell-climax.png\"><img src=\"2019-8-5.png\" alt=\"Emini bull trend reversal after sell climax\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/EURUSD-Forex-expanding-triangle-and-wedge-bottom.png\"><img loading=\"lazy\" src=\"2019-8-5-1.png\" alt=\"EURUSD Forex expanding triangle and wedge bottom\"></a></figure><p>The EURUSD daily Forex chart is reversing up strongly from both a wedge bottom and an expanding triangle bottom. The breakout below the 5 month trading range is probably failing, like every other new low for the past year. All prior rallies lasted at least 2 – 3 weeks, had at least 2 legs, and continued up for 200 – 300 pips. Traders will expect the same this time.<p>The bears had a double top bear flag in mid-July. They hope this rally reverses down at the July 25 high, which would be another double top bear flag. But the momentum up is strong. The rally will probably test the beginning of the wedge bear channel, which is the mid-July double top at around 1.1280. The bulls will buy the 1st 1 – 3 day selloff, expecting at least one more leg up to the target.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart rallied 70 pips in a tight bull channel over the past 6 hours. When that is the case, traders should only buy. It is impossible for the bears to make much money in a tight bull channel.<p>However, a tight bull channel is a buy climax and the rally is at the July 25 high, which is resistance. The bulls will begin to take some profits, which will result in a 20 – 30 pip pullback within the next few hours. After that, the bear scalpers will begin to trade.<p>But even then, a strong bull trend typically evolves into a trading range or a bull flag, and not a bear trend. Consequently, it will probably be easier to make money as a bull all day.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-bear-channel-and-down-100-points.png\"><img loading=\"lazy\" src=\"2019-8-5-2.png\" alt=\"Emini bear channel and down 100 points\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini gapped down on the daily and weekly charts. It closed down more than 100 points for the 1st time in a year. After every strong rally, it sold off near the EMA. This was a bear channel day.<p>It is now below support on the daily chart at the June 12 low and a 50% pullback. However, the chart is in a free-fall. The bulls need to wait for at least a micro double bottom before buying.<p>Today’s gap might be a measuring gap. It projects down to 2800. There is now a 50% chance that the selloff will test the June low.<p>Because the selloff is strong, traders will sell the 1st 1 – 3 day rally. However, since today was a sell climax, there is a 75% chance of at least a couple hours of sideways to up trading tomorrow that begins by the end of the 2nd hour.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-8-5"
    }
  ],
  "6": [
    {
      "data": [
        "<article class=\"post-92369 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini possible measuring gap so might selloff to June low\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini possible measuring gap so might selloff to June low</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-08-06T06:20:08-07:00\">August 6, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Tuesday August 6, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday gapped down on the daily and weekly charts and sold off from the open. The gap might lead to a measured move down to near the June low.<p>However, yesterday is also at the support of the June 12 low. That was the 1st pullback in the June rally and is a common target for the bears. The market often begins to enter a trading range there.<p>In addition, the selloff is around a 50% pullback of the 2 month rally. Furthermore, it tested the 2800 Big Round Number and fell 100, which is also a Big Round Number. Finally, it reached a measured move down below the July 31 low. The bears will probably cover some of their shorts around here. This could lead to a 1 – 3 day rally.<p>But, the bears will probably sell the 1st rally and most bulls will only buy for a brief short-covering rally. Consequently, they, too, will probably look to sell after a 1 – 3 day bounce.<h3>Overnight Emini Globex trading</h3><p>The Emini sold off to below 2800 overnight and then reversed up 90 points. This means that the bears are starting to take profits. A profit-taking rally was likely to begin either today or tomorrow after 4 huge bear trend days down to a support zone.<p>Because the selloff was so extreme, traders do not see much downside risk today. But the bears will probably sell the first 1 – 3 day rally. Strong reversals in strong bear trends create confusion. The result is usually more trading range trading.<p>Since the daily ranges have been huge, the legs in a trading range initially might be more than 50 points. Also, the bars on the 5 minute chart will probably continue to be big. Therefore, day traders will have swing trades up and down, despite what will likely be the start of a trading range for a few days.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-bear-channel-and-down-100-points.png\"><img src=\"2019-8-6.png\" alt=\"Emini bear channel and down 100 points\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/EURUSD-Forex-short-covering-rally-on-China-tariff-war.png\"><img loading=\"lazy\" src=\"2019-8-6-1.png\" alt=\"EURUSD Forex short covering rally on China tariff war\"></a></figure><p>The EURUSD daily Forex chart rallied 200 pips over the past 4 days after a failed breakout below the 5 month trading range. There was both a month-long wedge bottom and a 4 month expanding triangle bottom. The momentum up is strong enough for traders to expect at least a small 2nd leg up over the next 2 weeks.<p>However, today so far is a big bear reversal day at the top of the 7 week bear channel and at the EMA. The bears want another lower high and then a new low. This rally would then be just another strong bull leg in the yearlong bear channel.<p>But this rally is strong enough so that the bears will probably need a micro double top. Traders will buy the 1st 1 – 5 day selloff.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart rallied 50 pips overnight and then sold off 70 pips. It spend most of the past 6 hours in a trading range around the open of the day. Traders therefore believe that the open is a fair price. Consequently, they think that the 20 pip bear breakout over the past hour might fail.<p>If today gets drawn back up into that trading range, today would then be a doji bar on the daily chart. That would be more neutral than a big bear reversal bar closing on its low.<p>Day traders know that today’s close is important. If today closes near its low, today will be a strong bear reversal bar on the daily chart. It would increases the chance of a deep reversal this week.<p>The bears do not need it to sell off from here. If today closes where it is now, today will be a strong bear bar. Having the day close much lower will not make the bar significantly more bearish. Consequently, there is not much incentive for the bears to sell at the low. They will be satisfied to sell 20 – 30 pip rallies and try to get the day to close near its low.<p>The bulls know that they probably cannot get today to close back near its high. Their goal is simply to weaken the overnight bear trend. All they need to do is have the day to close near the open. They therefore will buy selloffs and take profits around the open.<p>Consequently, despite a big bull trend and then a big bear trend overnight, the remainder of the day will probably be a trading range. Traders will be fighting over the location of the close.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-gap-up-and-selloff-and-then-bull-trend-reversal-day.png\"><img loading=\"lazy\" src=\"2019-8-6-2.png\" alt=\"Emini gap up and selloff and then bull trend reversal day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini sold off for a couple hours after a big gap up. It then rallied from a wedge bottom to a new high of the day. On the daily chart, today is an inside bar and a buy signal bar for tomorrow. If tomorrow gaps up, there will be a 2 day island bottom.<p>But it is important to understand that island tops and bottoms are minor patterns. After such a strong selloff, this short covering rally will probably lead to a minor reversal up for another day or two. Following the collapse and strong reversal up, the Emini will likely begin to form a trading range for several days.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-8-6"
    }
  ],
  "7": [
    {
      "data": [
        "<article class=\"post-92372 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini short covering after August collapse on China tariffs\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini short covering after August collapse on China tariffs</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-08-07T06:20:51-07:00\">August 7, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Wednesday August 7, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>After a 4 day sell climax to below support, the Emini yesterday had a big gap up above Friday’s close. It sold off for a couple hours, but then reversed back up and closed near the high to form a bull bar on the daily chart. It was an inside bar and therefore it is a buy signal bar for today.<p>In addition, an inside bar is also a sell signal bar for a Low 1 bear flag. But the bull body means it is a weak sell signal bar. Traders expect that there will be buyers not far below yesterday’s low.<p>After a 4 day collapse and then a big reversal up, there is confusion. Is the short covering rally a pullback in a bear trend or a resumption of the bull trend? Confusion typically leads to sideways trading, which is likely for the next several days. This is true even with the huge moves down and up.<p>The Emini will probably be mostly sideways for several days. It might even test of the June low before resuming up to the all-time high. The odds still favor a new all-time high within a couple months.<h3>Overnight Emini Globex trading</h3><p>The Emini traded above yesterday’s high on the daily Globex chart overnight, but then reversed down 40 points over the past hour. It is now testing yesterday’s low. Since a trading range for a few days is likely, traders will look for reversals.<p>However, the daily ranges have been big. Even if there is a trading range day, the legs up and down will be big enough for swing trades. Day traders will look for 10 point moves instead of the 4 point moves that they expect during most days.<p>Since yesterday was an inside day, it might be the start of several sideways days. If so, day traders today will look for reversals from around the prior day’s high or low.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-gap-up-and-selloff-and-then-bull-trend-reversal-day.png\"><img src=\"2019-8-7.png\" alt=\"Emini gap up and selloff and then bull trend reversal day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/EURUSD-Forex-strong-short-covering-rally.png\"><img loading=\"lazy\" src=\"2019-8-7-1.png\" alt=\"EURUSD Forex strong short covering rally\"></a></figure><p>The EURUSD daily Forex chart rallied strongly for 4 days back to the middle of its 5 month trading range. The rally reduces the chance of a strong selloff to far below the August low within the next several weeks. Big Down, Big Up creates Big Confusion. When there is confusion, traders look for reversals. The result is a trading range, which is likely over the next week.<p>The rally was strong enough to make a 2nd leg up likely after a 3 – 5 day selloff. Bulls will look to buy a pullback to around the August 1 buy signal bar high and bottom of the April/July trading range or a 50% retracement of the rally.<p>Yesterday was a big doji bar on the daily chart. It represents profit-taking from the bulls. It is also a sign that the bears are beginning to sell again.<p>Since it was a big bar that opened and closed in the middle, it represents balance. Today so far is another doji day. Furthermore, it is within yesterday’s range. It again is a trading range day. The tails at the top and bottom of the bar on the daily chart tell traders that everyone is buying low, selling high, and taking quick profits.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart rallied to below yesterday’s high, sold off to above yesterday’s low, and rallied back to yesterday’s close. The 3 legs are within a 40 pip range. Traders expect that the remainder of the day will probably remain mostly within the overnight range. Day traders will likely scalp around yesterday’s close, which is also around today’s open.<p>Since a 2 – 5 day pullback is likely within a few days, the bears will try to get a bear bar on the daily chart today or tomorrow. While the bulls would prefer a close near the high and a test of the July 19 high, the 4 day rally was climactic. Consequently, a test down is likely first.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-bull-trend-reversal-and-micro-double-bottom.png\"><img loading=\"lazy\" src=\"2019-8-7-2.png\" alt=\"Emini bull trend reversal and micro double bottom\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini reversed up from a test of Monday’s sell climax low. By trading below yesterday’s low and then above its high, the Emini formed an outside up bar today. It is a buy signal bar on the daily chart. The bulls also have a micro double bottom with Monday’s low. In addition, they are trying to create a bull buy signal bar on the weekly chart.<p>While the odds favor higher prices over the next 2 months, the selloff was exceptionally strong. Therefore a trading range for a couple weeks is more likely than an immediate resumption of the bull trend.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-8-7"
    }
  ],
  "8": [
    {
      "data": [
        "<article class=\"post-92375 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini micro double bottom with August 5 sell climax low\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini micro double bottom with August 5 sell climax low</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-08-08T06:20:05-07:00\">August 8, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Thursday August 8, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday reversed up from a test of Monday’s low. Because it had a bull body, it is a buy signal bar for today. It was also an outside up day. The bulls now have a micro double bottom, which is bullish.<p>However, the 4 day sell climax was surprisingly strong. Consequently, the bulls might need a week or more of stopping the selling before there will be a reversal up to a new high. Therefore, traders will look for reversals every few days until the bulls get either a very big bull bar (Surprise Bar) or 3 or more consecutive ordinary bull bars.<p>The bulls are hoping that yesterday will be similar to the December 26 reversal and lead to a Buy The Close rally on the daily chart. It will more likely be like the many reversals up in early 2018 and again in late 2018. They all became legs in a trading range.<h3>The importance of this week’s open</h3><p>The most important price for the rest of the week is 2885.00. That is the open of the week. If the week closes above open, there will be a bull reversal bar on the weekly chart. This week would then be a buy signal bar for next week. Traders will suspect that the correction is over.<p>But if this week has a bear body, it will be a weaker buy signal bar. There might be sellers above.<p>Since the selling has been exceptionally strong, even if the bulls get their buy signal bar, the 1st reversal up will probably be minor. The odds favor a trading range for at least a couple weeks.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 11 points in the Globex session. Today might therefore gap up. But small gaps typically close within the 1st 2 hours.<p>Also, while yesterday was an outside up day, it had a prominent tail on top. That makes it a weaker buy signal bar on the daily chart. Additionally, as I wrote above, a relentless bull trend like the one after Christmas is less likely than a trading range after a sell climax like we had over the past week.<p>Finally, yesterday’s rally on the 5 minute chart was unsustainable and therefore climactic. It will begin to attract profit-takers. Traders should understand that there is only a 25% chance of another relentless bull trend again today. They should expect at least a couple hours of sideways to down trading that starts by the end of the 2nd hour today.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-bull-trend-reversal-and-micro-double-bottom.png\"><img src=\"2019-8-8.png\" alt=\"Emini bull trend reversal and micro double bottom\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/EURUSD-Forex-breakout-above-wedge-bottom-and-expanding-triangle-bottom.png\"><img loading=\"lazy\" src=\"2019-8-8-1.png\" alt=\"EURUSD Forex breakout above wedge bottom and expanding triangle bottom\"></a></figure><p>The EURUSD daily Forex chart formed consecutive doji bars over the past 2 days. Today so far is a 3rd consecutive doji bar and a 2nd consecutive inside day. If today remains within yesterday’s range, there would be an ii Breakout Mode pattern. Traders would see today as both a buy and sell signal bar for tomorrow.<p>Minor legs up and down typically have a pullback within a week. Consequently, the odds are that the daily chart will test down for several days starting within a few days.<p>Less often, a leg will last a couple weeks before there is a pullback. In that case, the pullback will probably begin from around the July 11/July 19 double top. That is the start of the wedge bottom and it is a common target for a rally up from a wedge bottom. The daily chart should get there whether or not there is a pullback 1st.<p>While the daily chart is still in a bear channel, it is a weak trend and more of a trading range. There is no sign that the pattern of 2 – 3 week legs up or down is about to end.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute chart has had a small range so far today. It reversed down from just below yesterday’s high and it is now testing yesterday’s low. Since it has been in a tight range for 3 days, traders expect a breakout either today or tomorrow.<p>The 1st breakout of a Breakout Mode pattern fails 50% of the time. Furthermore, once there is a successful breakout, there is a 50% chance of it being up or down.<p>Since the selloff of the past 5 hours has been in a tight bear channel, day traders are only selling. The bulls are not yet buying. They want to see the chart to begin to go sideways first. That would be a sign that the bears are becoming less eager to sell.<p>The selloff is now just above yesterday’s low. This is a price level where the bulls got reversals up twice in the past 2 days. Traders therefore doubt that the overnight bear trend will last much longer. They expect an evolution into a trading range within the next couple hours. Day traders will then scalp up and down.<p>A strong reversal up or a strong bear breakout are currently much less likely. If either happens, day traders will look for a swing trade.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-small-pullback-bull-trend.png\"><img loading=\"lazy\" src=\"2019-8-8-2.png\" alt=\"Emini small pullback bull trend\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>After failing to close the gap above yesterday’s high, the Emini rallied in an extremely strong Small Pullback Bull Trend today. After going sideways for a couple hours, the bulls got a little trend resumption up into the close. Today formed a good entry bar on the daily chart after yesterday’s micro double bottom.<p>Since today was extremely strong, the rally is unsustainable. It is a buy climax and bulls will begin to take some profits. Traders should expect at least a couple hours of sideways to down trading tomorrow that begins by the end of the 2nd hour.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-8-8"
    }
  ],
  "9": [
    {
      "data": [
        "<article class=\"post-92378 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini strong entry bar above August micro double bottom\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini strong entry bar above August micro double bottom</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-08-09T06:20:14-07:00\">August 9, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Friday August 9, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday was an exceptionally strong Small Pullback Bull Trend day. It reversed up from a one bar selloff on the open that tested Wednesday’s high. The bears could not close the gap above Wednesday’s high. The rally continued up to above last week’s low, closing the gap on the weekly chart.<p>I said over the past few days that the week might close around the open. After yesterday’s strong rally to far above the open, that is now unlikely. The bulls want the week to close near its high so that this week will be a stronger buy signal bar on the weekly chart. At a minimum, they want the week to close above last week’s 2913.50 low. That will therefore be a magnet in the final hour.<p>Because yesterday was extremely strong on the 5 minute chart, the rally is unsustainable. It is therefore a buy climax. Day traders expect at least a couple hours of sideways to down trading to begin by the end of the 2nd hour. There is only a 25% chance of another relentless bull trend today.<p>Will the bull trend on the daily chart resume from Wednesday’s micro double bottom? The selloff was strong enough to probably lead to a trading range 1st for a couple weeks. The daily chart over the next 2 weeks will more likely resemble early and late 2018 than early 2019.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 15 points in the Globex session. After 2 huge days of trending up, the bulls are exhausted. Today therefore will probably not be another big bull trend day. More likely it will have mostly trading range price action.<p>Today is Friday so weekly support and resistance can be important. This is especially true in the final hour. The bulls want the week to close on its high. Also, they would like it to close above last week’s low of 2913.50. At a minimum, they want it to close above the 2885.50 open of the week. That is below yesterday’s low and an unlikely target.<p>The goal for the bears is to have the week be a less strong buy signal bar for next week. They want to put as big a tail on the top of this week’s candlestick as they possibly can.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-small-pullback-bull-trend.png\"><img src=\"2019-8-9.png\" alt=\"Emini small pullback bull trend\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/EURUSD-Forex-triangle.png\"><img loading=\"lazy\" src=\"2019-8-9-1.png\" alt=\"EURUSD Forex triangle\"></a></figure><p>The EURUSD daily Forex chart has been sideways for 4 days and the daily range is shrinking. This is a triangle and it is therefore a Breakout Mode pattern.<p>The bears want the 2 week rally to be a lower high in a yearlong bear channel. But the rally was strong enough to make a 2nd leg up likely. What traders do not yet know is whether the 2nd leg up will be from this triangle or from a break below that reverses up.<p>When there is a Breakout Mode pattern, traders know that the 1st breakout up or down will fail 50% of the time. Furthermore, they know that it is equally likely that the eventual successful breakout will be up or down.<p>Downside support is at the August 1 buy signal bar high and the May low. Resistance is at the July 11/July 19 double top and then the June high.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart so far has a small range today. Its low is above yesterday’s low and its high is below yesterday’s high.<p>Today is currently another inside day. Day traders are continuing to scalp as they wait for a breakout above or below the 4 day range. If a breakout is strong and has follow-through, they will swing trade in the direction of the breakout. If it is brief and reverses, they will swing trade in the opposite direction, betting that the breakout will fail.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-bull-trend-reversal.png\"><img loading=\"lazy\" src=\"2019-8-9-2.png\" alt=\"Emini bull trend reversal\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini sold off on the open to just above the open of the week. It dipped below the 60 minute EMA and the 2900 Big Round Number and reversed up. This week is now a buy signal bar on the weekly chart.<p>However, it is a doji bar on the daily chart, which is neutral. Also, after Big Up in July, and now Big Down and Up in August, there is confusion. That will probably result is a few sideways days next week, despite the good buy signal bar on the weekly chart.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-8-9"
    }
  ],
  "10": [
    {
      "data": [
        "<article class=\"post-92384 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini bear rally after crash down to 2800\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini bear rally after crash down to 2800</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-08-10T00:30:49-07:00\">August 10, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Market Overview: Weekend Market Update</h2><p>The<strong>Emini</strong>reversed up sharply for 2 days after a sell climax down to around 2900. It will probably go sideways for a couple weeks.<p>The weekly<strong>crude oil</strong>futures has a wedge bull flag. But the bear body and many recent dojis make a continuation of the yearlong trading range likely.<p>The<strong>EURUSD</strong>weekly Forex chart reversed up from below its 5 week trading range, but the reversal has been weak. Traders will continue to look for reversals every few weeks.<h2><strong>Crude oil Futures market:</strong><br>Testing bottom of 7 month trading range</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Crude-oil-wedge-bull-flag-in-trading-range-1.png\"><img loading=\"lazy\" src=\"2019-8-10.png\" alt=\"Crude oil wedge bull flag in trading range\"></a></figure><p>Crude oil futures reversed up this week from a breakout below the June low. It now has 2 legs down from the April high.<p>I have written several times that the December to April rally was a Spike and Channel bull trend. There typically is a break below the bull channel and then a test down to the start of the channel. That is the January 14 low on the daily chart (not highlighted on the weekly chart). At that point, the chart usually transitions into a trading range with that 1st pullback in January being the start of the range. Everything that has happened since the December low is consistent with this common pattern.<p>The bears want the leg down from the July 11 lower high to lead to a break below the December low. More likely, the chart will reverse up from somewhere above the bottom of the 7 month trading range. This week might be the start of a leg up.<h3>Crude oil forming wedge bull flag</h3><p>The bulls see the February 11 low on the weekly chart as the 1st leg down in a wedge bull flag. The June low is the 2nd leg down. They are hoping for a reversal up this month. There would then be 3 legs down in a trading range. That is a triangle. Since it is sloped down slightly, it is more precise to call it a wedge. You can call it a wedge bull flag since it might be a pullback in the bull trend that began at Christmas.<p>Since it is forming above the December low, there will probably be a reversal up within a couple weeks. It might have started this week. Traders see the July lower high as the 1st target.<p>Remember, all year I have been saying that crude oil would probably be in a trading range for all of 2019. Traders should expect reversals. They look to buy low, sell high, and take quick profits.<p>Crude oil is now low in the range. Since the July selloff was strong, the daily chart might have to go sideways for a couple weeks before traders believe that the selling has ended. Once they do, they will look to buy a reversal up.<h2><strong>EURUSD weekly Forex chart:</strong><br>Failed breakout below 5 month trading range</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/EURUSD-weekly-Forex-chart-has-weak-buy-signal-bar-and-entry-bar-1.png\"><img loading=\"lazy\" src=\"2019-8-10-1.png\" alt=\"EURUSD weekly Forex chart has weak buy signal bar and entry bar\"></a></figure><p>The EURUSD weekly Forex chart reversed up strongly this week after a break below the 5 month trading range. That break was a reminder that the yearlong bear channel is still intact. The bulls need a strong breakout above the June high to make traders believe that the bear trend has finally ended. Without that, traders will continue to look for a reversal after every 2 – 3 week leg up or down.<p>This week’s reversal up on the daily chart (not shown) was strong enough to make a 2nd leg up likely. A reversal down from here will probably only last about a week before the bulls will buy again.<h3>Reversal up from Spike and Channel Bear Trend</h3><p>The selloff from the June high on the daily chart (not shown) formed a Spike and Channel Bear Trend. Traders see the July 11/July 19 double top as the start of the wedge bear channel. When a Spike and Channel Bear Trend reverses up, traders expect a test of the start of the channel. That means they will buy the 1st reversal down and look for a rally to around 1.1280.<p>If the current leg up continues to 1.1280 without more than a day or two pullback, traders will expect the 1st pullback to lead to a test of the next resistance. That is the June high of 1.1413.<p>Can this week’s high be a lower high that reverses down to below the August low? The momentum up this week makes it likely that bulls will buy the 1st 3 – 5 day reversal down. Consequently, a higher low and then a 2nd leg up is a more likely outcome.<h2><strong>Monthly S&amp;P500 Emini futures chart:</strong><br>Minor reversal down from expanding triangle top</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-monthly-chart-has-weak-reversal-down-from-expanding-triangle-top.png\"><img loading=\"lazy\" src=\"2019-8-10-2.png\" alt=\"Emini monthly chart has weak reversal down from expanding triangle top\"></a></figure><p>The monthly S&amp;P500 Emini futures chart&nbsp;has a big range in August. There is currently a bear body, but a big tail below. August is not particular bearish at the moment on the monthly chart.<p>As strong as the selloff has been on the daily chart, it is still more likely to be a pullback in a bull trend than the start of a bear trend on the monthly chart. This is because July triggered an oo buy signal (consecutive outside months). May was an outside down month and June was an outside up month. Once July went above the June high, it triggered the buy signal.<p>I have been saying throughout July that there is a 60% chance of 3 months of sideways to up trading. I chose my words carefully. Sometimes the Emini will go sideways instead of up. With the August selloff as strong as it has been, the 3 months will probably not be strongly up.<p>What happens after September? The effect of the oo buy signal wanes and traders begin to look for the next pattern.<h3>Expanding triangle top will probably lead to minor reversal</h3><p>I have also written many times about the expanding triangle top on the weekly and monthly charts. That is a major trend reversal pattern. Like all major patterns, there is only a 40% chance of an actual major reversal from a bull trend into a bear trend. The majority of major tops and bottoms go mostly sideways. Traders then look for the next pattern to buy or sell.<p>There is still a 60% chance of a break below the December low within 3 years. But there is not much risk of that happening until at least after a test of the all-time high, and probably not for many more months.<h2><strong>Weekly S&amp;P500 Emini futures chart:</strong><br>Buy signal bar for higher low in bull channel</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-weekly-candlestick-chart-has-pullback-from-expanding-triangle-top.png\"><img loading=\"lazy\" src=\"2019-8-10-3.png\" alt=\"Emini weekly candlestick chart has pullback from expanding triangle top\"></a></figure><p>The weekly S&amp;P500 Emini futures chart gapped down this week but reversed up strongly from far above the June low. It closed the big gap down and it is now a buy signal bar for next week.<p>But the tail on its top and the strong 2 week selloff weaken the buy setup. I said all through July that there would be at least a 2 – 3 week selloff. The size of the selloff makes 3 or more weeks of sideways trading likely.<h3>Limit order, scale-in bears</h3><p>In the 1st week of June, the Emini reversed up strongly with an outside up bar. The last week of May was a big bear bar closing on its low. It was reasonable for traders and algorithms to sell with a limit order at the top of that bear bar because it was a low probability buy signal bar.<p>In a situation like that, experienced traders know that some bears will sell more (scale-in bears) as the Emini goes higher. They are confident that if they do something reasonable, there is an 80% chance of avoiding a loss or making a profit. This type of scaling in often requires a wide stop. Traders expect an eventual pullback to below the top of the bear bar where they began to short.<p>This is what happened this week. The selloff to below the top of that May bear bar allowed the bears to buy back their 1st shorts at breakeven. They made a profit on their higher shorts. Remember, the bears are<em>buying</em>the selloff down to the top of that bear bar.<p>What do the bulls do? They buy as well. They know that the Emini rallied in early June once it broke above that bear bar’s high. Traders are betting that there will again be buyers at that price. If many bulls and bears buy at the top of that big bear bar, you get a week like this past week.<h3>Probably sideways to up for a few weeks</h3><p>Will this week be the end of the selloff? The Big Up in July has been followed by Big Down in August, and now by Big Up again. That typically creates Big Confusion. The surprisingly strong bears on the daily chart (see below) make traders wonder if the bears will sell again back around the September/May double top at 2960.<p>Bear surprises typically have at least a small 2nd leg sideways to down. Therefore, if this week is a rally in a developing trading range for the next few weeks, traders should expect it to fail around where the Emini sold off in September and again in May.<p>As strong as this week has been, there is currently only a 50% chance that the Emini will go straight up to a new high without at least a small 2nd leg sideways to down within the next couple weeks.<h2><strong>Daily S&amp;P500 Emini futures chart:</strong><br>Strong rally from micro double bottom might be end of pullback</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-daily-candlestick-chart-has-reversal-up-after-sell-climax.png\"><img loading=\"lazy\" src=\"2019-8-10-4.png\" alt=\"Emini daily candlestick chart has reversal up after sell climax\"></a></figure><p>The daily S&amp;P500 Emini futures chart had a strong bull breakout in early June. A bull breakout is a Spike. Once there was a pullback, the breakout phase ended and a bull channel began. That happened on June 12.<p>A bull channel has a 75% chance of a bear breakout and then a transition into a trading range. I talked about this many times over the past month. This is how the Market Cycle typically behaves. That is why I said throughout July that a selloff was likely. A strong trend (breakout) weakens and becomes a channel. The chart then transitions into a trading range. At that point, the process starts over. Traders look for the next breakout up or down.<p>The bottom of the trading range is usually around the bottom of the 1st pullback. This week fell below that June 12 low and reversed up.<p>Wednesday formed a micro double bottom with Monday’s low. The reversal up this week was strong enough to make traders wonder if the selloff was just a brief, sharp pullback in the strong bull trend that began in December.<h3>What do the bulls need?</h3><p>A small double bottom after an extremely strong selloff is usually not enough of a foundation to support a bull trend. There typically will be at least one more leg sideways to down. If the bounce is weak, the 2nd leg down can fall far below the 1st. Also, there is often a 3rd leg down to a wedge bottom. That would be a Spike and Channel Bear Trend.<p>However, this week’s reversal up was as unusually strong as was the 2 week selloff. It makes it likely that the low is in or that there will be buyers not far below this week’s low. But there is only a 50% chance that this rally will go straight up to a new high.<p>Next week will be important. If the Emini hesitates for a few days, it will probably test back down and retrace about 50% of the reversal up. There was a 2 week sell climax and then a sharp reversal up this week. But this week was a buy climax and therefore there is a 50% chance of a test back down within a couple weeks.<hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-8-10"
    }
  ],
  "12": [
    {
      "data": [
        "<article class=\"post-92381 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini weekly buy signal bar after August sell climax\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weekly buy signal bar after August sell climax</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-08-12T06:20:22-07:00\">August 12, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Monday August 12, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>On the weekly chart, last week was a bull bar and a possible end of a 2 week pullback. It is a buy signal bar for this week. The weekly chart is in a bull trend and the 2 week selloff formed a higher low.<p>This week will probably go above last week’s high at some point and trigger the buy signal. However, since early July, I have been saying that the minimum selloff would be 2 – 3 weeks. This 2 week selloff was exceptionally strong. Consequently, the weekly chart will probably be mostly sideways for another week or two. In addition, last week’s low might not be the bottom of the pullback. This is despite the weekly buy signal bar.<p>Friday was a bear doji bar on the daily chart. The Emini is in the middle of the 2 week selloff. A doji is neutral. There will probably be buyers not far below its low and sellers not far above its high. Traders will be cautious this week after Big Up in July, and Big Down and Up in August. The Emini will probably be mostly sideways for at least a few days.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 18 points in the Globex session. It will probably gap down below Friday’s close. Furthermore, it might even gap below Friday’s low, the 60 minute EMA, and the 2900 Big Round Number. Those support levels will be magnets today.<p>Traders are deciding if last week’s low is the end of the selloff. While the odds favor at least another couple weeks of sideways to down trading before the bull trend resumes, there is currently only about a 50% chance of a break below last week’s low.<p>A big gap below Friday’s close will confuse traders. This is consistent with what I have been saying. The bulls will be disappointed, just as the bears were disappointed by the 2 big bull days last week. Disappointment makes traders unwilling to hold onto positions. This typically results in a trading range. A trading range on the daily chart usually has a lot of trading range price action on the 5 minute chart.<p>But, the daily ranges have been big. Consequently, the legs up and down will likely allow day traders to continue to swing trade up and down for 2 or more hours at a time.<h2>Friday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-bull-trend-reversal.png\"><img src=\"2019-8-12.png\" alt=\"Emini bull trend reversal\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/EURUSD-Forex-bull-flag-or-bull-trap.png\"><img loading=\"lazy\" src=\"2019-8-12-1.png\" alt=\"EURUSD Forex bull flag or bull trap\"></a></figure><p>Today is the 5th day in a tight trading range on the EURUSD daily Forex chart. This is a Breakout Mode pattern. That means that there is about a 50% chance of a successful bull breakout or a bear breakout. Traders see it as either a triangle bull flag or a triangle top in a bear rally in a bear channel.<p>When there is a Breakout Mode pattern, traders expect the 1st breakout up or down to fail. Furthermore, until there is a clear breakout, there is no breakout.<h3>Overnight EURUSD Forex trading</h3><p>Today broke below the 4 day range but reversed up and it is forming a 5th day in the tight range. This is a failed bear breakout and it increases the chance of a successful bull breakout tomorrow or Wednesday’s.<p>The bulls are hoping that today will close near its high. Today might even be an outside up day (break above Friday’s high after breaking below its low). If today closes near its high, today will increase the chance of a successful bull breakout tomorrow.<p>If it instead closes near its low, traders will conclude that the daily chart will begin to test down to the August 1 high.<p>The overnight 40 pip reversal up from below Friday’s low was mostly in a tight bull channel. That means that the rest of the day will probably be sideways to up.<p>However, the rally pulled back an hour ago. In addition, it is now getting close to the Friday’s high. Today is the 4th consecutive day with slightly lower highs. The bears are hoping to stop the rally and convert the day into a trading range. At the moment, it is unlikely that they will get more than a 30 pip reversal down today.<p>Because the rally is at the resistance of the top of the 5 day range, it will likely not go much higher today. With limited upside and downside, the 5 minute chart will probably begin to enter a 30 pip trading range.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/ES-5-minute-Chart-Bear-Channel.png\"><img loading=\"lazy\" src=\"2019-8-12-2.png\" alt=\"\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini fell below Friday’s low and triggered a sell signal on the daily chart today. However, Friday was a bear doji and therefore a weak sell signal bar. Also, the context is bad for the bears. Last week had 2 big bull bars.<p>While today sold off in a broad bear channel, the selloff held above last week’s low. It is still more likely that the 2 day pullback is a pullback from last week’s strong reversal up. But it is also likely that the Emini will be mostly sideways for the next couple of weeks after Big Up in July, and Big Down and Up and now Down in August.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-8-12"
    }
  ],
  "13": [
    {
      "data": [
        "<article class=\"post-92619 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini testing neckline of August micro double bottom\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini testing neckline of August micro double bottom</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-08-13T06:20:39-07:00\">August 13, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Tuesday August 13, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday traded below Friday’s low and therefore triggered a sell signal on the daily chart. The bears saw last week as a 4 day bear flag.<p>Since Friday was a bear doji, it was a weak sell signal bar. Also, after 2 big bull bars, the context is bad as well for the bears. There will likely be more buyers than sellers below Friday’s low either today or tomorrow.<p>The 2 week selloff in early August was surprisingly big. That makes at least a couple more weeks of sideways to down trading likely. The Emini is deciding whether last week ended the 2 week selloff. It might take several more days until that is clear.<p>Confusion usually results in a trading range. The Emini will probably be mostly sideways for a couple weeks. This is true even it it tests above last week’s high or below last week’s low and 2800.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 8 points in the Globex session. There might be a small gap down opening. But small gaps typically close in the 1st hour. Also, even though the Emini has sold off for 2 days and yesterday was a bear Surprise Day on the daily chart, the odds are that there will be a test back up starting at some point this week.<p>Because the daily chart is probably forming a trading range, day traders will look for reversals every few days. Furthermore, day traders know that a trading range on the daily chart increases the amount of trading range price action on the 5 minute chart. As a result, traders will expect at least one reversal every day.<p>While yesterday reversed up in the final hour, the rally followed a 6 hour tight bear channel. It was therefore likely to be minor. But it was strong enough so that a reversal up this morning would have a 40% chance of being major.<p>A major reversal in a bear trend means a conversion into a bull trend. Consequently, day traders will look for a reversal up from around yesterday’s low.<p>But is important to understand that 60% of major trend reversal<em>setups</em>lead to small profits or losses and not bull trends. Therefore, the odds still favor trading range price action again today.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-broad-bear-channel.png\"><img src=\"2019-8-13.png\" alt=\"Emini broad bear channel\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/EURUSD-Forex-bull-flag-in-breakout-mode.png\"><img loading=\"lazy\" src=\"2019-8-13-1.png\" alt=\"EURUSD Forex bull flag in breakout mode\"></a></figure><p>The EURUSD daily Forex chart broke below the 4 day bull flag yesterday, but reversed up. Today so far is an inside day after yesterday being an outside up day. An ioi pattern is a Breakout Mode pattern, but it changes nothing since the chart is already in Breakout Mode.<p>The bulls want a bull breakout and a test of the July 11/July 19 double top. The bears want the 2 week rally to be a bear rally in the yearlong bear channel.<p>Since the reversal up in early August was strong, the odds favor at least a small 2nd leg up to the July double top. However, a tight trading range can last a long time. Traders will continue to sell near the top and buy near the bottom of the now 6 day range until there is a clear breakout.<p>It is important to note that the daily chart has been in a trading range for 5 months. Consequently, the breakout of the 6 day tight trading range will probably not get far before reversing.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart reversed up overnight from above yesterday’s low and the bottom of the 6 day tight trading range. It is now stalling just below yesterday’s high and the top of the range.<p>Because the 6 day range followed a rally, it is slightly more likely to be a bull flag than a top. But until there is a breakout, there is no breakout. Day traders will continue to buy low, sell high, and scalp until there is a clear breakout. Six days in a tight range is extreme. Day traders expect a breakout up or down this week.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-huge-bull-surprise-breakout-on-open-then-exhaustion-and-trading-range.png\"><img loading=\"lazy\" src=\"2019-8-13-2.png\" alt=\"Emini huge bull surprise breakout on open then exhaustion and trading range\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini had an unusually strong rally on the open. When one is that extreme, the day usually then enters a trading range, which happened today. That early rally was a Bull Major Surprise and it may give the chart a bullish bias for several days. But the bulls might be exhausted from such extreme buying. If so, the Emini might go sideways to down for a couple days before trying for a 2nd leg up.<p>Today also triggered the weekly buy signal by going above last week’s high. However, it pulled back and went sideways. The Emini will probably test last week’s high again tomorrow or Thursday.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-8-13"
    }
  ],
  "14": [
    {
      "data": [
        "<article class=\"post-92622 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini triggered weekly buy signal but within August trading range\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini triggered weekly buy signal but within August trading range</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-08-14T06:20:25-07:00\">August 14, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Wednesday August 14, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>I have been saying since Friday that this week would go above last week’s high to trigger the weekly buy signal. But I also said that there probably would be sellers above last week’s high and that the Emini is probably beginning to form a trading range that will last at least a couple weeks more. Yesterday triggered the buy signal but did not close far above last week’s high. That hesitation is consistent with what I have been saying.<p>Something important happened yesterday on the 5 minute chart. That rally on the open was so unusually strong that it would normally have a 60% chance of follow-through buying over the next several days. However, context is important. It was also a test of last week’s high, and a trading range is likely for at least a couple weeks. Therefore, there is a 50% chance that it will turn out to be a bull trap and it will form a double top with last week’s high.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 43 points in the Globex session. It therefore is reversing most of yesterday’s rally. But because the daily chart is in a trading range, this selloff might simply be a test of Monday’s low and a deep pullback from yesterday’s rally. The bears hope that it is the start of a reversal down from a double top with last week’s high.<p>Both possibilities are equally likely. The location at the bottom of the 5 day range is good for the bulls, but the likely big gap down today from yesterday’s close is good for the bears.<p>Day traders will be ready for anything today. There might be a break below Monday’s low and a trend down, or a reversal up after a test of Monday’s low. Finally, since the Emini has been sideways for 5 days and yesterday spent most of the day in a trading range, today could be another trading range day.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-huge-bull-surprise-breakout-on-open-then-exhaustion-and-trading-range.png\"><img src=\"2019-8-14.png\" alt=\"Emini huge bull surprise breakout on open then exhaustion and trading range\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/EURUSD-Forex-bull-flag-in-bear-channell.png\"><img loading=\"lazy\" src=\"2019-8-14-1.png\" alt=\"EURUSD Forex bull flag in bear channell\"></a></figure><p>The EURUSD daily Forex chart has been in a tight trading range for 7 days. That is a Breakout Mode pattern. The bears see the rally to August 6 as a lower high in a yearlong bear channel. They want a reversal down to a new low.<p>However, traders know that the rally was strong enough to have at least a small 2nd leg up. What they do not know is if there will be a breakout above this tight trading range and then a 2nd leg up, or a test back down to the May low before a 2nd leg up begins.<p>Until there is a breakout, there is no breakout. Traders will continue to buy near the bottom of the 7 day range and sell near the top until there is a breakout. Traders know that when a market is in Breakout Mode, there is a 50% chance of either a bull or bear breakout. Furthermore, there is a 50% chance that the 1st breakout up or down will fail.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 25 pip range at the bottom of the 7 day tight trading range. Even though yesterday was a big bear day on the daily chart, it did not break strongly below the bottom of the range. Consequently, there has been no follow-through selling today. Day traders overnight have been willing to buy near the tight trading range low. The bears are selling rallies, but are not selling at the low. Instead, they have been scalping out of their shorts.<p>Because today’s range is unusually small, it will probably increase. Since the chart is at the bottom of the tight trading range, there is a slightly greater chance of the range expanding to the upside.<p>However, there is no sign that the trading range behavior of the past 7 days is about to end. Day traders have been scalping as they wait for a breakout up or down.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-bear-trend-from-the-open.png\"><img loading=\"lazy\" src=\"2019-8-14-2.png\" alt=\"Emini bear trend from the open\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini sold off strongly on today’s inversion of the 2/10 yield curve. The interest rate on the 10 year note fell below that of the 2 year note. This is the 1st time in about 10 years. An inverted yield curve typically leads to a recession. However, that recession usually begins about 18 months later. In fact, the market is up an average of 12% a year after the inversion.<p>After a huge selloff today, the Emini reversed up from consecutive wedge bottoms. While the day closed on the low, it was mostly sideways for the final 4 hours.<p>Yesterday was a big bull day, but today opened near yesterday’s low and sold off. That is a strong bull trap and it increases the chance of lower prices. This week might become outside down and the bears might get their test below 2800.<p>I have been saying for the past 2 weeks that the Emini will be sideways for possibly several more weeks. That is still the case. It might have to test below 2800 before there is a bottom. That is a Big Round Number. The Globex market tested below it last week. That increases the odds that the day session will as well within a week or so.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-8-14"
    }
  ],
  "15": [
    {
      "data": [
        "<article class=\"post-92625 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini selloff on inverted yield curve\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini selloff on inverted yield curve</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-08-15T06:20:36-07:00\">August 15, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Thursday August 15, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday was a strong bear trend day, and there was very little overlap with Tuesday, which was a strong bull day. This is a bull trap and it increases the chance of lower prices.<p>However, these big reversals up and down on the daily chart create confusion. That will probably result in the Emini continuing in a trading range for at least a couple more weeks.<p>I wrote over the weekend that last week was a weak buy setup on the weekly chart. I said that there would probably be more sellers than buyers above its high. And there were. This week might even go outside down.<p>I mentioned last week that the Globex Emini traded below 2800 but that the day session did not. That is a Big Round Number and a magnet. I said that these factors increase the odds that the day session would have to trade below 2800 as well.<p>Was yesterday the start of that test? Well, nothing is clear in a trading range. The only thing that traders believe is likely is that every strong move up or down will soon reverse and not lead to a trend. Bottoms and tops typically are not clear.<p>What will happen today? The bull trap on the daily chart and the magnetism of last week’s low and 2800 makes at least slightly lower prices likely within a few days. But day traders have to be ready for anything when the daily chart is in a trading range. After yesterday’s sell climax, there will probably be at least a couple hours of trading range price action. Since there are now 2 legs down from last week’s high, today could even be a bull trend day.<h3>Is inverted yield curve a buy signal?</h3><p>Yesterday was the 1st time in 10 years when the interest rate on the 10 year note was less than that on the 2 year note. This is an inverted yield curve. That is important because an inverted yield curve typically leads to a recession.<p>But that recession usually begins 1 – 2 years later. In fact, once the yield curve inverts, the stock market is up an average of 12% one year later. Therefore, one could argue that it is a buy signal for the next year.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 11 points in the Globex session. Since yesterday was a sell climax day, there is a 75% chance of at least 2 hours of sideways to up trading that starts by the end of the 2nd hour today.<p>Traders know that the daily chart is in a trading range. They expect bad follow-through after strong trend days up and down. Yesterday closed on its low and had very little overlap with Tuesday. Tuesday was a big bull day. That type of bull trap typically has follow-through selling for at least a few days.<p>But context is important. The daily chart is in a trading range. Traders expect reversals and not trends. That reduces the chance of a follow-through bear trend day today. Day traders will be ready for anything today. However, they are confident of at least a couple hours of sideways to up trading at some point.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-bear-trend-from-the-open.png\"><img src=\"2019-8-15.png\" alt=\"Emini bear trend from the open\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/EURUSD-Forex-minor-breakout-below-bull-flag.png\"><img loading=\"lazy\" src=\"2019-8-15-1.png\" alt=\"EURUSD Forex minor breakout below bull flag\"></a></figure><p>The EURUSD daily Forex chart has two consecutive bear bears days, which typically means that there will be at least a small 2nd leg down. But the rally to the August 6 high was strong and it was a surprisingly strong reversal up from a breakout below the 5 month trading range. That makes a 2nd leg sideways to up likely.<p>I have been writing over the past week that the bears might get a test of the May low at the bottom of the 5 month range before the bulls test the July 11/July 19 double top. That is what is likely at the moment.<p>The bears want the August rally to be just a bear leg in the yearlong bear channel. They need several more bear days before the probability shifts in their favor.<p>After 2 big bear days, the bulls will likely need at least a micro double bottom before they can begin a 2nd leg up from the August low. Also, the May low was the bottom of the trading range for 4 months. It is therefore an important price. This selloff might have to get closer to that 1.1108 low before the bulls will aggressively buy again.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 25 pip range overnight. It so far is within yesterday’s range. However, traders expect at least a little follow-through selling after 2 big bear trend days. It might come today. A third consecutive big bear trend day is unlikely since the daily chart is near the bottom of its trading range.<p>Consecutive big trend days often lead to exhaustion. Therefore, today might remain small and day traders might continue their overnight scalping. Can today be a big bull trend day? That is unlikely after a breakout with 2 big bear days.<p>With day traders knowing that a big trend day up or down is unlikely, they expect to scalp all day today.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-reversed-up-from-above-last-week-low-preventing-outside-down-bar.png\"><img loading=\"lazy\" src=\"2019-8-15-2.png\" alt=\"Emini reversed up from above last week low preventing outside down bar\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini was in a trading range for most of the day. The bears got a parabolic wedge selloff that began around 10:30, but it was a sell vacuum test of last week’s low (not shown).<p>I have been saying that the week might go outside down. However, there is often a sharp reversal up from just above the low of the prior bar.<p>This is true for any higher time frame. Today was an example of it. The selloff was simply a sell vacuum test of last week’s low. Once traders concluded that the bears would fail to break below last week’s low, the bears bought back their shorts and the bulls went long.<p>Tomorrow is Friday so weekly support and resistance can be important. The bulls want a close above the open of the week to put a bull body on this week’s candlestick on the weekly chart. The open of the week might be too far above to reach tomorrow. Instead, the bulls will try to get the week to close above its midpoint.<p>The Emini is still near last week’s low. Consequently, the bears might try again tomorrow to create an outside down week on the weekly chart. Whether or not they succeed, the Emini will probably continue in a trading range for at least a couple more weeks.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-8-15"
    }
  ],
  "16": [
    {
      "data": [
        "<article class=\"post-92628 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini reversing up after almost forming outside down week\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini reversing up after almost forming outside down week</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-08-16T06:20:41-07:00\">August 16, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Friday August 16, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini was in a trading range for the 1st half of yesterday. The bears got a strong breakout below the double bottom, but the selloff reversed up from just above last week’s low. The bulls hope that the reversal up continues throughout the day today.<p>Remember that earlier this week the Emini went above last week’s high. I have been saying that it might trade below last week’s low. That would create an outside down bar on the weekly chart.<p>Whenever a selloff is about to go outside down, there is often a sharp reversal up from just above the low of the prior bar. This is true on any timeframe. Yesterday reversed up strongly from just above last week’s low. The bulls now want a double bottom on the daily chart with last week’s low.<p>With the overnight reversal up, the Emini will probably not form an outside down bar on the weekly chart. However, the open of the week is likely too far above for the bulls to get a close above the open. Their alternate goal is to have the week close above its midpoint.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 25 points in the Globex session. Traders therefore expect a gap up. The Emini might also gap above the 60 minute EMA.<p>Yesterday was a bull reversal day on the daily chart. There is now a double bottom with last week’s low. But since yesterday was only a bear doji bar on the daily chart, it is a weak buy signal bar. That is a weak foundation upon which to build a rally that would be strong enough to undo this week’s selling. Traders expect any bounce over the next few days to be just another leg in the 2 week trading range.<p>Today will open far above last week’s low. The bears will likely give up their goal of creating an outside down week on the weekly chart. That loss on an incentive to sell reduces the chance of a big bear day.<p>The most significant thing that the bulls could do today is to get the week to close above its open. But that is likely too far up. Therefore, there is also a lack of incentive for the bulls as well.<p>With no compelling reason for a strong trend up or down, if there is a trend today, it will probably not be strong. But the daily ranges have been big. As a result, even if today is mostly sideways, day traders will be able to swing trade.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-reversed-up-from-above-last-week-low-preventing-outside-down-bar.png\"><img src=\"2019-8-16.png\" alt=\"Emini reversed up from above last week low preventing outside down bar\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/EURUSD-Forex-lower-high-double-top-after-bull-trap.png\"><img loading=\"lazy\" src=\"2019-8-16-1.png\" alt=\"EURUSD Forex lower high double top after bull trap\"></a></figure><p>The EURUSD daily Forex chart has 4 big bear bars after a failed breakout above a bull flag. Traders now believe that the August rally was a bull trap. It formed a lower high double top with the July 19 high.<p>This selloff is strong enough so that traders will sell the 1st minor reversal up. Consequently, the bulls will probably need at least a micro double bottom before they can begin a leg up.<p>The chart has been in a weak bear channel for a year. Every strong leg up and down reversed after a few weeks. Traders will therefore look for a reversal up from around the August low. The reversal can come from either a higher low or after a break below the low.<p>Eventually the pattern of reversals will end. But there is only a 25% chance of a successful strong bear breakout below a bear channel. What typically happens is that the channel transitions into a trading range. At the moment, there is no sign that the bear channel is about to end.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has sold off 40 pips overnight. It has been in a weak bear channel for 4 hours. While the rallies are currently too small for the bulls to make money, the bear channel will probably transition into a trading range within a couple hours. At that point, bulls scalpers will begin to buy reversals up.<p>Since there is a bear channel, the bears will continue to sell. But the legs down are not big. Consequently, the bears are now looking to sell rallies for scalps and they are taking profits around the prior low.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-bull-trend-from-the-open.png\"><img loading=\"lazy\" src=\"2019-8-16-2.png\" alt=\"Emini bull trend from the open\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini gapped above yesterday’s high and the 60 minute EMA. Today was a Bull Trend From The Open. However, the Emini went sideways around Wednesday’s high for the final 5 hours.<p>This week was a doji bar on the weekly chart. That is a weak entry bar after last week’s buy signal bar. Traders should expect sideways to down trading for at least a couple more weeks. The Emini will probably have to fall below 2800 before the bull trend will resume.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-8-16"
    }
  ],
  "17": [
    {
      "data": [
        "<article class=\"post-92634 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini August pullback to below 2800 and maybe 2730\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini August pullback to below 2800 and maybe 2730</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-08-17T00:30:30-07:00\">August 17, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Market Overview: Weekend Market Update</h2><p>The<strong>Emini</strong>has been sideways for a couple of weeks, but it will probably fall below 2800 before the bulls will buy again. It might test the June low, which is the bottom of a 5 month trading range.<p>The 30 year treasury<strong>bond futures</strong>are in a strong breakout to a new all-time high. The bulls will probably soon begin to take some profits, which will lead to at least a 2 week pullback.<p><strong>Bitcoin</strong>is trying to hold above 10,000, but there is a 50% chance that it will fully retrace the June/July buy climax and test 7500.<h2><strong>30 year Treasury Bond Futures market:</strong><br>Parabolic wedge buy climax but no top yet</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Bond-futures-breakout-above-nested-wedge-top.png\"><img loading=\"lazy\" src=\"2019-8-17.png\" alt=\"Bond futures breakout above nested wedge top\"></a></figure><p>The 30 year Treasury Bond futures market rallied to a new all-time high this week. There was a nested wedge top from 2008 to 2016 on the monthly chart. That was a reliable trend reversal pattern.<p>When there is a credible top, there is a 40% chance of one more new high and then a 2nd top. If the bears get their 2nd top, it would have a higher probability of leading to a trend reversal on the monthly chart.<p>Trends on the monthly bond chart last 20 – 30 years. Therefore, if there is a reversal down, interest rates will work higher until around 2040.<h3>No sign of a top, despite buy climax</h3><p>It is important to accept that there is currently no top on the monthly chart. The rally is very strong. A strong rally typically does not instantly reverse into a bear trend.<p>Traders usually have to see the rally stop for a few months before the bears can get a reversal. The topping process might take 10 – 20 bars, which means 1 – 2 years. Therefore the downside risk near-term is small. Traders will buy the 1st reversal down.<p>The daily chart is in a parabolic wedge buy climax. It is testing the 2016 all-time high. The bulls who bought at that high can now exit breakeven. Many will.<p>Also, a huge buy climax will attract profit takers. The bulls have huge profits and soon will only want to buy pullbacks instead of that market. Their protective stop is far below. Soon, many will begin to take profits to reduce the risk of watching their windfall profits evaporate.<p>Their profit taking will probably result in 2 – 3 weeks of sideways to down trading. They will want to see if the bears can get a reversal down. If they cannot, the bulls will then buy again.<h3>Negative interest rates</h3><p>Many major countries now have negative interest rates. If you pay $100 for one of their bonds or notes, you to not have to pay them interest.<p>For example, if you buy a 10 year German bund (their equivalent of a US treasury note) with a face value of $100, you might have to pay $105. It will pay no interest. At the end of 10 years, Germany will give you $100 to buy back the bund. Your money will be tied up for 10 years and you will lose $5. You effectively lost about 5%, which is why the bund is said to have a negative interest rate.<p>Why would anyone buy a bund and lose 5% over 10 years? Why not just put the money in a safe deposit box? An obvious point is that safe deposit boxes get robbed and banks go out of business. No one wants to put a substantial part of their net worth in something that has any risk. The 10 year bund is safer.<h3>A perfect trade?</h3><p>Well, why doesn’t Germany sell a trillion dollars in bunds, pay no interest, and take the money and buy US Treasuries that might pay 1.7%? Isn’t that a perfect carry trade? Perfect trades cannot exist.<p>If you think a trade is perfect, you are missing something. What is missing? Forex and interest rate fluctuation.<p>If Germany buys a trillion dollars in US treasuries, they have to convert Euros to dollars when the buy and then dollars to Euros when they sell. What happens if the dollar falls 20% against the Euro over the next 10 years? Germany would have collected 1.7% for 10 years, or 17%, but they would lose 20% 10 years from now in the currency exchange.<p>Alternatively, what happens if the US treasury note futures market has a huge reversal down over the next 10 years? Remember, it is probably going to form a top withing the next couple years. Germany will be locked into a 1.7% return at a time when interest rates might be 5% or more in 5 – 10 years. That is a bad investment.<p>If they need more money to run their government 5 years from now, they will have to pay 5% interest to sell their bunds. But they will only be collecting 1.7% on the trillion dollars they used to by treasuries. They would be losing 3.3%, or $33 billion dollars a year on their investment.<h2><strong>Bitcoin cash index:</strong><br>Tight trading range at 50% pullback from 2018 crash</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Bitcoin-trading-range-after-parabolic-wedge-buy-climax.png\"><img loading=\"lazy\" src=\"2019-8-17-1.png\" alt=\"Bitcoin trading range after parabolic wedge buy climax\"></a></figure><p>Bitcoin has rallied strongly from the December low. But it has been in a tight trading range for 8 weeks at a 50% retracement of the 2018 crash. The bars on the weekly chart (not show) have been big and most have prominent tails. Also, there have been many reversals. There is no sign of an impending breakout up or down.<p>Because of the 8 month rally, TV only interviews the bulls. The least bullish expect a test of the 20,000 all-time high. The most bullish talk about a rally to 200,000 within two years.<p>Since Bitcoin is a market, it behaves like all other markets. Trading is ruled by logic and self-interest. There are enough buyers and sellers to create reliable patterns. Since Bitcoin is unregulated and there are still some big thieves out there, the swings can be big. But its chart looks no different from that of any other market.<h3>8 week tight trading range so Breakout Mode</h3><p>Because of the tight trading range and big reversals, it is now in a limit order market. It is in Breakout Mode. Traders are buying 1 – 2 week selloffs and selling out on 1 – 2 week rallies. The bulls are trying to trying to hold it above 10,000. They see the 2 week selloff as a pullback from a breakout above a 6 week triangle on the daily chart.<p>However, there are many emotional bulls who are too eager to buy. Look at all the failed rally attempts in 2018. Those were all bull traps. CNBC kept putting on confident, professorial, purportedly rich bitcoin bulls who kept claiming that the bear trend ended. The audience believed that they guys made a fortune by truly understanding Bitcoin. If they say that Bitcoin was about to resume up, you have to trust them.<p>Bad idea. Profitable traders only trust themselves, not idiots on TV. The weak bulls kept buying and repeatedly got trapped by the absence of strong bulls willing to buy higher.<p>The same is true now. Traders should expect a lack of follow-through buying. In addition, it is better if traders trade small, use wide stops, and have the ability to scale in lower. That will give them the best chance of trading Bitcoin profitably.<h3>Will 10,000 hold?</h3><p>Will important psychological 10,000 Big Round Number hold? I suspect not. This week’s reversal up from below 10,000 is more likely just the start of another leg in the 8 week trading range than a resumption of the bull trend.<p>The parabolic rally in 2019 had 3 legs up. The first ended with the April 3 high and the 2nd ended with the May 30 high.<p>You can see that the 3rd leg up from the June 4 low was huge. A huge rally typically results in exhausted bulls. They take profits and then are not be too eager to buy again. There often has to be a bear breakout below the bottom of the final leg up before the bulls will believe that the pullback has ended. Consequently, anyone buying now has a better chance of making money trading small and using a wide stop. That June 4 low of 7442 is an important magnet below.<h3>How low can Bitcoin go?</h3><p>While the bulls are hoping that the pullback ended with this week’s test of 10,000, there is better than a 50% chance of a retracement of the entire 3rd leg up. That means a test of the June 4 of 7442. If 10,000 does not hold, that is the next target. At the moment, traders should expect it to get tested within a few months.<p>When there is a reversal down from a parabolic wedge, the bulls typically want to see a test of the bottom of the 1st or 2nd pullback. The 2nd pullback was the May 16 low of 6334. That was also a test of a gap above the May 10 high. That is the next support.<p>Finally, a much less likely target is the bottom of the 1st pullback in the wedge bull channel. That is the April 25 low of 4986.<p>Since Bitcoin has been sideways for 8 weeks, it might have another leg up before breaking below 10,000 and testing 7442. But unless the bulls beak far above the June high, Bitcoin will probably have to go lower to find buyers.<h2><strong>Monthly S&amp;P500 Emini futures chart:</strong><br>Expanding triangle top, but only minor reversal likely</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-monthly-candlestick-chart-has-minor-reversal-down-from-expanding-triangle-top-1.png\"><img loading=\"lazy\" src=\"2019-8-17-2.png\" alt=\"Emini monthly candlestick chart has minor reversal down from expanding triangle top\"></a></figure><p>The monthly S&amp;P500 Emini futures chart&nbsp;so far has a big bear bar in August. I have been writing for several months that the weekly and monthly charts were likely to form an expanding triangle top. However, after the July broke above consecutive outside bars in May and June, there was only a 40% chance of a major trend reversal into a bear trend.<p>As strong as the August selloff has been, it is still only a one month pullback in a strong bull trend. Traders should expect that the pullback to end within a month or two. The Emini will then likely make a new high before there is a trend reversal into a bear trend.<p>What happens if the bears can create two or three big bear bars closing on their lows? The odds would then shift in favor of a test of the December low. At the moment, they only have a 30% chance of achieving their goal before there is a new high.<h3>What about the inverted yield curve?</h3><p>This week was the 1st time in 12 years when the interest rate of the 2 year treasury note was higher than that of the 10 year note. A note is a loan that you make to the government. A note for 10 years has 10 years of risk and uncertainty. You would expect that the government would have to pay more interest to entice buyers into taking that increased risk.<p>Why would investors be willing to earn so little when locking their money up for such a long time? It is because they have compared the 10 year note to other investments, like stocks and real estate, and decided that the low rate with the high security is their best choice. They clearly are not optimistic about the future. They are afraid that other investments will lose money.<h3>An inverted yield curve is a buy signal!</h3><p>An inverted yield curve is a reliable predictor of a recession. There have been 9 instances of a 2/10 year yield curve inversion since World War 2, and 7 led to a recession. Depending on how one defines a recession, some say that all 9 led to a recession.<p>But there is another statistic that usually gets overlooked. A yield curve inversion is a buy signal! Stocks rallied 15% on average 18 months after the inversion. The average time before a recession is 22 months (range of 5 – 34 months). Therefore, traders have a window when they can make money.<p>What happens once the recession hits? Not good. At 36 months after the inversion, the stock market is up only 2% from the time of the inversion.<p>It is reasonable to assume at this point that this inversion is similar to the others. If so, traders should expect a 15% rally over the next 18 months. But they should also expect the stock market to lose most of those gains over the next 18 months and be up only 2% from today’s level.<p>The yield curve inverted yesterday and the S&amp;P cash index closed the day at 2841. That means that in August 2022, the S&amp;P might only be at 2898, even though it could rally to 3267 in February 2021.<h2><strong>Weekly S&amp;P500 Emini futures chart:</strong><br>Failed buy signal, as expected</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-weekly-candlestick-chart-has-weak-entry-bar-after-High-1-bull-flag.png\"><img loading=\"lazy\" src=\"2019-8-17-3.png\" alt=\"Emini weekly candlestick chart has weak entry bar after High 1 bull flag\"></a></figure><p>The weekly S&amp;P500 Emini futures chart has been in a trading range from 2750 to 2930 for 5 months. That range is in the top half of 20 month trading range from 2350 to 2930. There is no sign of an impending breakout.<p>There was a big bull reversal bar 2 weeks ago. It was a High 1 buy flag and a buy signal bar for this week. Since it was a good looking buy signal bar in a bull trend, I said that the Emini would probably go above its high this week to trigger the buy signal. And it did.<p>However, I also said that there would probably be more sellers than buyers above its high. Why would traders sell above a good looking buy signal bar? Because it was not as good as it looked. Context, which means the bars to the left, is important.<h3>Bad buy setup despite good looking buy signal bar</h3><p>I pointed out that it followed a huge bear bar and a buy climax. After that bear bar and the buy climax, the odds were that the weekly chart would be sideways to down for at least a couple more weeks. That meant that the buy signal would fail.<p>In addition, the bar had a prominent tail on top. That further lowered the probability for the bulls.<p>Also, it was a big bar. If a trader bought above its high and put a stop below its low, he would have a big risk. Since a lower high was likely, the reward was small.<p>It was a buy signal bar with bad risk/reward and low probability for stop entry bulls buying above its high. Since there is nothing in it for the bulls, there would probably be more bears selling with limit orders at the top of the buy signal bar. And there were.<p>While this week was the entry bar, it was a doji and therefore weak. The weekly chart will probably trade sideways to down for at least another couple weeks.<h2><strong>Daily S&amp;P500 Emini futures chart:</strong><br>Double top with double bottom means trading range</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-daily-candlestick-chart-has-weak-buy-signal-after-double-bottom.png\"><img loading=\"lazy\" src=\"2019-8-17-4.png\" alt=\"Emini daily candlestick chart has weak buy signal after double bottom\"></a></figure><p>The daily S&amp;P500 Emini futures chart formed a micro double bottom on August 5th and 7th. Thursday’s low was a test of last week’s low and there is now a double bottom. There is also a micro double top just below the EMA. When a chart has both credible buy and sell signals, it is in a trading range.<p>The Big Up in June and July and now the Big Down in August has created Big Confusion. When there is confusion, traders bet against sustained moves up or down.<p>Traders are uncertain of the direction of the breakout. They expect reversals instead of a trend up or down. Traders buy strong selloffs, sell strong rallies, and take quick profits, betting against sustained moves. This creates a trading range.<p>The June/July rally was a typical Spike and Channel pattern, which I have discussed often. During the July bull channel, I said many times that there would be a break below the bull channel, a test of the June 12 start of the bull channel, and then a trading range. The market is behaving as was likely, although the bars and legs have been bigger than what was likely.<p>Traders are now deciding if the 2 week selloff is a 50% pullback from the June/July rally or the start of a trend down to below the June low.<p>Both outcomes can happen. The selloff is strong enough so that traders should expect it to continue down to at least a little below the August 5 low and 2800. But it might not be strong enough to fall below the June low of 2732.75.<p>Over the next week, traders will continue to look for reversals every few days. But the odds favor a test below 2800 within a couple weeks.<hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-8-17"
    }
  ],
  "19": [
    {
      "data": [
        "<article class=\"post-92631 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini weak buy signal after yield curve inversion\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weak buy signal after yield curve inversion</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-08-19T06:20:51-07:00\">August 19, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Monday August 19, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini triggered a double bottom buy signal on Friday. However, the buy signal bar was a small bear doji. That is an unreliable setup. Furthermore, it followed a huge selloff on the day before and the Emini has been in a trading range for 2 weeks. Traders are therefore not looking for a big reversal up. More likely, the rally will end this week and the 3 week trading range will continue.<p>Even though the Emini has been sideways, the August selloff was surprisingly strong. Traders should expect a test below 2800 within a few weeks. This is true even if this rally tests to just below the all-time high.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 31 points in the Globex session. Last Tuesday, there was a huge rally on the 5 minute chart on the open. A Bull Major Surprise like that usually affects the market for many days and sometimes weeks.<p>The selloff from that rally was deep and the Emini fell far below the low of that day. However, a selloff from a Bull Major Surprise typically results in a trading range and not a bear trend. The 2 day rally is now a bull leg in that trading range. At a minimum, it should test last Tuesday’s high.<p>Is the rally a resumption of the June/July bull trend? Probably not. The August selloff was a Bear Major Surprise on the daily chart. The odds still favor at least a brief selloff to below the August low.<p>However, there is room to last week’s double top at around 2950. That is a magnet above. There is therefore an increased chance of rally today or tomorrow up to that resistance.<p>Whenever there is an increased chance of a bull trend day, there is also an increased chance of the opposite. If there is an early strong selloff, day traders will be ready to swing trade their shorts.<h2>Friday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-bull-trend-from-the-open.png\"><img src=\"2019-8-19.png\" alt=\"Emini bull trend from the open\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/EURUSD-Forex-test-of-bottom-of-trading-range.png\"><img loading=\"lazy\" src=\"2019-8-19-1.png\" alt=\"EURUSD Forex test of bottom of trading range\"></a></figure><p>The EURUSD daily Forex chart sold off for 4 days but is pausing at the bottom of the 5 month trading range. Trading ranges resist breaking out. Consequently, there are probably more buyers than sellers around the August low. This is true even if there is a new low.<p>A rally from here would be a higher low major trend reversal. A major reversal setup generally has a 40% chance of leading to a new trend.<p>The probability is less in this case. There have been many major reversal attempts and attempts at bear breakouts over the past year. All have failed. Every strong selloff and rally reversed within a few weeks. As a result, traders will continue to expect reversals until there is a clear, strong breakout up or down.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart rallied 30 pips from Friday’s close, but pulled back after breaking above Friday’s high. The 1st reversal up after 4 bear days is likely to fail. Day traders will expect 2 – 3 sideways days rather than a resumption of the early August rally.<p>The 5 minute chart has been in a 20 pip range for the past 5 hours. That is so tight that it is difficult even for scalpers to make money. Day traders are scalping. Since the EURUSD Forex market is near the bottom of its 5 month range, the odds are that the next swing trade will be up.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-trading-range-day-closed-at-open-for-doji-day.png\"><img loading=\"lazy\" src=\"2019-8-19-2.png\" alt=\"Emini trading range day closed at open for doji day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>After a big gap up, the Emini sold off for about an hour. While it rallied for several hours, it reversed down from a nested wedge top. It closed exactly at the open and today form a small doji bar on the daily chart. The Emini is just below last week’s double to around 2950. A 2nd leg down to below 2800 is more likely than a new all-time high.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-8-19"
    }
  ],
  "20": [
    {
      "data": [
        "<article class=\"post-92838 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini bear rally testing resistance around 2950\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini bear rally testing resistance around 2950</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-08-20T06:20:14-07:00\">August 20, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Tuesday August 20, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini gapped up and rallied for the 1st half of the day. But there was a lot of trading range price action and the day closed exactly at the open. This formed a perfect doji bar on the daily chart and a sign of neutrality.<p>The Emini is near the top of a 2 week trading range. Also, the August selloff was strong enough to have at least a small 2nd leg down. Consequently, this rally will probably test below 2800 before making a new all-time high. It is therefore a bear rally.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 3 points in the Globex session. While the momentum up over the past 3 days has been good, the Emini is near the top of its 2 week trading range and at the resistance of the 20 day EMA. Furthermore, yesterday was neutral. The bulls are losing momentum. Finally, this rally is probably only a bull leg in a developing 3 week range and not a resumption of the June/July bull trend.<p>Traders will begin to look for sell setups within a week or so. However, trading ranges often break through support and resistance before reversing. As a result, the rally might have to go above last week’s high before the bears take control again.<p>The momentum up favors the bulls, but the location favors the bears. This creates uncertainty and it will likely result in more sideways trading today and possibly for several days.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-trading-range-day-closed-at-open-for-doji-day.png\"><img src=\"2019-8-20.png\" alt=\"Emini trading range day closed at open for doji day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/EURUSD-Forex-low-1-bear-flag-and-higher-low-major-trend-reversal.png\"><img loading=\"lazy\" src=\"2019-8-20-1.png\" alt=\"EURUSD Forex low 1 bear flag and higher low major trend reversal\"></a></figure><p>Friday was the 4th consecutive bears bar on the EURUSD daily Forex chart. Yesterday’s low was above Friday’s low. It was a pullback in a bear trend and therefore a Low 1 sell signal bar. Today fell below yesterday’s low, which triggered the sell signal and made today the entry bar.<p>While the bears want the 2 week bear trend to continue to far below the August low, every selloff and rally over the past year reversed within a few weeks. Consequently, the bulls will probably soon buy and create a 2 – 3 week rally. This is true even if the bears get a brief break below the August low first.<p>If the bears do not get a big bear bar today, they will be disappointed by yesterday’s bear flag. Many will start to buy back their shorts. Today will then form a micro double bottom with Friday’s low.<p>If today closes above the open, it will form a bull bar on the daily chart. A micro double bottom with a bull bar is a buy setup. Today would then be a buy signal bar for tomorrow. The bears might begin to buy back shorts and the bulls will begin to buy.<p>After 4 big bear bars, the daily chart might have to go sideways for several days before the bulls can take control. They typically have so stop the selling for a few days before enough buyers will come in to create a rally.<h3>Overnight EURUSD Forex trading</h3><p>Today traded below yesterday’s low and therefore triggered a Low 1 sell signal on the daily chart. However, it did not fall far below and it is now back above yesterday’s low. There so far is no enthusiasm on the part of the bears. They are unwilling to sell at the low. This means they now prefer to sell pullbacks than at the market, which is a sign that the selloff is losing momentum.<p>The overnight range has only been 20 pips. There is no energy up or down. Day traders are selling rallies and buying selloffs.<p>The bulls want today to close above its open so that today will be a buy signal on the daily chart for tomorrow. However, the bears want today to close below the open and below yesterday’s low. Furthermore, they want the day’s range to grow and for today to close on the low. That would increase the chance of lower prices tomorrow.<p>At the moment, that is unlikely. Instead, the daily chart will probably go sideways for a few days. Day traders therefore expect to scalp all day today, buying low and selling high.<p>Since the selloff on the daily chart is losing momentum and is now at the bottom of the 5 month range, a big bear day is unlikely. The bulls are forming a micro double bottom, but 3 sideways days in a tight range make a big bull day unlikely as well.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><img loading=\"lazy\" src=\"2019-8-20-2.png\" alt=\"Emini opening reversal up and down\"></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini fell below yesterday’s low, testing the gap above Friday’s high. After an early rally, the Emini entered a bear channel. It closed near the low of the day. It did not close the gap above Friday’s high.<p>After a 3 day rally, this 2 day selloff will probably be a bear leg in the 3 week trading range rather than a resumption of the August bear trend. The bears need more and bigger days before traders believe that the bear trend has resumed. However, the odds still favor a move below 2800 before a new all-time high.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-8-20"
    }
  ],
  "21": [
    {
      "data": [
        "<article class=\"post-92841 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini testing 2900 below and August double top above\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini testing 2900 below and August double top above</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-08-21T06:20:33-07:00\">August 21, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Wednesday August 21, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini sold off in a bear channel yesterday, but were unable to close the gap above Friday’s high. The selloff is more likely a pullback from last week’s rally than a resumption of the August bear trend.<p>For the bears, last week’s rally was a double top pullback. However, the rally was strong enough so that at least one more test up is likely within a week.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 22 points in the Globex session. It will therefore gap above yesterday’s bear channel. But it is still below the top of the 3 week trading range.<p>A bear channel is a bull flag. Traders expect a bull breakout and then a transition into a trading range. Consequently, while the Emini will gap up above the channel, a trading range is more likely than a strong bull trend from the open.<p>The FOMC minutes come out at 11 am PST today. Since the last meeting was unusually important, its minutes are extra important as well. Day traders should exit positions ahead of the announcement and then wait 10 minutes before resuming their trading. This is because there is usually a big move that reverses in the 1st couple minutes after any FOMC announcement. Trends usually do not start to become clear until after about 10 minutes.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-opening-reversal-up-and-down.png\"><img src=\"2019-8-21.png\" alt=\"Emini opening reversal up and down\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/EURUSD-Forex-bear-flag-and-sell-climax.png\"><img loading=\"lazy\" src=\"2019-8-21-1.png\" alt=\"EURUSD Forex bear flag and sell climax\"></a></figure><p>The EURUSD daily Forex chart sold off sharply last week to the bottom of its 5 month trading range. With yesterday’s reversal up, the bulls now have a micro double bottom. A rally from here would be a higher low major trend reversal.<p>But every leg up and down has reversed over the past year within a few weeks. As a result, every major reversal pattern only led to minor moves. There is no reason to believe that this pattern is about to change.<p>After 5 bear bars, the bulls will probably need more sideways bars before they can begin a leg up. Also, there is room to the August low. Many bulls will want one more brief move down to test that low and then a reversal up from there before concluding that the selloff has ended.<p>After 5 bear days, the bears believe that the 4 day tight trading range is a bear flag. Monday’s Low 1 bear flag failed. But if today’s low remains above yesterday’s low, today will be a sell signal bar for a Low 2 bear flag.<p>The bears know that every new low for the past year reversed up. However, there is still room to the August low for the bears to make 100 pips profit. They therefore would like to trigger a bear flag short signal some time this week.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a very tight range overnight. Yesterday is a buy signal bar on the daily chart. Today went 1 pip above yesterday’s high, triggered the buy signal, and then pulled back.<p>The overnight range is only 20 pips. There is no energy and day traders are scalping. They might be waiting for today’s FOMC minutes to be released at 11 am PST before they will be willing to hold onto positions for a swing trade.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-trading-range-day-after-FOMC-minutes.png\"><img loading=\"lazy\" src=\"2019-8-21-2.png\" alt=\"Emini trading range day after FOMC minutes\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini gapped up but then traded in a tight range up to when the FOMC minutes were released at 11 am PST. There were a couple brief legs down, but the Emini closed near the high. This increases the chance of higher prices tomorrow.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-8-21"
    }
  ],
  "22": [
    {
      "data": [
        "<article class=\"post-92844 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini has room to top of August trading range\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini has room to top of August trading range</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-08-22T06:20:41-07:00\">August 22, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Thursday August 22, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>With yesterday’s close at the high of the day, there is an increased chance of at least slightly higher prices today in the Emini. However, the Emini is now near the top of its 3 week trading range. Most trading range breakouts fail. Disappointing follow-through after big moves up and down is common. Even if the bulls get a break above last week’s high, there would still be a 50% chance of a test below 2800 before there is a new high.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 3 points in the Globex session. With yesterday’s late rally, the bulls want follow-through buying today. However, the Emini is near the top of its 3 week range and yesterday was a trading range day. This reduces chance of a big bull day today.<p>The bears have a micro double top on the daily chart. But yesterday’s bull body make it a weak sell signal bar. This reduces the chance of a big bear day.<p>Traders are deciding whether the Emini will resume its yearlong bull trend or get a 2nd leg down after the August selloff. There is no evidence yet that the Emini is about to have a big move either way. Today will more likely be either a weak trend day up or down or another trading range day.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-trading-range-day-after-FOMC-minutes.png\"><img src=\"2019-8-22.png\" alt=\"Emini trading range day after FOMC minutes\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/EURUSD-Forex-bear-flag-and-higher-low-major-trend-reversal.png\"><img loading=\"lazy\" src=\"2019-8-22-1.png\" alt=\"EURUSD Forex bear flag and higher low  major trend reversal\"></a></figure><p>The EURUSD daily Forex chart had a micro double bottom over the past few days. When today traded above Tuesday’s high, it triggered the buy signal.<p>Yesterday was a bear day on the daily chart and the 2nd sell signal bar in 3 days. It was therefore a Low 2 bear flag sell setup. When today went below yesterday’s low, today triggered the sell signal. Since it also went above yesterday’s high, today is now an outside day.<p>Today triggered both a minor buy signal and a minor sell signal. But the range is small and it is the 5th day in a tight trading range. Traders are deciding if the 2 week selloff will lead to a new low or a higher low. The odds are 50% for each possibility.<p>However, since every new low over the past year reversed up for a few weeks, traders will look for a reversal up within the next couple weeks from either a higher low or from below the August low.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart rallied to above yesterday’s high and then reversed down to below yesterday’s low. It quickly revered back up to the middle third of the overnight range.<p>The selloff was in a tight bear channel. Today will probably not get back above the overnight high. While the bears want a trend down from the 25 pip bounce over the past hour, tight trading ranges resist breaking out. Consequently, the bears will probably not get a big move down from here. Traders are expecting a continuation of the 5 day tight trading range.<p>If there is going to be a trend today, down is more likely than up after the selloff from above yesterday’s high to below its low.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-outside-down-day-and-then-outside-up-day.png\"><img loading=\"lazy\" src=\"2019-8-22-2.png\" alt=\"Emini outside down day and then outside up day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini had a climactic selloff on the open. It reversed down from above yesterday’s high, but it then reversed up from below yesterday’s low. That strong a selloff in a trading range typically is exhaustive. Traders expected and got a reversal up. The rally went briefly back up to yesterday’s high. Today closed in the middle of the day’s range and near the open of the week.<p>Today was just a big doji bar on the daily chart. It therefore does not have much bearing on tomorrow.<p>Tomorrow is Friday and therefore weekly support and resistance might be important in the final hour. The weekly candlestick currently also is a doji bar. The bears want the week to close below the open so that there will be a bear body on the weekly chart. The bulls want a close above last week’s high.<p>After 4 sideways days, tomorrow will also probably have a lot of trading range price action. If so, the week would remain as a doji bar on the weekly chart.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-8-22"
    }
  ],
  "23": [
    {
      "data": [
        "<article class=\"post-92847 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini outside up bar at top of 3 week range\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini outside up bar at top of 3 week range</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-08-23T06:20:45-07:00\">August 23, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Friday August 23, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday was an outside day and a doji day on the daily chart, which is neutral. The Emini is at the top of a 3 week trading range. But the momentum up on the daily chart is strong enough so that the rally might go at least a little above the trading range.<p>If the bulls get consecutive big bull bars closing near their highs, the rally will probably continue up to a new all-time high. If not, traders should expect a 2nd leg down to below the August low and 2800.<p>Today is Friday so weekly support and resistance can be important, especially in the final hour. The nearby targets are last week’s high, low, and open of the week. Even if the week forms a doji bar on the weekly chart, traders will fight over whether there will be a small bull or bear body.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 12 points in the Globex session. Most of that loss came in the past hour. The Emini has been struggling to hold above 2900. Traders know that the Emini is at the top of a 3 week trading range and it is therefore in the sell zone. If the bulls continue to fail to break above last week’s high, traders will look for a selloff to the bottom of the range and below 2800.<p>Yesterday’s early selloff was strong enough for traders to expect at least a small 2nd leg sideways to down. Today will probably open around yesterday’s low. That would achieve the minimum goal.<p>The bears hope that yesterday was a spike in what will become a Spike and Channel bear trend over the next week. That means they see yesterday’s selloff as the 1st of at least 3 legs down.<p>But the bulls hope that today’s gap down will simply be a test of yesterday’s low. They will try for an early reversal up from a double bottom.<p>If today closes around 2900 or below, this will with be a Low 1 bear flag sell signal bar on the weekly chart. That is what the bears hope to achieve today.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-outside-down-day-and-then-outside-up-day.png\"><img src=\"2019-8-23.png\" alt=\"Emini outside down day and then outside up day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/EURUSD-Forex-weak-breakout-below-bear-flag.png\"><img loading=\"lazy\" src=\"2019-8-23-1.png\" alt=\"EURUSD Forex weak breakout below bear flag\"></a></figure><p>The EURUSD daily Forex chart is breaking below a small bear flag. But the bear flag is a tight trading range and most tight trading range breakouts soon reverse.<p>Furthermore, the breakout is near the bottom of a 5 month trading range and near the bottom of a yearlong bear channel. Every breakout attempt over the past year has reversed. Consequently, while there is no reversal yet, traders should expect a 2 – 3 week rally to begin within a couple weeks. It could come from above or below the August low. If there is a break below the August low, it will probably last for only 2 – 3 days before reversing up.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart broke below the 6 day tight trading range overnight, but reversed up to just below the bottom of the range. The overnight range is not big. Therefore, this is not a strong breakout.<p>Today is Friday so weekly support and resistance are important. Last week was a big bear bar and a reversal down. This week has been small. At a minimum, the bears want a bear body on the weekly chart to confirm last week’s selloff. Consequently, they would like the week to close below the 1.1090 open of the week.<p>In addition, they would like it to close below last week’s low of 1.1066. It is within a few pips of that right now. In addition, the range has only been 25 pips over the past 8 hours. Therefore, today will probably stay in a tight range around last week’s low. Traders have been scalping around it, buying below and selling above.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-spike-and-channel-bear-trend.png\"><img loading=\"lazy\" src=\"2019-8-23-2.png\" alt=\"Emini spike and channel bear trend\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini had a huge selloff on China trade war news. It then entered a bear channel. When a Bear Surprise is that big, it is major. It often affects the market for several days. The bears need follow-through selling on Monday. If they do not get it, there is a 40% chance that today will just be a bear trap in the 3 week trading range.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-8-23"
    }
  ],
  "24": [
    {
      "data": [
        "<article class=\"post-92853 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini weekly sell signal bar but within August trading range\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weekly sell signal bar but within August trading range</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-08-24T00:30:25-07:00\">August 24, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Market Overview: Weekend Market Update</h2><p>The<strong>Emini</strong>had a strong selloff on Friday, but it is still within its 3 week trading range. While the odds favor a break below the August low and 2800 within a few weeks, until there is a breakout, there is no breakout. There is a 40% chance that Friday was a bear trap and the Emini could reverse up next week.<p><strong>Bitcoin</strong>has been in a triangle for a couple months. That is Breakout Mode. But there are slightly better odds for a break below the 10,000 support and test the bottom of the June rally at 7442.<p>The<strong>EURUSD</strong>weekly Forex chart has been in a weak bear channel for a year. This week’s micro double bottom will probably lead to a minor reversal up, like all of the other bottoms over the past year.<h2><strong>Bitcoin:</strong><br>Apex of triangle just above 10,000 Big Round Number</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Bitcoin-daily-chart-at-apex-of-triangle-at-10000-so-breakout-mode.png\"><img loading=\"lazy\" src=\"2019-8-24.png\" alt=\"Bitcoin daily chart at apex of triangle at 10,000 so breakout mode\"></a></figure><p>Bitcoin had a huge rally for the 1st half of 2019 and has been sideways for 3 months. So far, there is an ii on the monthly chart (not shown). The bulls and most of the TV pundits see the trading range as a bull flag. They want a breakout above the August high and then a test of last year’s all-time high.<p>But there are problems with this setup. The rally had 3 pushes up, with each leg getting significantly bigger. This is a parabolic wedge buy climax. The bulls were exhausted and took profits in July. It is a mistake to assume they will be quick to buy again.<p>A reversal from a buy climax typically lasts longer and falls further than what seems reasonable to most traders. The strong bulls will only buy once they are convinced that there is no one left to sell. At the moment, there are many traders ready to sell. Who are they? They are the emotional bulls who have been buying the pullback for the past 2 months, afraid that the bull trend will soon resume without them.<h3>10,000 is probably fake support</h3><p>Bitcoin broke strongly above 10,000 in June. It is a Big Round Number and traders are hoping it will be support.<p>But there is a problem. Traders have been easily able to buy pullbacks to below 10,000 for over a month. Traders should realize that a good fill is usually a bad trade.<p>All markets are mostly made up of institutions. If you take any trade, you should assume that an institution is taking the opposite side.<p>Furthermore, it is useful to assume that we are dumb and they are smart. If it is very easy to do something, then an institution is eager to do the opposite.<p>Traders have found it easy to buy at 10,000. That means many institutions are eager to sell there. Why? Because they think that Bitcoin will go lower and they can make money.<p>Unless the bulls get a strong reversal up from 10,000 within the next few weeks, Bitcoin will probably break below. All of those bulls who thought it was support will sell out of their longs in a panic. The result will be a quick move down to the next support, which is 7442.<h3>What happens if the weak bulls exit?</h3><p>If the rally continues to fail to materialize, at some point the weak bulls will begin to think that they bought too early and too high. If they come to that conclusion, they will exit their longs in a panic. That would result in a break below the 3 month trading range.<p>When there is a reversal down from a parabolic wedge buy climax, the selloff usually retraces to the bottom of the final leg up. That is the June 4 low of 7442, and it is a reasonable target. Less likely, the selloff will continue down to the bottom of the pullback after the 1st leg up. That is the April 4 low of 4784.<p>But if Bitcoin truly is in a bull trend, the 2 week rally will be the start of a series of many bull bars on the daily chart, like in early June. Show me the money. I think lower first, then higher.<h2><strong>EURUSD weekly Forex chart:</strong><br>High 2 minor bottom in yearlong bear channel</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/EURUSD-weekly-Forex-chart-has-High-2-bottom-in-bear-channel.png\"><img loading=\"lazy\" src=\"2019-8-24-1.png\" alt=\"EURUSD weekly Forex chart has High 2 bottom in bear channel\"></a></figure><p>The EURUSD weekly Forex chart has been drifting down for a year since its strong reversal down in May 2018. There have been many credible bottom attempts, but each failed within a few weeks.<p>However, the bears are failing to get a strong break below the bear channel. The bears have been taking profits at each new low. This means that they are not confident of much lower prices. Also, the bulls continue to buy below the last low, knowing that this has been a profitable trade for a year.<h3>A bear channel is a bull flag</h3><p>There is no evidence that this is about to change. But there are a couple things that traders should know. If the bears get a strong break below the bear channel, there is a 75% chance that it will fail and reverse up within 5 bars (weeks). If that were to happen, it would likely represent a transition from a bear channel into either a trading range or a bull trend.<p>Also, even if there is no climactic reversal up from below the bear channel, traders should ultimately expect a bull breakout. There is a 75% chance that a bear channel will eventually have a bull breakout. It would then evolve into either a trading range or a bull trend. There is only a 25% chance of a successful bear break below a bear channel and then a transition into a stronger bear trend.<p>However, channels can last a long time. There is no evidence that this one is about to end. Traders will continue to buy new lows and sell rallies, expecting legs up and down to last at least a few weeks.<h2><strong>Monthly S&amp;P500 Emini futures chart:</strong><br>Sideways to up for at least another month</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-monthly-candlestick-chart-in-pullback-from-expanding-triange-top.png\"><img loading=\"lazy\" src=\"2019-8-24-2.png\" alt=\"Emini monthly candlestick chart in pullback from expanding triangle top\"></a></figure><p>The monthly S&amp;P500 Emini futures chart has a bear bar so far this month. But nothing has changed on the monthly chart from what I have been saying since early July. There were consecutive outside bars in May and June. July triggered an oo buy signal when it went above the June high. At that point, there was a 60% chance that the monthly chart would be sideways to up for at least 3 months.<p>While August retraced more than half of July, it is still a 2nd sideways to up month. This should continue at least into September.<h3>August might become High 1 bull flag buy signal bar</h3><p>If the August high remains below the July high, August will be a High 1 bull flag buy signal bar for September. But unless it has a bull body, which is unlikely at the moment, it would be a weak B setup.<p>Also, the Emini is at the top of a 20 month trading range. Most trading range breakouts do not go far. Therefore, the likely reward for a bull buying with a stop above the August high is not very big.<p>Big risk and limited reward means that the risk/reward is not strong for a stop entry buy above the August high. In addition, since most trading range breakouts fail, the probability of a strong rally is small. When the risk/reward is bad and the probability is low, there might be more traders selling above the August high than buying. If so, the rally might only last a bar or two before there is another 1 – 3 month reversal down.<h2><strong>Weekly S&amp;P500 Emini futures chart:</strong><br>Big bear inside sell signal bar after 2 doji bars</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-weekly-candlestick-chart-has-bear-inside-bar-sell-signal.png\"><img loading=\"lazy\" src=\"2019-8-24-3.png\" alt=\"Emini weekly candlestick chart has bear inside bar sell signal\"></a></figure><p>After the early August plunge, the weekly S&amp;P500 Emini futures chart has been sideways for 3 weeks. This week formed a big bear inside bar and it closed near its low. It is therefore a sell signal bar for next week. The bears want a strong break below this week’s low. That would represent a resumption of the August selloff.<p>But a big inside bar in a tight trading range has a lower probability of success for the bears. The big bar means big risk. Fewer bears will sell at the bottom of a 3 week tight trading range.<p>Also, there is a conspicuous tail on the bottom of this week’s bar. That further reduces the probability of a successful bear breakout.<h3>Weak sell signal bar</h3><p>Traders should always look to the left and not just at the sell signal bar. The context is important. A 3 week tight trading range is a weak environment for a breakout. Markets have inertia. That means they tend to continue to do what they have been doing. The weekly chart has been going sideways of 3 weeks.<p>Why were the bears unable to create a better sell signal bar, like a small bear bar at the top of the 3 week range? Traders should assume that it is because the bears were not strong enough to create a more convincing sell signal.<p>Next week is important. A big bear entry bar would make a test of the June low likely.<p>But if the bulls can prevent next week from falling below this week’s low, they might be able to create a 2nd consecutive inside bar. Or, if the bears trigger their sell signal but next week closes near its high, the sell signal will likely fail during the following week. Either outcome would return the weekly chart to more neutral.<h2><strong>Daily S&amp;P500 Emini futures chart:</strong><br>Reversal down from double top bear flag, but still in 3 week trading range</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-daily-candlestick-chart-has-bear-bar-but-within-trading-range.png\"><img loading=\"lazy\" src=\"2019-8-24-4.png\" alt=\"Emini daily candlestick chart has bear bar but within trading range\"></a></figure><p>Traders know that the August selloff was surprisingly strong. When there is a strong selloff, traders expect at least a small 2nd leg sideways to down. The bulls hope that the August 15 double bottom satisfied that expectation. But Friday’s selloff means that the bears have a 60% chance of a break below the August low.<p>When a selloff is as strong the August one was, the 2nd leg typically forms a new low and not just a test of the 1st low. Therefore, traders should expect one more push down to below 2800 before there is a new all-time high.<p>But, a couple big bull bars closing on their highs and above the 3 week trading range would shift the probability in favor of a new high without another leg down.<p>The bulls have a 40% chance that Friday’s selloff was a bear trap. It might be a brief, sharp pull from the August 5/August 15 double bottom (a double bottom pullback). If they get a strong reversal up early next week, the odds will shift in their favor.<p>At the moment, nothing has changed from what I have been saying all month. The Emini will probably fall below the August low and 2,800 at a minimum within a few weeks. There is a 50% chance that it break below the June low. Finally, the bears have a 40% chance of a 120 point measured move down based on the height of the 3 week trading range.<p>But don’t forget the monthly chart. Any selloff should end within a couple months. The odds still favor a new all-time high this year.<hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-8-24"
    }
  ],
  "26": [
    {
      "data": [
        "<article class=\"post-92850 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini bear breakout in trade war but in trading range\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini bear breakout in trade war but in trading range</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-08-26T06:20:44-07:00\">August 26, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Monday August 26, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Friday had a surprisingly strong selloff. When a selloff is that strong, there is a 60% chance of lower prices over the next few days. But there is a 40% chance that it is a bear trap. If the bulls get a strong bull bar today, traders will conclude that the selloff was in fact a trap. Today would then be a buy signal bar for tomorrow.<p>I wrote over the weekend that a big bear bar alone is not a reliable indicator of a bear trend. Friday was a big bear bar and last week formed a big bear bar on the weekly chart. Both charts are still in tight trading ranges.<h3>Weak sell signal bar since bad context</h3><p>The daily chart has had many big bars up and down for 3 weeks. Until there is a breakout, there is no breakout. Traders need more information and should assume that Friday is just another day in the range.<p>Last week was a sell signal bar on the weekly chart. This week might have to go below last week’s low to see if the bears are willing to sell at the bottom of the 3 week range. Typically, they will not and the bear breakout will fail.<p>The bulls would like the week to remain within last week’s range. If so, this week would probably have a bull body. It would then be a buy signal bar on the weekly chart.<p>The minimum that the bears want today is no bull body on the daily chart. If they get a bear body, it will increase the odds of lower prices this week. Remember, for the past several weeks I have been saying that the August selloff would probably get a 2nd leg down. The minimum goals for the bears are a break below the August low and below 2800.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 14 points in the Globex session. Today’s close will be important because today is the follow-through day after Friday’s big selloff. A bull close today makes a continuation of the 7 day range likely. But if the bears get even a 1 tick bear body, the odds will favor at least slightly lower prices this week.<p>Friday was a Spike and Channel bear trend. There is usually a bull breakout above the bear channel and then a test of the start of the channel. It began with the pullback to around 2890 after Friday’s huge selloff. Finally, the bear channel typically evolves into a trading range.<p>Friday’s late reversal up and the overnight rally are probably the start of the transition. This increases the chance of a sideways’s to up day today.<h2>Friday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-spike-and-channel-bear-trend.png\"><img src=\"2019-8-26.png\" alt=\"Emini spike and channel bear trend\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/EURUSD-Forex-bear-flag-and-bull-trend-reversal-after-G7-and-China-trade-war.png\"><img loading=\"lazy\" src=\"2019-8-26-1.png\" alt=\"EURUSD Forex bear flag and bull trend reversal after G7 and China trade war\"></a></figure><p>The EURUSD daily Forex chart formed a big outside up day on Friday and a higher low reversal. But the bulls need a strong break above the EMA before traders will conclude that a 2 – 3 week rally is underway.<p>So far, today is a bear day at the EMA. If today closes near its low, the bears will see today as a sell signal bar for a failed reversal up. Friday will then be just a 50% pullback from the selloff 2 weeks ago, and the past 7 days will be a bear flag.<p>The past 7 days have been in a tight trading range. That is a Breakout Mode pattern. There is a 50% chance of a test below the August low.<p>Since every new low for the past year reversed up for 2 – 3 weeks, traders expect the same this time. What they do not know is if Friday was the start of a rally or if the bears will get a brief breakout below the August low first.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart sold off 45 pips at the start of the European session. But is has been in 15 pip tight trading range for 4 hours.<p>If the bears can get the day to close near its low, they will have a good sell signal bar on the daily chart. They do not need the day’s range to get bigger. Therefore, there is less incentive for a selloff in the US session.<p>The bulls will try to prevent today from forming a strong sell signal bar on the daily chart. Consequently, they will buy tests of the day’s low. They would like the day to close at least 20 pips above the low. That would reduce the chance of a big selloff tomorrow.<p>Can they reverse the overnight selloff? Probably not. The 15 pip range over the past 4 hours is a sign that there is no energy. Day traders are scalping and will continue to scalp unless there is a surprise breakout up or down.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-late-breakout-in-trading-range-day.png\"><img loading=\"lazy\" src=\"2019-8-26-2.png\" alt=\"Emini late breakout in trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini formed a bull inside day today after Friday’s sell climax. It is a buy signal bar for tomorrow. The bulls hope Friday was just a bear trap and that today is the start of a resumption of the June/July bull trend.<p>More likely, it is just another leg in the 4 week trading range. Unless the bulls get a strong break above the August 13 high, the Emini will probably test below 2800 within a few weeks.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-8-26"
    }
  ],
  "27": [
    {
      "data": [
        "<article class=\"post-92995 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini pause after Friday Spike and Channel Bear Trend\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini pause after Friday Spike and Channel Bear Trend</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-08-27T06:20:18-07:00\">August 27, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Tuesday August 27, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday was a bull inside day on the daily chart. It is therefore a buy signal bar for today. The bulls hope that Friday was a bear trap and that June/July bull trend is resuming.<p>But unless the bulls get consecutive closes above the top of the 4 week trading range, traders will continue to expect a break below 2800. However, the odds still favor a new high this year.<p>On the 5 minute chart, Friday was a Spike and Channel bear trend. That usually transitions into a trading range, which happened yesterday. There is still room to the 2890 start of Friday’s bear channel, which is a magnet just above yesterday’s high.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 9 points in the Globex session. It therefore might gap above yesterday’s high and the 60 minute EMA. That would trigger a buy signal on the daily chart. Furthermore, it would erase Friday’s bearishness. Friday would then be simply a bear trap within a trading range.<p>But the Emini is in the middle of a month-long trading range. It has reversed every few days. In a trading range, traders expect buy and sell signals to not have much follow-through. Consequently, the bulls will start to take profits and the bears will begin to sell as any rally gets near the 2940 top of the range.<p>Will today become a big bull trend day? When a market starts a day in the middle of a trading range, the odds of a big trend are less. The middle of the range is a magnet. Traders tend to sell higher and buy lower. Therefore, the odds favor more trading range price action today.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-late-breakout-in-trading-range-day.png\"><img src=\"2019-8-27.png\" alt=\"\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/EURUSD-Forex-bear-flag-or-higher-low-major-trend-reversal.png\"><img loading=\"lazy\" src=\"2019-8-27-1.png\" alt=\"EURUSD Forex bear flag or higher low major trend reversal\"></a></figure><p>The EURUSD daily Forex chart had a big bear bar yesterday after a bigger bull bar Friday. This is a common pattern. Traders wonder if yesterday is just a pullback from Friday’s rally or a reversal of the rally.<p>For the bears, it is a lower high at the EMA in a bear channel. Yesterday is therefore a Low 1 bear flag.<p>The bulls, however, believe there will be more buyers than sellers below yesterday’s low. They therefore expect today to become a buy signal bar for tomorrow.<p>After 7 sideways days, traders think that the daily chart is still in Breakout Mode. The believe that there is an equal chance of a bull or bear breakout.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 20 pip range overnight. Furthermore, it is within yesterday’s range. It therefore did not yet go below yesterday’s low to trigger the sell signal on the daily chart. But even if it does, the odds are against a big move since the price the EURUSD in the middle of a 7 day tight trading range.<p>At the moment, the day’s range has been so small that it is even difficult to make a 10 pip scalp. If today does trade below yesterday’s low, it will trigger a sell signal on the daily chart. But with so little energy overnight and for many days, there will probably be more buyers than sellers below yesterday’s low. Today will probably not go very far up or down.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-endless-pullback-after-gap-up-so-small-pullback-bear-trend.png\"><img loading=\"lazy\" src=\"2019-8-27-2.png\" alt=\"Emini endless pullback after gap up so small pullback bear trend\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini gapped above yesterday’s high and triggered a minor buy signal on the open. It then sold off in a Small Pullback Bear trend for 4 hours. The bulls got a reversal up from a High 4 bottom, and the day evolved into a trading range.<p>Because it was a bear bar on the daily chart, today is a sell signal bar for tomorrow. But stop entry setups in the middle of a 4 week trading range are low probability bets. Just look at today’s buy signal.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-8-27"
    }
  ],
  "28": [
    {
      "data": [
        "<article class=\"post-92998 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini stalled in middle of August trading range\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini stalled in middle of August trading range</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-08-28T06:20:12-07:00\">August 28, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Wednesday August 28, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday triggered a buy signal on the daily chart. But I said before yesterday’s open that it was a weak setup. Entering with stops in the middle of a 4 week trading range is low probability trading.<p>Yesterday sold off in a Small Pullback Bear Trend. It evolved into a trading range in midday. Since it was a bear day on the daily chart, it is a sell signal bar for today. But the problem remains. Entering with stops in the middle of a 4 week trading range is a losing strategy. There will probably be more buyers than sellers below yesterday’s low.<p>When a market is in a trading range, it tends to spend most of its time around the middle. Consequently, the Emini might be sideways for another day or two.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 8 points in the Globex session. There might be a small gap down open. That would trigger a sell signal on the daily chart. But since the Emini is in the bottom half of a 4 week tight trading range, the sell signal is minor. That means that the odds of a big bear trend day are less.<p>The bears want follow-through selling after yesterday’s bear trend. However, the Emini has been reversing every couple days for the past 4 weeks. Therefore it is equally likely that if there is a trend today, it will be up.<p>Sell climaxes typically lead to trading ranges. Yesterday was in a trading range for the 2nd half of the day. Traders expect that today will continue that range. They therefore will look for reversals up and down unless there is a strong breakout up or down.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-endless-pullback-after-gap-up-so-small-pullback-bear-trend.png\"><img src=\"2019-8-28.png\" alt=\"Emini endless pullback after gap up so small pullback bear trend\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/EURUSD-Forex-bear-flag-or-pullback-after-bull-trend-reversal.png\"><img loading=\"lazy\" src=\"2019-8-28-1.png\" alt=\"EURUSD Forex bear flag or pullback after bull trend reversal\"></a></figure><p>The EURUSD daily Forex chart has sold off for 3 days after going above a big bull outside up bar. As long as the selloff remains above that bar’s low, the bulls will assume that the selloff is a pullback from that bull trend reversal. They see the daily chart as forming a higher low reversal up from the bottom of a 5 month trading range.<p>But it is equally likely that the outside up bar was a pullback to the EMA from the 5 day selloff of 2 weeks ago. When there is both a credible buy and sell setup, the chart is in Breakout Mode. It is in the middle of a 9 day tight trading range. Until there is a breakout, there is no breakout.<p>That 9 day range is at the bottom of a 5 month trading range and a yearlong bear channel. Every breakout to a new low over the past year reversed up for several weeks. Traders therefore believe that there is not much downside risk over the next few weeks. The EURUSD is in the buy zone, but it might have to fall below the August low before the bulls will buy aggressively.<p>That is what the market is currently deciding. Is the bottom for the next few weeks in, or will there be another brief leg down?<p>It is important to understand that the yearlong bear channel will end at some point. There is only a 25% chance of a strong bear breakout and then an acceleration of the bear trend. Most bear channels have bull breakouts and evolve into trading ranges or bull trends. But there is no sign that the channel is about to end.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart overnight barely broke below yesterday’s low, but the range is small and it is going sideways around that low. Day traders are scalping. They are buying reversals up from the bottom of the overnight range and selling reversals down from the top.<p>Traders expect the 9 days of tight trading range price action to end soon. Once there is a strong breakout up or down, day traders will switch to swing trading. There is no sign that the breakout is about to happen.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/bull-trend-from-open-then-trading-range.png\"><img loading=\"lazy\" src=\"2019-8-28-2.png\" alt=\"Emini bull trend from the open\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini triggered the sell signal on the daily chart by going below yesterday’s low. But, stop entries in the bottom third of a tight trading range are bad bets. The bulls bought just below yesterday’s low and today reversed up into a bull trend.<p>Because today has a bull body, it is a buy signal bar for tomorrow. However, it is a weak buy signal since the Emini is still in the middle of its 4 week tight trading range.<p>Since this week is a small inside bar on the weekly chart, this week might be a doji bar once the bar closes on Friday. Unless the Emini moves far from the open of the week, the open might be a magnet for the rest of the week.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-8-28"
    }
  ],
  "29": [
    {
      "data": [
        "<article class=\"post-93001 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini bad stop entry setups within August tight trading range\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini bad stop entry setups within August tight trading range</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-08-29T06:20:40-07:00\">August 29, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Thursday August 29, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini triggered a minor sell signal yesterday by trading below Tuesday’s low. But, I said that it was a weak sell setup since it was a big bear bar in the bottom third of a 4 week trading range. Traders bought below Tuesday’s sell signal bar and yesterday was a bull trend day.<p>For the bulls, yesterday is now a buy signal bar for today. It formed a micro double bottom with Monday’s low, which increases the chance of at least a small rally.<p>It is important to note that there are only 2 trading days left in August and that July triggered a reliable buy signal on the monthly chart. Today and tomorrow might rally to undo much of August’s selloff.<p>Will the overnight China news lead to a resumption of the June/July bull trend? It might, but traders will assume that the institutions have already factored in everything involving a possible trade deal, including the timing. Therefore, the overnight news might not have a lasting effect.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 26 points in the Globex session. Today will probably gap up above yesterday’s high and the 2900 Big Round Number.<p>A big gap increases the chance of a trend day. If there is going to be a trend day, a bull trend day is slightly more likely than a bear trend day when the gap is up.<p>Because there are only 2 days left in August, monthly support and resistance could be magnets for the next 2 trading days. At a minimum, the bulls want the month to close above its 2917.38 midpoint. Traders would see that as a sign that the bulls owned the month, despite the strong selloffs.<p>The bulls would prefer that the monthly candlestick has a bull body. That would require tomorrow closing above the 2981.25 open of the month. However, that might be out of reach by tomorrow’s close.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-bull-trend-day.png\"><img src=\"2019-8-29.png\" alt=\"Emini bull trend\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/EURUSD-Forex-bear-channel-and-bottom-of-5-month-trading-range.png\"><img loading=\"lazy\" src=\"2019-8-29-1.png\" alt=\"EURUSD Forex bear channel and bottom of 5 month trading range\"></a></figure><p>The EURUSD daily Forex chart is continuing its 4 day selloff after last Friday being a big outside up day. The overnight news about the China trade war is good for the US and therefore relatively bad for every competitor. However, traders should assume that the institutions have already mostly factored in any China news. That reduces the probability of a huge move up or down on the daily chart.<p>The 4 day selloff increases the chance that last week’s rally was just a bull trap and a bear flag. Traders now expect that the selloff might continue to below the August low.<p>However, there have been many news events over the past year and many new lows in the yearlong bear channel. Each bear breakout reversed up within a few days. It then led to a 2 – 4 week bear rally. Consequently, traders will assume that the August selloff will behave the same way.<p>Also, even if the bears get a strong breakout below the bear channel, there is only a 25% chance that it would lead to an accelerated bear trend on the daily chart. Traders know that there is a 75% chance of it reversing up within 5 days.<p>That would be an exhaustive sell climax and it would probably lead to a breakout above the bear channel. If so, the yearlong bear channel would end and transition into a trading range, which could last many months.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart traded below yesterday’s low overnight. But the overnight range has been small and the entire 4 day selloff is a Spike and Channel bear trend on the 5 and 60 minute charts. There is typically a bull breakout above the bear channel and then a transition into a trading range. Day traders therefore expect a bounce today or tomorrow.<p>With the past 2 days and the overnight range being small, there is currently no energy. Day traders have been scalping while waiting for a breakout.<p>When there is a bear channel, there is only a 25% chance of a successful bear breakout and a stronger bear trend. Consequently, day traders expect a rally within a few days. They are ready for either a bull breakout or a bear breakout that reverses up. Less likely, there would be a successful bear breakout and a strong bear trend.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-big-gap-up-and-wedge-opening-reversal-up-from-EMA.png\"><img loading=\"lazy\" src=\"2019-8-29-2.png\" alt=\"Emini big gap up and wedge opening reversal up from EMA\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini had a big gap up to the midpoint of the August range. It traded around it for an hour and then broke to the downside. It reversed up from a wedge bottom at the EMA. The selloff was also a 50% pullback from yesterday’s higher low. The rally then tested the August 23 sell climax high and went sideways for the rest of the day.<p>Tomorrow is the last day of the month. Two important monthly targets are the midpoint of the month and the open of the month. A close above either would strengthen the bull case. The open of the month is far above and likely beyond reach tomorrow. It is important to remember that until there is a breakout of the month-long trading range, there is no breakout and traders will look for reversals.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-8-29"
    }
  ],
  "30": [
    {
      "data": [
        "<article class=\"post-93004 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini month-end magnets are August midpoint and open\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini month-end magnets are August midpoint and open</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-08-30T06:20:15-07:00\">August 30, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Friday August 30, 2019</h2><p>There will be no update at the end of the day due to Al travelling.<h2>Pre-Open market analysis</h2><p>I have been writing about the importance of the monthly chart since June went outside up after May was outside down. July triggered the oo bull flag buy signal on the monthly chart. At that point, there was a 60% chance of sideways to up trading for at least 3 months.<p>While August sold off early in the month, the Emini is now back to the 2917.38 midpoint of the August range. That was a magnet yesterday and it might be a magnet today. Why? Because if the Emini closes the month above its midpoint, it is a sign of strong bulls. The bulls will have owned the month, at least by a little, despite the big early selloff.<p>Yes, yesterday’s gap up helped the bulls. But the bulls need today to close above the August midpoint. That would increase their chance of resuming the bull trend up to a new high.<p>The rally this week is strong enough so that the bulls might even get the day to close above the open of the month. August would then have a bull body on the monthly chart. It would then be a High 1 buy signal bar for September.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 16 points in the Globex session. If it opens here, it will be at the top of the 4 week trading range. The bulls would like today to close above the top of the trading range. That would increase the chance that the June/July bull trend has resumed and that this rally will continue up to a new all-time high.<p>While today will gap up, the Emini will still be about 40 points below the open of the month. That monthly magnet is probably too far above for the bulls to get there today. The midpoint of the month is 26 points below and could still be a magnet at the end of the day. More likely today will close between both monthly targets, and focus more on the weekly target of the high of the 4 week trading range.<p>When a market gaps up to a resistance level and the next higher resistance is far above, it tends to oscillate around the resistance. Consequently, there is an increased chance of a trading range day centered around the top of the 4 week range.<p>If that happens, that price will be a magnet at the end of the day. That means traders should expect it to get tested late today. This could result in a brief strong trend in the final hour to above or below the top of the range.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/08/Emini-big-gap-up-and-wedge-opening-reversal-up-from-EMA.png\"><img src=\"2019-8-30.png\" alt=\"Emini big gap up and wedge opening reversal up from EMA\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><img loading=\"lazy\" src=\"2019-8-30-1.png\" alt=\"EURUSD Forex bear leg in bear channel\"></figure><p>The EURUSD daily Forex chart has sold off for 5 days after a sharp rally to the EMA. While it is still above the August low, the selloff is more likely a resumption of the yearlong bear channel than a pullback from the rally 3 weeks ago.<p>As strong as the selloff has been, it is important to note that there have been many other strong selloffs over the past year. Every new low reversed up within days and led to a 2 – 3 week bull leg in the bear channel.<p>Will the price action change? For example, will the bears get a strong breakout that lasts several weeks, creating a stronger bear channel? Markets have inertia. That means they resist change. It is more likely that the behavior of the past year will continue.<p>Consequently, traders will continue to look for a reversal up within a week or two until there is a new low with consecutive big bear bars closing near their lows. If the bears get that, traders will look for several weeks down below the August low before buying again.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute chart sold off early in the European session to below yesterday’s low, but it has been in a 15 pip trading range for the past 6 hours. Traders are deciding if the selloff will continue to below the August low.<p>That target is only 6 pips below the overnight low. Can today break strongly below that low? This is unlikely because the bears will not gain much by doing that. They have already convinced traders that the rally from 3 weeks ago was just a bull leg in the yearlong bear channel. They would need a 50 pip selloff from here today to make traders believe that the bear channel is evolving into a bear breakout. That would represent a change in the yearlong behavior and it is therefore unlikely.<p>What about the bulls? Can they get a strong reversal up today? Probably not. The bear channel over the past week has been tight. A tight bear channel typically has to transition into a trading range before there will be a strong rally.<h3>Weekly and monthly targets are important today</h3><p>If today will probably not go far up or down, what is left? A trading range day. Today will probably focus on the August low and last week’s low. If the bears can close the day, week, and month below both, there will be an increased chance of a bear breakout below the bear channel over the next few weeks. If the bulls can get the week to close above both, it will increase the chance that there will be a reversal up within 2 weeks and the yearlong bear channel is continuing.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-gap-up-and-then-double-top-and-bear-trend.png\"><img loading=\"lazy\" src=\"2019-8-30-2.png\" alt=\"Emini gap up and then double top and bear trend\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>No summary today due to Al travelling.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-8-30"
    }
  ]
}