{
  "1": [
    {
      "data": [
        "<article class=\"post-93137 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini August ledge top so brief bull breakout likely\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini August ledge top so brief bull breakout likely</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-09-01T21:05:28-07:00\">September 1, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Market Overview: Weekend Market Update</h2><p>The<strong>Emini</strong>has a ledge top on the daily chart. Traders should expect a breakout above the 4 week range. But that breakout will probably fail and lead to a move below the August low.<p>The monthly<strong>gold</strong>futures chart has rallied strongly, but is at resistance. It might pause here for a month or two, but traders should expect at least slightly higher prices.<p>The<strong>EURUSD</strong>weekly Forex chart is breaking below the yearlong bear channel. All prior breakouts reversed up within a couple weeks. But if next week is a 2nd consecutive big bear bar closing near its low, this selloff will probably continue down for a measured move to around 1.04<h2><strong>Gold Futures market:</strong><br>Strong rally, but buy climax at resistance</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Gold-monthly-futures-testing-start-of-wedge-selloff-2.png\"><img loading=\"lazy\" src=\"2019-9-1.png\" alt=\"Gold monthly futures testing start of wedge selloff\"></a></figure><p>Gold futures have trended up strongly for 4 months. The rally began with a double bottom higher low major trend reversal on the monthly chart in August 2018.<p>As strong as the rally has been, it is now testing the August 2013 high. Why is that important? Because beginning in April 2013, there was a 3 month strong bear break below a bull trend line. That was a bear spike. The bear channel began with the top of the August 2013 rally.<p>When there is a Spike and Channel bear trend, traders expect a bull breakout above the bear channel. The rally typically tests the start of the bear channel. In this case, it was the August 2013 high. Then, the chart typically enters a trading range.<p>The 2019 rally went just above that August 2013 high. As strong as the rally has been, many traders will begin to take profits. That is because the rally reached a resistance level where a trading range typically begins.<p>A trading range has bull and bear legs. The 2019 rally is a bull leg. The bulls hope it is the start of a bull trend that will break above the September 2011 buy climax high. More likely, the bulls will start to take profits and the bears will soon sell. Both know that the rally will probably stall for at least a couple bars on the monthly chart. That means a 1 – 2 month trading range on the daily chart.<h3>Do the bulls have to exit?</h3><p>Investors will hold long, even if there is a 2 month reversal down to 1400 and the January 2018 high. Traders, however, will quickly take profits if they sense that widespread profit-taking is underway.<p>How will they know if the profit-taking might last a couple months and fall far below, perhaps down to 1400? They look for either a surprisingly big bear bar or a series of 3 or more smaller bear bars closing near their lows.<p>Both represent strong profit-taking and they increase the chance of at least 10 bars down on the daily chart. More likely, the daily chart would test the July trading range at around 1400, which is also the January high breakout point.<h3>How far will a pullback fall?</h3><p>The June/July rally had 3 legs up on the daily chart (not shown) and it is therefore a wedge rally. A reversal down from a wedge typically tests the start of the wedge. That is the pullback after the 1<sup>st</sup>leg up. Here, it is the July low at around 1400.<p>Was this week’s selling a likely candidate for the start of a 1 – 2 month pullback? The bears need to do more. The 3 month rally has been in a tight bull channel. The 1<sup>st</sup>break below the bull trend line typically leads to a bull flag or trading range and not a bear trend. Traders therefore expect a trading range over the next couple of weeks and not a bear trend.<p>The trading range could be another bull flag that would lead to higher prices. But with a wedge rally on the daily chart and the monthly chart testing the resistance of the August 2013 high, the upside over the next few weeks is probably small. This is despite the strong bull trend.<h2><strong>EURUSD weekly Forex chart:</strong><br>Outside down week, but bottom of bear channel</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/EURUSD-weekly-Forex-chart-outside-down-week-below-wedge-bottom.png\"><img loading=\"lazy\" src=\"2019-9-1-1.png\" alt=\"EURUSD weekly Forex chart outside down week below wedge bottom\"></a></figure><p>The EURUSD weekly Forex chart had a buy signal bar last week. This week traded above last week’s high, triggering the buy signal. It then reversed down and traded below last week’s low. This week therefore was an outside down bar.<p>While bearish, traders must consider the context. The EURUSD weekly chart is near the bottom of a yearlong bear channel. Every new low reversed up within a couple weeks. Also, every rally reversed back down after a few weeks. Traders expect that any follow-through selling will end within a few weeks.<p>A year is unusually long for a bear channel in the Forex markets. Consequently, traders need to be prepared for a change in the price action.<h3>The Market Cycle</h3><p>All markets typically go through a repeating cycle of price action. A breakout weakens into a channel. The channel weakens further and transitions into a trading range. Then traders wait for the next breakout up or down.<p>The EURUSD weekly Forex chart has been in a bear trend for 18 months. The current channel phase has lasted for more than a year. Traders know that there is a 75% chance of a break above the bear channel and then a transition into a trading range. Sometimes there is a breakout below the bear channel and then a reversal up, and then a transition into a trading range.<p>But 25% time, there is a successful breakout below a bear channel. That means two or more consecutive bear bars closing near their lows and an acceleration of the bear trend. Traders then expect a transition into a bear channel, and then a trading range.<h3>What should traders expect next week?</h3><p>Traders know that most breakout attempts fail. As a result, they expect a reversal up within a few weeks. But they also know that a year is a long time for a channel. Consequently, there is an increasing chance of a successful breakout above or below the channel with each passing week.<p>If there are consecutive big bear bars closing on their lows, traders will bet on a successful bear breakout. That means an acceleration down and probably lower prices for at least a couple more months. A measured move down based on the height of the wedge is around 1.04.<p>More likely, once there is a successful breakout, it will be up. Traders need to see consecutive closes above a major lower high, like the June 25 high of 1.1413. Until that happens, the bear trend is still intact and traders will continue to sell 2 – 3 week rallies.<p>Since the EURUSD Forex market is in a bear channel, the bears will continue to take profits below the last low. Also, the bulls will look to buy a reversal up from around the last low, expecting a tradeable bounce for a couple weeks.<p>But if this is the start of a successful bear breakout, next week will close on its low. This would be caused by bears continuing to sell instead of taking profits. That would represent a change in the price action of the past year.<h2><strong>Monthly S&amp;P500 Emini futures chart:</strong><br>Reversal up in August but bear body</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-monthly-chart-buying-pressure.png\"><img loading=\"lazy\" src=\"2019-9-1-2.png\" alt=\"Emini monthly chart buying pressure\"></a></figure><p>The monthly S&amp;P500 Emini futures chart&nbsp;triggered an oo buy signal when July traded above consecutive outside bars in May and June. I have written about this every week since June. When an oo bull flag triggers, there is a 60% chance of sideways to higher prices for 3 bars. On the monthly chart, that means into September.<p>This month was a big bear bar on the monthly chart until this past week. Then, the bullishness of the oo buy signal asserted itself. The Emini rallied and August closed above the midpoint of the month’s range. While the month still had a bear body, the close above the midpoint means that the bulls won the month. It is a sign of buying pressure and strong bulls.<p>August would have been much more bullish if it rallied strongly from the 1<sup>st</sup>day and the month became a big bull trend bar closing far above the July high. Instead, the bulls achieved the minimum. They erased more than half of the selling and gave the bulls hope that the selloff has ended.<p>Since the August high is below the July high, August is a pullback in a bull trend. It is therefore a High 1 bull flag. But it has a bear body and the Emini is at the top of a 20 month expanding triangle. That is a weak buy setup. Traders will not be eager to buy above the August high.<p>When a buy setup is weak, there are usually more sellers than buyers above the high of the buy signal bar. Therefore September will probably not be a strongly bullish month.<h3>Has the correction ended?</h3><p>The selloff from the January 2018 high was mostly sideways for 3 months. The selloff in September lasted 3 months. Traders would not be surprised if the current selloff continues sideways for another month or two. Can the bears get a strong reversal down from the July high at the top of the expanding triangle? Probably not without more sideways bars 1<sup>st</sup>.<h2><strong>Weekly S&amp;P500 Emini futures chart:</strong><br>Weak higher low buy setup in yearlong bull channel</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-weekly-chart-has-bear-flag-and-higher-low-in-bull-channel.png\"><img loading=\"lazy\" src=\"2019-9-1-3.png\" alt=\"Emini weekly chart has bear flag and higher low in bull channel\"></a></figure><p>The weekly S&amp;P500 Emini futures chart formed a bull bar this week and it closed near its high. This week is therefore a buy signal bar for next week.<p>But there are problems for the bulls. Buying with a stop above a tight trading range and just below the EMA is a low probability bet.<p>Furthermore, the August selloff from an expanding triangle top is likely to have at least a small 2nd leg down. Consequently, while this week is a buy setup, there will probably be more bears looking to sell above this week’s high than bulls looking to buy.<p>What do traders need to see to believe that the 2019 bull trend is resuming? The bulls need at least 2 consecutive big bull bars closing near their highs and above the 4 week tight trading range. More likely, a breakout above will reverse down within a couple weeks.<h2><strong>Daily S&amp;P500 Emini futures chart:</strong><br>Emini August ledge top so brief bull breakout likely</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-daily-chart-has-ledge-top-so-test-of-2750-likely.png\"><img loading=\"lazy\" src=\"2019-9-1-4.png\" alt=\"Emini daily chart has ledge top so test of 2750 likely\"></a></figure><p>The daily S&amp;P500 Emini futures chart reversed down again this week from the top of the August trading range. This is the 4th top in the trading range and all 4 tops are almost exactly at the same price. That makes this a ledge top.<p>On the 5 minute chart, the 4 or more highs in a ledge top are exactly at the same price. But the bars on the daily chart are much bigger than those on the 5 minute chart. They therefore have many more ticks in each bar. With so many possible prices for the high, it almost impossible to have 4 bars in a short period time with exactly the same high.<p>That does not mean ledges cannot exist on higher time frame charts. It only means they are not perfect. The closer they are to perfect, the more likely they will act like a ledge.<h3>Why do ledges work?</h3><p>I talked about the ledge bottom in Bitcoin a couple times over the past few weeks. I said there would be a break below 10,000, which happened this past week.<p>The Emini now has a ledge top. You might sometimes hear that a triple top always has a bull breakout. While “always” is never true, some things have high probability. A ledge top is a quadruple top. It has a higher probability of a bull breakout than a triple top.<p>The Emini keeps rallying to 2940. That has made it very easy to short there with a limit order. If something is easy, you must wonder if it is wrong. We should always assume that an institution is taking the other side of every trade that we take.<p>Why? Because they make up 95% of the volume. They are both sides of almost every trade and therefore probably the other side of your trade.<p>If it is easy for you to keep selling at 2940, then institutions are eager to buy from you at that price. Why? Because they see it as cheap, even though it is the top of the range.<p>At some point, the bears will become concerned that the Emini is not going down. If enough of them buy back their shorts, there will be a break above the ledge. The remaining bears might then cover their shorts in a panic. The result would be a bull breakout.<p>Most breakouts come back to test the breakout point. That is why traders expect a test back below the ledge top. But will the reversal down be only a test or a failed breakout and the start of a swing down?<h3>What happens after a ledge top?</h3><p>When there is a ledge top on the 5 minute chart, There is an 80% chance of a break above the ledge within 2 days. Furthermore, there is also an 80% chance of a pullback to below the top of the ledge within 20 bars after the bull breakout. At that point, the bull trend can reverse or resume.<p>How does that translate to the daily chart? Ledges are never perfect and are rare. That means there is more variation. Traders should expect a break above the top of the ledge within a couple weeks. They should then see a reversal back down below the top of the ledge within a couple weeks after the breakout.<p>The bulls hope that the pullback will be a bull flag. They want the breakout to continue up to a new all-time high.<p>The bears want the pullback to become a failed bull breakout and then a bear trend reversal. After such a strong selloff in early August, the bears still have a slightly higher probability of a break below the August low before there is a new all-time high. Consequently, traders should look for a bull breakout within a couple weeks and then a lower high that leads to a selloff to below 2800 within a couple months. A measured move down based on the 4 week trading range would be around 2700.<hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-9-1"
    }
  ],
  "3": [
    {
      "data": [
        "<article class=\"post-93007 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini August ledge top and Breakout  Mode\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini August ledge top and Breakout Mode</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-09-03T06:20:34-07:00\">September 3, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Tuesday September 3, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini on Friday sold off from the top of its 4 week trading range. It was the last day of the month and August closed above its midpoint. That is a sign of strength for the bulls.<p>Last week also closed near its high. On the weekly chart, it is a buy signal bar for this week. But stop entries in tight trading ranges are lower probability setups. Furthermore, the odds still favor another leg down after the unusually strong selloff in early August.<p>However, neither the bulls nor the bear have given up. The 4 week trading range means that the daily chart is in Breakout Mode. That means that the probability of a rally to a new high is about the same as for a selloff down to the June low.<p>With 4 tops in the trading range, there is now a variant of a ledge top. Consequently, there will probably be a break above last week’s high within a week or two. Additionally, there will likely be a reversal attempt.<p>Traders need to see consecutive bull bars closing near their highs and above the trading range before they believe the 2019 bull trend is resuming. Until then, there is a slightly greater chance of a 2nd leg down from the July high.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 16 points in the Globex session. Despite the 2 day selloff from the top of the August trading range, this is probably a minor reversal down. The ledge top on the daily chart tells us that the bulls will probably buy within a day or two. The odds favor a break above the 2944.25 ledge top this week. Therefore, there is an increased chance of a bull trend day today or tomorrow, even if there is more selling first.<p>Yesterday’s big bear breakout on the 5 minute chart was strong. It might lead to a bear channel with 3 pushes down. Less likely, it is the start of a trend down from the top of the 4 week trading range. If the bears get 2 or 3 big bear bars early today, today could be a bear trend day.<p>However, the odds favor a break above 2944.25 within a week or so. Consequently, day traders should be looking for a bottom soon that will lead to at least a 2 – 3 day rally.<h2>Friday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-gap-up-and-then-double-top-and-bear-trend.png\"><img src=\"2019-9-3.png\" alt=\"Emini gap up and then double top and bear trend\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/EURUSD-Forex-bear-breakout-at-bottom-of-bear-channel-1.png\"><img loading=\"lazy\" src=\"2019-9-3-1.png\" alt=\"EURUSD Forex bear breakout at bottom of bear channel\"></a></figure><p>The EURUSD daily Forex chart has had 7 consecutive bear trend days. Since that is unusual, it is unsustainable and climactic. The bears now have a big profit and a stop that is far above. They will begin to take some profits, especially since the chart is at the bottom of a yearlong channel.<p>While climactic, the selloff is strong. Consequently, the 1st rally will probably go only 100 – 200 pips before the bears will sell again. There are also bulls who bought below the August low. They too will sell the 1st bounce, looking to get out with a smaller loss.<p>With both bulls and bears looking to sell the 1st rally, it will likely be minor. Traders should expect a bear flag. Most bulls will want at least a micro double bottom before looking to buy for a short-covering bounce.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart sold off in the Asian session. However, it has been in a 25 pip trading range in the European session. Traders know that the daily chart is in a sell climax at support. Consequently, many bears will switch to selling rallies instead of selling at the market.<p>Also, day traders expect a 100+ pip rally over the next 2 weeks. Furthermore, the odds favor a 50 pip bounce within a couple days. Now that the chart is sideways, they are beginning to buy reversals up. Most day traders expect a small trading range for at least a couple days and will start to scalp instead of simply swing trading shorts.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-trading-range-day.png\"><img loading=\"lazy\" src=\"2019-9-3-2.png\" alt=\"Emini trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>After a brief early selloff to yesterday’s low, the Emini formed a trading range day. Today was an inside day in the middle of a 5 week trading range.<p>Today closed near the open but above its midpoint after a 2 day pullback. It is a High 1 buy signal bar for tomorrow. But since its range was small and it closed near the middle, it is a weak buy setup.<p>Because the 5 week range has a ledge top, there will probably be at least a brief bull breakout within a couple weeks. However, this pullback might have to reach the middle of the range before the bulls will buy again.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-9-3"
    }
  ],
  "4": [
    {
      "data": [
        "<article class=\"post-93167 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini in middle of August range with ledge top\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini in middle of August range with ledge top</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-09-04T06:20:56-07:00\">September 4, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Wednesday September 4, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday sold off early, but the day formed a trading range. It closed above the open after a 2 day selloff. It is therefore a buy signal bar for today. However, it was a doji day, which is a weak buy signal bar. Also, it is in the middle of its 5 week range so the context is not strong for the start of a trend.<p>But the ledge at the top of the 5 week trading range is a strong magnet above. A ledge top is 4 or more bars with almost exactly the same high. Consequently, the odds favor at least a brief bull breakout. Therefore, the odds favor higher prices over the next week.<p>It is important to remember what I have said several times over the past few weeks. Even though a move above 2944.25 is likely, there is still better than a 50% chance of a reversal down from failed breakout. Traders should still expect a move to below 2800 unless the bulls get 2 or more closes above the month-long trading range.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 26 points in the Globex session. There will probably be a big gap up. There is only a 20% chance of either a bull or bear trend from the open when there is a big gap up.<p>A big gap up typically leads to a trading range for the 1st 1 – 2 hours. The bulls will look to buy a double bottom or wedge bottom near the EMA. However, the bears want a double top or wedge top and a swing down.<p>I have been saying that traders should expect a breakout above the 2944.25 ledge top. The Emini is currently only 12 points below. Consequently, the bulls will probably get their breakout today or tomorrow.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-trading-range-day.png\"><img src=\"2019-9-4.png\" alt=\"Emini trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/EURUSD-Forex-reversal-up-from-sell-climax-at-bottom-of-channel.png\"><img loading=\"lazy\" src=\"2019-9-4-1.png\" alt=\"EURUSD Forex reversal up from sell climax at bottom of channel\"></a></figure><p>The EURUSD daily Forex chart reversed up yesterday from the bottom of a wedge bear channel that began in November 2017. Today is the entry bar and it is a big bull bar so far.<p>The bulls want this to be a climactic bull trend reversal. They hope that the selloff was simply a sell vacuum test of the bottom of the channel.<p>The reversal is similar to the August 8 bottom. The bulls are hoping that it continues, like the climactic reversal in the stock market after Christmas 2018. They need several consecutive bull trend bars to convince traders that the rally will last 3 or more weeks.<p>The bears know that, and will try to prevent 3 or more bull bars from closing near their highs. They will try to form a lower high around the EMA.<h3>Importance of the August 1 low</h3><p>The minimum goal for the bulls is to get at least 1 pip above the August 1 low of 1.1027. That is the breakout point. Bulls who bought there and scaled in lower want to exit their 1st buy there at breakeven. Many will take profits on their lower purchases there.<p>In addition, the bears know that bulls will sell there, so they might sell there as well. It is therefore a resistance zone for today and tomorrow.<p>How the chart behaves there will be an indication of what to expect over the next few weeks. The more the hesitation, the less rally will be likely.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart continued yesterday’s rally over night. It has been in a 15 pip trading range for the past 4 hours. That is not yet enough selling for day traders to short. They are continuing to buy dips.<p>The trading range means that they are now mostly scalping. The bears will initially look to sell below a strong bear reversal bar at the top. Their first trades will only be scalps. Because the selloffs have been less than 15 pips, the odds are against a pullback growing to more than 20 – 30 pips today.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-bear-trap-and-bull-trend.png\"><img loading=\"lazy\" src=\"2019-9-4-2.png\" alt=\"Emini bear trap and bull trend\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini gapped up and sold off on the open. That was a bear trap and it then trended up, but spend much of the day in tight ranges.<p>That ledge top is still a magnet just above. Traders should expect a breakout above 2944.25 within a few days and then a pullback below. The breakout will likely be at least 20 and maybe 50 points, The downside is therefore small for the next couple days.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-9-4"
    }
  ],
  "5": [
    {
      "data": [
        "<article class=\"post-93170 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini just below August ledge top magnet above\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini just below August ledge top magnet above</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-09-05T06:20:27-07:00\">September 5, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Thursday September 5, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday gapped up and rallied in a weak bull trend. I have mentioned the ledge top at the top of the 5 week trading range on the daily chart many times over the past week. There were 4 highs at almost the same price on the daily chart. When that happens, traders expect a breakout above the top. The breakout is typically fairly conspicuous. That means it would have to go at least 30 – 50 points above the high of the 5 week trading range.<p>Traders also will then expect a pullback below the top of the ledge. Consequently, both the breakout and pullback are likely over the next couple weeks.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 27 points in the Globex session. It will therefore gap above yesterday’s high and probably above the top of the 5 week trading range.<p>It is important to note that there will probably be a pullback below the top of the ledge within a couple weeks. The bears hope that the reversal down to below the top of the ledge will begin a trend to below the 4 week trading range. They currently still have a 50% chance.<p>The higher the Emini goes, the more likely the rally will make a new high before falling below 2800. However, at the moment, there is still a 50% chance that this rally will form a lower high.<p>A big gap up has only a 20% chance of a big trend up or down from the open. Traders expect an opening 1 – 2 hour trading range. The bulls will look for a wedge bottom or double bottom to buy for a swing up. The bears want to sell a double top or wedge rally for a swing down.<p>Finally, if there is a trend after a trading range open, it is usually not a strong trend. Traders will expect some trading range price action later in the day.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-bear-trap-and-bull-trend.png\"><img src=\"2019-9-5.png\" alt=\"Emini bear trap and bull trend\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/EURUSD-Forex-reversal-up-in-bear-channel-after-Brexit-vote.png\"><img loading=\"lazy\" src=\"2019-9-5-1.png\" alt=\"EURUSD Forex reversal up in bear channel after Brexit vote\"></a></figure><p>The EURUSD daily Forex chart reversed up this week from the bottom of the 22 month bear channel. That reversal up was also from the bottom of a bear channel that began in June.<p>Bear channels have many reversals up and down, but continue to form lower highs and lows. There is no sign that this rally will be any different from the many other strong rallies over the past 22 months.<p>The bulls will take profits after 2 – 3 weeks around a lower high. The targets are the August 6 and 26 lower highs. That is also where the bears will look to reestablish their shorts.<p>Until there is a breakout with follow-through above the channel and above major lower highs, like the June high, the bear trend is intact.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart continued its 3 day rally overnight. The EURUSD is now testing the EMA and the August 1 low, which is the breakout point for last week’s selloff.<p>Since the biggest pullback was only 15 pips, day traders have been only looking to buy. The selloff over the past 30 minutes had 4 consecutive bear bars with 3 closing on their lows.<p>While the drop was only 15 pips, it indicates sustained profit taking. That is the 1st step toward a more 2 sided market. Consequently, the bears will begin to sell reversals for scalps.<p>Furthermore, the bulls will begin to take quicker profits. Also, they will become more selective about their entries. They will tend to buy pullbacks instead of simply at the market. This change in behavior typically will convert a strong bull trend into a trading range.<p>If the bears can stop the rally and begin a trading range, they will have a better chance of getting a reversal down from resistance later today. However, the overnight bull channel was tight. Consequently, the best the bears probably will get today is a trading range and not a trend reversal down.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-parabolic-wedge-buy-climax-above-ledge-top-at-neckline-of-double-top.png\"><img loading=\"lazy\" src=\"2019-9-5-2.png\" alt=\"Emini parabolic wedge buy climax above ledge top at neckline of double top\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini gapped above the August ledge top. There was a bull trend from the open that broke above the July 18 neck line of the double top on the daily chart. The rally was a parabolic wedge buy climax and the day evolved into a trading range day. It closed near that neck line.<p>Tomorrow might also have a lot of trading range price action. Traders are deciding if the breakout will succeed or fail. That confusion often leads to more sideways trading.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-9-5"
    }
  ],
  "6": [
    {
      "data": [
        "<article class=\"post-93173 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini breakout above August ledge top\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini breakout above August ledge top</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-09-06T06:20:41-07:00\">September 6, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Friday September 6, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini broke above the top of the 5 week trading range yesterday. I have been saying that a bull breakout was highly likely because of the ledge top. Furthermore, I said that the breakout would be big enough for traders to wonder if the bull trend is resuming. I thought that 30 – 50 points was a reasonable minimum goal. However, there will also probably be a pullback below the top of the ledge within a couple weeks.<p>Yesterday rallied strongly on the open and then entered a trading range. It spent a lot of time around the July 18 neck line of the double top on the daily chart. That might be a magnet for another day or two.<p>When there is a big gap up, the Emini often goes sideways for a few days before deciding if the breakout will continue or reverse. Because traders are deciding, the odds favor more trading range trading today.<h3>Weekly support and resistance</h3><p>Today is Friday so weekly support and resistance can be important. The most important price is the 2944.25 top of the ledge. However, the bulls will probably hold today above that level. In addition, they want the week to close on the high. The bears always want the opposite. There is often a move toward or away from weekly support or resistance in the final hour of the week.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 10 points in the Globex session. It will gap far above yesterday’s close and it might gap above yesterday’s high. The 3,000 Big Round Number is a magnet just above.<p>However, the Emini often goes sideways for a few days after a big gap out of a trading range. Also, the 5 week ledge top is a magnet below. That might limit the upside over the next few days.<p>Finally yesterday was a trading range day. These factors reduce the odds of a big trend day up or down today.<p>But even if today is another trading range day, the daily ranges have been big lately. As a result, the legs up and down will be big enough for swing trading.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-parabolic-wedge-buy-climax-above-ledge-top-at-neckline-of-double-top.png\"><img src=\"2019-9-6.png\" alt=\"Emini parabolic wedge buy climax above ledge top at neckline of double top\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/EURUSD-Forex-test-of-EMA-and-50-pullback-in-bear-channel.png\"><img loading=\"lazy\" src=\"2019-9-6-1.png\" alt=\"EURUSD Forex test of EMA and 50% pullback in bear channel\"></a></figure><p>The EURUSD daily Forex chart rallied for 3 days from a test of the bottom of 2 bear channels. However, yesterday’s candlestick had a big tail on the top and its high was at the resistance of the EMA. In addition, it was around a 50% pullback from last week’s selloff. The bears want the rally to be simply another lower high in the 2 bear channels. One began 22 months ago and the other started with the June 18 low.<p>The bulls are hoping that yesterday is just a pause in a reversal up. But the 3 day rally had only one strong bull trend day. Also, it followed 6 bear days. It is therefore more likely a minor reversal than the start of a big move up.<p>However, the move up was big enough to generate confusion. When there is confusion, the chart usually has to go sideways for 2 – 3 days before one side takes control.<h3>Overnight EURUSD Forex trading</h3><p>Today’s low is above yesterday’s low and its high is below yesterday’s high. It is therefore an in inside day, which is neutral. Furthermore, yesterday was a doji bar and today so far is a doji day. A doji is a sign of a balanced market.<p>Today is Friday and weekly support and resistance can be important. The bulls want this week’s candlestick to be a strong bull reversal bar on the weekly chart. Therefore, the would like today to close near yesterday’s high, which is the high of the week.<p>The bears at a minimum want no bull body on the weekly candlestick. They will try to get today to close below the 1.0993 open of the week. That might be too far below. As an alternative, they want as small a bull body as possible on the weekly chart.<p>The 5 minute chart has been in a 30 pip range overnight. Day traders therefor have been looking for quick profits. There is no sign that this is about to change. But day traders should watch for moves toward the week’s open or high late in the US session.<p><a href=\"https://www.brookstradingcourse.com/market-update/emini-breakout-above-august-ledge-top/\">View Post</a><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-trading-range-day-2.png\"><img loading=\"lazy\" src=\"2019-9-6-2.png\" alt=\"Emini trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini formed a 2nd trading range day after yesterday’s break above a ledge top. There will probably be a pullback below the ledge top within a couple weeks. The bears want it to grow into a bear trend. However, the bulls hope that it will be a bull flag.<p>Whenever there is a gap above major resistance, there is an increased chance of a gap down. If there is a gap down next week, there would be an island top.<p>It is important to understand that island tops and bottoms are minor reversal patterns. Most do not lead to trends. Because the August selloff was so strong, an island top in this case would have a better chance of starting a swing down to below the bottom of the range.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-9-6"
    }
  ],
  "7": [
    {
      "data": [
        "<article class=\"post-93234 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini breakout above August ledge top might fail\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini breakout above August ledge top might fail</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-09-07T00:30:42-07:00\">September 7, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Market Overview: Weekend Market Update</h2><p>The<strong>Emini</strong>broke above the top of a ledge on the weekly chart. There is a 50% chance that the breakout will fail.<p>The 30 year treasury<strong>bond futures</strong>have a weak breakout above the 2016 wedge top. The odds favor a month or two of sideways trading.<p>The<strong>EURUSD</strong>weekly chart reversed up from the bottom of a 22 month bear channel this week. However, there is also a 12 week bear channel and it is tight. This makes only a minor reversal up likely.<h2><strong>30 year Treasury Bond Futures market:</strong><br>Strong rally up to 2016 high</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/30-year-treasury-bond-futures-in-buy-climax-and-breakout-about-nested-wedge-top.png\"><img loading=\"lazy\" src=\"2019-9-7.png\" alt=\"30 year treasury bond futures in buy climax and breakout about nested wedge top\"></a></figure><p>The 30 year treasury bond futures monthly chart has been in a strong bull trend over the past year. The August rally broke slightly above the 2016 wedge top and all-time high.<p>In general, when there is a breakout above a wedge top, there is a 50% chance of a measured move up and a 50% chance of a reversal down. But a nested wedge top is a reliable pattern. Therefore, there is only a 40% chance of a strong break above the 2016 high, and a much smaller chance of a measured move up. Traders should expect a reversal down within the next 5 months.<p>Most tops are not abrupt. There will typically be at least a micro double top, like in January 2015, or 3 consecutive bear bars, like after the July 2016 high. That means there is not much downside risk for several months.<h3>Zero interest rates are unlikely</h3><p>TV pundits are confidently saying that the interest rate will fall to zero, like it has in so many other wealthy countries. While statements like this get a purported expert some time on TV, his lemming logic is foolish. Lots of things sound good on TV, but if you take a minute to think about them, there is often no logical basis for the statement.<p>This is an example. I am not saying that a negative interest rate is impossible for US treasuries. I am only saying that there is no rational basis for that conclusion. In fact, the monthly 30 year treasury bond chart tells a different story.<h3>Breakout above 9 year wedge top</h3><p>For over 5 years, I have been saying that the monthly chart rally would continue up to form to a nested wedge top. I carefully chose my words. I repeatedly said that the high would be final high or near the final high for the next 20 years.<p>That is still the case. The 2019 rally broke above the 2016 top of the 2008 – 2016 wedge in August. This breakout might continue up for another 10% and last for a year or more. But the odds are that the breakout will ultimately fail. A reversal down would be a failed breakout above a wedge, and the implication is the same as for a wedge top.<p>The wedge rally began with the December 2008 high and has now lasted 11 years. Once there is a reversal, the bear trend will last at least 10 years and probably 20 years. That means interest rates will soon begin to trend higher for a long time.<p>But as climatic as the August bar was, there is no top yet. Even if September ends up as the final high, the chart will likely have to go sideways for several bars (months) before there is at least a micro double top. That is the minimum traders want to see before they will bet on a reversal down. Even though September is typically not good for bonds, there is not much downside risk for the next couple months.<h2><strong>EURUSD weekly Forex chart:</strong><br>Sell climax reversing up from bottom of 22 month bear channel</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/EURUSD-weekly-Forex-chart-at-bottom-of-bear-channel-with-measured-move-targets-below.png\"><img loading=\"lazy\" src=\"2019-9-7-1.png\" alt=\"EURUSD weekly Forex chart at bottom of bear channel with measured move targets below\"></a></figure><p>The EURUSD weekly Forex chart formed a bull reversal bar this week. The low poked below the bottom of the bear channel that began 22 months ago in November 2017. It was also a reversal up from the bear channel that began on June 25.<p>While this week’s candlestick had a bull body, it was small. A doji bar like this is a weak buy signal. This is especially true in a tight bear channel, like the one down from the June 25 high. A rally from a weak setup typically is minor. That means that a bear flag or a bull leg in the bear channel is more likely than a bull trend.<p>For the past year in the bear channel, every strong rally reversed down from a lower high after a few weeks. In addition, every strong selloff reversed up within a week or two of making a new low.<p>Price action does not remain constant forever. A year in a tight bear channel is unusual. Consequently, traders expect change soon.<h3>A bear channel is a bull flag</h3><p>A bear channel behaves like a bull flag 75% of the time. Traders expect a break above the channel and the end of the bear trend. When a bear trend ends, there is usually then a trading range that can last many bars. Less often, a bear trend immediately reverses into a bull trend.<p>In 25% of bear channels, there is a successful bear breakout below the bear channel and an acceleration down. In 75% of cases when there is a break below the bear channel, the selloff reverses up within 5 bars. When it does, the rally then usually breaks above the bear channel and the channel transitions into a trading range or bull trend.<p>There is currently no evidence of a breakout above or below the bear channel. As a result, traders will continue to look for reversals every few weeks.<p>It is important to note that there are magnets below. Two bear flags have measured move projections to just above 1.08. Also, the bottom of the April 2, 2017 gap is just below 1.08. Most gaps get filled, especially if the market gets close. Many traders will not trust a reversal up until after these targets have been reached.<h2><strong>Monthly S&amp;P500 Emini futures chart:</strong><br>Pullback from breakout above oo buy setup (consecutive outside bars)</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-monthly-candlestick-chart-forming-High-1-bull-flag.png\"><img loading=\"lazy\" src=\"2019-9-7-2.png\" alt=\"Emini monthly candlestick chart forming High 1 bull flag\"></a></figure><p>The monthly S&amp;P500 Emini futures chart&nbsp;has a bull inside bar so far in September. I have talked about the oo buy setup since June went above the May high. May was an outside down month and June was outside up. They therefore formed consecutive outside bars in a bull trend.<p>That is a bull flag. Once July went above the June high, there was a 60% chance that the next 3 months would be sideways to up. September is the 3rd month and the Emini is back at the June high. That was the entry price for the bulls. Consequently, there have been 3 sideways months since the June oo buy signal. That is the minimum objective for the bulls.<p>Where does the Emini go from here? An oo pattern is an expanding triangle on a lower time frame chart. A triangle is an area of agreement. If the Emini goes above or below, it tends to get drawn back into the triangle. Therefore, a rally from here might only last a few months before it gets pulled back into the triangle.<h3>Emini has expanding triangle top (also called a megaphone or bull horn pattern)</h3><p>I have mentioned many times over the past 4 months that the monthly chart has a bigger expanding triangle that began with the January 2018 high. It might be easier to see on the weekly chart.<p>An expanding triangle means that the Emini keeps making new highs and lows, but each one soon reverses. As a result, the Emini monthly chart has a 40% chance of a reversal down to the bottom of the triangle at the December low.<p>But when? The bulls might continue the rally for a few more months. Any more than that would probably mean that the triangle is no longer significant.<p>July was the sell signal bar. But it was a small doji. That typically is not strong enough to reverse a strong bull trend. Most traders will want to see a 2nd sell signal.<p>For example, October or November might become a sell signal bar for a micro double top or a wedge top. If October or November goes above July and reverses, it would be the 3rd leg up from December. The 1st 2 legs were the May and the July highs. If the month is a big bear bar closing near its low, traders would see that as a much more reliable sell signal.<h2><strong>Weekly S&amp;P500 Emini futures chart:</strong><br>Emini breakout above August ledge top might fail</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-weekly-candlestick-chart-forming-strong-breakout-above-ledge-top.png\"><img loading=\"lazy\" src=\"2019-9-7-3.png\" alt=\"Emini weekly candlestick chart forming strong breakout above ledge top\"></a></figure><p>The weekly S&amp;P500 Emini futures chart had been in a tight trading range for 4 weeks prior to this week’s bull breakout. The reason I said that a bull breakout was likely this week is that the trading range had a ledge top.<p>On a 5 minute Emini chart, a ledge top is 4 or more bars in a tight trading range with exactly the same high. On higher time frame charts, you will never see a perfect ledge. But markets are fractal. That means all time-frames behave the same. Consequently, ledges on daily and weekly charts behave like those on the 5 minute chart, even though the highs are not identical.<h3>What happens after a ledge top?</h3><p>The closer a ledge is to perfect, the more it will behave like a ledge. The ledge top of the weekly chart is the most perfect one in many years. On a 5 minute chart, there is an 80% chance of a breakout above the ledge.<p>Furthermore, there is then an 80% chance of a pullback below the top of the ledge. It typically comes within 20 bars, but sometimes not for 100 bars. That pullback sometimes grows into a bear trend.<p>On the weekly chart, it is impossible to accurately assess the probabilities because ledges are so rare. There is not enough data to calculate reliable statistics. But traders should assume that the odds of the bull breakout and the pullback are still very high.<p>The bulls got their breakout this week. There will probably be a pullback below the top of the ledge within a few weeks. It could come this week.<p>If the reversal down is strong, the odds will again shift in favor of a break below the 5 week trading range and below 2800. If the reversal down is weak, it will probably form a bull flag. Traders will then look for a new all-time high within a month or two.<p>But even if the bears get their reversal down, traders will buy a test of either 2800 or 2700. The monthly chart is still bullish enough to make at least one more new all-time high likely this year, even if there is a selloff to 2700 first.<h2><strong>Daily S&amp;P500 Emini futures chart:</strong><br>Questionable breakout above 5 week trading range</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-daily-candlestick-chart-has-breakout-above-ledge-top.png\"><img loading=\"lazy\" src=\"2019-9-7-4.png\" alt=\"Emini daily candlestick chart has breakout above ledge top\"></a></figure><p>The daily S&amp;P500 Emini futures chart gapped above the top of a 5 week trading range on Thursday. However, the Emini did not form a pair of big bull trend bars closing on their highs. Traders sense that the breakout is not as strong as it could be.<p>Compare it to the June break above the May bear channel. There were many bull bars closing above their midpoints or near their highs. That led to a strong 2 month rally.<p>In addition to the lack of big bull bars, there are other problems that reduce the chance of a successful breakout. I mentioned earlier that a break above a ledge top typically soon has a reversal down back below the ledge top. Therefore, even if this breakout continues for a week or two, there will probably be a pullback to below the 2944.25 top of the 5 week trading range.<p>Also, a trading range is a magnet. It is an area of agreement and it resists breaking out. In general, there is a 50% chance that the 1st strong breakout above a trading range will fail. For example, a gap down next week would create an island top. While an island top typically is a minor sell signal, in the current context, it could lead to a 2nd leg down to 2700 – 2800.<p>The monthly and weekly charts have an expanding triangle top. That makes many bulls hesitant to buy near the high.<p>It is important to remember how strong the August selloff was. A selloff that strong usually has as least a small 2nd leg sideways to down. Sometimes there is a strong rally after the 1st leg down, but that rally then reverses down from a lower high and leads to a 2nd leg down.<h3>Testing the July 18 neckline of the double top</h3><p>On the 5 minute chart, both Thursday and Friday oscillated around the July 18 low of 2975.75. That is the neckline of the July 15 and July 26 double top. If the Emini sells off next week, then the rally from the August low would simply be a breakout test of that low.<h3>The bulls need buying pressure</h3><p>What do the bulls need to increase the probability of a successful breakout and a rally to a new all-time high? They need buying pressure, which means a sign that the bulls are more aggressive than the bears. That can be one or more big bull bars closing near their highs, several small bull bars, or a small pullback bull trend in a tight bull channel.<p>At the moment, the bulls have none of this. Until they can demonstrate more strength, traders will assume that this breakout has a 50% chance of forming a lower high and reversing down to 2700 – 2800.<hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-9-7"
    }
  ],
  "9": [
    {
      "data": [
        "<article class=\"post-93176 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini breakout above August ledge top needs follow through buying\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini breakout above August ledge top needs follow through buying</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-09-09T06:20:16-07:00\">September 9, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Monday September 9, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini gapped above the month-long trading range on Thursday. But Thursday and Friday were trading range days. The bulls did not get strong follow-through buying and the bears do not yet have a reversal down.<p>There is still a 50% chance that the breakout will reverse down before the Emini rallies to a new high. There is at least a 60% chance of a pullback below the top of the ledge within a couple weeks.<p>If the Emini gaps down any day this week, there will be an island top with Thursday’s gap up. Island tops are minor reversal patterns. However, the context is good for the bears. If there is a gap down, there is an increased chance of a selloff that could last several weeks.<p>Traders know that the Emini could continue up or reverse down. They are waiting for more information. Until there is follow-through buying or a strong reversal down, the Emini will remain neutral on the daily chart.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 10 points in the Globex session. The bulls want today to close above the 3,000 Big Round Number. That is psychological resistance. If they succeed, the Emini will then probably test the all-time high this week.<p>However, as strong as the September rally has been, there is still only a 50% chance that this rally will lead to a strong break above the old high. Until there is a breakout, there is no breakout.<p>The past 2 days were trading range days in a 2 week bull trend. Markets tend to continue what they have been doing. Consequently, there is an increased chance of more trading range price action today. This is true even if the bulls break above the 3,000 resistance level. It is common for a market to break through support or resistance and then oscillate around that magnet for a few days.<p>Day traders know that the Emini is at resistance. As a result, there is an increased chance of an unusually big trend day up or down. But they will continue to expect trading range price action and reversals until they see a strong breakout up or down.<h2>Friday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-trading-range-day-2.png\"><img src=\"2019-9-9.png\" alt=\"Emini trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/EURUSD-Forex-weak-reversal-up-in-bear-channel-so-bear-flag-at-EMA.png\"><img loading=\"lazy\" src=\"2019-9-9-1.png\" alt=\"\"></a></figure><p>The EURUSD daily Forex chart sold off in 3 legs since the July 25 high and reversed up from the bottom of 2 bear channels last week. The wedge bottom reversed up, but the rally had only one big bull bar closing on its high and it stalled at the 20 day EMA.<p>So far, this is a weak reversal. The bears see it as a bear flag. But it is strong enough so that the bulls will probably get at least a small 2nd leg up this week. If that 2nd leg stalls after a day or two, then the 2 week rally will probably be a bear flag. The result would likely be a new low within a few weeks.<p>Alternatively, the 2nd leg might have 2 or 3 big bull bars closing near their highs. If so, the rally will then test the August 26 or even the August 6 highs. That would increase the chance of the bulls converting the bear channel into a trading range for a few months, like after the November and April lows.<h3>Overnight EURUSD Forex trading</h3><p>Last week was a doji bar on the weekly chart and today so far is the 3rd consecutive doji bar on the daily chart. The overnight range has only been 27 pips. This is a 3 day trading range. While the odds favor at least a small bull breakout and 2nd leg up, the bears might first get one more day down.<p>After 3 trading range days, day traders will expect more trading range price action today. So far, they have been looking for reversals to scalp for 10 pips. But there is a slight bullish bias over the next few days after last week’s reversal up from a wedge bottom at the bottom of 2 bear channels.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-breakout-mode-open-and-then-sell-climax-and-trending-trading-range-day.png\"><img loading=\"lazy\" src=\"2019-9-9-2.png\" alt=\"Emini breakout mode open and then sell climax and trending trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini reversed down from above Friday’s high and broke below Friday’s low. Today was therefore an outside down day. A gap down this week would form an island top with Thursday’s gap up. There is a 50% chance that last week’s bull breakout will fail.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-9-9"
    }
  ],
  "10": [
    {
      "data": [
        "<article class=\"post-93362 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini outside down after gap up so possible island top\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini outside down after gap up so possible island top</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-09-10T06:20:31-07:00\">September 10, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><p>I will update again at the end of the day.<h2>Emini and Forex Trading Update:<br>Tuesday September 10, 2019</h2><h2>Pre-Open market analysis</h2><p>Yesterday reversed down from above Friday’s high and then up from below Friday’s low. It was therefore an outside down day. Furthermore, it again tested the July 18 low, which was the neckline of a double top on the daily chart. Also, it was an important magnet on Thursday and Friday.<p>Traders are still deciding if the June/July bull trend is resuming. Unless there is a breakout to a new all-time high, there is a 50% chance that this rally will form a lower high. The target for the bears is the bottom of the August trading range and down to the June low around 2700.<p>I mentioned last week that there is an increased chance of an island top this week because of the uncertainty surrounding the breakout. Any gap down this week would create an island top with Thursday’s gap up. Most island tops and bottoms are minor reversal patterns. But the context in this case increases the chance of a possible swing down.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 5 points in the Globex session. It therefore might gap below yesterday’s low. If it does, there will be a 3 day island top on the daily chart.<p>However, if the gap is small, it will probably close in the 1st hour. But, if there is a gap down and an early strong selloff, today could be the start of a swing down for several weeks.<p>More likely, the 3 week rally will 1st test 3,000 before the bulls will give up. After 3 trading range days, traders will expect another trading range day today. They will switch to swing trading if there is another strong breakout up or down, like they did for 40 minutes yesterday.<p>Since the bulls have been in control for 3 weeks, they will try to continue the rally to above 3,000. They would like today to be a buy signal bar for tomorrow. They will try to get today to close near its high. For example, if today is a bull inside day closing near its high, today will be a bull ioi buy signal bar on the daily chart for tomorrow.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-breakout-mode-open-and-then-sell-climax-and-trending-trading-range-day.png\"><img src=\"2019-9-10.png\" alt=\"Emini breakout mode open and then sell climax and trending trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/EURUSD-Forex-bear-flag-at-EMA-and-minor-bull-trend-reversal.png\"><img loading=\"lazy\" src=\"2019-9-10-1.png\" alt=\"EURUSD Forex bear flag at EMA and minor bull trend reversal\"></a></figure><p>The EURUSD daily Forex chart has been sideways for 4 days just below the EMA. It reversed up for 3 days last week from the bottom of 2 bear channels.<p>The rally had only one big bull bar closing near its high. It was strong enough for traders to expect at least a small 2nd leg sideways to up. Yesterday met that minimum goal. Consequently, the bears will be more willing to sell again.<p>There is now a micro double top. The bears see the rally as a bear flag at the EMA. If today has a bear body, today will be a sell signal bar for a micro double top and bear flag at the EMA. A big bear body and a close near the low of the day today will make more bears willing to sell tomorrow below today’s low.<p>The bulls know that, and they therefore will try to prevent today from closing on its low. Furthermore, they want today to close on its high and above the EMA. If they achieve their goal, traders will believe that the 2nd leg up from last week’s rally will reach the August 26 lower high.<p>Since the rally only had one strong bull bar, it is more likely that there will be a test back down within a few days. The bulls will then try again to get a 2nd leg up, but from a higher low.<p>The bears want a reversal down to a below the September low. Traders should expect a test down to a higher low within a few days and then another attempt at a 2nd leg up.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart so far has only had a 30 pip range overnight. It is also an inside bar and the 4th day in a tight trading range. Day traders have been scalping for 4 days as they wait for a breakout up or down. A downside breakout is slightly more likely, but it would probably form a higher low on the daily chart around the September 3 reversal bar’s high.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-sell-climax-and-bull-trend-reversal.png\"><img loading=\"lazy\" src=\"2019-9-10-2.png\" alt=\"Emini sell climax and bull trend reversal\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini had a sell climax on the open. It rallied from a higher low major trend reversal. Once it got to the July 18 low, it reversed back down from a wedge top. At the end of the day, it rallied again from a wedge bull flag. Today was a bull bar on the daily chart and it is therefore a High 1 bull flag buy signal bar for tomorrow.<p>However, today was the 4th consecutive trading range day after last week’s gap up. There will probably be a pullback to below the wedge top on the daily and weekly charts within a week.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-9-10"
    }
  ],
  "11": [
    {
      "data": [
        "<article class=\"post-93364 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini testing August ledge top and might form island top\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini testing August ledge top and might form island top</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-09-11T06:20:18-07:00\">September 11, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Wednesday September 11, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday pulled back but closed on its high in a bull trend on the daily chart. It is therefore a High 1 bull flag buy signal bar for today.<p>But, yesterday was the 4th sideways day after last week’s gap up. Also, the ledge top on the daily and weekly charts is a magnet below. Any gap down this week will create an island top on the daily chart. What is not clear is whether the Emini will test down to below the top of the ledge or go directly up to a new all-time high. The probability for each outcome is 50%.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 3 points in the Globex session. Traders are still deciding if last week’s breakout will succeed or fail. Yesterday’s late reversal up helps the bulls, but they need more.<p>The past 4 days have been trading range days. Traders will expect the trading range price action to continue again today.<p>However, since the daily chart is in Breakout Mode, day traders are ready to swing trade up or down. They know that the odds of a big trend day up or down are increasing.<p>It will probably begin early in the day. Day traders will therefore look for a strong buy or sell signal and a strong early breakout up or down. If they see that, they will swing trade, betting on a strong trend day.<p>But if the open is unclear for an hour or more, as has been the case for 4 days, they will expect another trading range day.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-sell-climax-and-bull-trend-reversal.png\"><img src=\"2019-9-11.png\" alt=\"Emini sell climax and bull trend reversal\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image size-full\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/EURUSD-Forex-bear-flag-in-bear-channel.png\"><img loading=\"lazy\" src=\"2019-9-11-1.png\" alt=\"EURUSD Forex bear flag in bear channel\"></a></figure><p>The EURUSD daily Forex chart formed a micro double top at the EMA after a brief reversal up from the bottom of its bear channel. I said that it was likely to test back down to retrace at least half of the rally. The overnight selloff has accomplished this minimum objective.<p>Traders are still not sure if the rally was a bear flag or the 1st leg up in a 2 legged reversal. They will get information over the next few days that will help them decide. If today’s selloff continues for 2 – 3 days, the odds will favor a new low. But if tomorrow forms a reversal day, traders will expect a 2nd leg up to the August 26 lower high.<p>Every bottom attempt for the past year failed. As a result, traders expect every 2 – 3 week rally to form a lower high and then lead to another new low.<h3>Overnight EURUSD Forex trading</h3><p>I said yesterday that the bears had a micro double top at the EMA on the daily chart and that there would probably be a test of the September 3 buy signal bar high. The 5 minute chart has been selling off in a tight bear channel overnight and it is near that target.<p>When a selloff is in a tight bear channel, day traders will only sell. They sell for scalps or swings. Since the selloff is near the support of the September 3 buy signal bar high, there is probably not much left to the bear trend today. Consequently, the bears will begin to take some profits. In addition, they will switch from selling at the market to selling 20 – 30 pip bounces. This should convert the tight bear channel into a trading range.<p>Once the bulls believe the chart is beginning to enter a trading range, they will look to buy reversals up for 10 pip scalps.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image size-large\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-small-pullbck-bull-trend.png\"><img loading=\"lazy\" src=\"2019-9-11-2.png\" alt=\"Emini small pullbck bull trend\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini rallied in a Small Pullback Bull Trend today. After a 2 hour pullback, the bulls got trend resumption up and a new high. The Emini closed above the 3000 Big Round Number, which increases the chance of a new all-time high in the next couple weeks.<p>If tomorrow is a strong bull day, there will probably be a new high within days. But since today was a buy climax, there is only a 25% chance of a big bull day tomorrow. Furthermore, there is a 75% chance of at least a couple hours of sideways to down trading that begins by the end of the 2nd hour.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-9-11"
    }
  ],
  "12": [
    {
      "data": [
        "<article class=\"post-93366 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini lower high but closed above 3000 Big Round Number\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini lower high but closed above 3000 Big Round Number</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-09-12T06:20:24-07:00\">September 12, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Thursday September 12, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday was a Small Pullback Bull trend. It broke above the 4 day tight trading range and closed above the 3,000 Big Round Number. The Emini will probably make a new high within a couple weeks and possibly today. The bears need a strong reversal down this week to turn the Emini back to neutral.<p>Since yesterday was a buy climax, there is a 75% chance of at least a couple hours of sideways to down trading today that begins by the end of the 2nd hour.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 7 points in the Globex session. It pulled back from an overnight break above the August high. There is typically selling around a prior high, like the August high and the July all-time high. The bulls who bought around those highs are relieved to be able to exit around breakeven, and many sell out of their longs. Consequently, the Emini might go sideways for a day or two around the July all-time high.<p>Because yesterday was a buy climax, day traders expect some exhaustion. That means trading range trading. Exhausted bulls start to look to buy pullbacks instead of at the market. Once pullbacks begin, the bears sell reversals down for scalps.<p>Can today be a big trend day? The bulls are exhausted and the chart is near resistance. That reduces the chance of a big bull day. The bull channel yesterday was tight and that makes a strong bear day less likely. Today will probably have a lot of trading range price action.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-small-pullbck-bull-trend.png\"><img src=\"2019-9-12.png\" alt=\"Small pullback bull trend\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/EURUSD-Forex-weak-breakout-below-bear-flag-at-EMA.png\"><img loading=\"lazy\" src=\"2019-9-12-1.png\" alt=\"EURUSD Forex weak breakout below bear flag at EMA\"></a></figure><p>The EURUSD daily Forex chart sold off for the past 2 days from a bear flag at the EMA in a bear channel. But yesterday’s bear bar had a prominent tail below. Also, today’s has a big tail above and the body is not exceptionally big. This is not yet a strong selloff and traders are wondering if there will be a 2nd leg up after last week’s bull trend reversal.<p>Whether or not there is a 2nd leg up, there is no sign that the yearlong bear channel is about to end. Traders continue to expect lower highs and lows. The best the bulls can probably do is to test the August lower highs.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD fell 100 pips in the past hour. It is now again testing the bottom of the yearlong bear channel. In addition, it is testing the September 3 buy signal bar high. Traders need to see follow-through selling over the next hour to know if this bear breakout is the start of a bear trend day or just a sell vacuum test of support.<p>The 5 minute chart has been sideways for 6 bars and the bars are small. The bears are hoping that this is a brief bear flag and that the chart will continue down in a bear trend for the rest of the day.<p>However, the bulls want the chart to stop going down. They then want relentless profit-taking today. That would create a bull channel on the 5 minute chart and reverse most of this morning’s selling.<p>Currently, there is a 50% chance of either outcome. Day traders need to see more bars. If there is either a channel up or down, they will swing trade. But if the 5 minute chart enters a trading range, they will scalp.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-trading-range-day-4.png\"><img loading=\"lazy\" src=\"2019-9-12-2.png\" alt=\"Emini trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini had several legs up and down today and formed a trading range day. It got to within 8 points of the July all-time high. The odds favor a new high within a week. It might come tomorrow.<p>The bears see the 3 week rally as a wedge on the daily chart. Also, the ledge top on the weekly chart is a magnet below. But today had a bull body and it is therefore not a reliable sell signal bar. Consequently, the downside risk over the next few days is not great.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-9-12"
    }
  ],
  "13": [
    {
      "data": [
        "<article class=\"post-93368 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini wedge rally testing July all time high\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini wedge rally testing July all time high</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-09-13T06:20:36-07:00\">September 13, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Friday September 13, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday again gapped up, sold off, and reversed up from near the EMA. But, as was likely, yesterday was a trading range day. The bulls are trying to get a new all-time high this week. However, the 3 week rally is extreme. Consequently, there might be a pullback before the new high.<p>The 3 week rally has had 3 pushes up in a tight bull channel. It is therefore a wedge. But there is no reversal yet. Also, the bears will probably need at least a micro double top before they can get a reversal down. Therefore, the downside risk over the next few days is not great.<p>Today is Friday so weekly support and resistance can be important. This is especially true in the final hour. The all-time high is the most important price. If the bears get a selloff, then the 3000 Big Round Number and the open of the week would be magnets below.<h3>Testing July all-time high</h3><p>Even though the 3 week rally has been strong, there is typically hesitation at a prior high. This is because some of the bulls who bought at the high in June were very disappointed by the August selloff. This rally is making them whole. Many will sell out of their longs and wait to buy after a strong break to a new high or after a pullback. Other bulls who bought wisely at the August low will take profits at the old high, just in case there is a reversal from a double top.<p>It is impossible to know in advance if there will be enough bulls selling up here to create a 2 – 5 day pullback. However, 5 of the past 6 days had mostly trading range price action. That is a sign of hesitation and it increases the chance of more sideways price action around the July all-time high. This is especially true when the rally is in a wedge, like this one has been.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 9 points in the Globex session. Everyone knows that the obvious magnet is the all-time high, which is about 6 points above the Globex high. The bulls would like a breakout and a weekly close above the 3031.25 all-time high today. Traders would see that as a sign of strength. It would therefore increase the chance of higher prices over the next several weeks.<p>Since 5 of the past 6 days were trading range days and the Emini is at major resistance, the odds favor a trading range day today. However, there is a slightly increased chance of either a huge breakout above resistance or a big reversal down.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-trading-range-day-4.png\"><img src=\"2019-9-13.png\" alt=\"Emini trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/EURUSD-Forex-double-bottom-and-outside-up-day.png\"><img loading=\"lazy\" src=\"2019-9-13-1.png\" alt=\"EURUSD Forex double bottom and outside up day\"></a></figure><p>The EURUSD daily Forex chart formed a huge outside up day yesterday. It was a double bottom with last week’s low and a 2nd test of the bottom of the yearlong bear channel. It was strong enough to make sideways to up trading likely over the next week.<p>When there is a big outside up bar, the stop is below its low. That means the risk is relatively big for the bulls. Also, its high is at the top of a 2 week trading range. Therefore, the probability is lower since traders prefer to buy below the top of a trading range.<p>When the risk/reward is low and the probability is low, many bulls will wait to buy a pullback. That increases the chance of a 50 – 100 pip pullback before the rally will continue.<p>Also, the rally is at the top of the June bear channel and not far above the EMA. While the odds favor higher prices next week, the bulls need a close at least 30 pips above last week’s high to increase the chance of a quick move up to the August 6 high. If today stalls, then there will probably be a 2 – 3 day pullback before the resumption up.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart rallied early in the European session up to the bear trend line. It has been in a trading range since.<p>The selloff from the trend line was big enough to create a Big Up, Big Down, Big Confusion pattern. Confusion is a hallmark of a trading range. Consequently, traders will expect trading range price action in the US session. They will look for 10 – 20 pip scalps from reversals up and down.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-bear-channel-at-all-time-high.png\"><img loading=\"lazy\" src=\"2019-9-13-2.png\" alt=\"Emini bear channel at all time high\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>Today was mostly another trading range day, but it also was a bear channel. It was a bear inside day and it is now a sell signal bar for Monday. The 3 week rally has had 3 legs up and it therefore will probably have a minor reversal early next week. But the odds still favor a new all-time high within a couple weeks.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-9-13"
    }
  ],
  "14": [
    {
      "data": [
        "<article class=\"post-93373 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini breakout above August ledge top but pullback likely\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini breakout above August ledge top but pullback likely</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-09-14T00:30:52-07:00\">September 14, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Market Overview: Weekend Market Update</h2><p>The<strong>Emini</strong>daily chart has a wedge rally that is testing the all-time high. Friday is a sell signal for a minor reversal down.<p>The 30 year Treasury<strong>bond futures</strong>weekly chart has a parabolic wedge top, which is also a Low 4 Top. It will trade sideways to down for many weeks.<p>The<strong>EURUSD</strong>weekly Forex chart has a weak reversal up from the bottom of its 2 year bear channel.<h2><strong>30 Year Treasury Bond Futures market:</strong><br>Strong reversal down from Low 4 Top and parabolic wedge buy climax</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/30-year-treasury-bond-futures-has-buy-climax-and-consecutive-Low-2-tops-so-Low-4-top-2.png\"><img loading=\"lazy\" src=\"2019-9-14.png\" alt=\"30 year treasury bond futures has buy climax and consecutive Low 2 tops so Low 4 top\"></a></figure><p>The 30 year Treasury bond futures market has rallied strongly since October 2018. The rally has been in a tight bull channel and the slope has been increasing. The 4 legs up on the weekly chart mean that the rally is a parabolic wedge buy climax. That is any rally with 3 or more legs in a tight bull channel.<p>It is important to note that the weekly chart is reversing down from just above the the July 11, 2016 high. This is therefore a slightly higher high double top in addition to the 2019 buy climax.<p>When there is a double top, the 2nd leg up is often a wedge, like the case here. Traders know that this increases the chance of a successful reversal down.<h3>Breakout above 2008 – 2016 nested wedge top</h3><p>The July 2016 rally ended with a huge nested wedge top (not shown) where the 1st leg up was in December 2008. That is a reliable topping pattern. However, wedge tops often have one more new high before there is a trend reversal down. Traders can see that this might be happening here.<p>In general, a breakout above a wedge top has a 50% chance of a measured move up and a 50% chance of a reversal down. The bulls want a measured move based on the distance from the October 2018 low of 133 27/32 to the July 2016 high of 165 15/32. That puts their measured move target at just below 200, which is a Big Round Number and another magnet.<p>The odds vary depending on the context. Here, the probability of a measured move up is only 30%. This is because the 2016 nested wedge top is a reliable pattern and the 2019 rally is reversing down strongly from a reliable buy climax top.<h3>Low 4 Top</h3><p>The 2019 rally formed a Low 4 top. There was a reasonable attempt to create a lower high in March after 2 legs up. That was a Low 2 top.<p>But there was then a strong breakout above that top and that breakout had 2 more legs up to a 2nd Low 2 top. The weekly chart is now reversing down again from a 2nd consecutive complex top (one with 2 or more legs).<p>When there is a Low 2 top, a bull breakout, and then a 2nd Low 2 top, that is a Low 4 top. That is a 2nd major top after the July 2016 rested wedge top. It increases the chance of a major trend reversal down.<p>Since the bull trend lasted about 30 years, a major reversal down will probably last at least half as long. Traders therefore should expect interest rates to work higher over the next couple decades.<h3>No negative interest rates</h3><p>What about all of the talk on TV about negative interest rates? The weekly and monthly charts are telling us that the consensus among institutions is that it will not happen.<p>Why do they keep putting experts on TV who say that it will happen? Because in general, those who talk don’t know and those who know don’t talk. The smartest people do not feel a need to be on TV all the time.<p>However, the charts are showing us what they believe. It is very different from what the TV pundits are saying. You get to choose whom to believe. I believe the institutions and not the TV stars.<h3>Major trend reversals take time</h3><p>There is currently a credible top on the weekly and monthly charts. But will it be the final top? It is too early to tell. A trend reversal from a 30 year bull trend into a 20 year bear trend is not going to be abrupt.<p>The current topping process began 3 years ago with the 2016 high. Traders should not be surprised if this current buy climax lasts many months and has a small higher high before there is a trend reversal.<p>The 2019 rally on the weekly chart was a parabolic wedge buy climax. A tight bull channel does not typically instantly reverse into a bear trend.<p>More often, a trend reversal down from a parabolic wedge top often forms a tight trading range that is tilted down slightly. The bulls see it as a bull flag. It can have 10 – 20 bars. The best the bulls can probably get over the next few months is a rally in trading range. Traders should expect sideways to down trading for many months.<p>On the weekly chart, it could easily last for the rest of the year. If this Endless Pullback type of reversal happens, traders will not conclude that the trend has reversed until there is a strong break below the bear channel. Therefore, while the top for the next 20 years might be in, traders need more evidence, which will take many more months.<h2><strong>EURUSD weekly Forex chart:</strong><br>Weak bull trend reversal attempt from bottom of yearlong bear channel</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/EURUSD-weekly-Forex-chart-has-doji-double-bottom-at-bottom-of-bear-channels.png\"><img loading=\"lazy\" src=\"2019-9-14-1.png\" alt=\"EURUSD weekly Forex chart has doji double bottom at bottom of bear channels\"></a></figure><p>The EURUSD weekly Forex chart this week formed a micro double bottom with last week. This is occurring at the bottom of the bear channel that began in November 2017. It is also at the bottom of a bear channel that began this June.<p>However, the bull bodies for the past 2 weeks were small. This week is therefore not an especially strong buy signal bar for next week. The bulls need a strong reversal up over the next couple weeks before traders will conclude that the 2 month selloff has ended.<p>But even if the bulls get their rally, traders know that every reversal up over the past year failed and led to a reversal down after a few weeks. There is no reason to believe that this bottom attempt will be different.<h3>2 Double top bear flags</h3><p>There are measured move targets below. Measured move targets, like all support, are magnets and they draw the market to them. The July/September 2018 double top and the March/June 2019 double top both project down to just above 1.08. Additionally, the gap above the April 21, 2017 high of 1.0777 is also a magnet below.<p>With 3 magnets near one another and only about 100 pips below the September low, the bear channel will probably continue down. This is true even if there is a first a 200 – 300 pip rally up to the August 6 or August 26 lower highs.<p>The bulls need a strong break above the June 25 major lower high of 1.1413 before traders will begin to wonder if the bear trend has ended. Without that, traders will continue to believe that the sequence of lower highs and lows will continue.<h2><strong>Monthly S&amp;P500 Emini futures chart:</strong><br>Resumption of 2019 bull trend</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-monthly-chart-in-weak-rally-to-new-all-time-high-but-expanding-triangle-top.png\"><img loading=\"lazy\" src=\"2019-9-14-2.png\" alt=\"Emini monthly chart in weak rally to new all time high but expanding triangle top\"></a></figure><p>The monthly S&amp;P500 Emini futures chart&nbsp;so far has a big bull bar in September. I have been writing the same thing every week since June. May was an outside down month and June was an outside up month. Once July went above the June high, it triggered an oo buy signal (consecutive outside months).<p>That meant that the Emini was likely to go sideways to up for at least 3 months. September is the 3rd month. If it closes near its high, October will probably go even higher.<p>There is no sign of a top. But if the bears get a reversal bar within the next few months, it would be a sell signal bar. Traders would see it as a 2nd sell signal for the expanding triangle top that began with the January 2018 high. It would also be a 2nd sell signal for a failed breakout above the double top.<h2><strong>Weekly S&amp;P500 Emini futures chart:</strong><br>3rd leg up in yearlong bull trend</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-weekly-chart-breakout-above-ledge-top-and-testing-all-time-high-but-expanding-triangle-top.png\"><img loading=\"lazy\" src=\"2019-9-14-3.png\" alt=\"Emini weekly chart breakout above ledge top and testing all time high but expanding triangle top\"></a></figure><p>The weekly S&amp;P500 Emini futures chart has rallied for 3 weeks from a higher low in August. This is the 3rd leg up in the rally that began at Christmas. There is no sign of a top so the odds favor sideways to up over the next week.<p>If the Emini reverses down from above the July high, there would be a wedge top on the weekly chart. But a strong bull trend like this typically needs at least a micro double top before there will be a bear trend reversal. Consequently, the downside risk over the next few weeks is small. The Emini would probably have to stop going up and begin to go sideways for at least 3 weeks before the bears could get a credible sell setup.<h2><strong>Daily S&amp;P500 Emini futures chart:</strong><br>Emini wedge rally and minor reversal down likely</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-daily-chart-wedge-rally-and-double-top-with-all-time-high.png\"><img loading=\"lazy\" src=\"2019-9-14-4.png\" alt=\"Emini daily chart wedge rally and double top with all time high\"></a></figure><p>I have been writing every week since the August selloff that there would probably be a new all-time high this year. I have been saying that it most likely would come in September or October. The daily S&amp;P500 Emini futures chart is testing the all-time high. While the bears do not have a credible top, there are a 3 problems with this rally.<p>First, this week was the 4th leg up in the bull channel that began on August 23. Three or more legs up in a bull channel is a wedge. Once there are 3 legs, the odds of profit-taking go up. Consequently, there is an increasing risk of at least a small pullback within a couple weeks.<p>Second, the gap above the August trading range was likely to have at least a small 2nd leg up. This week was that 2nd leg. However, the gap and this week’s rally were not strong enough to make a 3rd leg up likely. Therefore, there is a 50% chance of a pullback within a couple weeks.<h3>Breakout above ledge top so pullback likely</h3><p>Finally, ledge tops typically have bull breakouts and then pullbacks. On September 3, I said that the odds favored a breakout above the August trading range.<p>There were 4 highs in August at almost exactly the same price. This is easier to see on the weekly chart. When there are 4 or more bars with the same high, there is a ledge top.<p>Ledges on the daily and weekly charts are never perfect. But the closer to perfection they are, the more likely the market will behave as it does with a ledge. This ledge is as close to perfect as you are going to see.<p>On a 5 minute chart, a ledge top has 4 highs that are identical to the tick. There would then be an 80% chance of a bull breakout.<h3>Ledge tops on daily and weekly charts</h3><p>Ledge tops are much less common on weekly charts. But markets are fractal. This means they behave the same on all time frames. Therefore the odds favored the bull breakout.<p>However, there is one other interesting characteristic of ledge tops. The top of the ledge is an important price. When the Emini is below it, traders expect a rally to at least a little above the ledge.<p>But the top of the ledge remains a magnet even after the bull breakout. On a 5 minute chart, there is an 80% chance of a pullback below the top of the ledge by the end of the next day. Most of the time, the pullback begins within 20 bars.<p>Since ledges are rare on the daily and weekly charts, the sample size is small. This makes it is impossible to know exactly how likely the pullback is. But it is reasonable to assume that there will be a pullback to below the top of the ledge within about 20 days. That means by the end of October.<hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-9-14"
    }
  ],
  "16": [
    {
      "data": [
        "<article class=\"post-93370 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini wedge rally testing July all time high so pullback likely\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini wedge rally testing July all time high so pullback likely</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-09-16T06:20:29-07:00\">September 16, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Monday September 16, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini stalled on Thursday and Friday just below the all-time high. In addition, the 3 week rally has had 3 legs and it is therefore a wedge. This makes a 1 – 3 day pullback likely early this week. However, the momentum up is good enough to make a new all-time high likely within a couple of weeks.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 10 points in the Globex session. It therefore will probably gap down below Friday’s low. Since a pullback is likely on the daily chart, day traders will look to sell rallies.<p>For example, they will look for a reversal down from around Friday low and the 60 minute EMA. Friday’s close is just above. That is also the close of last week. Since the bodies have been shrinking for 3 weeks on the weekly chart, day traders will look for a reversal down from around last week’s close.<p>If there is a gap down, there probably will be an early attempt to close the gap. I wrote on Friday and over the weekend that a pullback was likely this week. Therefore day traders will look from an opening reversal down from an early double top or wedge rally to the resistance above.<h2>Friday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-bear-channel-at-all-time-high.png\"><img src=\"2019-9-16.png\" alt=\"Emini bear channel at all time high\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/EURUSD-Forex-double-top-and-double-bottom-in-bear-channel.png\"><img loading=\"lazy\" src=\"2019-9-16-1.png\" alt=\"EURUSD Forex double top and double bottom in bear channel\"></a></figure><p>The EURUSD daily Forex chart was sideways in August, but it is still in a year long bear channel. There has also been a 3 month bear channel since June 25 within that bigger channel.<p>Thursday’s reversal up was from a double bottom at the bottom of both channels. Friday then reversed down from a double top at the top of the 3 month channel. A double top and a double bottom in a trading range is a Breakout Mode pattern. That means the probability for the bears and bulls is just about the same over the next several days. Traders will look for at least one more reversal.<p>Friday had a bull body after a big bull reversal up on Thursday. That follow-through makes at least a small sideways to up leg likely this week. Consequently, the bulls will look to buy around a 50% pullback from the 2 day rally.<p>However, when the market is in a Breakout Mode pattern, the odds never greatly favor one side. Therefore, traders know that the 2 day reversal down could easily break below the double bottom. Since the daily chart is in a bear trend and there are measured move targets and a gap below at around 1.08, the odds favor lower prices. This is true even if the bulls get a rally up to the August lower highs first.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart sold off in a tight bear channel overnight. Traders have only been selling.<p>The 5 minute chart is almost to a 50% retracement of the 2 day rally. As a result, the bears will begin to take profits. That profit-taking will probably begin within a couple hours.<p>Once there is a 20 pip rally, the bears will switch to selling rallies from selling at the market. Furthermore, they will begin to take profits near the most recent low instead of holding for a further swing down.<p>Also, the bulls will begin to buy reversals up from near the most recent low. Both will scalp. This buying low and selling high should convert the tight bear channel into a trading range early in the US session.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-trading-range-day-5.png\"><img loading=\"lazy\" src=\"2019-9-16-2.png\" alt=\"Emini trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>By trading below Friday’s low, the Emini triggered a sell signal on the daily chart today. There is a wedge top. But the bull channel is tight and therefore traders expect only a minor reversal down. Today sold off for the first half and then rallied for the 2nd half. The day remained small and it was a trading range day.<p>Today closed near its high and is a High 1 bull flag buy signal bar on the daily chart for tomorrow. But, the Emini will probably stay mostly sideways into Wednesday’s 11 am PST FOMC announcement.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-9-16"
    }
  ],
  "17": [
    {
      "data": [
        "<article class=\"post-93517 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini stalling at July all time high before tomorrow’s FOMC\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini stalling at July all time high before tomorrow’s FOMC</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-09-17T06:20:14-07:00\">September 17, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Tuesday September 17, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday triggered a sell signal on the daily chart by going below Friday’s low. There has been a wedge rally over the past 3 weeks. The bears also hope for a reversal down from a double top with the July all-time high.<p>But the wedge bull channel was tight. Therefore this reversal down will probably be minor. Also, yesterday was a bull day. It is therefore a High 1 buy signal bar for today.<p>The big tail on top make it a weak buy setup. Also, a reversal from a wedge rally typically has at least a small 2nd leg sideways to down. Consequently, there will probably be more to this pullback. The ledge top around 2940 is a magnet below.<p>It is important to remember that tomorrow’s 11 am PST FOMC announcement will overwhelm everything else. This is true for at least for the final 2 hours of tomorrow.<p>After the report, traders should be open to anything. There will be an increased chance of a big move up or down for those final 2 hours.<p>Many traders will be unwilling to hold positions ahead of that announcement. Consequently, the Emini might stay mostly sideways today and early tomorrow into the report.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 6 points in the Globex session. It is struggling to hold above 3,000. Also, the wedge top on the daily chart increases the chance of lower prices over the next week. Since most of the days over the past 2 weeks had swings up and down, today will probably continue that trading range price action.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-trading-range-day-5.png\"><img src=\"2019-9-17.png\" alt=\"Emini trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/EURUSD-Forex-double-bottom-pullback-buy-signal.png\"><img loading=\"lazy\" src=\"2019-9-17-1.png\" alt=\"EURUSD Forex double bottom pullback buy signal\"></a></figure><p>The EURUSD daily Forex chart reversed up from a double bottom this week. It then reversed down from a double top bear flag at the EMA yesterday. It is in the middle of the 3 week range and it is therefore in Breakout Mode. Traders are probably waiting for tomorrow’s 11 am PST FOMC announcement to decide on the direction of the breakout.<p>If today closes near its high, today will be a buy signal bar for tomorrow. The 2 day selloff would then be a pullback from the reversal up from the double bottom. This would then be a double bottom pullback buy signal. The odds would shift in favor of a breakout above the double top and a likely rally up to the August 26 high over the next few weeks.<p>Since the bears know this, they will try to prevent today from closing near its high. If they are able to close today near the low, today would be a follow-through bar after yesterday’s strong reversal down. Today would then increase the chance of a break below the September double bottom within the next week.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart traded slightly below yesterday’s low and then reversed up. This means that the bears were unwilling to sell at the low. In addition, it is a sign that the bulls see yesterday as a test down after a double bottom.<p>Neither the bulls nor the bears need a big day today. Tomorrow’s FOMC report is another reason why today will likely be small and sideways. Markets typically become neutral ahead of major catalysts.<p>Both the bulls and the bears are very interested in today’s close. The bulls will buy 20 pip selloffs and try to get the day to close near its high. However, the bears will sell rallies to near the high of the day. At a minimum, they want the day to have a bear body on the daily chart. That would require today to close near its low.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-trading-range-then-late-buy-the-close-rally-ahead-of-FOMC.png\"><img loading=\"lazy\" src=\"2019-9-17-2.png\" alt=\"Emini trading range then late buy the close rally ahead of FOMC\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini was in another small trading range day today until the final hour. There was a Buy The Close rally at the end of the day. It triggered the High 1 bull flag buy signal on the daily chart.<p>Traders are waiting for tomorrow’s 11 am PST September FOMC interest rate announcement. They will then decide whether the rally will continue up to a new all-time high or first pull back to below the 2940 ledge top.<p><em>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\" rel=\"noreferrer noopener\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-9-17"
    }
  ],
  "18": [
    {
      "data": [
        "<article class=\"post-93519 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini awaiting today’s September FOMC interest rate announcement\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini awaiting today’s September FOMC interest rate announcement</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-09-18T06:20:11-07:00\">September 18, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Wednesday September 18, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Th Emini has mostly trading range trading for 2 weeks. At 11 am PST today, the Fed will make its September FOMC interest rate announcement. This will probably affect the market for the rest of the week.<p>The bulls want a breakout to a new all-time high. They will probably achieve their goal by the end of October, but not necessarily this week.<p>Traders must be ready for anything after a Fed announcement. For example, the top of the ledge on the daily and weekly charts is down around 2940. It is a strong magnet below and the Emini should pull back at least a little to below the top of that ledge top within the next month.<p>Which will come first, the new high or the test of the ledge top? We will find out over the next few days.<h3>Overnight Emini Globex trading</h3><p>Most of the price action over the past 3 weeks has been sideways. Day traders will continue to scalp and look for 1 – 2 small swing trades every day until this behavior changes.<p>Because there is typically a quick, big move up and down in the 1st few minutes after the FOMC announcement, day traders should exit their positions ahead of the interest rate report. It is usually best to wait for at least 2 consecutive trend bars up or down before resuming day trading. That means most traders should wait until at least 11:10 am PST before day trading again.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-trading-range-then-late-buy-the-close-rally-ahead-of-FOMC.png\"><img src=\"2019-9-18.png\" alt=\"Emini trading range then late buy the close rally ahead of FOMC\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/?attachment_id=93579\"><img loading=\"lazy\" src=\"2019-9-18-1.png\" alt=\"EURUSD Forex double bottom pullback buy signal ahead of FOMC\"></a></figure><p>The EURUSD daily Forex chart reversed up yesterday from a test of a double bottom. Yesterday is therefore a double bottom pullback buy signal. Today traded 1 pip above yesterday’s high and triggered the buy signal.<p>But, it immediately sold off. There were more sellers than buyers above the buy signal bar. The buyers might be waiting for today’s 11 am PST FOMC announcement.<h3>Buy and sell signals in trading range</h3><p>Just because there is a buy signal and it triggered does not mean that the odds greatly favor a rally. The chart has been sideways for 3 weeks. It is therefore in a trading range and in Breakout Mode. Consequently, the odds for a rally are about the same as for a selloff.<p>Traders should also see the 3 week trading range as a bear flag just below the EMA. Until there is a breakout, there is no breakout.<p>The chart has been in a bear channel for over a year. There is a gap below around 1.08 and 2 measured move targets there as well. Every strong reversal up over the past year lasted only a few weeks before the EURUSD turned down to a new low.<p>There is no sign that this pattern is about to end. While the odds currently might slightly favor a rally to the August high, traders should continue to expect lower highs and new lows until there is a rally far above a major lower high. The most recent major lower high is the June 25 high just above 1.14.<h3>Overnight EURUSD Forex trading</h3><p>After trading 1 pip above yesterday’s high overnight, the 5 minute EURUSD Forex chart sold off 35 pips. It has been in a 20 pip trading range for the past 4 hours.<p>Today’s 11 am PST FOMC interest rate announcement is potentially a major catalyst. Traders expect a big move up or down after the announcement. There is often a big move in both directions Most expect the trading range to continue until the announcement. They therefore will continue to scalp until then.<p>An FOMC announcement typically leads to a big move up or down. Furthermore, there is usually quick moves up and down in the 1st couple minutes after the report. Day traders should exit positions ahead of the report and wait at least 10 minutes after the report before resuming trading.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-outside-up-day-after-FOMC-interest-rate-cut.png\"><img loading=\"lazy\" src=\"2019-9-18-2.png\" alt=\"Emini outside up day after FOMC interest rate cut\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini sold off to below yesterday’s low on the FOMC interest rate cut. But it reversed back up to above yesterday’s high, turning today into an outside up day.<p>While the odds continue to favor a new all-time high soon, most days over the past few weeks have not been strong bull trend days. There was mostly trading range price action on the 5 minute chart. There is no sign that this is about to end.<p><em>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\" rel=\"noreferrer noopener\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-9-18"
    }
  ],
  "19": [
    {
      "data": [
        "<article class=\"post-93521 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini minor reversal down after September FOMC rate cut\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini minor reversal down after September FOMC rate cut</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-09-19T06:20:49-07:00\">September 19, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Thursday September 19, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini sold off after the FOMC announcement yesterday to below Tuesday’s low. It then rallied to above Tuesday’s high. Yesterday was therefore an outside up day. That is a sign of strong bulls. Because of the 4 week rally, the odds favor a new all-time high within a few weeks.<p>Yet, there is still a wedge rally and a double top on the daily chart. Also, the Emini is at the top of a 2 year trading range. Furthermore, the ledge top at 2940 on the weekly chart is a magnet below. Finally, most days over the past 3 weeks have had a lot of trading range price action on the 5 minute chart. Consequently, while the Emini is working higher, it is not racing up. Also, because of the loss of momentum at resistance, there can be a strong reversal down at any time.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 5 points in the Globex session. It therefore might gap above yesterday’s high. It is only 16 points below the all-time high. Therefore the bulls could easily make a new high today or tomorrow.<p>However, until there is a breakout, the bears can get a strong reversal down from a double top with the July high on any day. But yesterday’s late rally was in a tight bull channel. Consequently, the Emini will probably have to transition into a trading range for at least an hour before the bears can begin a bear trend.<p>As a result, the downside risk on the open is not great. The best the bears can probably get is a sharp pullback for an hour or so. However, if they get one, then they would have a better chance of a reversal down after a test back up.<p>What is most likely? The all-time high is major resistance and it is therefore a magnet. There is plenty of room for a continuation of yesterday’s rally up to that high. Yesterday’s momentum up was strong.<p>That makes an early bear trend unlikely. Therefore, the Emini will probably either have some resumption up on the open from yesterday or enter a trading range.<p>Since yesterday’s rally was extreme, many bulls will look to take some profits early today. That increases the chance of a trading range beginning within the 1st 2 hours. If there is a trading range, the bears would then have a better chance of a swing down. At the moment, today will probably be mostly sideways or up.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-outside-up-day-after-FOMC-interest-rate-cut.png\"><img src=\"2019-9-19.png\" alt=\"Emini outside up day after FOMC interest rate cut\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/EURUSD-Forex-double-bottom-pullback-and-higher-low-major-trend-reversal-buy-signal.png\"><img loading=\"lazy\" src=\"2019-9-19-1.png\" alt=\"EURUSD Forex double bottom pullback and higher low major trend reversal buy signal\"></a></figure><p>The EURUSD daily Forex chart has a double bottom pullback buy signal. It is also a small higher low major trend reversal buy setup. Yesterday formed a micro double bottom with Monday’s low. Traders believe that the odds slightly favor at least a small 2nd leg up after the double bottom and last week’s big bull outside up bar. The targets are the August 26 and August 6 lower highs.<p>However, there is also a triangle over the past 6 days. Also, the chart has been in a tight trading range for 3 weeks. These are Breakout Mode patterns. There is therefore also close to a 50% chance of a bear breakout. If the bulls had a significant advantage, the chart would not still be sideways and below the EMA.<p>While the odds slightly favor a bull breakout, until there is a breakout, there is no breakout. The pattern is also a 3 week bear flag just below the EMA. In addition, there are measured move targets down around 1.08. There is a gap there as well, and therefore another magnet below.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD rallied overnight, reversing yesterday’s selloff. This is the 2nd reversal up this week from a 50% pullback from last week’s rally.<p>The overnight bull channel has had only small pullbacks, but it has only rallied 20 pips over the past 5 hours. The bull trend is therefore transitioning into a trading range. Consequently, the bears will begin to look for reversal patterns to sell for scalps.<p>Also, because of the loss of momentum, day trading bulls are now waiting to buy pullbacks instead of buying at the market. They are switching to scalping.<p>Can today break strongly above or below the 4 day tight trading range? Yes, and the potential for a big move up or down is real. But the probability is low given the loss of momentum over the past 5 hours.<p>Day traders are now scalping. They will only switch to swing trading if there is a big breakout. At the moment, today will probably remain in a trading range all day.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-bear-trend-reversal-after-wedge-top.png\"><img loading=\"lazy\" src=\"2019-9-19-2.png\" alt=\"Emini bear trend reversal after wedge top\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini rallied on the open, but reversed down from a wedge top just above last week’s high. Today is a sell signal bar for tomorrow. The bears want a reversal down from this double top. That would also create a bigger double top with the July all-time high. The bears will need several bear days before traders will conclude that a swing down has begun.<p>Tomorrow is Friday and weekly support and resistance will be important. This is particularly true in the final hour. The bears want the week to close below its open to create a bear bar on the weekly chart. However, the bulls would like a close at a new all-time high. That is unlikely after today’s selloff.<p><em>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\" rel=\"noreferrer noopener\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-9-19"
    }
  ],
  "20": [
    {
      "data": [
        "<article class=\"post-93523 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini minor double top just below July all time high\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini minor double top just below July all time high</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-09-20T06:20:14-07:00\">September 20, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Friday September 20, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday rallied to a wedge top that reversed down from above last week’s high. The rally got to within 7 points of the all-time high. Yesterday closed near its low and it is a sell signal bar for today. The bears now have a double top with last week’s high and a bigger double top with the July high.<p>But the momentum up still favors the bulls. A reversal down today will probably become a 1 – 3 day pullback. The bears need several bear days before traders will conclude that a move down to the 2940 ledge top is underway.<p>The bears want the week to close below the open. This week would then have a bear body and increase the chance of lower prices next week.<p>Today is Friday and therefore weekly support and resistance can be important. This is especially true in the final hour. The weekly targets are last week’s high, the all-time high, and this week’s open.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 4 points in the Globex session. Even though yesterday traded down in a bear channel for 5 hours, the bulls see the channel as a pullback from Wednesday’s strong reversal up. It is therefore a bull flag. They hope to break above the channel today and rally back up to the high of the week. They would like the week to close at a new high.<p>The bears want a strong break below yesterday’s low, which would trigger the sell signal on the daily chart. However, the bull case is better and the odds are therefore against a bear trend today.<p>Most days over the past 3 weeks have had reversals and a lot of trading range trading. Day traders expect more of that price action again today. But since the chart is testing the all-time high, they will be ready to swing trade if there is an early strong breakout up or down.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-bear-trend-reversal-after-wedge-top.png\"><img src=\"2019-9-20.png\" alt=\"Emini bear trend reversal after wedge top\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/EURUSD-Forex-triangle-so-Breakout-Mode.png\"><img loading=\"lazy\" src=\"2019-9-20-1.png\" alt=\"\"></a></figure><p>The EURUSD daily Forex chart has an inside day today after yesterday’s inside day. That is an ii Breakout Mode pattern. It is nested within a 5 day tight trading range that is within a 3 week tight trading range.<p>There will probably be a breakout within a few days. When there is an intensely balanced pattern like this, there is always both a sell and buy signal. Each has a 50% chance of success. Also, the 1st breakout up or down has a 50% chance of reversing.<p>The bears see the trading range just below the EMA as a bear flag. There are measured move targets down around 1.08.<p>For the bulls, this week has been a pullback from a 2 week double bottom. They want a reversal up from the bottom of the bear channel to the August 26 lower high over the next several weeks.<p>The most important rule when there is a Breakout Mode pattern is that there is no breakout until there clearly is a breakout. In the meantime, control alternates between the bulls and bears every day or two.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has sold off in a tight bear channel for the past 5 hours. It could not get above yesterday’s high and it reversed down. It is now testing yesterday’s low.<p>Because the channel is tight, day traders have only been selling. Now that it is near yesterday’s lows, the bears will probably begin to take profits and look to sell rallies instead of at the market.<p>If there is a 20 pip bounce from the short covering, the bulls will begin to buy reversals up from the low. This will convert the bear trend into a trading range. Then both the bulls and bears will scalp.<p>Can the overnight bear trend break below the bottom of the 5 day trading range? Unlikely, since tight trading ranges resist breaking out. There will probably be buyers around yesterday’s low. That means a break below yesterday’s low will probably not get far.<p>Today is Friday and this week is a small inside bar on the weekly chart. The bears are trying to get the week to close on its low. This week would then be a credible sell signal bar for next week. The bulls always want the opposite and will try to prevent the week from closing on its low.<br><h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-bear-trending-trading-range-day.png\"><img loading=\"lazy\" src=\"2019-9-20-2.png\" alt=\"Emini bear trending trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini was in a weak bear channel for the 1st half of the day. It had a Bear Major Surprise bar in the middle of the day. After a wedge rally, the bears got a 2nd leg down.<p>By trading below yesterday’s low, the Emini triggered a daily sell signal. This week closed below the open. There is now a bear bar on the weekly chart. That increases the chance of at least slightly lower prices next week. The top of the wedge at 2940 is a magnet below.<p><em>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\" rel=\"noreferrer noopener\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-9-20"
    }
  ],
  "21": [
    {
      "data": [
        "<article class=\"post-93528 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini nested double top with July high but minor reversal\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini nested double top with July high but minor reversal</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-09-21T00:30:12-07:00\">September 21, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Market Overview: Weekend Market Update</h2><p>The<strong>Emini</strong>has a nested double top, but a minor reversal to below the 2940 ledge top is more likely than a bear trend.<p><strong>Crude oil</strong>had a brief rally and then reversal down this week. The rally was strong enough. The rally was strong enough to make at least a small test back up likely.<p>The<strong>EURUSD</strong>Forex market has been sideways for 3 weeks at the bottom of its yearlong bear channel. Since it is at the bottom of the channel, it will probably bounce soon, but it might continue sideways for another week or two first.<h2><strong>Crude oil Futures daily chart:</strong><br>Pullback from bull breakout, but still in trading range</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Crude-oil-daily-chart-has-pullback-from-breakout-on-Iran-attack.png\"><img loading=\"lazy\" src=\"2019-9-21.png\" alt=\"Crude oil daily chart has pullback from breakout on Iran attack\"></a></figure><p>The crude oil futures jumped 15% on Monday after the attack on Saudi Arabia’s oil production facilities. While dramatic, crude oil gave back half of the gain on the next day. As big a move as it was, it is not noticeable on the monthly chart and unremarkable on the weekly chart.<p>Crude oil has been in a tight trading range for 4 years. Furthermore, it has been forming lower highs and higher lows for 2 years. It is therefore at the apex of a triangle on the weekly chart.<p>Every tight trading range is a Breakout Mode pattern. The apex of a triangle is an example. Traders know that it is a balanced market. Control alternates between the bulls and bears.<h3>What happens with a breakout from a Breakout Mode pattern?</h3><p>At some point, there is a breakout. Traders know 3 things about the breakout. First, there is a 50% chance that the 1st breakout will fail. Second, there is an equal chance that a successful breakout will be up or down.<p>Finally, until there is a breakout, there is no breakout. Most breakout attempts will reverse. They bet against breakouts by selling strong rallies and buying strong sells. Additionally, since they believe moves up and down will not last, they take quick profits. This results in a continuation of the trading range.<h3>Bull Surprise Bar typically will lead to a 2nd leg sideways to up</h3><p>This week’s rally was surprisingly strong on the daily chart. A Surprise Bar or Breakout means that it was unlikely. Traders were therefore not positioned correctly for it.<p>There were bears who sold early in the bull breakout, betting it would not get far. Now that it has, these bears are trapped into a bad short. They will therefore buy this reversal down to exit their shorts with a smaller loss.<p>The bulls were also not expecting as big a bull breakout. Many did not buy, but are hopeful that it is the start of a bull trend. These bulls will also buy this week’s pullback, but they are buying to get long.<p>There are other bulls who bought at the top of Monday’s rally. They were confident that either the rally would continue and they could make a profit, or there would be a pullback and the chart would enter a trading range.<p>These traders believed that the rally was strong enough to make an immediate bear trend unlikely. They could then buy more lower and exit on a test back up to the top of the range. They would get out around breakeven on their 1st buy and with a profit on their lower buy.<h3>At least small 2nd leg up likely soon</h3><p>With both the bulls and bears buying the reversal down, the odds favor a 2nd leg sideways to up. Will the 2nd leg up form a double top and then lead to a swing down for a few weeks? Or will it test the next resistance at the June high, just below 67?<p>In either case, most breakout attempts fail. Therefore, this rally will probably not lead to a trend up to the October 3, 2019 high above 78. Big Up, Big Down creates Big Confusion. Traders expect more sideways trading between 50 and 65.<h2><strong>EURUSD weekly Forex chart:</strong><br>Tight trading range at bottom of bear channel</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/EURUSD-weekly-Forex-chart-in-tight-trading-range-in-bear-channel.png\"><img loading=\"lazy\" src=\"2019-9-21-1.png\" alt=\"EURUSD weekly Forex chart in tight trading range in bear channel\"></a></figure><p>The EURUSD weekly Forex chart formed 3 sideways small bars over the past 3 weeks. Two were dojis. This is a neutral pattern. Because the bars are sitting on the bottom of the yearlong bear channel, traders expect a bounce. But their small bodies indicate that there is no enthusiasm for a reversal up. Since they are going sideways at support, next week will probably be sideways as well.<p>A bear channel is a series of lower highs and lows. This channel has had many legs up and down, each lasting a few weeks. There have also been many tight trading ranges lasting for a month or two. The weekly chart is now in one of those periods.<p>The bulls want a reversal up to the top of the channel. That is currently around the 1.1250 August 6 major lower high.<p>But they need more than that to end the bear channel. The June 25 high of 1.1413 is more major. Traders want to see a couple daily closes above that high before they will begin to conclude that the bear channel has ended and either a trading range or bull trend has begun. Since every rally over the past year led to a new low, traders will bet that any rally now will do the same.<h3>Measured move targets are near April 2017 gap below 1.08</h3><p>There are 2 double tops with measured move projections down at around 1.08. The first is the July/September 2018 double top. The other is the March/June 2019 double top. Two magnets at nearly the same price increase the chance of a test of that support.<p>It is important to note that there is a 3rd magnet around 1.08 as well. The daily and weekly charts gapped up on April 24, 2017. For the gap to close, the EURUSD will have to trade below 1.0777, which is the April 21, 2017 high. That is only about 30 pips below both measured move targets.<p>Furthermore, the 1st of the 3 targets is less than 100 pips below this month’s low. Support is a magnet. The closer something gets to a magnet, the stronger the magnetic pull. As some point, the magnetism is so strong that it is very difficult to escape the magnetic pull.<p>The EURUSD weekly chart is near that point. This bear channel will probably continue down to at least 1.08 over the next few months, even if there is a test of August high first.<h2><strong>Monthly S&amp;P500 Emini futures chart:</strong><br>August had bear body so it was a weak High 1 bull flag</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-monthly-candlesstick-chart-breaking-above-weak-High-1-bull-flag-buy-signal-bar.png\"><img loading=\"lazy\" src=\"2019-9-21-2.png\" alt=\"Emini monthly candlestick chart breaking above weak High 1 bull flag buy signal bar\"></a></figure><p>The monthly S&amp;P500 Emini futures chart has a bull trend bar so far in September. Since June formed consecutive outside (oo) bars, I have been saying that the Emini would be sideways to up into at least September. July went above the June high and triggered the oo buy signal.&nbsp;A rally from an oo pattern usually continues sideways to up for at least 3 months.<p>Can it last longer? Three months is the minimum. But think about the pattern. Consecutive inside bars (an ii pattern) is a triangle on a smaller time frame chart. A triangle has at least 5 legs. That means that the market is spending a lot of time oscillating around a price. Traders see that price as important. It is a magnet. A breakout above or below usually reverses back to the triangle within about 10 bars.<p>It is important to note that an ii pattern is a traditional triangle, which means one that is constricting. An oo pattern is usually an expanding triangle on a smaller time frame chart. It, too, has at least 5 legs on a smaller time frame, and it oscillates around its middle. Again, that middle is a magnet.<p>Therefore, once there is a breakout up or down, there is a force that tends to draw the market back to that price within about 10 bars. This will probably limit the near-term extent of the breakout above the 21 month trading range. It could certainly continue for a few more bars, but the middle of the triangle will probably pull any rally back to the 3,000 middle of the triangle.<h3>Weak High 1 bull flag buy signal bar</h3><p>August was a pullback in a bull trend. It was therefore a High 1 bull flag buy signal bar. But it had a bear body. That lowers the probability of a big rally over the next few bars. In fact, there are often more sellers than buyers above a bear buy signal bar.<p>This is especially true when the buy signal is not in a strong bull trend. This one is at the top of a 21 month trading range. Traders should expect the September rally to lead to a pullback in October or November.<h3>21 month expanding triangle top</h3><p>I have mentioned many times over the past several months that there is a big expanding triangle top on the weekly and monthly charts. The sell signal triggered when August traded below July.<p>But July was a doji bar and that is a low probability sell signal bar. Furthermore, July just triggered an oo buy signal. Traders were going to buy below the weak sell signal bar, expecting sideways to up over the next couple months.<p>What happens if October is a bear reversal bar? It would then be a 2nd sell signal for the 21 month expanding triangle. A 2nd sell signal has a higher probability of leading to at least a minor reversal. This is especially true if the sell signal bar is strong in October or November. That means a relatively big bear body and a close near the low of the bar.<p>If the bears get that, traders would look for a test down to at least the most recent higher low. That is the August low just above 2800.<p>A reversal down from a major top usually has at least 2 legs. If the reversal down is strong, traders would then look for a test down to the next support, which is the June low around 2700.<h2><strong>Weekly S&amp;P500 Emini futures chart:</strong>Loss of momentum at all-time high<br></h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-weekly-candlestick-chart-pulling-back-from-breakout-above-ledge-top.png\"><img loading=\"lazy\" src=\"2019-9-21-3.png\" alt=\"Emini weekly candlestick chart pulling back from breakout above ledge top\"></a></figure><p>The weekly S&amp;P500 Emini futures chart had a bear doji bar this week. This is slightly bearish compared to last’s small bull body. And last week’s body was smaller than that of the week before, which means less bullish. This is a loss of momentum over the past 3 weeks. It is not what the bulls want to see as they try to break out to a new all-time high.<p>This hesitation near the prior high makes traders wonder if this rally is simply a test of the prior high. A lack of momentum means a lack of buyers. The bulls are hesitating to buy at this price. If there is a strong break above the July high, many would be willing to buy higher.<p>Alternatively, if there is a reversal down to support, like at the top of the August ledge at 2940, many bulls will buy. Traders are now deciding if there will be a strong bull breakout or a pullback.<h3>Breakout above ledge top means pullback likely soon</h3><p>There were 4 consecutive weeks in August with essentially identical highs. That is a ledge top. It is support and therefore a magnet. Once the ledge formed, I said that there was a high probability of a breakout above the ledge.<p>I also said that there would be a high probability of a pullback below the top of the ledge before the rally went very far. That is still likely to happen. But traders do not know if it will happen from where the Emini currently is or from a new all-time high. This week’s bear body makes a test of the ledge top slightly more likely within a couple weeks.<p>If the Emini turns strongly down from here, there would be a double top with the July all-time high. If instead it breaks to a new high and then reverses, there would be a wedge top with the May and July highs.<p>But any reversal will more likely lead to a trading range or a bull flag than a bear trend. Traders should expect a new high witin the next several weeks. There is currently only a 30% chance that this week’s reversal down will test below 2800 before there is a new high.<h2><strong>Daily S&amp;P500 Emini futures chart:</strong><br>Nested double top but only minor reversal down likely</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-daily-candlestick-chart-has-nested-double-top-and-ledge-top-magnet-below.png\"><img loading=\"lazy\" src=\"2019-9-21-4.png\" alt=\"Emini daily candlestick chart has nested double top and ledge top magnet below\"></a></figure><p>The daily S&amp;P500 Emini futures chart triggered a sell signal on Friday by trading below Thursday’s low. Thursday was a sell signal bar for a double top with last week’s high. Furthermore, the 2 week double top is nested within a larger double top with the July all-time high.<p>The bears want a break below Wednesday’s low. That is the neck line of the 2 week double top. A measured move down would be near the August ledge top at 2940. A ledge top is a reliable magnet. Therefore the Emini will probably dip below that top within a few weeks. The bulls will see the test down as forming a bull flag. However, the bears want that pullback to grow into a bear trend.<p>Without a strong reversal down over the next couple weeks, a pullback followed by higher prices is more likely. I have been saying since June that a new all-time high was likely to come in September or October. That is still true.<p>However, the Emini went sideways for 4 weeks in July. It is now in that trading range. That increases the chance of more sideways to down trading over the next couple of weeks.<hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-9-21"
    }
  ],
  "23": [
    {
      "data": [
        "<article class=\"post-93680 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini has magnet below at 2940 August ledge top\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini has magnet below at 2940 August ledge top</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-09-23T06:20:06-07:00\">September 23, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Monday September 23, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Friday was a surprisingly big bear day on the Emini daily chart. Since September 3, I have been saying that the Emini would break above the 2940 top of its 4 week range, but then pull back below the top of that ledge. Friday might be the start of the pullback below the 2940 top of the ledge.<p>What happens once there is a dip below the top of a ledge? The bulls try to get a reversal up. They see the selloff as a breakout test of support. They then buy, hoping for a resumption of the bull trend.<p>However, the bears want the selloff to continue down and begin a bear trend. Unless they get several bear days this week, the probability favors the bulls. Most reversal attempts in bull trends form bull flags.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 2 points in the Globex session. Friday’s midday selloff was big enough to qualify as a Major Bear Surprise Bar. That means it can dominate the trading for the next few days. It increases the chance that the Emini is beginning its pullback to below the 2940 top of the August ledge on the weekly chart.<p>The bulls never want any selloff. They therefore will buy around Friday’s and last week’s low. They will try to form a micro double bottom on the daily chart at the 20 day EMA.<p>Friday’s big selloff and then big reversal up created confusion. Confusion typically leads to a trading range. Therefore, there is an increased chance of buyers around Friday’s low and then a trading range within Friday’s lower trading range.<p>A big move down like on Friday increases the chance of follow-through selling within a few days. It also increases the chance of a trend up from a double bottom. This confusion will probably lead to early trading range trading today.<h2>Friday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-strong-bear-breakout.png\"><img src=\"2019-9-23.png\" alt=\"Emini strong bear breakout\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/EURUSD-Forex-Low-2-bear-flag-and-double-bottom-pullback.png\"><img loading=\"lazy\" src=\"2019-9-23-1.png\" alt=\"EURUSD Forex Low 2 bear flag and double bottom pullback\"></a></figure><p>The EURUSD daily Forex chart has been sideways for 4 weeks. It has been in a bear channel for a year. There is no sign that the series of lower highs and lows is about to end. Also, there are 2 measured move targets and a gap around 1.08. Consequently, this attempt at a bottom will probably be minor. If the bulls get a reversal up this week from a test of the September double bottom, the rally will probably fail to get above the August high.<p>Because the daily chart is sideways, the bulls and bears are balanced. Traders believe that the next 2 – 3 week move is as likely to be up as it is to be down.<p>Even though there probably will be a breakout within a few weeks, until there is a breakout, they are betting on reversals. They buy low, sell high, and take profits every couple days.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute chart traded below last week’s low at the start of the European session and then reversed up. The rally has only been 30 pips and in a broad channel. This is not yet the start of a strong bull trend. Day traders will look for scalps up and down until there is a strong trend.<p>The minimum goal for the bulls is to have today close above the open. Today would then be a High 2 buy signal bar on the daily chart. It would also be a buy signal for a pullback from the September double bottom. There would be a Double Bottom Pullback buy signal.<p>If the bears can get today to close near its low, traders will expect a break below the September low this week. Their next target is 1.08.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/09/Emini-triangle-open-and-then-bull-channel-to-3000.png\"><img loading=\"lazy\" src=\"2019-9-23-2.png\" alt=\"Emini triangle open and then bull channel to 3000\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini was in a triangle for the 1st 90 minutes and then rallied in a Small Pullback Bull Trend. After a 3 hour trading range, there was a small breakout to above 3000 and the 60 minute EMA. After stalling for a few bars on the 5 minute chart, many bulls took profits. This resulted in a close off the high.<p>Today was a bull day and a buy signal bar for tomorrow on the daily chart. But the tail on top makes is less reliable.<p>The Emini has been sideways for 3 weeks. Each of the other buy and sell signal bars failed to lead to a trend. Consequently, this is not a strong buy setup on the daily chart.<p>While the Emini is still likely to make a new high in September or October, the odds are that it will continue to do what it has been doing for several weeks. Traders should expect reversals every 2 – 3 days.<p><em>See the<a href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\" rel=\"noreferrer noopener\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-9-23"
    }
  ]
}