{
  "1": [
    {
      "data": [
        "<article class=\"post-89363 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini High 1 bull flag at all-time high on FOMC day\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini High 1 bull flag at all-time high on FOMC day</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-05-01T06:20:58-07:00\">May 1, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Wednesday May 1, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini reversed down on Monday and up yesterday. It closed just below Monday’s high and was almost an outside up day. Yesterday is therefore a buy signal bar for today. With it just below the all-time high, the Emini could gap up to a new high on the open.<p>It is important to note that there is an FOMC announcement at 11 am today. That is always a catalyst, and it will probably dominate the day. The Emini is unlikely to have a strong trend up or down ahead of the report.<p>It is better to think of the day as starting over at 11 am. At that time, day traders should focus on what happens on the report and pay much less attention to the earlier bars.<p>Reversals in the first 10 minutes after the report are the norm. Also, the bars are typically big and the market moves fast. Most traders should not resume trading until at least 10 minutes after the report.<p>Because the Emini is testing the all-time high, there is an increased chance of a big move up or down. This particularly true after the report. Big reversals are common at any point after an FOMC report. Consequently, day traders have to exit quickly if the Emini begins to reverse.<p>There is only a 20% chance of a strong, relentless trend after the report. If one forms, traders should look to enter on any one or two legged pullback.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 10 points in the Globex session. Today might therefore gap up to a new all-time high. A gap above key resistance increases the chance of a trend day. If there is a trend, up is slightly more likely.<p>There is a strong trend day from the open only 20% of the time. Most often, a big gap up leads to a trading range for the 1st hour. The bulls look for a double bottom or wedge bottom to around the EMA. However, the bears look for a double top or wedge top and then a swing down.<p>Day traders should go flat ahead of the 11 am PST FOMC announcement. There is usually a quick move in the wrong direction within the 1st few minutes. Consequently, it is usually better to not resume trading until at least 10 minutes after the report.<p>Furthermore, day traders should be open to anything. They have to be quick to determine if the Emini is in a trading range or a trend. In addition, they should be quick to exit their positions if the Emini reverses. This is because the reversals can be abrupt and go far.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/04/Emini-bull-trend-reversal-day-1.png\"><img src=\"2019-5-1.png\" alt=\"Emini bull trend reversal day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/EURUSD-Forex-bear-rally-ahead-of-May-FOMC-announcement.png\"><img loading=\"lazy\" src=\"2019-5-1-1.png\" alt=\"EURUSD Forex bear rally ahead of May FOMC announcement\"></a></figure><p>The EURUSD daily Forex chart has rallied for 4 days after breaking to a new low in a 10 month bear channel. It is now at the EMA. All prior rallies have ended above the EMA.<p>However, the April 12 minor lower high at 1.1324 is nearby. Every prior high and low is a magnet. Consequently, this rally might continue up to that high before the bears will sell again.<p>The 10 month bear channel will continue until the bulls can get 2 or more closes above a major lower high, like the March 20 high. In addition, they then need to get a higher low. That would convert the broad bear channel into either a trading range or a bull trend. Until then, traders will expect reversals up and down every 2 – 3 weeks.<p>Today’s 11 am PST FOMC announcement is a potential catalyst for a big move up or down. The day has been small so far. It probably will remain small until after the report. If day trading after the report, it is better to wait at least 10 minutes. This is because the initial move on the report typically is big and reverses within the 1st 10 minutes.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 20 pip range for 5 hours. That makes it difficult for day traders to make even a 10 pip scalp. They will trade reversals until there is a strong breakout up or down. That might not happen until the 11 am PST FOMC announcement.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-outside-down-day-after-FOMC-announcement.jpg\"><img loading=\"lazy\" src=\"2019-5-1-2.jpg\" alt=\"Emini outside down day after FOMC announcement\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini tested the September 2956.00 all-time high to the tick before and again after today’s FOMC report. It reversed down both times. It reversed down from above yesterday’s high to below its low. Today is an outside down day. Yesterday’s high was at Monday’s high. It reversed up from below yesterday’s low. It was therefore a variant of an outside up day.<p>Consecutive outside days in a bull trend is a sell signal for tomorrow. Today is a good candidate for the start of a 2 – 3 week pullback.<p>The bulls want tomorrow to be a bull day. For example, if tomorrow is a bull inside day, it would be an ioi buy signal for Friday. While this is possible, the odds at the moment favor the start of a 2 – 3 week pullback. While not likely at the moment, the selloff could even last a couple months and retrace half of the 4 month rally.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-5-1"
    }
  ],
  "2": [
    {
      "data": [
        "<article class=\"post-89366 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini exact test of all-time high after FOMC announcement\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini exact test of all-time high after FOMC announcement</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-05-02T06:20:49-07:00\">May 2, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Thursday May 2, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini rallied yesterday up to the all-time high before and again after the FOMC report. It exactly hit 2956.00 twice and turned down both times.<p>Yesterday was an outside down day after Tuesday’s outside up day. That is consecutive outside days (an oo pattern). When that happens in a bull trend, it is a sell setup. If today trades below yesterday’s low, the odds would favor a 2 – 3 week pullback at a minimum. However, if the bulls get a strong bull bar today on the daily chart, it will undo yesterday’s damage.<h3>Overnight Emini Globex trading</h3><p>The Emini is unchanged in the Globex session. The bears need today to trade below yesterday’s low. That would trigger a significant sell signal on the daily chart. The odds would then favor a couple legs down on the daily chart over the next 2 – 3 weeks. Traders should expect this possibility even if the Emini goes sideways over the next few days after triggering the sell signal.<p>With tomorrow’s unemployment report being a potential catalyst, the Emini has an increased chance of going sideways today. This is true regardless of whether the Emini triggers the sell signal.<p>In addition, after yesterday’s sell climax, there is a 75% chance of at least 2 hours of sideways to up trading today that begins by the end of the 2nd hour. There is only a 25% chance of a strong bear trend from the open.<p>The bulls do not want the sell signal to trigger. They will buy at and above yesterday’s low. If they can prevent today from trading below yesterday’s low, today would be an inside day on the daily chart. There would then be an ioi (and inside day after an outside day) on the daily chart. That would be a bull flag. They they would again try to break to a new all-time high next week.<p>If today triggers the sell signal, the bulls will try to create a strong bull trend day. Today would then be a buy signal bar on the daily chart. However, if the oo sell signal triggers, it is more significant. The odds would favor lower prices for a couple weeks.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-outside-down-day-after-FOMC-announcement-1.png\"><img src=\"2019-5-2.png\" alt=\"Emini outside down day after FOMC announcement\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/EURUSD-Forex-bear-rally-in-bear-channel.jpg\"><img loading=\"lazy\" src=\"2019-5-2-1.jpg\" alt=\"EURUSD Forex bear rally in bear channel\"></a></figure><p>The EURUSD daily Forex chart formed a bear reversal day at the 20 day EMA yesterday. It is a Low 1 bear flag in a 10 month bear channel. But, after 3 bull days, the bears will probably need a micro double top before they get a new low. That was the case with all other bear rallies to the EMA. Consequently, even though today would trigger a sell signal by breaking below yesterday’s low, there will probably be buyers not far below yesterday’s low.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 30 pip range overnight. It is within yesterday’s range. On the daily chart, yesterday is a sell signal bar at resistance in a bear trend. Today will probably fall below yesterday’s low.<p>However, after a 4 day tight bull channel on the 60 minute chart, there will probably be buyers below yesterday’s low down to around the April 26 high. Consequently, the 3 day tight trading range will probably continue for at least a couple more days. Day traders will look to scalp reversals for 10 – 20 pips.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-parabolic-wedge-sell-climax.jpg\"><img loading=\"lazy\" src=\"2019-5-2-2.jpg\" alt=\"Emini parabolic wedge sell climax\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini triggered an oo sell signal today by trading below yesterday’s low. After a parabolic wedge sell climax, it reversed back up to the middle of the day. Today is therefore somewhat neutral ahead of tomorrow’s unemployment report. However, the odds now favor 2 – 3 weeks of sideways to down trading. This is true even if the Emini bounces for a couple days.<p>Tomorrow is Friday so it determines the appearance of this week’s bar on the weekly chart. Therefore, this week’s open, high, and low are magnets, especially in the final hour.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-5-2"
    }
  ],
  "3": [
    {
      "data": [
        "<article class=\"post-89369 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini oo sell signal after consecutive outside bars\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini oo sell signal after consecutive outside bars</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-05-03T06:20:00-07:00\">May 3, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Friday May 3, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini sold off sharply early yesterday, but reversed up from a parabolic wedge sell climax at the 20 day EMA. On the daily chart, it closed with a small bear body. It is therefore a weak buy signal bar for today.<p>By trading below Wednesday’s low, the Emini triggered a sell signal on the daily chart. There are consecutive outside bars late in a bull trend at resistance. That is a sell setup. The odds are that the Emini will be sideways to down for the next 2 – 3 weeks, even if it bounces for a few days. However, if the bulls can close today above Wednesday’s high, they will erase the sell setup.<h3>Weekly chart is important on Fridays</h3><p>Since today is Friday, the weekly chart is important. The bears want a bear bar. That means a close below the open of the week. If they can get the week to close on its low, it would be a stronger sell signal bar for next week.<p>The bulls would like another bull bar. However, a small bear body is not particularly bearish. If the bulls can get at least that, the odds of a strong selloff would be less. Ideally, they want the week to close at a new all-time high, but that is unlikely.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 13 points in the Globex session. That is near yesterday’s high. Yesterday is a High 1 buy signal bar on the daily chart. The bulls will try to trigger the buy today by breaking above yesterday’s high.<p>However, yesterday was a bear doji, which is a weak buy signal bar. In addition, the Emini triggered a sell signal yesterday by trading below consecutive outside days. Therefore, there will probably be sellers above yesterday’s high. The odds are against a big bull trend day.<p>Since today is Friday, the weekly chart is important. The most significant magnet is the 2942.00 open of the week. If the week closes below the open, the candlestick on the weekly chart will have a bear body. That will increase the chance of next week trading below this week’s low. Furthermore, it will make a 2 – 3 week pullback more likely.<p>With the big 2 day selloff and the reversal up, there is confusion. Also, since a sell signal is in effect on the daily chart, the upside is probably not big today. As a result, the Emini will probably have at least one swing up and one swing down today. That has been the case for most days over the past month.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-parabolic-wedge-sell-climax.jpg\"><img src=\"2019-5-3.jpg\" alt=\"Emini parabolic wedge sell climax\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/EURUSD-Forex-breakout-of-Low-1-bear-flag-at-EMA.jpg\"><img loading=\"lazy\" src=\"2019-5-3-1.jpg\" alt=\"EURUSD Forex breakout of Low 1 bear flag at EMA\"></a></figure><p>The EURUSD daily Forex chart reversed down from the 20 day EMA 2 days ago. It has been in a bear channel for 10 months. The bears hope that this will lead to a new low.<p>However, the 4 day rally was strong enough so that the bulls will probably buy above last week’s low. Also, the rally retraced less of the most recent bear leg than prior bear rallies. Finally, most bear rallies have lasted at least a couple weeks. Consequently, there will probably be a higher low today or tomorrow.<p>But, unless the bulls break strongly above the March 20 major lower high, the bear channel is intact. Traders will continue to expect a series of lower highs and lows.<p>In addition, there are measured move targets below. The nearest is 1.0942, based on the February 28 and March 20 double top.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart sold off 40 pips overnight and 130 pips from Wednesday’s high. It just reversed up on this morning’s unemployment report. The bulls hope that this is the end of the selling and will look to buy dips. After 3 days of selling, the bears will continue to sell rallies.<p>On the weekly chart, this week so far mostly overlaps last week and it is a doji bar. That is neutral. The high of the week is probably too far above for the bulls to reach today. This is especially true since the selloff was in a tight bear channel on the 60 minute chart. They will be satisfied with the week closing above the open.<p>The reversal up 5 minutes ago is probably enough to prevent this week from falling below last week’s low. However, the bears would like the week to have a doji body.<p>It is reasonable to assume that both the bulls and bears will be fighting today over this week’s close. The nearest target is the 1.1147 open of the week. That might be a magnet all day.<p>After a sharp 4 day rally and strong 3 day selloff, there is uncertainty. That is a hallmark of a trading range. Today will probably be a trading range day. Both the bulls and bears will scalp unless there is a strong breakout up or down.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-small-pullback-bull-trend.jpg\"><img loading=\"lazy\" src=\"2019-5-3-2.jpg\" alt=\"Emini small pullback bull trend\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini today rallied in a small pullback bull trend. The bulls are trying to undo yesterday’s sell signal on the daily chart. The signal is still in effect unless the Emini breaks above Wednesday’s high, which is also the all-time high.<p>If the Emini breaks above and then reverses down within a day or two, there will be an expanding triangle top on the 60 minute chart. Since the Emini typically stalls around a prior major high, the odds still favor a couple weeks of sideways to down trading whether or not there is a new high 1st.<p>Beginners should know that the micro Emini S&amp;P contract begins trading Monday. It is 1/10th the size of the Emini.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-5-3"
    }
  ],
  "4": [
    {
      "data": [
        "<article class=\"post-89376 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini consecutive outside bars means an oo top\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini consecutive outside bars means an oo top</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-05-04T00:30:00-07:00\">May 4, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Market Overview: Weekend Market Update</h2><p>The<strong>Emini</strong>triggered an “oo top” sell signal this week when Thursday traded below consecutive outside bars on the daily chart. It will probably trade down for 2 – 3 weeks, even if there is one more minor new high first.<p><strong>Crude oil</strong>began a correction from a 4 month buy climax. It is testing support around $60, and it will probably be in a trading range for several weeks.<p>The<strong>EURUSD</strong>Forex market has been in a 11 month bear channel with no end in sight. Traders are betting on reversals up and down every few weeks.<h2><strong>Crude oil Futures market:</strong><br>Trading range after buy climax</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Crude-oil-pullback-in-bull-trend-1.jpg\"><img loading=\"lazy\" src=\"2019-5-4.jpg\" alt=\"Crude oil pullback in bull trend\"></a></figure><p>The crude oil futures market is finally pulling back after a strong 4 month rally. Since the December low, I have been writing every week that crude oil would likely continue at least a little higher.<p>In mid-April, I changed and said that it would probably soon reverse down for at least several weeks. This was because the April 18 tight trading range was a good candidate for a Final Bull Flag. Also, there was an important measured move target just above 66. I said that a reasonable 1st target was the March 21 high of 60.50. That was the most recent breakout point, and it is still a good minimum objective fore the selloff.<h3>Where is support?</h3><p>When there is a reversal down from a buy climax, the bull trend typically evolves into a trading range. Traders should expect that for at least a few weeks. It could last a couple months. The bears are just probing for support.<p>Traders are deciding where the bottom of the trading range will be. The 1st leg down will probably end around 60, but it could be at any of the 2019 higher lows. There will then probably be a bull leg in the trading range. Traders should expect at least 2 – 3 legs before there is a breakout up or down.<p>The entire 2019 rally is a spike and channel bull trend. The spike began with the December low and ended with the January 11 high. Once there was a pullback, the channel began. That pullback was the January 14 low. Ultimately, that is a target for the bears, but they may not reach it for many months.<h2><strong>EURUSD weekly Forex chart:</strong><br>11 month bear channel</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/EURUSD-Forex-weak-bear-channel.jpg\"><img loading=\"lazy\" src=\"2019-5-4-1.jpg\" alt=\"EURUSD Forex weak bear channel\"></a></figure><p>The EURUSD weekly Forex chart has been in a bear channel for 11 months. It has been forming lower highs and lows since June, 2018. Legs up and down have lasted only a few weeks before there was a reversal. There is no evidence that this trend is about to end. Traders will continue to bet on reversals every 2 – 3 weeks.<p>Channels often spend a lot of time in trading ranges. The EURUSD Forex market had been in a tight trading range for 5 months on the daily chart. Two weeks ago, the bears broke below the trading range. Because they got consecutive closes below the range on the daily chart, the odds favor at least slightly lower prices.<p>The March 7 low of 1.1177 was the bottom of the range. It is also the neck line for the February 28 and March 20 double top on the daily chart. Since there were 2 closes below the neck line, traders are expecting a measured move down over the next couple of months. That target is 1.0942.<p>The bears want a measured move down based on the height of the entire 5 month range. That projects down to 1.0783.<h3>How does a bear channel end?</h3><p>These targets are reasonable as long as the bear channel continues. To end the bear trend, the bulls need a couple closes above the most recent major lower high. That is the March 20 high of 1.1448.<p>Even that is not enough. They then need a higher low and then a higher high. At that point, traders will conclude that the bear trend on the daily chart has ended.<p>The end of a bear trend usually means the start of a trading range. Less likely, a bear trend will reverse into a bull trend without forming at least a small trading range.<h2><strong>Monthly S&amp;P500 Emini futures chart:</strong><br>Double top, but higher prices likely</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-monthly-candlestick-chart-perfect-double-top.jpg\"><img loading=\"lazy\" src=\"2019-5-4-2.jpg\" alt=\"Emini monthly candlestick chart perfect double top\"></a></figure><p>The monthly S&amp;P500 Emini futures chart had 4 consecutive bull trend bars closing near their highs through April. That is extremely strong buying. Also, the rally was from a monthly bull trend line. Traders aggressively bought a test of support and are unlikely to give up easily. Consequently, the bulls will probably buy the 1st pullback. For example, if May trades below the April low, the Emini would probably reverse back up in June.<p>So far, the May high is an exact double top with the September 2956.00 all-time high. Perfect double tops on higher time frame charts are rare. Therefore, the Emini will probably go above the September high within the next few months. May has only begun, and the Emini might get the breakout within a week or two.<h3>Expanding triangle top likely</h3><p>The Emini has been in a trading range for 16 months. Trading range breakouts usually fail. The September high and December low are examples of failed breakouts. Therefore, a break above the all-time high will probably fail within 1 – 5 bars. But, this is the monthly chart. That means that the top might be several hundred points above the September high.<p>A reversal down from a new high would create an expanding triangle top. Some call that a megaphone pattern. The ultimate target is a break below the expanding triangle, which is the December low.<p>Since a triangle is a trading range, if there is a bear breakout, there will probably be a reversal up. The pattern at that point would be an expanding triangle bull flag. The target for the bulls would be a new all-time high. At the moment, that is unlikely after a 10 year bull trend. More likely, the Emini will continue in a big trading range that could last for a couple more years.<p>At some point, the expanding triangle stops growing and it evolves into some other pattern. At the moment, the break to a new high will probably reverse. The reasonable objective would be about a 50% retracement of the 2019 rally. That would also be a test of the 20 month EMA. At that point, traders will decide if the bull trend will resume or the reversal will continue down to the December low.<h2><strong>Weekly S&amp;P500 Emini futures chart:</strong><br>Minor reversal after perfect double top</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-weekly-candlestick-chart-has-perfect-double-top.jpg\"><img loading=\"lazy\" src=\"2019-5-4-3.jpg\" alt=\"Emini weekly candlestick chart has perfect double top\"></a></figure><p>The weekly S&amp;P500 Emini futures chart has been in a small pullback bull trend for 4 months. This is unsustainable and therefore a buy climax. I wrote about this type of thing in January 2018. Back then, I said that a 5 – 10% correction would probably begin within weeks. The Emini sold off 10% in February.<p>Will the current rally lead to another 5 – 10% correction? Probably not. This rally is not nearly as climactic as that one. Back then, the Emini was the most overbought on the daily, weekly, and monthly charts that it ever had been in the 100 year history of the stock market. A big exhaustive reversal was likely.<h3>Where is support?</h3><p>There are reasonable targets between 2 – 5% down from this week’s high. An obvious one is the most recent breakout point. That is the March 21 high of 2866.00. The March 29 unusually big gap at 2840.50 is an another magnet just below that.<p>The final nearby target is the March 25 low of 2789.50. That is the start of the most recent buy climax. The bottom of the most recent buy climax is always a magnet when there is a reversal.<p>Can a correction continue far below that? Unlikely. The Emini is in a tight bull channel. Traders expect the 1st reversal to be minor. It will therefore lead to a bull flag or a 2 month trading range rather than a trend reversal.<h2><strong>Daily S&amp;P500 Emini futures chart:</strong><br>Emini consecutive outside bars means an oo top</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-daily-candlestick-chart-has-consecutive-outside-bar-top.jpg\"><img loading=\"lazy\" src=\"2019-5-4-4.jpg\" alt=\"Emini daily candlestick chart has consecutive outside bar top\"></a></figure><p>The daily S&amp;P500 Emini futures chart did something unusual and important this week. Tuesday reversed up from below Monday’s low and reached Monday’s high. While not a traditional outside up day, it is a variant. In the Globex market, there was an actual outside up bar.<p>Wednesday then reversed down from above Tuesday’s high to below its low. It was therefore a 2nd consecutive outside day. That is an “oo top” (outside, outside, or consecutive outside bars) sell signal. It is always a double top on a smaller time frame. Since it is at major resistance and in a buy climax, it is a more reliable pattern.<p>When Thursday traded below Wednesday’s low, it triggered the sell signal. Traders should expect about 10 bars and 2 legs down as a reasonable minimum goal. The pullback could last longer. I talked about the targets in the Weekly section above.<h3>oo Top, but minor reversal</h3><p>It is common for the market to go sideways for a few days after an oo sell signal triggers. The bulls will try to resume the bull trend. However, unless the Emini breaks above the top of the oo (Wednesday’s high), the odds favor a couple legs down over the next 2 – 3 weeks.<p>Friday was a good bull day and it erased much of the bear argument. However, the oo top is still a sign of profit taking, which is likely at a prior major high. Consequently, whether or not the Emini breaks above Wednesday’s big outside down bar, it will still probably pull back for 2 – 3 weeks in May.<p>Even if the pullback is surprisingly deep and tests 2700, the odds still favor a new all-time high within a few months after that. An extremely strong bull trend like the one in 2019 typically will not reverse into a bear trend without first testing the top of the bull trend. Yes, April tested September’s high. But, the 2019 rally was strong enough so that its high will also probably get tested after any 1 – 3 month selloff.<h3>Micro Emini begins trading on Monday</h3><p>The CME will start trading the micro Emini contracts on Monday (S&amp;P, Nasdaq, Russell, and Dow). The micro Emini S&amp;P is 1/10th the size of the Emini. It might take a few weeks for the volume to get big. However, it will be tightly arbitraged with the Emini and therefore it should track it almost exactly.<p>The advantage is for beginning traders. There are often setups in the Emini that require too much risk for a small account. However, the micro contract should allow most traders to stay within their comfort zone. The small size will give traders a good opportunity to learn how to trade with much less risk. They then will be better able to focus on how to trade without constantly worrying about money. That is a very good thing.<p>Even if the round turn commission is only around $1, that is a problem for scalpers. In general, a trader should not take any trade where his transaction cost is more than 10% of his expected profit. If the cost is $1, a trader should not scalp for less than 2 points, which is $10 in the micro Emini.<p>Most traders should not scalp at all. A reasonable minimum goal with the mini Emini S&amp;P is 4 points profit. For a day trader, that is a swing trade, and traders should always have swing trading as their goal.<p>Once they are consistently profitable, they can add scalping if they would like. However, most successful day traders are swing traders.<hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-5-4"
    }
  ],
  "6": [
    {
      "data": [
        "<article class=\"post-89373 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini consecutive outside bars minor top at all-time high\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini consecutive outside bars minor top at all-time high</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-05-06T06:20:25-07:00\">May 6, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Monday May 6, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>I wrote last week that there were consecutive outside bars on the daily chart. I said that it would probably lead to a couple legs of sideways to down trading over the next 2 – weeks.<p>Furthermore, I said the pullback would likely test the most recent breakout point. That is the 2866.00 March 21 high. The big gap above the March 29 high is also a magnet.<p>Did I know in advance that Trump would create worries about the China trade deal yesterday? Of course not. However, there is always some news item that happens when the stock market makes a move. The move was going to happen anyway. Since news reporters believe that news causes everything, they do not understand that the chart already told us that the bulls were beginning to take profits last week.<p>Yes, the news will make today’s gap bigger, but the profit taking began before the news and it will probably continue down to those targets. The China news is a coincidence, not a cause.<p>The Emini will still likely make a new high in May or June. Can the Emini have a huge bull trend day today that continues far above the 2956.00 high this week? Probably not. Typically, the Emini goes sideways for at least a couple weeks when it tests a major prior high. Consequently, this selloff is probably just another example of this common tendency.<h3>Micro Emini begins trading today</h3><p>I first posted this over the weekend. The CME will start trading the micro Emini contracts today (S&amp;P, Nasdaq, Russell, and Dow). The micro Emini S&amp;P is 1/10th the size of the Emini. It might take a few weeks for the volume to get big. However, it will be tightly arbitraged with the Emini and therefore it should track it almost exactly.<p>The advantage is for beginning traders. There are often setups in the Emini that require too much risk for a small account. However, the micro contract should allow most traders to stay within their comfort zone. The small size will give traders a good opportunity to learn how to trade with much less risk. They then will be better able to focus on how to trade without constantly worrying about money. That is a very good thing.<p>Even if the round turn commission is only around $1, that is a problem for scalpers. In general, a trader should not take any trade where his transaction cost is more than 10% of his expected profit. If the cost is $1, a trader should not scalp for less than 2 points.<p>Most traders should not scalp at all. A reasonable minimum goal with the mini Emini S&amp;P is 4 points profit. For a day trader, that is a swing trade, and traders should always have swing trading as their goal.<p>Once they are consistently profitable, they can add scalping if they would like. However, most successful day traders are swing traders.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 44 points in the Globex session. It will therefore have a big gap down opening. However, the daily, weekly, and monthly charts are in bull trends. This is probably the start of a 2 – 3 week pullback and not a bear trend. Therefore, the bears will probably be disappointed by the lack of sustained selling. For example, although there was an immediate collapse on the news yesterday, the Emini has been sideways overnight.<p>When there is a big gap down, there is only a 20% chance of a big bull or bear trend day from the open. There is usually a trading range for the 1st 60 – 90 minutes. The bulls look for a double bottom or wedge bottom and then a swing up. However, the bears want a double top or wedge top and then a swing down. That trading range open represents balance and uncertainty. It typically reduces the chance of a relentless, strong trend day.<h2>Friday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-small-pullback-bull-trend.jpg\"><img src=\"2019-5-6.jpg\" alt=\"Emini small pullback bull trend\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/EURUSD-daily-Forex-chart-in-breakout-mode-in-bear-channel.jpg\"><img loading=\"lazy\" src=\"2019-5-6-1.jpg\" alt=\"EURUSD daily Forex chart in breakout mode in bear channel\"></a></figure><p>The EURUSD daily Forex chart formed a bull reversal bar on Friday. It was a also a higher low after the April 26 reversal up from below the 5 month trading range. This is a higher low major trend reversal buy setup.<p>However, there have been many major buy setups in the past 10 months of this bear channel. Trends resist change. Consequently, most major setups turn out to be minor. Every leg up and down for 10 months has reversed within 2 – 3 weeks. Traders should expect this to continue until there is a break above or below the bear channel. Until there is, the trend will continue in a bear channel.<p>The bears see the past 2 days as a pullback from Wednesday’s reversal down from the 20 day EMA. There is therefore a sell signal in addition to the buy signal. When that is the case, the chart is in Breakout Mode. It typically goes sideways. The bulls usually want to see a micro double bottom and the bears want a micro double top. Therefore, the daily chart will probably be sideways for a few days.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 30 pip range overnight. While Friday was a buy signal bar on the daily chart, the bulls so far today have been unable to go above Friday’s high to trigger the buy signal.<p>They want to either trigger the buy signal today or close the day near the high. That would turn today into another buy signal bar tomorrow. They therefore will buy pullbacks today. If there is a strong break above Friday’s high, they will swing trade. With the overnight session being quiet, today will probably remain a trading range day.<p>The bears do not want the buy signal to trigger. If it does trigger, they want it to fail. As a result, they will sell rallies to around Friday’s high. If they can get today to close near its low, today was be a minor sell signal bar on the daily chart.<p>When there is both a reasonable buy and sell setup, the daily chart is in breakout mode. It usually has to go sideways for several days.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-bull-trend-from-the-open.jpg\"><img loading=\"lazy\" src=\"2019-5-6-2.jpg\" alt=\"Emini bull trend from the open\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini had a huge gap down and then a strong reversal up. It was a Bull Trend From The Open and the Emini rallied to above yesterday’s low, closing the gap. Since it formed a bull bar on the daily chart, it is a High 2 bull flag buy signal bar for tomorrow.<p>Today’s rally was exceptionally strong. It was strong enough to neutralize last week’s oo top sell signal. There is now a 50% chance of a new all-time high this week.<p>There is also a 50% of a pullback to below the March 21 high within a couple weeks. Even if the bears get their pullback, the odds favor a new all-time high in May.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-5-6"
    }
  ],
  "7": [
    {
      "data": [
        "<article class=\"post-89555 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini High 2 bull flag but still on oo top sell signal\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini High 2 bull flag but still on oo top sell signal</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-05-07T06:20:35-07:00\">May 7, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Tuesday May 7, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday opened with a huge gap down, but the Emini reversed up and formed a big bull trend day. In part, the rally was from bears who were relieved to finally have a profit. They quickly bought back their shorts early in the day. In addition, the bulls saw the open as a brief opportunity to buy at a discount.<p>Yesterday is a High 2 bull flag buy signal bar on the daily chart. The rally was strong enough to neutralize the oo top (consecutive outside bars) from last week. The chance of a new high this week is now the same as the chance of a 2 – 3 week pullback to below the March 21 high. That is the most recent breakout point and therefore a magnet below.<p>The all-time high is an important magnet above. There will probably be a break above that high within May or June, even if there is a pullback first.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 18 points in the Globex session. The daily chart has been sideways for 3 weeks. It has had several violent moves up or down. This increases the chance of a breakout up or down that could last a couple weeks and travel 100 points or more.<p>There has been at least one swing trade up or down every day. Day traders expect that tendency to continue.<p>Because yesterday was a buy climax, there is a 75% chance of at least a couple hours of sideways to down trading that begins by the end of the 2nd hour today.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-bull-trend-from-the-open.jpg\"><img src=\"2019-5-7.jpg\" alt=\"\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/EURUSD-Forex-breakout-mode.jpg\"><img loading=\"lazy\" src=\"2019-5-7-1.jpg\" alt=\"EURUSD Forex breakout mode\"></a></figure><p>The EURUSD daily Forex chart has been sideways for 4 days. There is a small higher low and lower high. It is a tight trading range, and there is now a triangle on the 4 hour chart. This is a Breakout Mode pattern.<p>The bears see a micro double top (Low 2 bear flag) just below the EMA on the daily chart. They want a continuation of their 11 month bear channel.<p>The bulls, however, hope that the breakout below the 5 month trading range will fail. They see Friday as a buy signal bar for a higher low major trend reversal.<p>While the bulls might get a 2 week rally, they need more. Unless there is a month-long rally that breaks above the March 20 major lower high, the bear trend will remain intact.<p>The bears simply need to prevent major higher lows and higher highs. As long as they do, traders know that the odds continue to favor lower prices over the next month or two.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart rallied above the highs of the past 2 bull days and reversed down 40 pips overnight. But, the selloff lacked consecutive big bear bars on the 5 minute chart. There is an absence of conviction. This selloff is therefore more likely simply a leg in the 4 day tight trading range than the start of a bear trend.<p>The bulls and bears are looking for 10 – 20 pip scalps. Traders are waiting for a catalyst that could lead to the next brief 30 – 50 pip breakout up or down. Thursday night’s China tariff announcement is the next potential catalyst.<p>However, there have been many catalysts this year and none resulted in a big sustained move. Day traders will continue to look to scalp reversals on most days. With today at the apex of a triangle, they expect to scalp again today.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-sell-vacuum-test-of-breakout-point.jpg\"><img loading=\"lazy\" src=\"2019-5-7-2.jpg\" alt=\"Emini sell vacuum test of breakout point\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini again sold off to below last week’s low, but reversed up into the close. The selloff was a sell vacuum test of important support.<p>I have been saying for several weeks that the Emini would probably pull back to below the March 21 high. That is because it has been pulling back to below breakout points for several months. March 21 was the most recent breakout point.<p>The reversal up was strong enough to make traders wonder if the selloff has ended. The Emini fell to about a measured move down from last week’s consecutive outside bars. In addition, traders got the 2 legs down that they expected. Finally, the selloff was about the same size as the other selloffs in the 5 month rally. Consequently, traders are wondering if the bull trend will now resume.<p>However, there are still magnets below. While the Emini might bounce for a few days, if it does not reverse up strongly, it will probably test the gap above the March 29 high.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-5-7"
    }
  ],
  "8": [
    {
      "data": [
        "<article class=\"post-89558 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini selloff testing March breakout point and gap\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini selloff testing March breakout point and gap</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-05-08T06:20:25-07:00\">May 8, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Wednesday May 8, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>I have been saying for several weeks that the Emini probably had to pull back below the March 21 high. This is because the Emini pulled back below breakout points several times this year. That is the most recent breakout point and therefore a magnet. Yesterday dipped below the target and reversed up sharply at the end of the day.<p>If there is strong follow-through buying today, traders will suspect that the bull trend is resuming. More likely, the selloff has been strong enough to generate confusion. When there is confusion, traders are quick to take profits. Consequently, the Emini might have to go sideways to a little more down before the bulls will get their new all-time high.<p>The gap above the March 29 high is another magnet just below, as is the March 25 higher low. Will this selloff last more than a few weeks? It might. An extreme buy climax often has a surprisingly deep pullback.<p>However, even if the bears retrace half of the 2019 rally, the bulls will buy a reversal up. They are confident that the Emini will soon break above the September/May double top at the all-time high.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 13 points in the Globex session. But, yesterday’s reversal up was surprisingly strong. Consequently, there will probably be at least a small 2nd leg sideways to up today.<p>Today and tomorrow will probably be trading range days after a sell climax down to major support and ahead of Thursday night’s announcement on China tariffs. But, even though a leg up and a leg down are likely, the range will probably be big enough for swing trading.<p>Day traders will look for swings that last 2 – 3 hours. They then will look for reversal patterns like wedges tops and bottoms, and double tops and bottoms. If legs are strong, they will wait for 2nd signals, like micro double tops and bottoms.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-sell-vacuum-test-of-breakout-point.jpg\"><img src=\"2019-5-8.jpg\" alt=\"emini bull trend reversal at support\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/EURUSD-Forex-apex-of-triangle-so-breakout-mode.jpg\"><img loading=\"lazy\" src=\"2019-5-8-1.jpg\" alt=\"EURUSD Forex apex of triangle so breakout mode\"></a></figure><p>The EURUSD daily Forex chart has been sideways for 5 days in a tight trading range. This is a small triangle and the chart is therefore in breakout mode. It is as likely to go up 100 pips as it is to go down 100 pips.<p>However, it is still in an 12 month bear channel. Consequently, as long as it continues to make lower highs, the odds will favor lower lows. The bulls need a strong break above the March 20 1.1448 major lower high before traders will conclude that the bear trend has ended.<p>At the moment, there is no credible bottom. The selloff is in search of support. That might come at a measured move down from the February 28/March 20 double top.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 25 pip tight trading range overnight. Today so far is a small inside day at the apex of a 5 day triangle. Traders have been selling around the high of the prior day and buying around the low of the prior day for a week.<p>Since the range is getting very tight, there will probably be a breakout within a few days. When a there is a triangle breakout, there is a 50% chance that the 1st breakout will fail and reverse. In addition, there is a 50% chance that the successful breakout will be up or down.<p>The breakout will probably only go about 100 pips before pulling back. This is because the daily chart has been having pullbacks every few days and there is no sign that this is about to change.<p>Day traders will continue to scalp until there is a breakout on the 5 minute chart. Once it comes, day traders will only look for a small 30 – 50 pip swing because that has been the pattern for months.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-trading-range-day-ahead-of-china-tariffs.jpg\"><img loading=\"lazy\" src=\"2019-5-8-2.jpg\" alt=\"Emini trading range day ahead of china tariffs\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini rallied in a weak bull channel for most of the day. A bull channel is a bear flag. The bears got a break below the bull trend line in a sharp selloff down to the open at the end of the day. There was mostly trading range price action today.<p>Trump is making an announcement tomorrow night about Chinese tariffs. That could lead to a big gap up or down on Friday.<p>Today was a bull doji bar on the daily chart, and the daily chart is in a bull trend. Today is therefore a weak buy signal bar for tomorrow. The bulls want the week to close above the open. This week would then be a buy signal bar on the weekly chart for next week.<p>However, the March 29 high is the bottom of a big gap up. It is therefore a magnet below. Also, the 5 day bear channel is tight. At the moment, the odds favor sideways to down trading for at least another week, even if the Emini bounces for a couple days.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-5-8"
    }
  ],
  "9": [
    {
      "data": [
        "<article class=\"post-89561 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini in breakout mode ahead of Trump Chinese tariff announcement\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini in breakout mode ahead of Trump Chinese tariff announcement</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-05-09T06:20:13-07:00\">May 9, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Thursday May 9, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday was a weak follow-through day for the bulls. On Tuesday, they had a strong reversal up after a dip below the March high. But yesterday’s rally had a lot of trading range price action. There was a late selloff that tested the open and the day closed in its middle third.<p>Yesterday was a bull inside bar on the daily chart after a 5 day pullback in a strong bull trend. It is therefore a buy signal bar for today. However, it was a doji bar. Furthermore, the 5 day selloff has been in a tight bear channel. In addition, the big gap above the March 29 high is a strong magnet below. Consequently, the Emini still might drift lower for a week or two more.<p>Since yesterday was an inside bar in an early bear trend, it is a sell signal bar for today. But, it had a bull body. That means there might be more buyers than sellers below yesterday’s low. It is therefore a weak sell setup.<p>The bulls are eager to get a new all-time high. While they probably will get it, it might not come for several more weeks. The unclear price action of the past week makes more sideways to down trading likely. After the extreme 2019 rally, the pullback could last a month or more.<p>Trump might increase Chinese tariff’s tonight. His decision could create a big gap up or down tomorrow. If he makes an announcement during trading today, it could lead to a huge breakout or a breakout and a reversal.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 22 points in the Globex session. It therefore will probably gap down. A big gap has an increased chance of leading to a trend. If there is a trend, down is slightly more likely.<p>However, there is a strong trend from the open only 20% of the time. Most big gaps result in trading ranges for the 1st hour or so. Day trading bulls look for a double bottom or wedge bottom and then a swing up. The bears look for the Emini to go sideways to up to the EMA. Then then look for a double top or a wedge top and a swing down.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-trading-range-day-ahead-of-china-tariffs.jpg\"><img src=\"2019-5-9.jpg\" alt=\"There was mostly trading range price action today.\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/EURUSD-Forex-triangle-in-bear-channel.jpg\"><img loading=\"lazy\" src=\"2019-5-9-1.jpg\" alt=\"EURUSD Forex triangle in bear channel\"></a></figure><p>The EURUSD daily Forex chart is in a triangle in a yearlong bear channel. This is a Breakout Mode pattern. That means the odds of a successful bull breakout are the same as for a bear breakout. Furthermore, there is a 50% chance that the 1st breakout will fail.<p>Finally, over the past year, all legs up and down reversed after 2 – 3 weeks. Consequently, the breakout will probably last a couple weeks and then reverse for a couple weeks.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 30 pip range overnight. Also, each of the past 6 days have mostly overlapped one another. Traders have been buying reversals up from around the prior day’s low and selling reversals down from the prior day’s high. This is unsustainable and traders therefore expect a breakout within a few days. Until then, they will continue to scalp reversals.<p>Trump might announce further China tariffs tonight. This could be the catalyst for a breakout or failed breakout up or down. In addition, he might make an announcement at any point today. If there is a strong breakout lasting several bars on the 5 minute chart, traders will enter in the direction of the breakout and hold for a swing trade. But, if there is a strong reversal, they will swing trade in the opposite direction.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Bull-trending-trading-range-day.jpg\"><img loading=\"lazy\" src=\"2019-5-9-2.jpg\" alt=\"Bull trending trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini sold off and closed the gap above the March 29 high today. It then reversed up strongly from a lower low major trend reversal to above yesterday’s low. Today is therefore now a buy signal bar on the daily chart. However, any announcement about Chinese tariffs tonight will override any chart pattern. There is an increased chance of a big gap up or down tomorrow.<p>So far, the 6 day selloff lacked consecutive big bear bars. Also, it is a one bar pullback on a very strong weekly chart. Therefore, this might be the bottom.<p>However, the 6 day bear channel is tight and there are other targets below. In addition, after a buy climax and a perfect double top with the all-time high, there is an increased chance that the selloff could last 2 – 3 weeks. Consequently, there is confusion. Confusion typically leads to a trading range. Even though the Emini will probably get a new all-time high in May or June, it is more likely to go sideways for at least another week first.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-5-9"
    }
  ],
  "12": [
    {
      "data": [
        "<article class=\"post-89570 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini monthly double top but weak sell setup\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini monthly double top but weak sell setup</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-05-12T10:06:02-07:00\">May 12, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Market Overview: Weekend Market Update</h2><p>The<strong>Emini</strong>formed a micro double bottom at important support this week. If the bulls get follow-through buying this week, there will probably be a test of 3,000 in May.<p>The<strong>crude oil</strong>daily chart has probably entered a trading range. It is searching for a bottom. The legs up and down will probably last 2 – 3 weeks.<p>The<strong>EURUSD</strong>weekly Forex chart is in a weak bear channel. Traders are continuing to look for 100 – 200 pip moves up and down, lasting 2 – 3 weeks.<h2><strong>Crude oil Futures market:</strong><br>First leg down in developing trading range</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Crude-oil-daily-chart-has-1st-leg-down-in-likely-trading-range.jpg\"><img loading=\"lazy\" src=\"2019-5-12.jpg\" alt=\"Crude oil daily chart has 1st leg down in likely trading range\"></a></figure><p>The crude oil futures market has sold off for 3 weeks from a buy climax at a measured move target. Nothing is coincidental, and it is amusing that the diabolical traders chose a religiously significant number (66.60) for the top.<p>In mid-April, I said that the 8 day tight trading range would probably be the Final Bull Flag and that the high would be just above the measured move target. In addition, I said that there would be a pullback that had at least 2 legs down, and it would dip below the March 21 high. It has achieved all of those goals.<p>Finally, I said that the market would probably enter a trading range for a couple months. That is still the case. The market is now searching for the bottom of the range. The bulls want it to be the low of the May 6 outside up day.<p>However, the 3 week bear channel is tight. In addition, the 6 day tight range below the EMA is a bear flag. Also, the absence of a clear buy signal make it likely that the daily chart will be sideways to down for at least another week.<h3>2nd leg down likely</h3><p>This 3 week selloff is probably just the 1st of at least 2 legs sideways to down. If there is a rally for a week or two, traders will expect it to be only a test of the April high. They will sell the rally. That would create a lower high major trend reversal sell setup. Traders would then expect a 2nd leg down.<p>However, a major sell setup only has a 40% chance of starting a bear trend. More likely, the bears would get a few weeks down to one of the higher lows in the 4 month rally. The bottom will probably be below 58. Much less likely, it would be around the January 14 low of 51.42.<h3>Confusion and uncertainty create trading ranges</h3><p>After a reversal down from a buy climax, traders become uncertain. They are confident that the market will not quickly go too high or too low. This results in them taking quick profits.<p>It also makes them comfortable scaling into shorts during rallies and into longs during selloffs. Buying low, selling high, and taking quick profits creates a trading range. This process is currently underway and it will probably last at least another month.<p>After the extreme 2018 sell climax and the extreme 2019 rally, the trading range could last many months and possibly for the remainder of the year.<h2><strong>EURUSD weekly Forex chart:</strong><br>Endless weak, tight bear channel</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/EURUSD-weekly-Forex-chart-in-12-month-bear-channel.jpg\"><img loading=\"lazy\" src=\"2019-5-12-1.jpg\" alt=\"EURUSD weekly Forex chart in 12 month bear channel\"></a></figure><p>The EURUSD weekly Forex chart has been in a tight bear channel since last June. It continues to reverse every 2 – 3 weeks. Yet, it also is making lower highs and lows, and it is therefore in a bear trend.<p>The trend is so weak that it is almost sideways. Traders see the chart as a breakout mode pattern. It has lasted an unusually long time. Consequently, traders will switch to trend trading once there is a clear breakout up or down.<p>The past 2 weeks had bull bodies. This is a weak bear flag. Traders will probably buy below this week’s low.<p>If next week trades above this week’s high, it would trigger a buy signal. The bulls see this week’s bull inside bar as a buy signal bar for a failed break below a 5 month trading range. However, 3 sideways bars just below the EMA is a weak buy setup. It is simply a continuation of the yearlong price action.<h3>No sign of a breakout</h3><p>There is no sign of an imminent breakout up or down. Traders will continue to look for 100 – 200 pip moves up and down, and then another reversal.<p>Until there are either consecutive big bull trend bars closing on their highs or consecutive big bear trend bars closing on their lows, traders will bet on a continuation of the weak, tight bear channel.<h2><strong>Monthly S&amp;P500 Emini futures chart:</strong><br>Emini monthly double top, but weak sell setup</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-monthly-candlestick-chart-perfect-double-top-but-minor-reversal-1.jpg\"><img loading=\"lazy\" src=\"2019-5-12-2.jpg\" alt=\"Emini monthly candlestick chart perfect double top but minor reversal\"></a></figure><p>The monthly S&amp;P500 Emini futures chart&nbsp;traded above the April high and then below the April low. May is therefore an outside down month. In addition, it formed a double top with the September all-time high.<p>However, there were 4 consecutive bull bars closing near their highs. In addition, the December selloff was simply a pullback to the 20 month EMA and a 10 year bull trend line in a strong bull trend. Consequently, there are probably more buyers than sellers below the April low.<p>This is a low probability top. Traders should expect a new all-time high within a month or two. Since there are several weeks left in May, the bulls might get their new high this month. If so, May would then go back above the April high. As a result, it would become an outside up bar after 1st being an outside down bar.<h3>Limited new high likely</h3><p>That would slightly increase the chance of higher prices this summer. But, the multiple reversals means there is balance between the bulls and bears. It increases the chance of June largely overlapping April and May.<p>The strong 1st 4 months of the year make it unlikely that the bears can get more than a few months of sideways to down trading. However, the Emini is now at the top of a 16 month trading range. Markets have inertia. This means they resist change. Traders should assume that the current market condition will continue indefinitely until it clearly as changed.<p>This means that a break to a new high will probably not last more than a few bars before there is a pullback into the range. Since this is a monthly chart, a few bars is a few months. It can also mean a couple hundred points. Therefore, in addition to not much downside risk, there is probably not much upside potential either this year.<p>Traders will soon realize that the downside risk to the December low is more than the upside potential above the all-time high. This will make them hesitate to buy much above the September high.<h3>Emini transitioning into 10 year trading range</h3><p>The 16 month trading range will probably get a higher high, but not much higher. A reversal down would form an expanding triangle top. That is a variation of a higher high major trend reversal.<p>It is important to note that major reversal patterns only actually lead to a major reversal 40% of the time. Therefore the 16 month range will probably continue for many more months.<p>Furthermore, the stock market has been in a huge 10 year bull trend. Also, there is a major top on the monthly chart in the bond market. The Emini is probably in the early stages of a huge trading range that could last a decade, like from 1998-2009 and 1965- 1980.<p>During those times, there were several 30 – 50% selloffs of 50% and 50-100% rallies. There is money to be made when buying low and taking profits near the high. However, buy and hold traders will probably not make much money over the next 10 years.<h2><strong>Weekly S&amp;P500 Emini futures chart:</strong><br>Consecutive doji bars after double top</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-weekly-candlestick-chart-has-2-doji-bars-after-double-top.jpg\"><img loading=\"lazy\" src=\"2019-5-12-3.jpg\" alt=\"Emini weekly candlestick chart has 2 doji bars after double top\"></a></figure><p>The weekly S&amp;P500 Emini futures chart formed doji bars over the past 2 weeks. The bears want a trend reversal down from the double top.<p>However, last week was a bull doji bar. That is a low probability sell signal bar. While this week had a bear body, it was small. The week was another doji bar with a big tail below. This is a bad entry bar for the bears. In addition, the 4 month bull trend is strong. Consequently, the weekly chart does not currently have much downside risk.<p>The 2 dojis represent balance. Traders are not rejecting the all-time high as too expensive. They are also not yet buying aggressively.<p>This week was a pullback in a 4 month trend. That makes it a High 1 bull flag. But a bear doji is a weak buy signal bar. There might be more sellers than buyers above its high, just as there were more buyers than sellers below last week’s low.<p>This could result in a few more weeks of sideways to down trading before a new high. The absence of a credible top or strong reversal down make higher prices likely soon.<h2><strong>Daily S&amp;P500 Emini futures chart:</strong><br>Pullback testing major support at 2018 triple top</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-daily-chart-micro-double-bottom-breakout-test-of-2018-triple-top.jpg\"><img loading=\"lazy\" src=\"2019-5-12-4.jpg\" alt=\"\"></a></figure><p>The daily S&amp;P500 Emini futures chart had consecutive outside bars 8 days ago. At that time, I said that it was a reliable sell setup. I said that traders should expect at least a couple legs down for 2 – 3 weeks, and possibly a couple months.<p>In addition, I talked about the targets below. I wrote that the pullback would dip below the March 21 high and probably would close the gap above the March 29 high. That would also result is a breakout pullback test of the October-November-December triple top.<p>The bears achieve all of these objectives this week. They always want more. They would like to get down to the March low, a 50% retracement, or even the December low.<h3>Buy signal, but possibly more trading range</h3><p>Friday was a big outside up day. It followed a good bull day on Thursday. This is a micro double bottom and it is at important support.<p>Friday is a buy signal bar for Monday. This pullback is about the size of prior pullbacks in 2019. The all-time high is a strong magnet above. Therefore, traders are wondering if the pullback ended this week.<p>They will find out early next week. If the bulls get a series of bull bars closing near their highs, especially if the bars are big, they will probably get their new high in May.<p>Alternatively, if Monday is an inside day, or if it goes above Friday’s high but has a bear body or a close in the middle, the Emini will probably go sideways for a few days. Traders will wonder if the chart will form a lower high and then fall for a 2nd leg down.<p>Because the micro double bottom was strong and at important support, a break below would have a 50% chance of a measured move down. That would be around 2700 and a 50% retracement of the 2019 rally. At the moment, it is more likely that the Emini will make a new high before falling far below the May low.<h3>Risk of 2nd leg down</h3><p>That final target is unlikely without 1st seeing a new all-time high. However, the 8 day bear channel has been tight. In addition, a consecutive outside bar top sometimes leads to a selloff that lasts more than 20 bars. Therefore, traders will watch to see if any rally over the next week or two begins to stall below the all-time high.<p>If so and if there is a bear bar closing near its low, traders will have a swing sell setup. If that were to happen, many of the bulls who held through this 1st leg down would wonder if the selloff would reach those lower targets.<p>This could result in chain reaction selling. As the selloff begins, it could scare an increasing number of bulls out of their longs. Theirs is a crowded trade. If many sell at the same time, the result could be a panic selloff similar to the one in December.<p>But, the 2019 bull trend has been strong. In addition, the 16 month trading range is within a 10 year bull trend. Therefore, even if there is a surprisingly quick selloff to 2600, the bulls would still probably buy it, like they bought the December crash.<h3>Big double top, but small risk</h3><p>There is a double top on the monthly chart. But the 2019 rally was exceptionally strong and it followed a reversal up from a monthly bull trend line. Consequently, there is currently only a 30% chance that this double top will lead to a strong break below the December low.<hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-5-12"
    }
  ],
  "13": [
    {
      "data": [
        "<article class=\"post-89567 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini micro double bottom after closing gap above March 29 high\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini micro double bottom after closing gap above March 29 high</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-05-13T06:20:03-07:00\">May 13, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Monday May 13, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini had a big outside up day on Friday. This was after Thursday’s bull reversal after closing the Gap above the March 29 high. After May 1 formed a consecutive outside down sell signal, I said the the minimum goal was a 2 – 3 week pullback. Furthermore, I said it would have at least 2 legs, which is typical after a buy climax. Finally, I said it would close the gap above the March 21 high and probably close the gap above the March 29 high.<p>After achieving all of those minimum goals, Friday reversed up strongly for the 2nd consecutive day of testing the March 29 high. This is a credible buy signal. I have been saying that the Emini would probably make a new high after at least a 2 – 3 week pullback, but that the pullback could last a couple months.<h3>Selloff can be bigger and deeper that traders think</h3><p>The 8 day selloff has been in a tight bear channel. When that happens, the selloff is often a complex 1st leg down in a bigger 2 legged pullback. We will find out over the next 2 weeks. The bulls need to break above Friday’s high. Otherwise, the selloff will continue down in search of a bottom.<p>If the Emini races up to a new high, it will probably continue to above 3,000. However, if it rallies but stalls again around the all-time high, traders will sell a reversal down.<p>What sometimes happens in situations like this is that not many bulls take profits on the 1st leg down. But if a 2nd leg down begins or if the 1st leg keeps growing, the profit taking can create a panic. This can lead to a surprisingly big and fast move down. If this begins, the Emini will probably retrace about half of the 2019 rally.<p>More likely, if there is a rally and then a 2nd leg down, it will probably be mostly sideways. It might dip below last week’s low, but probably not by much. The bulls will buy it and get their new high within a couple weeks later.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 54 points in the Globex session, despite 2 big bull days last week. That increases the chance of a breakout below last week’s micro double bottom and a quick move down to the next support at the March 25 low.<p>A big gap has only a 20% chance of leading to a strong trend from the open. An opening trading range for the 1st hour is more common. The bulls want either a double bottom or a wedge bottom, and then a swing up. The bears prefer to sell closer to the average price (the 20 bar EMA). Once there, they will look for either a double top or a wedge top and then a swing down.<h2>Friday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-outside-up-day.jpg\"><img src=\"2019-5-13.jpg\" alt=\"Emini outside up day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/EURUSD-Forex-bull-leg-in-bear-channel-in-China-trade-war.jpg\"><img loading=\"lazy\" src=\"2019-5-13-1.jpg\" alt=\"EURUSD Forex bull leg in bear channel in China trade war\"></a></figure><p>The EURUSD daily Forex chart has rallied for 3 weeks after another new low in its yearlong bear channel. All prior legs up and down ended after about 3 weeks.<p>The momentum up is good enough for the rally to break above the May 1 high. It will probably test the April 12 high and it might test the March 20 high.<p>If the bulls get 2 closes above that March high, traders will assume that the bear trend has ended. The market would be back in its 5 month tight trading range, and again in Breakout Mode.<p>Traders want to see a strong break above the January 10 high before concluding that the chart is now resuming the 2017 bull trend. Until then, they will continue to look for reversals every few weeks.<p>There is no top yet in the current bull leg. Therefore traders expect at least slightly higher prices.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been sideways to up for 3 weeks. It has rallied 30 pips over the past hours and it just broke above last week’s high. Consequently, it triggered the 2nd buy signal in 3 weeks. It is now likely to test the May 1 and April 12 highs this week.<p>Although the 3 week rally is not strong, it is always easier to make money buying when the trend is up. Because the legs are not big, day traders are still scalping for 10 – 20 pips.<p>However, they know that the rally will probably reach the magnets above. This increases the chance of a breakout above any of the highs and a quick move up to the next target. Consequently, they are more willing to look for 50 pip swing trades.<p>Because the 5 minute chart is rallying, it is difficult for the bears to make money. They need to wait for the rally to transition into a trading range. If it does, the bears will look for 10 pip scalps.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-spike-and-channel-bear-trend.jpg\"><img loading=\"lazy\" src=\"2019-5-13-2.jpg\" alt=\"Emini spike and channel bear trend\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>After a big gap down, the Emini sold off in a Spike and Channel bear trend. As is typical, there was a bull breakout above the bear channel and then a swing up to the start of the bear channel. After a wedge rally, the day sold off and closed in its lower 3rd.<p>With today closing in the lower 3rd of the day’s range and breaking below Friday’s bottom attempt, the Emini will probably trade lower. There is an increased chance of a gap down below the 2800 Big Round Number tomorrow.<p>Today did not have a bull body on the daily chart. It is therefore a weak buy signal bar for tomorrow. Also, the 3 week bear channel has been tight. The odds are that the bears will sell any 3 – 5 day rally. The bulls will probably need a small double bottom before making a new all-time high. Consequently, a lower high and 2nd leg sideways to down is more likely that a quick resumption of the 2019 bull trend.<p>Despite the strong selling, the 2019 reversal up from the 10 year bull trend line was exceptionally strong. Consequently, this selloff will probably result in a higher low, even if it continues down to 2700 first.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-5-13"
    }
  ],
  "14": [
    {
      "data": [
        "<article class=\"post-89564 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini 3 week minor trend reversal on China tariffs\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini 3 week minor trend reversal on China tariffs</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-05-14T06:20:51-07:00\">May 14, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Friday May 10, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>There were strong bull days on Thursday and Friday last week. However, the Emini yesterday opened near Friday’s low and sold off to test the 2800 Big Round Number. A bear break below a reasonable buy setup typically has at least a small 2nd leg down. Consequently, the Emini will probably trade lower over the next week or two. The next support is the March 25 low of 2789.50. Below that is the March 8 low of 2726.50. Finally, there is a gap above the February 8 high of 2686.25<p>The 2 week selloff has been in a tight bear channel. Once there is a reversal up on the daily chart, there will probably be a lower high. The selloff is strong enough for at least a small 2nd leg sideways to down after the 1st 3 – 5 day rally. Therefore, this selloff is probably a bear leg in what will become a trading range over the next couple of weeks.<p>Even if the selloff continues down to 2600 and retraces half of the 2019 rally, the odds are that the bulls will buy it. The bears need consecutive big bear bars to convince traders that this selloff is the start of a bear trend. Until then, the odds are that it is a pullback from the 2019 rally and there will be a rally to a new high.<h3>3 – 5 day bounce soon</h3><p>The midday reversal up yesterday was strong. This is a sign of aggressive bulls. If there is a rally on the open, yesterday’s late selloff could be a higher low major trend reversal.<p>Since the daily chart is getting oversold, a rally is likely soon. One target is Friday’s high. It was a strong bull bar and a buy setup on the daily chart. Many bulls who bought will buy more lower, expect the Emini to get back to their original buy around Friday’s high. They will probably be right, even if the selloff continues down for a few more days first.<p>But, the 3 week selloff has been in a tight bear channel. When that is the case, the 1st reversal up usually forms a lower high. There is then a 2nd leg sideways to down. That is still likely.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 16 points in the Globex session. There has been bad follow-through after bear bars on the daily chart all year, including during this 3 week selloff. Consequently, there is a slightly increased chance of a bull day today. This is true even though the selloff will probably test lower over the next couple weeks.<p>Yesterday formed a Spike and Channel bear trend on the 5 minute chart. That usually evolves into a trading range. The midday rally was a bull leg in the range and the late selloff was a bear leg.<p>On the 5 minute chart, there is now a big double top and a higher low major trend reversal. That is also a head and shoulders bottom. The bulls therefore have a 40% chance of a bull trend today. Since the buying yesterday was strong and the daily chart is oversold, there is a reduced chance of a strong bear trend day today.<p>With strong legs up and down yesterday, day traders expect swing trades lasting at least a couple of hours today. In addition, there is an increased chance of a bull trend day today.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-spike-and-channel-bear-trend.jpg\"><img src=\"2019-5-14.jpg\" alt=\"Emini spike and channel bear trend\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/EURUSD-Forex-double-top-bear-flag-but-in-bull-leg-in-bear-channel.jpg\"><img loading=\"lazy\" src=\"2019-5-14-1.jpg\" alt=\"EURUSD Forex double top bear flag but in bull leg in bear channel\"></a></figure><p>The EURUSD daily Forex chart has been in a tight trading range for 2 weeks. It is therefore in breakout mode, where there is always both a buy and a sell setup.<p>The bulls have a higher low major trend reversal. In addition, there have been many bull bars over the past 2 weeks so the buying pressure is good. Finally, the April 12 lower high is nearby and it is a magnet.<p>For the bears, the daily chart has been in a bear channel for a year. It keeps forming lower highs and lows. There is now a small double top. Since it is in a bear trend, it is a double top bear flag.<p>However, yesterday was a small sell signal bar and today so far is a small entry bar. This might not be enough to break below the 2 week tight trading range. Consequently, most traders are taking quick profits.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart broke below yesterday’s low and triggered a sell signal on the daily chart. It reversed down yesterday from above last week’s high. Furthermore, last week’s range was small. The EURUSD Forex bears could therefore get a break below last week’s low. This week would then be an outside down week. That would increase the chance of a break below the April low over the next week.<p>In the past 10 minutes, the 5 minute chart broke below a 2 day trading range. Consequently, the bears are hoping that the double top on the daily chart will be the start of a move down to below the April low.<p>However, this breakout so far is small and there is no follow-through selling yet. The bears need more big bear bars closing near their lows. If they get them, they will sell at the market and small pullbacks for both scalps and swing trades.<p>But, the daily chart is still in the middle of its 2 week tight trading range. Most breakout attempts fail. Unless the bears get follow-through selling over the next hour, the bulls will continue to buy reversals up for scalps. They will wait for the 5 minute chart to go sideways for 10 or more bars before looking to buy. If it does, the result will be another day with mostly sideways trading.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-bull-trend-from-the-open-then-reversal-1.jpg\"><img loading=\"lazy\" src=\"2019-5-14-2.jpg\" alt=\"Emini bull trend from the open then reversal\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>Yesterday was a big bear day. Today opened near its high and rallied. It then entered a trading range midday. The bears who sold yesterday’s close are trapped. This is similar to what happened on January 3 and 4, although much weaker.<p>In January, there was a strong reversal up from a 10 year bull trend line. Now, the Emini is reversing up from a bull flag. In addition, the 3 week bear channel is tight. Finally, today was not a big bull trend day on the daily chart. The odds favor a 3 – 5 day rally now or soon and then a lower high.<p>Whether or not there is a lower high and a test of yesterday’s low, or even of the February 8 gap, the odds favor a new all-time high within a couple months.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-5-14"
    }
  ],
  "15": [
    {
      "data": [
        "<article class=\"post-89827 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini minor reversal up from 2800 but lower high likely\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini minor reversal up from 2800 but lower high likely</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-05-15T06:20:13-07:00\">May 15, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Wednesday May 15, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday rallied in a Small Pullback Bull Trend. In addition, Monday was a big bear day and yesterday opened near Monday’s high. This is a buy signal, similar to January 4. However, these 2 bars are small and have prominent tails. Furthermore, the 3 week bear channel is tight. This is a weak buy setup..<p>Will this lead to a huge rally, like in January? No. The context is different and the bars are weaker. That was after a crash down to the 10 year bull trend line. This is a 3 week bull flag late in a bull trend and the Emini probably has been in a trading range since early March.<p>The bulls will need a double bottom before they can get a new all-time high. Consequently, if the Emini rallies for 3 – 5 days, it will probably form a lower high around Friday’s high.<p>However, the odds still favor a new all-time high this summer. This is true even if the pullback continues down to close the gap above the February 8 high at 2686.25.<h3>Bear channel will probably evolve into small trading range soon</h3><p>There have been 6 legs down in the bear channel on the 60 minute chart since the May 1 high. That is unusual. Unusual means unsustainable. Therefore, traders expect a change in the price action soon.<p>When there is a bear channel, there is only a 25% chance of a bear breakout and an acceleration down. More often, there is a break above the bear trend line and then a transition into a trading range.<p>This will probably happen over the next week. Consequently, the bulls will look for a reversal up from around Monday’s low.<p>Less likely, there will be a series of big bear bars closing below that low. If that happens, traders will look for a 150 point measured move down.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 20 points in the Globex session. The bulls hope that the 2 day rally will form a higher low today and they then want the Emini to rally for several days.<p>The bears will continue to sell rallies, betting on a continuation of the 3 week bear channel. In addition, if they can get a strong break below Monday’s low, they might make the bulls give up. If they give up, there can be a big bear trend day.<p>Today will probably be like most days over the past month and have at least one swing up and down. Also, because the 2 day rally was big, the Emini will probably begin to form a trading range on the 60 minute chart.<p>Therefore, after a big gap down today, the bulls will look for a reversal up within the 1st couple of hours. Less likely, the big gap down will be the start of a big bear trend day.<p>When there is a big gap up or down, there is an 80% chance of a trading range for the first hour. Then, the bulls look for a double bottom or wedge bottom for an early low of the day. The bears want a double top or wedge bear flag near the EMA and then a swing down.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-bull-trend-from-the-open-then-reversal-1.jpg\"><img src=\"2019-5-15.jpg\" alt=\"Emini bull trend from the open then reversal\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/EURUSD-Forex-double-top-bear-flag.jpg\"><img loading=\"lazy\" src=\"2019-5-15-1.jpg\" alt=\"EURUSD Forex double top bear flag\"></a></figure><p>The EURUSD daily Forex chart has sold off for 3 days from a double top bear flag in a yearlong bear channel. However, there have been many bull bars over the past 3 weeks. In addition, the rally from the low was smaller and had few bars than most prior bear rallies. Consequently, there is still at least a 50% chance of a test of the April 12 high before a new low.<p>But, even if the bulls get their rally, the bear channel is still in effect. That means the odds continue to favor new lows after every 2 – 3 week rally. This will continue until the bulls get a strong breakout above a major lower high. The most recent is the March 20 high.<p>At some point, the bulls will achieve their goal. Then, the bear trend will have evolved into a trading range. The bulls will need several strong rallies with higher highs and lows before traders will conclude that a bull trend is underway.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart sold off 40 pips in a tight bear channel over the past 4 hours. Bears are selling small bounces. Because the channel is tight, cannot make money. They are waiting for the bears to begin to take profits. This will result in a trading range. At that point, the bulls will begin to buy for scalps.<p>I mentioned yesterday that this week might form an outside down bar on the weekly chart. It reversed down from above last week’s high and last week’s low is only 11 pips below today’s current low. That is a magnet for the rest of the week.<p>Because the daily chart has been in a tight range for 3 weeks, traders are looking to buy selloffs, sell rallies, and take quick profits. Therefore, there probably will be buyers around last week’s low.<p>The legs up and down have been small. It has been difficult for day traders to make more than 20 pips on any trade. There is no sign that this is about to end.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-outside-up-day-with-bull-dominant-feature.jpg\"><img loading=\"lazy\" src=\"2019-5-15-2.jpg\" alt=\"Emini outside up day with bull dominant feature\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini reversed up from below yesterday’s low. By breaking above yesterday’s high, today was an outside up day. This is the 2nd one in the past week. The odds now favor 2 – 5 days up. There is an increased chance of a gap up and bull trend tomorrow. However, there will probably be a 2nd leg sideways to down before there is a new all-time high.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-5-15"
    }
  ],
  "16": [
    {
      "data": [
        "<article class=\"post-89830 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini 2nd outside bar buy signal for minor reversal up\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini 2nd outside bar buy signal for minor reversal up</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-05-16T06:20:29-07:00\">May 16, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Thursday May 16, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini yesterday formed an outside up day. This is the 2nd one in a week. A 2nd bottom attempt has a higher probability of success. There is an increased chance of a bull trend today and of a gap up.<p>However, the 3 week bear channel is tight. Consequently, even it the Emini rallies over the next week, it will probably form a lower high. A 2nd leg sideways to down is likely before the bulls get their new high.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 10 points in the Globex session. Today therefore might have a small gap up. Small gaps typically close in the 1st hour.<p>However, because of consecutive bottoms on the oversold daily and 60 minute charts, the odds favor a rally for at least a few days over the next week. It might have begun yesterday. Consequently, day traders should be ready for an increased chance of a bull trend day today.<p>In addition, even if the day is a trading range day, if the daily chart is beginning a leg up, there is an increased chance of a close near the high of the day. Day traders should look for a buy setup in the final hour for a late rally.<p>Finally, whenever the odds of a bull trend are higher, so are the odds of a bear trend. This is because when something seems likely, there is the potential for a crowded trade. Many traders might buy early, betting on a trend. If one does not develop, they might sell and not buy again today.<p>The absence of buyers could then lead to a bear trend on a day that was likely to rally. If the Emini enter a bear trend, it could last all day. But, the odds favor at least a weak bull trend today and a few days of sideways to up trading.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-outside-up-day-with-bull-dominant-feature.jpg\"><img src=\"2019-5-16.jpg\" alt=\"Emini outside up day with bull dominant feature\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/EURUSD-Forex-triangle-in-bear-channel-1.jpg\"><img loading=\"lazy\" src=\"2019-5-16-1.jpg\" alt=\"EURUSD Forex triangle in bear channel\"></a></figure><p>The EURUSD daily Forex chart has been sideways for 3 weeks. There is a double top and 2 higher lows. This is therefore a triangle and it is another breakout mode pattern.<p>Since the chart has been in a bear channel for a year, the odds favor a new low. However, most prior bear rallies went further above the EMA than this one. Consequently, there is slightly better than a 50% chance that the 3 week rally will test the April 12 high before there is another new low.<p>Because the chart is at the apex of a triangle, it is in Breakout Mode. There is almost a 50% chance that the breakout will be up or down. In addition, there is a 50% chance that the 1st breakout will fail and reverse within a day or two.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 30 pip trading range overnight. Day traders are looking for 10 pip scalps up and down.<p>Because the daily chart is at the apex of a triangle, traders know that there is an increased chance of a 50 pip breakout up or down in the next few days. Furthermore, a successful breakout will probably lead to at least a few days of a trend.<p>But, until there is a breakout, there is no breakout. Day traders will continue to take small scalps.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-buy-vacuum-test-of-resistance-and-then-reversal-day.jpg\"><img loading=\"lazy\" src=\"2019-5-16-2.jpg\" alt=\"Emini buy vacuum test of resistance and then reversal day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>I have been saying for several days that the Emini would probably test last Friday’s high. In addition, I said that today had an increased chance of being a bull trend day. Today’s strong rally reached the target, but the bulls took profits there. The Emini then entered a bear channel and gave back half of the rally.<p>This is disappointing for the bulls. Disappointment is consistent with the rally leading to a lower high on the daily chart, even if it lasts a few days.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-5-16"
    }
  ],
  "17": [
    {
      "data": [
        "<article class=\"post-89832 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini bear rally testing 2900 but lower high likely\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini bear rally testing 2900 but lower high likely</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-05-17T06:20:07-07:00\">May 17, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Friday May 17, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>For the past few days, I have been saying that the Emini would test last Friday’s high. It achieved that goal yesterday. Can it continue up to a new all-time without forming a 2nd leg down? Of course, it can. But a 2nd leg down from a lower high is more likely.<p>I also said that the rally would last a few days, maybe a week, and then form a lower high. That is still likely. The odds are that the 3 week correction down will last longer. The initial selloff was in a tight bear channel. It is therefore strong enough to have a 2nd leg down. It might continue down to close the gap above the February 8 high of 2686.25.<p>Before yesterday’s open, I said that the Emini would probably rally yesterday. Will it continue up today? Not necessarily because it already achieved its goal of testing last Friday’s high. Now, it is in the middle of a developing trading range on the daily chart. While it will probably go at least a little higher at some point over the next few days, it probably will not go a lot higher.<h3>Today affects the weekly chart</h3><p>Today is Friday and the bulls want the week to close on its high. It would therefore be a stronger buy signal bar on the weekly chart for a pullback to the weekly EMA. The bears always want the opposite. They want a conspicuous tail on the top of this week’s candle stick. That would require the week to close 20 or more points below the high of the week.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 20 points in the Globex session. It might therefore gap below yesterday’s low. If the gap is small, it will probably close in the 1st hour.<p>Six of the past 7 days have bull bodies on the daily chart, including the past 3 days. This is a sign of buying pressure and it increases the chance that today will also close above the open. Therefore, traders will look for a rally at some point, even if there is an early swing down.<p>However, there have been swings up and down on most days. That is likely again today. This is consistent with the Emini probably being in a trading range for the past month. In addition, it is likely to continue in a trading range for at least a few more weeks. Day traders will expect most days to have at least one swing up and one swing down.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-buy-vacuum-test-of-resistance-and-then-reversal-day.jpg\"><img src=\"2019-5-17.jpg\" alt=\"Emini buy vacuum test of resistance and then reversal day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/EURUSD-Forex-double-top-and-double-bottom.jpg\"><img loading=\"lazy\" src=\"2019-5-17-1.jpg\" alt=\"EURUSD Forex double top and double bottom\"></a></figure><p>The EURUSD daily Forex chart has a double top and is now attempting to form a double bottom. It is therefore in Breakout Mode.<p>Since it is in a yearlong bear channel, the odds continue to favor lower highs and lows. But, the rally from the April low lasted only 4 days. Because that is less than prior rallies, there is a slightly higher chance of a test of the April high before a new low. However, the odds are very close to 50-50. The chart could not be in a Breakout Mode pattern unless the bulls and bears were closely balanced.<p>When a chart is in Breakout Mode, there is a 50% chance that the 1st breakout up or down will reverse within a couple days. Once there is a successful breakout up or down, traders will look for a measured move based on the 100 pip height of the trading range.<p>Today is so far small. There is no evidence that the breakout will come today. The bulls are trying to create a credible buy signal bar to complete the double bottom.<p>Since the bears had an outside down day yesterday, they would like a bear body today. That would increase the chance of at least slightly lower prices on Monday.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 30 pip range overnight. The open of the day is important today. This is because a close above the open will turn today into a bull buy signal bar for Monday. That would increase the chance of higher prices next week.<p>The bears want a bear body. They therefore will sell rallies and try to get the day to close below the open. That bear body would turn today into a good follow-through bar on the daily chart after yesterday’s outside down day. It would therefore increase the chance of lower prices next week.<p>With today’s range and the bars on the 5 minute chart being small, today will probably remain a small trading range day. Day traders will continue to scalp for 10 pips, unless there is a strong breakout up or down. The bulls will buy reversals up from below the open and the bears will sell reversals down from above the open.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-bear-trend-reversal-after-parabolic-wedge.jpg\"><img loading=\"lazy\" src=\"2019-5-17-2.jpg\" alt=\"Emini bear trend reversal after parabolic wedge\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>After a strong reversal up from below yesterday’s low, the Emini reversed down from a parabolic wedge top. The selloff held above the open and the day had a bull body on the daily chart.<p>It formed a bull candlestick on the weekly chart as well. However, because of the big tail on top, this week is a weak buy signal bar for next week.<p>This 4 day rally will probably fail. The odds favor a 2nd leg down. The selling might fill the gap above the February high. Whether or not it does, the Emini will probably make a new all-time high in the coming months.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-5-17"
    }
  ],
  "18": [
    {
      "data": [
        "<article class=\"post-89836 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini likely lower high minor reversal down to February gap\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini likely lower high minor reversal down to February gap</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-05-18T00:30:48-07:00\">May 18, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Market Overview: Weekend Market Update</h2><p>The<strong>Emini</strong>is trying to resume its strong bull trend, but a lower high is more likely. A reasonable target for the bottom of this correction is the February 11 high, which is the bottom of a gap up.<p><strong>Crude oil</strong>has gone mostly sideways for 2 weeks after a buy climax. There will probably be a 2nd leg down. The March 1 high of 58.48 is a breakout point and therefore a strong magnet.<p>The<strong>EURUSD</strong>weekly Forex chart is in the channel phase of a yearlong Spike and Channel bear trend. There is no bottom yet. However, the odds are that there will eventually be a bull breakout and then a rally to 1.18 over the following many months.<h2><strong>Crude oil Futures market:</strong><br>Trading range after buy climax before 2nd leg down</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Crude-oil-daily-chart-has-week-rally-so-2nd-leg-down-from-lower-high-likely.jpg\"><img loading=\"lazy\" src=\"2019-5-18.jpg\" alt=\"Crude oil daily chart has week rally so 2nd leg down from lower high likely\"></a></figure><p>The crude oil weekly futures chart reversed down from a buy climax 3 weeks ago. The trend accelerated up 6 weeks ago and the bulls used the rally to take their surprisingly big profit.<p>Every bar since then has had prominent tails. That means that there were reversals up and down on the daily chart. Multiple reversals mean a lack of conviction. That is typical trading range price action. There is no sign that it is about to end. Consequently, traders should expect mostly sideways price action for at least a couple more weeks.<p>When a buy climax reverses, there will typically be at least 2 legs sideways to down. The reversal is caused by the bulls taking profits. They do not take profits in a prolonged bull trend if they intend to buy again a few bars later. They take profits because they think the pullback might be deep and last a long time.<p>Traders should expect at least a couple legs sideways to down. If the bears twice fail to create a bear trend, the bulls will begin to buy again. There has only been one leg down. Therefore, the odds favor a lower high and then a 2nd leg down. Friday might be the start of the 2nd leg down.<p>However, the pullback (bounce up) from the 1st leg down usually retraces more than half of the 1st leg down. Consequently the rally might continue up to 65 before the 2nd leg down begins.<h3>Where will the bulls buy again?</h3><p>Th March 25 low was a breakout test of the March 1 high. Also, the April 22 high was about a measured move up from the January 14 low to the March 1 high. Traders therefore believe that the March 1 high of 58.48 is an important price. That makes it a reasonable target for a 2nd leg down over the next couple months.<p>Can the bull trend resume without a 2nd leg down? Yes, but at the moment, the 2 week rally looks like a leg in a trading range and not a resumption of the bull trend. It therefore will probably lead to a lower high. Traders then have to be looking for targets below, like the March 1 breakout point.<h2><strong>EURUSD weekly Forex chart:</strong><br>Yearlong bear channel with no sign of a change</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/EURUSD-weekly-Forex-charg-in-yearlong-bear-channel.jpg\"><img loading=\"lazy\" src=\"2019-5-18-1.jpg\" alt=\"EURUSD weekly Forex chart in yearlong bear channel\"></a></figure><p>The EURUSD weekly Forex chart had a strong reversal down a year ago. That breakout was a spike down. Over the past year, it has continued down in a bear channel. A Spike and Channel bear trend evolves into a trading range 75% of the time. That requires a break above the bear trend line.<p>The rally usually tests up to around the top of the start of the channel. That is the June 14, 2018 high of 1.1851. At that point, traders expect a test down and then a trading range. This process will probably take at about a year to unfold.<p>At the moment, there is no bottom. A bear channel can last a lot longer and fall much further than what traders might think is reasonable. Markets have inertia. They tend to continue what they have been doing. The EURUSD weekly Forex chart has been working lower in a bear channel for a year.<h3>How does a bear channel end?</h3><p>How does the channel end? There is a 25% chance of a strong breakout below and then a much bigger bear trend. More often, if there is a bear break below a bear channel, it will be the climactic end of the bear trend. It usually reverses up within 5 bars and then begins a bull trend.<p>Another type of bottom comes when the channel begins to go sideways for many bars, like it did for 5 months through April. The bulls look for a strong bull signal bar and then a rally above the bear trend line. There was no strong buy signal in that particular tight trading range and the bears got a bear breakout in April.<p>Another possibility is that the channel can end with a surprisingly big bull bar in the absence of a good buy signal bar. If the bar is big and closes far above the bear trend line, traders will conclude that the bear channel has finally ended.<h2><strong>Monthly S&amp;P500 Emini futures chart:</strong><br>Tight trading range, 2nd leg down likely</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-monthly-chart-has-pullback-at-top-of-16-month-trading-range.jpg\"><img loading=\"lazy\" src=\"2019-5-18-2.jpg\" alt=\"Emini monthly chart has pullback at top of 16 month trading range\"></a></figure><p>The monthly S&amp;P500 Emini futures chart’s May candlestick has a bear bar and a big tail below. May traded below the April low and traders bought the selloff. This was likely after 4 consecutive bull bars closing near their highs.<p>However, by going below April’s low, there is less certainty of a new all-time high near-term. That confusion typically results in more sideways trading. After the 4 strong bull bars, most bears want at least a micro double top before looking for a swing down. That would take another month or two. Consequently, there is not much downside risk at the moment.<p>But, May had a big range, a bear body, and a break below last month’s low. Furthermore, there is now a perfect double top with the September all-time high. These factors reduce the chance of a new all-time high this month.<p>When the odds of a big move up and a big move down are less, the market usually goes sideways. That is what is likely for at least the next few weeks.<h2><strong>Weekly S&amp;P500 Emini futures chart:</strong><br>More sideways to down likely in pullback from double top</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-weekly-chart-in-minor-reversal-down-from-double-top.jpg\"><img loading=\"lazy\" src=\"2019-5-18-3.jpg\" alt=\"Emini weekly chart in minor reversal down from double top\"></a></figure><p>This week’s candlestick on the weekly S&amp;P500 Emini futures chart had a big bull body after testing the 20 week EMA. But, the tail on top weakens it as a buy signal bar for next week. The doji bars of the 2 prior week also reduce the chance of a strong move up next week. Therefore the probability is against a strong rally next week.<p>Furthermore, its range is big. As a result, the stop for the bulls buying above this week’s high will be far below. They therefore will have increased risk, reducing the risk/reward ratio.<p>The buy setup for bulls looking to buy with a stop has lower probability and reduced risk/reward. This means that there is an increased probability and better risk/reward for bears selling above the buy signal bar. Consequently, while this week is a buy signal bar on the weekly chart, there might be more bears above its high.<p>When a signal does not look quite right, fewer traders take it. In addition, more traders do the opposite, betting that the signal will fail.<p>A weak signal creates uncertainty, and confusion is a hallmark of a trading range. Traders know that the Emini is searching for a bottom. They therefore are unwilling to sell too low or hold onto shorts. The bears prefer to sell rallies.<p>Also, the bulls are quick to get out of longs because they doubt any rally will go far. They do not want to be long at the top or buy too far above the low.<p>With both bulls and bears looking for quick profits, the Emini usually goes sideways. That is what is likely over the next few weeks.<h2><strong>Daily S&amp;P500 Emini futures chart:</strong><br>Probable lower high and then 2nd leg down</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-daily-chart-has-double-top-bear-flag-and-lower-high-major-trend-reversal-1.jpg\"><img loading=\"lazy\" src=\"2019-5-18-4.jpg\" alt=\"Emini daily chart has double top bear flag and lower high major trend reversal\"></a></figure><p>The daily S&amp;P500 Emini futures chart reversed down from a double top with the September all-time high. The 2 week selloff was in a tight bear channel. When that is the case, the Emini typically will form a lower high and have at least a small 2nd leg down.<p>However, the combination of the big up move through April and the big down move in May creates confusion. Confusion usually leads to a trading range. Therefore, the Emini might go sideways for a couple of weeks before it begins its 2nd leg down.<p>Obvious targets for the bears are the bottoms of the pullbacks in the 4 month rally. Additionally, the February 11 high of 2723.00 is the bottom of a gap up, and it is just below the magnet of the March 25 low. Finally, the Emini might correct 50% of the 2019 rally. That target is 2651.00.<p>Even if the bears get a deep pullback over the next 2 months, the bulls will buy it. Moreover, the odds currently favor a break above the all-time high and a test of 3,000 at some point this year.<h3>Small chance of break below December neck line of double top</h3><p>Can the selloff continue down and break below the December low? That is the neck line of the September/May double top. If it did, traders would wonder if there would be a 600 point measured move down. That would be a 40% correction.<p>At the moment, the odds are only 20%. However, if the selloff continues and accelerates, the probability will go up.<hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-5-18"
    }
  ],
  "20": [
    {
      "data": [
        "<article class=\"post-89834 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini minor rally before possible test of February 8 gap\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini minor rally before possible test of February 8 gap</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-05-20T06:20:05-07:00\">May 20, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Monday May 20, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini had an early rally again Friday, and then sold off, like it did on Thursday. However, 7 of the past 8 days had bull bodies on the daily chart. That is a sign of buying pressure and it reduces the chance of a bear trend beginning today.<p>But nothing has changed. Whether the 4 day rally continues for a few days or not, the odds still favor a 2nd leg down. There is a small double top with Thursday’s high and the May 10 high. The 2nd leg up in a double top often has many bull bars.<p>If the bulls get a reversal down this week, the next target is the March 13 low of 2802.00. That is the neck line of the double top. A measured move down from there would test 2700 and close the gap above the February 8 high of 2726.50.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 23 points in the Globex session. It will probably gap below Friday’s low. That would trigger a sell signal on the daily chart for the May 10/May 16 double top.<p>But, because Friday had a bull body, it is a lower probability sell signal bar. That increases the chance that today’s selloff would be just another leg in the 2 week trading range. Consequently, the bulls will look for a reversal up either on the open or in the middle of the day.<p>However, if there is a selloff and the pullbacks are small, today could be a Small Pullback Bear Trend day. That would encourage day traders to hold onto at least part of their short trades for a swing down that could last most of the day.<h2>Friday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-bear-trend-reversal-after-parabolic-wedge.jpg\"><img src=\"2019-5-20.jpg\" alt=\"Emini bear trend reversal after parabolic wedge\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/EURUSD-Forex-double-top-and-double-bottom-so-breakout-mode.jpg\"><img loading=\"lazy\" src=\"2019-5-20-1.jpg\" alt=\"EURUSD Forex double top and double bottom so breakout mode\"></a></figure><p>The EURUSD daily Forex chart has been in a bear channel for a year. It was also in a tight trading range for 5 months, but broke below in April. It again has been going sideways for a month. The bears have a double top. They want a break below the May 3 neck line and then a 150 pip measured move down.<p>Every trading range always has a buy setup in addition to a sell setup. The bulls want a reversal up today. That would form a double bottom buy signal with the May 3 low.<p>Furthermore, the double bottom would be a higher low major trend reversal. Finally, the rally to the May 1 lower high had fewer bars than most other bear rallies over the past year. That makes it likely that the bear rally might not have ended. The bulls therefore are hoping for a 2nd leg up to above the May 12 high.<p>However, unless the bulls break strongly above the March 20 major lower high, the bear channel and bear trend are still intact. That means the odds will continue to favor new lows and lower highs.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been mostly sideways in the US sessions over the past month. Since the daily chart is testing the May 3 low, this is a buy zone.<p>The daily chart rallied from 1.11 and 1.1135 over the past month and the bulls hope to begin a leg up from here again. In addition, there is a micro wedge on the daily chart over the past 3 days. The wedge bottom is easier to see on a 60 minute or 4 hour chart. That increases the chance of a bounce early this week.<p>Will the bulls get a strong bull trend reversal on the daily chart? There is now a double bottom higher low bull trend reversal buy setup on the daily chart. They might get a 2 week rally to above the April 12 minor lower high. As a result, day traders will be more willing to swing part of their longs if the rallies on the 5 minute chart are strong.<p>However, the 5 minute chart has been in a 20 pip range over night. Day traders are having a difficult time making even 10 pip scalps. But, the odds favor a bounce within the next couple days.<p>Can the bears get a surprisingly big selloff to below the April low? While possible today, it is not likely. The daily chart has been quiet for a month. Day traders know that the odds are that each day will probably be fairly small and that reversals are more likely than successful breakouts.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-trading-range-day.jpg\"><img loading=\"lazy\" src=\"2019-5-20-2.jpg\" alt=\"Emini trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini reversed up from a big gap down, but then entered a trading range. In the final hour, it sold off to a new low of the day. However, it reversed back up and closed in the middle. Today was trading range today.<p>The Emini is in the middle of a 3 week trading range. Traders are deciding it the correction has ended or if it will continue down to close the February 11 gap. The odds slightly favor a 2nd leg down to that gap before a new all-time high.<p>It is important to note that today was the 5th consecutive bull day on the daily chart. In addition, there have been 10 bull days in the past 12 days. This is buying pressure and it might be a sign that the correction has ended. There is an increased chance of one or more big bull trend days this week.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-5-20"
    }
  ],
  "21": [
    {
      "data": [
        "<article class=\"post-89932 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini deciding between all time high and February 11 gap\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini deciding between all time high and February 11 gap</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-05-21T06:20:20-07:00\">May 21, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Tuesday May 21, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday gapped down, but reversed up in a weak rally on the open. It spent most of the day going sideways to down in a weak bear channel. However, it rallied into the closed. Today was the 5th consecutive bull trend bar on the daily chart.<p>This is a sign that the correction might have ended. It increases the chance of a strong bull trend day at some point this week and a new high within a few weeks. However, the odds are still slightly higher for a 2nd leg down to close the gap above the February 8 high.<p>Today will probably have at least one swing up and one swing down, like most recent days. Despite 10 bull bars in the past 12 days, today will probably not be a strong bull trend day.<h3>Breakout Mode</h3><p>The chart is in the middle of a 2 week trading range. Traders are deciding if the selloff has ended or if it will continue down to fill the gap above the February 8 high.<p>On the 240 minute chart, there is a head and shoulders bottom. Every head and shoulders bottom also is a double top bear flag. The chart is in Breakout Mode.<p>When that is the case, there is an increased chance of a big trend day up or down. However, the chart might continue to form another small trading range day or two before the breakout comes.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 14 points in the Globex session. It therefore might gap above yesterday’s high on the open.<p>Despite 5 consecutive bull bars on the daily chart, the buy setup on the daily chart is not strong. Yesterday was only a bull doji bar. It is therefore a weak buy signal bar. Consequently, there might be more sellers than buyers above yesterday’s high.<p>Also, when a chart is in a trading range on the daily chart, 5 consecutive bull bars is unusual. Therefore, if today is another trading range day, the odds are that today will close below its open. If the Emini is above the open in the final hour, day traders will look for a reversal down for a close below the open.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-trading-range-day.jpg\"><img src=\"2019-5-21.jpg\" alt=\"Emini trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/EURUSD-Forex-double-bottom-and-double-top-in-bear-trend-channel.jpg\"><img loading=\"lazy\" src=\"2019-5-21-1.jpg\" alt=\"EURUSD Forex double bottom and double top in bear trend channel\"></a></figure><p>The EURUSD daily Forex chart has been in a bear channel for the past year and in a trading range for several weeks. There is now both a double top and a double bottom. This means that the chart is in Breakout Mode.<p>Traders believe that the breakout will lead to about a 100 pip measured move up or down. Furthermore, they think that the market is neutral near-term. The probability of the breakout is the same for the bulls and the bears.<p>However, unless the bulls get a strong break above the March 20 major lower high, the bear trend will still be intact. Consequently, traders believe that every 2 – 3 week rally will reverse down and the selloff will lead to another new low.<p>There is a wedge bottom on the 240 minute chart. Also, the chart is at the bottom of a 3 week trading range. Trading ranges tend to continue rather than break out. Traders know that the odds favor a bounce within a week.<p>A reversal up from here would create a double bottom with the May 3 low. Additionally, that double bottom would be a double bottom higher low major trend reversal on the daily chart.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 30 pip range overnight. In addition, today’s range mostly overlapped the range of the past 2 days. Those days were also small, and day traders scalped reversals for 10 pips. They will continue to scalp until there is a strong breakout up or down on the 5 minute chart.<p>The daily chart is at the bottom of its 3 week range. There is therefore an increased chance of a 100 pip rally toward the top of the range beginning this week.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-trading-range-day-1.jpg\"><img loading=\"lazy\" src=\"2019-5-21-2.jpg\" alt=\"Emini trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>After a gap up, the Emini entered a tight trading range. A tight trading range after a big gap is a good candidate for a Final Bull Flag. There was a brief parabolic wedge rally and a reversal back down to the Final Bull Flag.<p>While the bulls got another rally, the day was exceptionally quiet. Most bars were within tight trading ranges.<p>Today was the 6th consecutive bull trend day on the daily chart. That is a sign of buying pressure. It increases the chance that the 3 week correction is over. But, at the moment, there is still a 50% chance of a lower high and a closure of the gap above the February 8 high.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-5-21"
    }
  ],
  "22": [
    {
      "data": [
        "<article class=\"post-89937 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini buying pressure in 3 week correction\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini buying pressure in 3 week correction</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-05-22T06:20:19-07:00\">May 22, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Wednesday May 22, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini formed a sixth consecutive bull trend bar yesterday on the daily chart. That is unusual because it has been in a trading range for 2 weeks. Normally, there would be a bear bar within a few days.<p>It is a sign of buying pressure. In fact, there have only been 2 bear bars in the past 13 days. This makes the bulls ready to buy aggressively once they conclude that the 3 week correction has ended.<p>That is not yet clear. However, every bull bar that gets added makes a new all-time high increasingly likely. At the moment, the probability is about 50%. The bears still want a lower high and a closure of the gap above the February 8 high.<p>Whether or not the bears close that gap, the bulls will still probably get a new high this summer.<h3>60 minute chart has head and shoulders bottom</h3><p>There is a head and shoulders bottom on the 60 minute chart. It is important to note that this means there is also a double top, 3 pushes down, and a higher low. Consequently, every head and shoulders pattern is also a triangle, which is a breakout mode pattern.<p>Here, the bears have a double top and the bulls have a higher low major trend reversal. Both are major patterns. Once a major pattern has a good signal bar, it only has a 40% chance of leading to a major move. Because the chart is now at its apex, traders expect a breakout within a few days.<p>Whenever there is a breakout mode pattern, traders should expect that the initial breakout will fail and reverse 50% of the time. Additionally, they know that the probability of a successful breakout is the same for the bulls and the bears.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 12 points in the Globex session. It might gap below yesterday’s low. Since yesterday gapped up, if a gap down today stays open, yesterday will be a 1 day island top on the daily chart.<p>However, island tops and bottoms are minor reversal patterns. Other factors are usually more important. Here, the most important factor is the breakout mode pattern on the daily and 60 minute charts. There is an increased chance of a series of trend days up or down beginning soon.<p>There is one final interesting point. A breakout mode pattern is neutral, yet there have been 6 consecutive bull bars on the daily chart. Consequently, the odds favor a bear bar today. Day traders will be inclined to look for a reversal down whenever there is a rally above the open. This is especially true in the final hour.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-trading-range-day-1.jpg\"><img src=\"2019-5-22.jpg\" alt=\"Emini trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/EURUSD-Forex-ioi-buy-signal-with-double-bottom.jpg\"><img loading=\"lazy\" src=\"2019-5-22-1.jpg\" alt=\"EURUSD Forex ioi buy signal with double bottom\"></a></figure><p>The EURUSD daily Forex chart is trying to form a double bottom with the May 3 low. This is a potential double bottom higher low major trend reversal buy signal.<p>So far, today is a bull bar and its low is above yesterday’s low. Its high is below yesterday’s high. Today is therefore an inside day on the daily chart. Yesterday was an outside day, which means that Friday was within yesterday’s range. This is an ioi (inside-outside-inside) breakout mode pattern.<p>Since it is at the bottom of a 3 week trading range, a breakout above today’s high and a rally is more likely than a breakout below today’s low and then the April 52 week low.<p>But, the chart has been in a bear channel for a year. That means that it is forming a series of lower highs and lows.<p>There have been many buy signals and many rallies. However, each lasted only 2 – 3 weeks, and each led to a new low.<p>There is no reason to believe that any rally here will be different from all of the others. If the bulls trigger the buy signal tomorrow, they will probably get a 2 – 3 week rally to above the May 1/May 13 double top. Traders should expect it to reverse down from below the March 20 major lower high.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has rallied 30 pips from above yesterday’s low. The bulls want a reversal up from the May 3 low, and therefore want today to be a bull bar on the daily chart.<p>If the bulls get a bull bar closing near its high and today is an inside day, today would be an ioi buy signal bar for tomorrow. They do not need a huge trend. In fact, the buy setup will be stronger if today does not break above yesterday’s high. This is because a big day will force traders tomorrow to buy higher than they want. Many will refuse, and there would be an increased chance of more sideways days.<p>An ioi pattern is a breakout mode setup. The bears want today to have a bear body. Today would then be a sell signal bar for tomorrow.<p>However, the EURUSD daily chart is at the bottom of a 3 week trading range. Reversals are more common than successful breakouts. Consequently, this would be a low probability sell setup.<p>If the sell signal triggered, it would probably fail. Traders know that the odds favor a reversal up from the bottom of a 3 week trading range and near the bottom of a yearlong bear channel.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-trading-range-within-a-triangle.jpg\"><img loading=\"lazy\" src=\"2019-5-22-2.jpg\" alt=\"Emini trading range within a triangle\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini was in a trading range today. There is triangle on the 60 minute and daily charts and therefore both are in Breakout Mode patterns. Traders know that there is a 50% chance that the correction is over. They also know that there is a 50% chance that the selloff will close the gap above the February 8 high.<p>Since the daily chart is at the apex of a triangle, there will probably be a breakout attempt within the next few days. This is a neutral pattern. Yet, the past 7 days on the daily chart have bull bodies. That is unusual and tomorrow will therefore probably have a bear body.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-5-22"
    }
  ],
  "23": [
    {
      "data": [
        "<article class=\"post-89944 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini small triangle and head and shoulder bottom\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini small triangle and head and shoulder bottom</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-05-23T06:20:24-07:00\">May 23, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Thursday May 23, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The daily chart is at the apex of a 2 week triangle. That is a neutral pattern. Yet, there have been 7 consecutive bull bars on the daily chart. This is unusual when a chart is neutral. Consequently, today will probably close below its open.<p>On the 60 minute chart, the triangle is a head and shoulders bottom. Every head and shoulders bottom is a higher low major trend reversal buy signal. It is also a trading range and there is always also a double top. Even with a big gap down today, the pattern will still be intact unless today has a big bear trend after the gap down.<p>These charts are in Breakout Mode. There is a 50% chance that a successful breakout will be up and a 50% chance it will be down. Furthermore, there is a 50% chance that the 1st breakout will fail. Traders know that the tight trading range could continue for several more days before there is a breakout<h3>Overnight Emini Globex trading</h3><p>The Emini is down 26 points in the Globex session. It will therefore probably have a big gap down today.<p>When there is a big gap, there is a slightly increased chance of a trend day. If there is a trend, there is a slightly greater chance of it being down.<p>However, a big gap leads to trading range price action for the first hour or two 80% of the time. The bears want to sell closer to the average price. They look for a wedge bear flag or a double top bear flag near the EMA for a swing down. The bulls want either a wedge bottom or a double bottom and then they buy for a swing up.<p>If today does not sell off strongly after the gap down, there will still be a triangle on the daily and 60 minute charts. This is especially true if it trends up from the gap down. The head and shoulders bottom would then have a double bottom higher low for its right shoulder.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-trading-range-within-a-triangle.jpg\"><img src=\"2019-5-23.jpg\" alt=\"Emini trading range within a triangle\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/EURUSD-Forex-breakout-below-neck-line-of-double-top-bear-flag.jpg\"><img loading=\"lazy\" src=\"2019-5-23-1.jpg\" alt=\"EURUSD Forex breakout below neck line of double top bear flag\"></a></figure><p>The EURUSD daily Forex chart broke below that May 3 low overnight. That is the neck line of the May 1/May 13 double top bear flag. The bears hope for a 100 pip measured move down. They hope for a huge breakout and an acceleration down, but that is unlikely.<p>There have been many new lows in the yearlong bear channel. Each was brief and led to a 2 – 3 week bear rally.<p>The bulls will again likely get a 2 – 3 rally from around the April 26 52 week low. They need a strong bull trend reversal bar or a strong reversal up for traders to conclude that the reversal has begun.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 20 pip tight trading range over the past 5 hours. This is not how a successful and strong breakout typically looks. Consequently, this breakout will probably not fall far nor last long before a 2 – 3 week bear rally begins.<p>Since the overnight range is tight, day traders have been scalping for 10 pips. Because the chart is testing a prior low, there is an increased chance of a big bear breakout or a big reversal up.<p>However, another small trading range day is more likely. Markets tend to continue to do what they have been doing until they clearly are doing something else. The overnight 5 minute chart is similar to that of most days over the past month. Day traders will assume that today will be similar as well unless there is a surprisingly big breakout up or down.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-bear-channel-and-then-short-covering-rally.png\"><img loading=\"lazy\" src=\"2019-5-23-2.png\" alt=\"Emini bear channel and then short covering rally\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini sold off in a bear channel for most of the day. Traders know that 75% of bear channels have bull breakouts. The bulls got their breakout at the end of the day when there was a strong short covering rally (bears taking profits). The reversal up was from just above last week’s low. This week therefore is still an inside bar on the weekly chart.<p>Today broke below the 2 week triangle. A triangle breakout has a 50% chance of failing. However, if the bulls get a big bull day tomorrow, the bear breakout will likely fail. They would have a double bottom with last week’s low and would then expect the 2 week trading range to continue.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-5-23"
    }
  ],
  "24": [
    {
      "data": [
        "<article class=\"post-89947 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini breakout below May triangle after big double top\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini breakout below May triangle after big double top</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-05-24T06:20:54-07:00\">May 24, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Friday May 24, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini sold off in a bear channel yesterday. It broke below the 2 week triangle on the daily and 60 minute charts. If the bears get follow-through selling over the next few days, the selloff will probably close the gap above the February 11 high of 2723.00.<p>Traders know that, in general, 50% of triangle breakouts fail. The bulls therefore will try to create a reversal up today. It would be a double bottom with last week’s low. Yesterday’s selloff, in part, was simply a test of last week’s low. The bulls bought aggressively just above that low.<p>Today is Friday and therefore weekly support and resistance can be important. The most important prices are last week’s low and this week’s open. Despite yesterday’s selloff, the Emini held above last week’s low. The bears want the week to close below that low or at least below the open. If they are successful, they will have increased the chance of lower prices next week.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 13 points in the Globex session. It is therefore continuing yesterday’s late rally. It might gap above yesterday’s high.<p>However, yesterday had a bear body. It is therefore a weak buy signal bar. This reduces the chance of a big bull trend day today.<p>The Emini is still in its 2 week trading range. Traders will focus on the open of the week. A close above the open will create a bull body on the weekly chart. That would increase the chance of at least slightly higher prices next week.<p>This week’s high is probably too far above to be a magnet today. Therefore, the bulls will focus on simply trying to get the week to close above the 2842.00 open of the week.<p>Since that is only about 10 points above the current Globex price, the odds of a big bull day are less. More likely, today will probably be mostly sideways. Traders will look for a test of the open of the week in the final hour.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-bear-channel-and-then-short-covering-rally.png\"><img src=\"2019-5-24.png\" alt=\"Emini bear channel and then short covering rally\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Capture-1.jpg\"><img loading=\"lazy\" src=\"2019-5-24-1.jpg\" alt=\"EURUSD Forex failed breakout of 52 week low\"></a></figure><p>The EURUSD daily Forex chart yesterday broke below the April 26 low and reversed up strongly. That was the 52 week low. All other new lows in the yearlong bear channel reversed up within a few days. Each reversal led to a 2 – 3 week rally.<p>Yesterday was an outside up bar that closed on its high and above Wednesday’s high. It is therefore a buy signal bar for today.<p>When a buy signal bar is big, the stop is far below and the risk for the bulls is big. Furthermore, yesterday’s high is at the top of a 5 day tight trading range. That lowers the probability for the bulls buying above its high.<p>This lower probability and reduced risk/reward usually makes many bulls wait to buy a 50% pullback. Consequently, there is a reduced chance of a big rally today. However, if there is a pullback within a few days, the bulls will probably buy it. At the moment, the odds favor a move above the May 1/May 13 double top within a couple weeks.<p>The bears want the reversal up to fail. If there is a pullback from the reversal up within the next few days, the bears will see the 2 – 3 day rally as a pullback from the breakout to a new 52 week low. They will look for a bear bar, which they will treat as a sell signal bar for a 2 – 3 day bear flag.<p>Since every bear breakout for a year has led to a 2 – 3 week rally, that is more likely than an immediate continuation down.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart broke above yesterday’s high and therefore triggered a buy signal on the daily chart. However, instead of a big rally, it has been in a 30 pip range overnight and it is stalling around yesterday’s high.<p>This is consistent with what I wrote above. The lower probability and increased risk is making many bulls wanting to buy around the midpoint of the 2 day rally and not at the top. Today will probably remain a small day and it will probably oscillate around yesterday’s high.<p>Today is important. If today closes with a bull body and above yesterday’s high, it will increase the chance that a 2 – 3 week rally has begun. There will probably be buyers below today’s low.<p>Alternatively, if today closes on its low, the bears will have a credible sell signal bar for Monday. But, unless today is an extremely big bear day, the odds still favor more buyers than sellers below today’s low.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/0_Blog.png\"><img loading=\"lazy\" src=\"2019-5-24-2.png\" alt=\"Emini head and shoulders top\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>After a big gap up to the open of the week, the Emini sold off to test yesterday’s close. It then had a swing up. Today was a trading range day. Since there is a head and shoulders top and double bottom on the daily chart, the Emini is in Breakout Mode.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-5-24"
    }
  ],
  "25": [
    {
      "data": [
        "<article class=\"post-89953 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini head and shoulders top target is 2650\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini head and shoulders top target is 2650</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-05-25T00:30:46-07:00\">May 25, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Market Overview: Weekend Market Update</h2><p>The<strong>Emini</strong>has been sideways for 4 weeks. It might have begun its 2nd leg down from its 4 month buy climax. There is a 40% chance of a head and shoulders top measured move down to 2650.<p><strong>Crude oil</strong>had a surprisingly big bear breakout this week. The odds favor at least a small 2nd leg down.<p>The<strong>EURUSD</strong>Forex market reversed up from a new low in a yearlong bear channel. Traders expect a rally for at least a couple weeks.<h2><strong>Crude oil Futures market:</strong><br>Strong bear breakout</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Crude-oil-daily-chart-has-strong-bear-breakout-below-60.png\"><img loading=\"lazy\" src=\"2019-5-25.png\" alt=\"Crude oil daily chart has strong bear breakout below 60\"></a></figure><p>The crude oil futures market sold off sharply this week. I said that there would be at least one more leg down after the selloff to the May 6 low. This week met that goal.<p>In addition, I said that the selloff might continue down to the start of the 3 month bull channel. That channel began with the January 14 pullback. Its low is 51.61.<p>Finally, I have been saying that the selloff would be a bear leg in a trading range that would probably last many months. That is still likely.<h3>Trading range for several months</h3><p>When traders think that a market has entered a trading range, they prefer to sell rallies and buy selloffs. Will they buy this week’s selloff? Thursday was a surprisingly big bear bar. A Bear Surprise Bar typically has at least a small 2nd leg down. Therefore, even if there is a rally for a few days next week, the odds favor at least a small 2nd leg down.<p>Trading ranges tend to reward limit order traders. They are traders who buy low, sell high, and scalp. They bet against trends.<p>In a trading range, breakouts usually pull back to test breakout points. Therefore, the bulls who bought the May 6 low of 60.23 will probably be able to avoid a loss if they scale in lower.<p>Traders expect a test of that low over the next couple weeks. This is especially true because it is also just above the 60 Big Round Number.<p>However, whether or not crude oil tests $60 next week, the odds favor at least a small 2nd leg down after this week’s bear breakout. It might lead to a measured move down to the January 14 low.<h2><strong>EURUSD weekly Forex chart:</strong><br>Reversal up from new 52 week low</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/EURUSD-weekly-Forex-chart-bull-trend-reversal-in-wedge-bear-channel.png\"><img loading=\"lazy\" src=\"2019-5-25-1.png\" alt=\"EURUSD weekly Forex chart bull trend reversal in wedge bear channel\"></a></figure><p>The EURUSD weekly Forex chart this week formed a bull reversal bar. It is therefore a buy signal bar for next week. The odds are that the EURUSD rally will continue for 2 – 3 weeks.<p>The EURUSD daily Forex chart broke below the April 26 low and reversed up sharply on Thursday. Although that was a new 52 week low, every breakout to a new low over the past year reversed up. That is what happens in bear channels. The Bulls buy below prior lows and bears sell rallies. Both take quick profits.<p>All legs up and down over the past year have lasted 2 – 3 weeks. The bulls are hoping that this is the start of a 2 – 3 week rally. Thursday was a big outside up day that closed on its high. In addition, it closed above Wednesday’s high. Also, Friday was a bull bar and therefore indicates that the bulls were continuing to buy. This is probably the start of a leg up.<p>The bears theoretically will exit above the May 1/May 13 double top at 1.1265. Since channels and trading ranges typically disappoint trend traders, if a rally has begun, it will probably go above that double top.<h3>Bear channel is a bull flag</h3><p>When will the bear trend end? A bear trend needs lower highs and lows. As long as it continues to form major lower highs, it is still intact.<p>The most recent major lower high is the March 20 high of 1.1448. If the rally breaks above that high, traders will conclude that the bear trend is over.<p>When a bear trend end, a trading range usually begins. Less often, the rally will continue far up and form a bull trend.<p>Traders should think of a bear channel as a bull flag. This is because there is a 75% chance of a break above the bear channel.<p>The bears only have a 25% chance of a successful break below the yearlong bear channel and an acceleration down. If there is a strong break below, it will probably reverse up within a few bars and begin a swing up.<h2><strong>Monthly S&amp;P500 Emini futures chart:</strong><br>Pullback from test of top of trading range</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-monthly-candlestick-chart-has-double-top-and-buy-climax.png\"><img loading=\"lazy\" src=\"2019-5-25-2.png\" alt=\"Emini monthly candlestick chart has double top and buy climax\"></a></figure><p>The monthly S&amp;P500 Emini futures chart has been in a trading range for 16 months. It&nbsp;so far has a big bear bar in May. Also, there is a double top with the September high. By trading below last month’s low, May triggered the sell signal for the double top.<p>But, after 4 consecutive bull bars, this is a low probability short. Consequently, the reversal down will probably be minor. Traders will expect a 1 – 3 month pullback and then another test of the all-time high.<p>The bears want the selloff to continue to below the December low. That is the neck line of the double top. They then want a 600 point measured move down. There is always a bear case, but this currently has only a 20% probability.<h2><strong>Weekly S&amp;P500 Emini futures chart:</strong><br>Inside bar so pause in pullback</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-weekly-candlestick-chart-pas-first-leg-down-from-buy-climax.png\"><img loading=\"lazy\" src=\"2019-5-25-3.png\" alt=\"Emini weekly candlestick chart pas first leg down from buy climax\"></a></figure><p>The weekly S&amp;P500 Emini futures chart formed an inside bar this week. Its low was above last week’s low and its high was below last week’s high. Furthermore, the close was around the middle and there were prominent tails above and below.<p>This is similar to each of the past 3 weeks. It represents a lack of conviction and it is trading range price action. Markets have inertia and tend to continue what they’ve been doing. There is no sign that the trading range trading is about to end. Therefore, it will probably continue for at least a couple more weeks.<p>The bulls hope that the past 4 weeks are simply forming a pullback to the 20 week EMA. They see this week as a buy signal bar. However, the week had a bear body. Also, there is now a 4 week bear micro channel. This is a weak buy setup. Traders expect that there will be more sellers than buyers above this week’s high.<p>For the bears, they have a 4 week selloff from a big double top. However, they have been unable to create consecutive big bear bars closing on their lows. In fact, they have been unable to form even a single big bear bar closing on its low. This is not how bear trend reversals typically begin. Consequently, the 4 week selloff is probably a minor reversal.<h2><strong>Daily S&amp;P500 Emini futures chart:</strong><br>Emini head and shoulders top target is 2650</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-daily-candlestick-chart-has-head-and-shoulders-top.png\"><img loading=\"lazy\" src=\"2019-5-25-4.png\" alt=\"Emini daily candlestick chart has head and shoulders top\"></a></figure><p>The daily S&amp;P500 Emini futures chart broke below a 2 week triangle on Thursday. Friday was a bear trend bar and it therefore represents follow-through selling.<p>The bears see the 4 month rally as a buy climax and a test of the all-time high. The May reversal down was strong enough to make a 2nd leg down likely. Traders are beginning to think that the 2nd leg down might have begun with the May 16 high. That is the right shoulder of a head and shoulders top. There is therefore a 40% chance of a 150 point measured move down to 2650.<p>However, Thursday’s low held above the May 13 low. Consequently, the bulls are hoping that they will get a reversal up next week. This would be a double bottom.<h3>Trading range means lack of conviction</h3><p>The daily chart has been in a trading range for several weeks. They are a sign of neutrality and balance. There is a lack of conviction. Traders see the price as just about right.<p>Trading ranges always have both credible buy and sell setups. There is currently both a double bottom and a double top. This is a breakout mode pattern. While the past 2 days have been good for the bears, they need a strong break below the May 13 low before traders will conclude that the 2nd leg down has begun.<h3>2nd leg down likely</h3><p>Even though the trading range is neutral, the odds continue to favor a 2nd leg down. This is true even if there is a break above the May 10/May 16 double top 1st.<p>There is a gap above the February 11 high of 2723.00. That is also around a 50% retracement of the 4 month rally. It would also be about a 10% pullback. It is therefore a reasonable magnet below.<p>What happens if the Emini reaches it? It will probably attract profit taking by the bears. Also, the bulls will look for a reversal up to buy.<hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-5-25"
    }
  ],
  "28": [
    {
      "data": [
        "<article class=\"post-89950 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini testing neck line of head and shoulders top\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini testing neck line of head and shoulders top</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-05-28T06:20:02-07:00\">May 28, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Tuesday May 28, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini sold off on Thursday and had a bear follow-through bar on Friday. The bears hope that the selloff will break below the May 13 low, which is the neck line of a head and shoulders top. March 21 formed the left shoulder.<p>Every head and shoulders top is also a triangle. It is therefore a Breakout Mode pattern. That means there is always both a buy and sell setup. For example, there is now a double bottom bull flag.<p>There is no breakout until there is a breakout. The bears have a credible start. Furthermore, a 2nd leg down from the 4 month buy climax is likely.<p>However, the Emini could continue its 2 week trading range for at least another week. This is especially true since last week was an inside bar on the weekly chart. In addition, it closed in its middle third. That increases the chance of this week being a 2nd consecutive inside bar. Consequently, there is an increased chance that the trading range price action will continue this week. Since the Emini is now at the bottom of the range, traders will expect a bounce for a few days.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 1 point in the Globex session. Since it is at the bottom of a 4 week trading range, the odds favor a bounce over the next few days. Therefore, day traders will look for an early low this morning and then a swing up. Every day over the past week has had a reversal. Consequently, day traders will expect at least one today.<p>Last week formed an inside bar on the weekly chart. The past 4 weeks have all had reversals on the weekly chart. Therefore, traders will expect a reversal up from around last week’s low and a reversal down from around last week’s high.<p>There is trading range price action on the daily and weekly charts. That increases the chance of more trading range price action on the 5 minute chart.<h2>Friday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/0_Blog.png\"><img src=\"2019-5-28.png\" alt=\"Emini head and shoulders top\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/EURUSD-Forex-double-bottom-in-bear-trend.png\"><img loading=\"lazy\" src=\"2019-5-28-1.png\" alt=\"EURUSD Forex double bottom in bear trend\"></a></figure><p>The EURUSD daily Forex chart reversed up last week from just below the April 26 52 week low. The reversal up was strong enough to have at least a small 2nd leg up. Furthermore, the reversal up was from the bottom of a 4 week trading range. In addition, the May rally was smaller than most of the prior bear rallies over the past year. Consequently, today is more likely a pullback from last week’s rally than a resumption of the bear trend. Therefore, traders should expect a test of the May 1/May 13 double top within a couple of weeks.<p>It is important to note that the chart has been in a bear channel for a year. Consequently, every 2 – 3 week rally will probably continue to reverse down to a new low.<p>Can yesterday be a small bear flag that leads to a new low this week? Yes, but a rally is more likely. This is especially true since the weekly chart had a good buy signal bar last week and yesterday triggered the buy signal by going above last week’s high.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 25 pip range overnight. Yesterday was a sell signal bar on the daily chart for a 3 day bear flag. Today triggered the sell signal by going below yesterday’s low.<p>However, last week’s 2 day rally was stronger than this 2 day selloff. In addition, yesterday triggered a weekly buy signal. Traders believe that there will be more buyers than sellers below yesterday’s low.<p>If the bulls can close today above its open, it will be a buy signal bar for tomorrow. While today so far is small and day traders are scalping, swing traders will hold for a test of the May 13 high of 1.1264.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-small-pullback-bear-trend.png\"><img loading=\"lazy\" src=\"2019-5-28-2.png\" alt=\"Emini small pullback bear trend\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>Today’s morning rally reversed down from below the 3 week bear trend line. It then sold off again for more than a measured move down from a double top bear flag. In addition, it broke below last week’s low. Today was a strong bear trend day.<p>Last week was an inside bar on the weekly chart. It is therefore a sell signal bar for this week. By today breaking below last week’s low, the Emini triggered the weekly sell signal.<p>However, last week’s candlestick had big tails above and below. It is therefore a weak sell signal bar. Consequently, there might be more buyers than sellers below last week’s low. The bulls will watch for a sharp reversal up tomorrow. Because today was a sell climax, there is a 75% chance of at least 2 hours of sideways to up trading tomorrow that starts by the end of the 2nd hour.<br><br>The bears hope that this is the start of a selloff from a head and shoulders top on the daily chart. They therefore want strong follow-through selling tomorrow. For example, if there is a big gap down and then a bear day, traders will look for a measured move down on the daily chart.<p>Because the Emini is testing major support, there is an increased chance of a big trend day up or down tomorrow.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-5-28"
    }
  ],
  "29": [
    {
      "data": [
        "<article class=\"post-90107 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini breaking below March-May head and shoulders top\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini breaking below March-May head and shoulders top</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-05-29T06:20:13-07:00\">May 29, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Wednesday May 29,2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday began a break below the neck line of a 3 month head and shoulders top. If today is a big bear trend day, the odds will favor a closure of the gap above the February 11 high of 2726.50. Furthermore, traders will look for a measured move down and a retracement of half of the 2019 rally.<p>The 2800 area has been support for 2 months. A strong break below will turn it into resistance.<p>However, if the bulls get a rally today, traders instead will suspect that yesterday was just a test of the neck line of the head and shoulders top. They will look for a reversal up this week to buy.<p>At the moment, the odds continue to favor a closure of the gap above the February 11 high. But, a strong reversal up this week could return the Emini to neutral.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 18 points in the Globex session. It therefore will probably gap below yesterday’s low.<p>When there is a big gap down, the Emini typically enters a trading range for the 1st hour or so. The bears look to sell a wedge rally or double top around the EMA for a swing down. However, the bulls want a wedge bottom or double bottom and then a swing up. If there is a trading range open, it reduces the chance of a big trend day up or down.<p>Since yesterday was a sell climax, there is only a 25% chance of a strong bear day today. In addition, there is a 50% chance of some follow-through selling in the 1st 2 hours. Finally, there is a 75% chance of at least a couple hours of sideways to up trading that begins by the end of the 2nd hour.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-small-pullback-bear-trend.png\"><img src=\"2019-5-29.png\" alt=\"Emini small pullback bear trend\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/EURUSD-Forex-pullback-from-reversal-up-from-double-bottom.png\"><img loading=\"lazy\" src=\"2019-5-29-1.png\" alt=\"EURUSD Forex pullback from reversal up from double bottom\"></a></figure><p>The EURUSD daily Forex chart has been in a bear channel for a year. Every rally has failed after 2 – 3 weeks and it led to a 2 – 3 week selloff and another new low. However, the bulls bought every new low and created another bear rally. There is no sign that this pattern is about to change.<p>What is unclear at the moment is whether the most recent bear rally ended with the May 13 high and last week’s rally is a pullback in a resumption of the bear trend. If so, the bears will get a break to a new low over the next week.<p>The alternative is that the May 23 new low is the start of another 2 – 3 week rally. If that is the case, the 3 day selloff is a pullback from last week’s reversal up. The bulls will then look for another couple week’s of higher prices. That would probably lead to a break above the May 13 high, but not the March 20 major lower high.<h3>Trading range means Breakout Mode</h3><p>When a market is in a trading range, it is telling traders that the bull and bear cases are about equally likely. The probabilities shift slightly in favor or one side or the other every few days. At the moment, there is a slightly higher probability that the 3 day selloff will form a higher low instead of a new low. The bulls need a bull bar today or tomorrow to show that they are resuming control.<p>However, the bears need to continue to form more bear bars. Additionally, they need a break below the May low to show that another swing down is underway.<p>The chart is still in a trading range. Day traders expect legs up and down to reverse every few days. In addition, the expect most days to be small.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 30 pip range overnight. In addition, it has been in a 15 pip range for the past 5 hours. At the moment, day traders are waiting for the range to expand before resuming trading.<p>Three days down is about as long as a pullback should last. Therefore, if last week’s low is the start of a swing up, the bulls need a bull day today or tomorrow. They will buy selloffs and try to get today to close above the open. That would create a credible buy signal bar on the daily chart.<p>The bears do not need a big bear bar. All they need is the absence of a good buy signal bar. They know that as long as they are able to continue to create bear bars on the daily chart, the odds will begin to shift in favor of another new 52 week low. They will sell rallies to above today’s open and try to get the day to close below the open.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-gap-down-below-head-and-shoulders-top-neck-line.png\"><img loading=\"lazy\" src=\"2019-5-29-2.png\" alt=\"Emini gap down below head and shoulders top  neck line\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>Today gapped down and broke below the neck line of the March-May head and shoulders top. But, it was a trading range day. Since it had a bear body on the daily chart, it is a weak buy signal bar for tomorrow.<p>The bears want a measured move down. That would close the gap above the February 11 high. In addition, it would be about a 50% correction of the 2019 rally.<p>However, the bulls hope that the breakout will fail. They need to get a strong reversal up over the next few days. Without that, the Emini will probably trade down to the targets below.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-5-29"
    }
  ],
  "30": [
    {
      "data": [
        "<article class=\"post-90110 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini breakout below March-May head and shoulders top\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini breakout below March-May head and shoulders top</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-05-30T06:20:26-07:00\">May 30, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Thursday May 30, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini gapped down and sold off yesterday, but reversed up midday from the 200 day MA. The bulls hope that the break below 2800 and the bottom of the 3 month trading range will fail. But, yesterday was not a big bull bar closing on its high. It is not a strong bull signal bar for today.<p>Last weekend, I said that the weekly chart had a bear doji bar last week. I mentioned that it was a weak sell setup. I said that there might be more buyers than sellers below its low.<p>This week is the entry bar for that short. There are 2 days left to the week. The bears want this week to close on its low. However, given that last week is a weak sell setup, the bulls will try to get this week to close above last week’s low. Therefore, there is an increased chance of a rally into the end of the week.<p>What is most likely? Confusion. The Emini has been sideways for 3 months. When that is the case, there is a lack of conviction. Every move tends to reverse after a few days. Consequently, this week will probably disappoint both the bulls and bears. It can do that by going mostly sideways today and tomorrow.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 10 points in the Globex session. After yesterday’s 2 reversals up from the 200 day MA, there might be follow-through buying today.<p>However, yesterday was a bear day on the daily chart. It is therefore a weak buy signal bar for today. As a result, traders expect that there will be sellers above yesterday’s high.<p>Even though the daily chart fell below 2800 and the 3 month trading range, it could still be testing this support. It is not yet clear that the breakout will succeed.<p>Confusion is a hallmark of a trading range. That makes sideways likely for a few days. Also, most days over the past month have had swings up and down. Therefore, today will probably again be a mostly trading range day. The bears might need more than one day to recover from Tuesdays’s exhaustive sell climax.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-gap-down-below-head-and-shoulders-top-neck-line.png\"><img src=\"2019-5-30.png\" alt=\"Emini gap down below head and shoulders top  neck line\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/EURUSD-Forex-trading-range-in-bear-channel.png\"><img loading=\"lazy\" src=\"2019-5-30-1.png\" alt=\"EURUSD Forex trading range in bear channel\"></a></figure><p>The EURUSD daily Forex chart has been sideways for a month. This is a Breakout Mode pattern.<p>Since the chart has been in a bear channel for a year, the odds continue to favor lower highs and lows. However, the May rally was smaller than most prior rallies. Furthermore, the 4 day selloff is holding above the double bottom. Consequently, there is still a 50% chance that the bottom will hold and the bulls will get a test of the May double top.<p>In addition, even if the bears get their breakout, every prior bear breakout over the past year reversed back up within several days. As a result, the bulls will look to buy a reversal up from around the May low.<p>There is no reversal yet. Also, there is no bear breakout. The daily ranges have been small and most days have been mostly sideways on the 5 minute chart.<h3>Weekly chart might form outside down bar this week</h3><p>The week traded above last week’s high. It is now almost down to last week’s low. There is an increased chance of an outside down week on the weekly chart. This week would then be a sell signal bar on the weekly chart for next week.<p>However, the weekly chart has been in a tight range for 5 weeks. A breakout up or down will probably not go far before reversing back into the tight trading range. Until there is a strong breakout up or down on the daily and weekly charts, day traders are mostly scalping, looking for reversals.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 20 pips range overnight. Day traders are looking for scalps. But when the range is that tight, it is difficult to make even a minimum scalp.<p>Because the daily chart is near the bottom of a month-long trading range, day traders expect a reversal up within the next few days. This is true even if there is a break below the May low 1st.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-wedge-bear-channel.png\"><img loading=\"lazy\" src=\"2019-5-30-2.png\" alt=\"Emini wedge bear channel\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini tested above yesterday’s high and below last week’s low in the 1st hour. It then reversed down for 4 hours. Next, it reversed up from a big wedge and closed in the middle of the day’s range. The daily chart is still in its breakout below the 3 month head and shoulders top. However, the wedge bull flag increases the chance of at least slightly higher prices tomorrow.<p>Tomorrow is Friday and weekly support and resistance are important, especially in the final hour. Last week was a sell signal bar on the weekly chart. Its low is therefore a magnet above. The bears want the week to close on its low.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-5-30"
    }
  ],
  "31": [
    {
      "data": [
        "<article class=\"post-90113 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini breakout below March-May head and shoulders top\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini breakout below March-May head and shoulders top</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-05-31T06:20:47-07:00\">May 31, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Friday May 31, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini sold off yesterday from above Wednesday’s high and below last week’s low. However, it reversed up late in the day from a wedge higher low. This follows Wednesday’s higher low major trend reversal. Neither rally was impressive.<p>The bulls are hoping that this week’s break below the neck line of the 3 month head and shoulders top will fail. But they need bull bars. Without a strong reversal up within the next week, the odds will continue to favor a closure of the gap above the February 11 high.<p>Today is Friday and therefore weekly support and resistance is important. This is particularly true in the final hour. The most important price is last week’s low. Last week was a weak sell signal bar on the weekly chart. The bulls want this week to close above last week’s low. However, the bears want the week to close on the low of the week. That would increase the chance of lower prices next week.<p>Today is also the last day of the month. It is unlikely that the Emini will close above the April low. However, the bears want the month to close near its low. That would increase the chance of lower prices in June.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 29 points in the Globex market. It will therefore probably have a big gap down on the open.<p>When there is a big gap down, there is an increased chance of a trend day. A bear day is more likely. However, a big gap down means that the open is far below the EMA. The bears do not want to sell far below the average price unless the bearish price action is far above average. Consequently, unless there are bear bars closing near their lows on the open, the bears will wait to sell a rally to near the EMA. That is typically either a double top or a wedge bull flag. It usually needs an hour of sideways to up trading to form.<p>The bulls hope that the gap down represents an extreme. They will therefore look to buy either a double bottom or wedge bottom in the first 90 minutes and hope for a bull trend day.<p>There is only a 20% chance of either a strong trend up or down from the open. Eighty percent of the time, a big gap up or down leads to confusion and at least one reversal. There typically is a trading range for the 1st hour or so before the 1st swing begins. Furthermore, if there is early trading range trading, it represents balance. It therefore reduces the chance of an exceptionally big trend day up or down.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-wedge-bear-channel.png\"><img src=\"2019-5-31.png\" alt=\"Emini wedge bear channel\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/EURUSD-Triangle-in-bear-channel.png\"><img loading=\"lazy\" src=\"2019-5-31-1.png\" alt=\"EURUSD Triangle in bear channel\"></a></figure><p>The EURUSD daily Forex chart has been in a trading range for a month and a bear channel for a year. The trading range now has 3 lows at around the same level. Since May 27 formed a lower high, the trading range is now a triangle.<p>That does not change things. The trading range alone is a Breakout Mode setup. Until there is a breakout, traders are looking for reversals.<p>Today reversed up above yesterday’s high. But yesterday was only a doji bar and not a strong bull trend reversal bar. Furthermore, it followed 3 strong bear bars. This is a weak buy setup. Consequently, many bulls will wait to buy above a bull bar closing near its high. The bulls today therefore will try to get today to close near its high.<p>Since the bears always want the opposite, they want today to close off the high and preferably below yesterday’s high. That would increase the chance that the 2 day rally will be a bear flag instead of a bull trend reversal.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart rallied overnight and broke above yesterday’s high. This triggered a buy signal on the daily chart for a reversal up from the bottom of the month-long trading range.<p>But the overnight rally has been only 30 pips. In addition, it lacked consecutive big bull bars with closes near their highs. This is not how a strong trend typically begins.<p>The bulls might have to wait until Monday to create signs of strength. Their minimum goals for today are to get the day to close above yesterday’s high and at the high of the day. They therefore will buy 10 – 20 pip selloffs.<p>The bears want the opposite. They will sell rallies to the high of the day and try to get today to close below yesterday’s high. They would prefer the day to close on its low. However, with so little energy so far, that is unlikely. In fact, the range over the past 5 hours is only 15 pips. That makes it difficult even for scalpers to make money.<p>Since today is the last day of the week and month, there is an increased chance of a big move up or down. However, the price action so far makes a quiet trading range day more likely.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-trading-range-day.png\"><img loading=\"lazy\" src=\"2019-5-31-2.png\" alt=\"Emini trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini had trading range price action all day, even though it closed on the low of the day, week, and month. Today was the last day in May. May is now an outside down bar and it formed a double top on the monthly chart with the September high. May is therefore a sell signal bar for June. However, the odds are that any selloff will only last another month or so.<p>On the daily chart, there are still magnets below. While the Emini might bounce next week because of the small parabolic wedge bear channel, the odds continue to favor lower prices.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-5-31"
    }
  ]
}