{
  "1": [
    {
      "data": [
        "<article class=\"post-90119 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini selloff to February gap and maybe 10% correction\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini selloff to February gap and maybe 10% correction</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-06-01T00:30:23-07:00\">June 1, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Market Overview: Weekend Market Update</h2><p>The<strong>Emini</strong>selloff is in search of a bottom of its 5 week bear leg in its 18 month trading range. A reasonable target is the gap above the February 11 high. Also, a 50% retracement of the 2019 rally would be about a 10% correction. The bulls will then probably get another test of the all-time high within a couple months.<p><strong>Crude oil</strong>is selling off sharply but it is entering the buy zone. The rally will probably be minor, last 2 – 3 weeks, and test $60.<p>The<strong>EURUSD</strong>Forex market has been in a bear channel for a year. Protracted bear channels often end with a sharp break below the channel and then a reversal up. There is no sign yet that the pattern of 2 – 3 week rallies and 2 – 3 week selloffs is about to end.<h2><strong>Crude oil Futures market:</strong><br>Strong bear breakout, but support at $52</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Crude-oil-weekly-chart-in-strong-bear-breakout-1.png\"><img loading=\"lazy\" src=\"2019-6-1.png\" alt=\"Crude oil weekly chart in strong bear breakout\"></a></figure><p>The crude oil futures contract sold off sharply over the past 2 weeks. For the 6 weeks, I have been saying that the selloff might continue down to the January 14 low of 51.61. That was the 1st pullback on the daily chart from the strong reversal up from the end of December. It was therefore the start of the bull channel in a 4 month Spike and Channel bull trend.<p>I said repeatedly in March and April that there is typically a bear break below the bull channel and then a transition into a trading range. The bottom of the range is often around the start of the bull channel. But, it could be higher or lower.<p>There are two scenarios that are unlikely. First, crude oil’s 2 month selloff will probably not continue down to the Christmas low without at least a several week rally. The selloff is probably a bear leg in a developing trading range and not the start of a bear trend.<p>Next, once there is a reversal up, it will probably not continue up to the October high with at least a pullback lasting several weeks. Remember, the entire 2019 rally was probably the start of a trading range that could last for the rest of the year.<p>Consequently, traders expect rallies and selloffs to reverse instead of leading to trends. They therefore buy as crude oil falls, sell as it rallies, and take quick profits. This creates a trading range.<h3>When will there be a bull trend reversal?</h3><p>The current 2 month selloff is in search of a bottom. Last week’s big bear breakout was a pair of Bear Surprise Bars. That typically leads to at least a small 2nd leg down. This week met the minimum objective.<p>Big bars often attract profit takers. Therefore, the bears will probably begin to take profits within a couple of weeks. The bulls know this and they will begin to buy.<p>The next support is the March 8 low of 55.12. Below that are the February and January higher lows around 52.00.<p>The buy zone is therefore between this week’s low of 56 and the January low of 51.61. This is an area where bulls will begin to buy and bears will begin to take profits.<h3>What will bottom look like?</h3><p>The bulls have to stop the selling before they can get a 2 – 3 week rally. There is no sign of a bottom yet.<p>However, the selling should slow over the next few weeks. Traders will look for a good buy signal bar, especially if there is a micro double bottom. They will then begin to buy, expecting a rally up to resistance.<p>The 1st target is the top of the most recent sell climax, which his Wednesday’s high of 59.70. That is about $60. That usually corresponds to the 20 day EMA.<h2><strong>EURUSD weekly Forex chart:</strong><br>Yearlong bear channel, month-long tight trading range</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/EURUSD-weekly-Forex-chart-in-tight-bear-channel.png\"><img loading=\"lazy\" src=\"2019-6-1-1.png\" alt=\"EURUSD weekly Forex chart in tight bear channel\"></a></figure><p>The EURUSD weekly Forex chart has been forming lower highs and lows for a year. This is a bear channel and there is no sign that it is about to end. Consequently, traders continue to buy reversals up from every new low and sell reversals down from rallies to above the 20 day EMA. The legs up and down have lasted 2 – 3 weeks.<p>The daily chart has been in a tight trading range for a month. Every trading range has both buy and sell setups. The bears have a double top with the May 1 and May 13 highs. The bulls have a double bottom with the April 26 and May 23 low.<p>Because the chart is now near the 52 week low, traders are expecting a reversal up. The reversal can come from above or below the May 23 low. But, a 2 – 3 week reversal up is more likely that a strong break below the May low.<h3>Possible sell climax below yearlong bear channel</h3><p>When a bear channel lasts a long time, it often ends with a sell climax. There can be a strong break below the bear channel. But, 75% of the time, a bear break below a bear channel reverses up within 5 bars.<p>Five bars, but on what time frame? It is the highest time frame that shows the channel. That is the weekly chart.<p>If traders see a strong selloff over the next few weeks that breaks strongly below the 52 week low and the bear channel, they should be ready for a reversal up. If there is a reversal up, it usually leads to a swing up. The minimum goal would be 10 bars and two legs. It could last longer and go much higher.<p>Since the weekly chart is in a Spike and Channel bear trend, traders will expect a reversal up to test the start of the bear channel. That is the June 14, 2018 high of 1.1851. Since that is far above, any rally would take many months to get there.<p>Bear channels usually evolve into trading ranges. Therefore, even if the bulls get a strong reversal up, it will probably be a bull leg in a trading range that will last a year or more.<h2><strong>Monthly S&amp;P500 Emini futures chart:</strong><br>Double top, but minor reversal</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-monthly-chart-double-top-with-outside-down-sell-signal-bar.png\"><img loading=\"lazy\" src=\"2019-6-1-2.png\" alt=\"Emini monthly chart double top with outside down sell signal bar\"></a></figure><p>The monthly S&amp;P500 Emini futures chart&nbsp;in May reversed down from above the April high and closed below the April low. May is therefore an outside down month. Furthermore, it formed a double top with the September all-time high. May’s candlestick is now a sell signal bar for that double top.<p>When there is a double top, the 2nd leg up is often very strong. The January to April rally is an example. Yet, if there is a bear sell signal bar like there is in May, the next bar triggers the sell signal if it trades below the sell signal bar low. Therefore, if June trades below the May low, it will trigger the sell signal for the double top.<p>In 60% of the instances, the market continues in its trading range. This is true even if it breaks below the neck line of the double top. That is the December low. The breakout usually fails and the trading range continues.<p>However, there is a 40% chance that the break below the May low will lead to a swing down. It could fall well below the middle of the 18 month trading range and even test the December low.<p>While it might be difficult to imagine at the moment, the sell signal would give the Emini a 30% chance of breaking far below the December low and falling for about a measured move down. That would be a test of the 2014 – 2015 trading range at around 2,000.<h3>Pullback more likely than trend reversal</h3><p>Currently, a 2 – 3 month pullback is likely. That is a minor reversal. The odds still favor a new all-time high this year.<p>However, this 18 month trading range is coming late in a bull trend on the monthly chart. It is therefore a good candidate for the Final Bull Flag. Therefore, if the bulls get a break above the double top, it will probably be the final rally in the 10 year bull trend.<h3>Upcoming trading range will last many years</h3><p>The Emini will probably correct down to the 2014 – 2015 trading range at some point in the next several years. At that point, it will probably enter a big trading range that could last for a decade.<p>Trading ranges typically follow big bull trends. Since this is the monthly chart, the trading range can last many years. That happened from 1965 – 1982 and again from 1997 – 2012. During those trading ranges, there were several selloffs of 30 – 50% and many rallies of 50 – 100%. Traders should expect this to begin again at some point in the next few years.<h2><strong>Weekly S&amp;P500 Emini futures chart:</strong><br>Emini selling off to March 2726 low and maybe 10% correction</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-weekly-chart-Bear-Surprise-Bar.png\"><img loading=\"lazy\" src=\"2019-6-1-3.png\" alt=\"Emini weekly chart Bear Surprise Bar\"></a></figure><p>The weekly S&amp;P500 Emini futures chart triggered a sell signal when this week traded below last week’s low. However, last week was a doji bar. That is a weak sell signal bar. Furthermore, the past 4 weeks all had prominent tails. That is not how a bear trend typically begins. That lack of momentum and the weak sell signal bar make a protracted, deep selloff unlikely.<p>This week was the entry bar for the sell signal. Because it was a bear bar closing below last week’s low, there is an increased chance of lower prices over the next few weeks.<p>However, each bar for the past 4 weeks had a high below the high of the prior bar. This is a 5 bar bear micro channel. The bears hope it is an early bear trend. But the prominent tails on the bars represents a lack of conviction on the part of the sellers. Consequently, the micro channel will probably end within the next few weeks. That means that the high of a bar will be above the high of the prior bar.<h3>1st reversal up from bear micro channel will be minor</h3><p>It is important to realize that the 1st reversal up in a 5 bar bear micro channel is typically minor. Traders will expect a 1 – 3 week rally and then a test back down. This limits the upside for the next several weeks.<p>The lack of consecutive big bear bars closing near their lows limits the downside.<p>What’s left? A trading range. This selloff is probably a bear leg in a developing trading range.<h3>Disappointment and confusion are hallmarks of a trading range</h3><p>Traders know that trading ranges can last longer and fall further than what seems reasonable. Trading ranges typically disappoint bulls and bears by forming breakouts that reverse instead of continuing into a trend.<p>Also, the lack of clarity confuses traders. The probability of everything is less than in a trend. Reversals often do not have strong signal bars. Legs up and down typically continue further than what seems likely. Breakouts of prior swing highs and lows reverse.<p>There is only one thing that traders see as high probability. Reversals are more common than breakouts. Consequently, they buy low and buy more lower. They are betting against a bear trend. Also, the sell high and sell more higher, betting against a bull trend. Finally, since they expect reversals, they are quick to take profits.<p>The result of traders buying low, selling high, and taking quick profits is a trading range. The weekly chart is in the early stages of a trading range. There is no sign that it is about to end.<h2><strong>Daily S&amp;P500 Emini futures chart:</strong><br>Break below neck line of head and shoulders top</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-daily-chart-breakout-below-neck-line-of-head-and-shoulders-top.png\"><img loading=\"lazy\" src=\"2019-6-1-4.png\" alt=\"Emini daily chart breakout below neck line of head and shoulders top\"></a></figure><p>The daily S&amp;P500 Emini futures chart this week broke below the bottom of the 3 month trading range. It also broke below the 2800 Big Round Number. The trading range was a head and shoulders top, which is always a lower high major trend reversal. This week triggered the major trend reversal sell signal by breaking below the neck line of the head and shoulders top.<p>It is important to realize that a major trend reversal sell<em>signal</em>only becomes a major trend reversal 40% of the time. More often, the breakout soon reverses back up and the trading range continues or the bull trend resumes.<h3>Support around 2650</h3><p>There is no credible sign of a reversal up yet. Furthermore, there are important magnets below. The first is the gap above the February 11 high of 2723.00. Next, a 10% correction is that at 2660.40. Finally, a 50% retracement of the 2019 rally is just below at 2651.00.<p>Many bulls would be more confident that the selloff is over if it continues down to just below those targets and then reverses up. If it reverses up before then, the bulls will feel that the Emini had not tested important support. This will make them hesitant to buy as the Emini rallies. That relative lack of buyers could then lead to a lower high and a test of that important support.<h3>Will the selloff end soon?</h3><p>Can the Emini rally up to a new high from where it is now? That is unlikely. The selloff has been in a tight bear channel. The 1st reversal up from a tight bear channel is typically minor. Traders will want to see a test down and then a 2nd reversal up before they will believe that the bull trend is resuming.<p>Less often, a minor reversal can continue up and become major. The bulls would need to see several big bull bars closing near their highs before they would be confident that the selloff has ended.<p>In the meantime, traders believe that the selloff is a pullback in a bull trend and not the start of a bear trend. However, there is no credible bottom and there are targets below. This uncertainty will probably lead to a trading range over the next several weeks. It could last many more months.<p>The most recent leg down has lasted about 2 weeks. That is similar to the 1st leg down to the May 13 low. That increases the chance of a bounce for several days this coming week.<hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-6-1"
    }
  ],
  "3": [
    {
      "data": [
        "<article class=\"post-90116 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini outside down monthly sell signal bar in May\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini outside down monthly sell signal bar in May</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-06-03T06:20:57-07:00\">June 3, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Monday June 3, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Today is the 1st day of June. May was an outside down month and a double top. The bears want June to trade below the May low to trigger the monthly sell signal. If they are successful, the odds favor only another month or two down because the 2019 rally was strong and the monthly chart is in a trading range.<p>When a signal triggers on a higher time frame, there is usually a pullback beyond the breakout point. Consequently, if today trades below May’s low, the odds favor a rally to back above the May low. It can happen today or it could take a week or two. Traders will then decide if the sell signal will fail or succeed.<p>Since the bulls always want the opposite, they hope that June closes near its high. It would therefore be a buy signal bar on the monthly chart for July. They want any breakout below the May low to reverse up.<p>The daily chart has been in a tight bear channel for a few weeks. In addition, it has had 4 small legs down. This is therefore a parabolic wedge selloff. Since that is a sell climax, it increases the chance of a bounce this week.<p>However, the momentum down over the past month is good enough to make sideways to lower prices likely over the next few weeks. Traders will sell a 2 – 3 day rally, betting that the selloff will reach the targets below.<p>Most days over the past month have had both at least one swing up and one swing down. That increases the chance of another mostly trading range day today.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 8 points on the Globex chart. If the day session opens here, it will trigger a monthly sell signal. Furthermore, there will be a gap down on the weekly and monthly charts. Gaps on the monthly chart are rare. Furthermore, small gaps typically close in the 1st hour. Consequently, if there is a gap down, there is an increased chance of a rally in the 1st hour.<p>Since there is a parabolic wedge sell climax on the daily chart, there is an increased chance of a 2 – 3 day rally this week. In addition, the daily chart is at the bottom of that tight bear channel. Since the bottom of the channel is support, there is a reduced chance of a big bear trend day today.<p>Finally, most days over the past month have had swings up and down. Traders will assume that today will also have a lot of trading range price action unless they see a strong trend up or down.<h2>Friday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/05/Emini-trading-range-day.png\"><img src=\"2019-6-3.png\" alt=\"Emini trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/EURUSD-Forex-triangle-in-bear-channel.png\"><img loading=\"lazy\" src=\"2019-6-3-1.png\" alt=\"EURUSD Forex triangle in bear channel\"></a></figure><p>The EURUSD daily Forex chart has been in a weak bear channel for a year. For the past month, it has been in a triangle. It has rallied for 3 days but the bars are not big and there is no breakout yet. This is a Breakout Mode pattern. That means there is a 50% chance that the 1st breakout up or down will reverse and a 50% chance that a successful breakout will be up or down.<p>Because a bear channel is a bull flag, traders should expect a rally lasting several months at some point. However, there is a 50% chance that there will first be a sharp breakout below the bottom of the yearlong bear channel first. If that were to happen, traders will look for a reversal setup. If they get one, they could be buying the bottom of a rally that would probably last many months.<p>Until then, traders will continue to look for 2 – 3 week rallies and selloffs that reverse. There is no sign that this is about to change.<h3>Profit-taking is US Bonds could lead to a bounce in the EURUSD Forex market</h3><p>The US bond market is in a buy climax and Friday’s extreme rally will probably attract some profit-taking. US Treasuries have been in a flight-to-quality rally. If traders begin to wonder that it might be ending, they will take profits in US bonds and begin to put money elsewhere. That includes Europe. If people are more willing to buy Euros, the profit-taking in the US bond market could lead to a 2 – 3 week rally in the EURUSD Forex market.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has rallied for 3 days and it is 40 pips above the overnight low. The bars are not big, and the rally so far looks minor.<p>The rally is now testing the bear trend line at the top of the month-long triangle. Because the overnight pullbacks have only been 15 pips, the bears are not yet making money. Day traders are buying for scalps.<p>If the bulls begin to create bigger bars closing on their highs and consecutive big bull bars, they will be more willing to swing trade. Their next target is last week’s high of 1.1215, and then the top of the triangle at the May high.<p>The bears need the overnight rally to stop. Because it is now at the daily bear trend line, they will start to look for sell setups on the 5 minute chart. Once the 5 minute chart transitions into a trading range, the bears will begin to sell at prior intraday highs and on reversals down. However, with small bars and small legs, they, too, will only scalp. Swing traders need bigger bars and bigger legs.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-trading-range-day-after-triggering-sell-signal-below-May-outside-down-bar.png\"><img loading=\"lazy\" src=\"2019-6-3-2.png\" alt=\"Emini trading range day after triggering sell signal below May outside down bar\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini triggered a monthly sell signal by trading below the May low today. However, it had violent swings up and down around that May low all day.<p>The price is clearly important. Traders are deciding if the sell signal will lead to a swing down or if it will fail. The February 11 gap is a magnet just below today’s low. I have been saying for 2 months that it is a target below. It might close tomorrow.<p>However, there is a parabolic wedge sell climax on the daily chart. This increases the chance of a bounce this week before the gap is filled. If there is a bounce, it will probably be minor. Odds favor at least slightly lower prices within a few weeks. This is especially true after so many tech stocks had surprisingly big selloffs today.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-6-3"
    }
  ],
  "4": [
    {
      "data": [
        "<article class=\"post-90299 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini monthly sell signal but parabolic wedge sell climax\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini monthly sell signal but parabolic wedge sell climax</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-06-04T06:20:39-07:00\">June 4, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Tuesday June 4, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini had unusually big swings up and down yesterday. The big swings up tell traders that the bears are beginning to take some profits. Additionally, the bulls are beginning to buy for a minor reversal up this week, which is what I have been saying for a few days.<p>This is consistent with the parabolic wedge sell climax on the daily chart. The month-long bear channel has 4 legs. That increases the chance of rally for a few days. The May 13 low is a breakout point and just above the 2800 Big Round Number and the 20 day EMA. These should get tested within a couple weeks.<p>When there is a rally above a tight bear channel, it typically is minor. It will probably last at least a few days.<p>The gap above the February 11 high is still a magnet below. If the reversal up is not too strong, the odds will continue to favor a closure of that gap before a test of the all-time high. However, that test is still likely at some point within a few months.<p>By trading below the May low yesterday, the Emini triggered a monthly sell signal. However, it spent yesterday oscillating around that low and closed just above it. Traders are deciding on whether the sell signal will succeed or fail. The odds favor a bounce.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 18 points in the Globex session. I have been saying that the parabolic wedge bear channel will probably lead to at least a 2 – 3 day rally this week. That is still the case.<p>Today might gap up and begin a rally to the top of the bear channel. If there is a gap up today and it stays open, there will be a 2 day island bottom. That is a minor reversal and it would increase the chance of higher prices for at least a couple days.<p>Furthermore, the daily chart has been in a trading range for 18 months. Limit order traders who bet against breakouts, scale in, and use wide stops typically make money. Therefore, the bulls will probably get a bounce above the March 13 breakout point of 2802.00. That will be around the 20 day EMA.<p>Since the odds favor a bounce for at least a day or two, there is an increased chance of a bull trend day today. Day traders should expect an attempt to form an early low of the day. They will therefore look for either a rally from the open or a brief selloff on the open and a reversal up.<p>Traders should never assume that the market will only do one thing. They always need to be ready to do the opposite of what is likely. They will be willing to short if there is a strong reversal down.<p>Most days over the past month have had swings up and down. That is likely again today. However, because of the likelihood of a move up to 2800 starting soon, there is an increased chance of a bull trend day.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-trading-range-day-after-triggering-sell-signal-below-May-outside-down-bar.png\"><img src=\"2019-6-4.png\" alt=\"Emini trading range day after triggering sell signal below May outside down bar\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/EURUSD-Forex-breakout-above-trading-range-in-bear-channel.png\"><img loading=\"lazy\" src=\"2019-6-4-1.png\" alt=\"EURUSD Forex breakout above trading range in bear channel\"></a></figure><p>The EURUSD daily Forex chart rallied for 4 days in its yearlong bear channel. The rally broke above the month-long trading range overnight but pulled back. The bulls hope that the pullback only lasts a day or two and then forms a bull flag. If they can get consecutive closes above the range, they will then try to test the March 20 major lower high of 1.1448.<p>It is important to remember that all breakouts up and down over the past year have failed. The bears therefore are confident that this one will fail as well. This is true even if it first tests the March high.<p>The rally is strong enough to have at least a small 2nd leg up. Consequently, the bears need signs of strength. If they get a surprisingly big bear day this week or a series of small bear days, the odds will shift back in their favor. Traders will begin to look for a break to a new 52 week low. But if they are unable, the odds will continue to favor a bull flag over the next couple days rather than the reversal down.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart broke slightly above the month-long trading range overnight but reversed down. This is not how strong breakouts typically behave. Instead, it is trading range price action, which has been present for a year.<p>The 4 day rally was climactic and it tested resistance. That typically attracts profit takers and some shorting. If the bears can get a strong selloff over the next few days, the breakout will fail.<p>The fight will be over the appearance of the bars on the daily chart. The bears want 2 – 3 days that close near their lows and have big bear bodies on the daily chart. To accomplish this, they will sell 20 – 30 pip rallies.<p>However, they need 50 point swings down on the 5 minute chart. Also, they need consecutive big bear bars on that chart. They do not have these yet.<p>The overnight selloff does not yet look like the start of a swing down. Instead, it looks more like a pullback from the breakout on the daily chart. Traders still believe that the selloff will form a 1 – 3 day bull flag on the daily chart.<p>There is uncertainty about whether the selloff is a pullback or a reversal. Uncertainty is a hallmark of a trading range. Day traders will therefore look for 10 – 20 pip reversals today.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-small-pullback-bull-trend-and-test-2800-big-round-number.png\"><img loading=\"lazy\" src=\"2019-6-4-2.png\" alt=\"Emini small pullback bull trend and test 2800 big round number\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>Today rallied in a Small Pullback Bull Trend. I have been saying for several days that the Emini would probably rally this week because of its parabolic wedge sell climax.<p>Has the bull trend resumed? Probably not. Bulls would like to see a reversal up, but many would like it to come after closing the gap above the February 11 high. Therefore, this is probably a minor reversal up. It is a test of the May 13 low. That low was the breakout point of the head and shoulders top on the daily chart.<p>There is still room to the daily EMA and the momentum up is strong. Consequently, the Emini will probably be sideways to up for at least another day or two.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-6-4"
    }
  ],
  "5": [
    {
      "data": [
        "<article class=\"post-90302 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini trend reversal up from May parabolic wedge sell climax\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini trend reversal up from May parabolic wedge sell climax</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-06-05T06:20:53-07:00\">June 5, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Wednesday June 5, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>I said over the weekend and on Monday that the Emini would probably rally this week. After 4 weeks in a tight bear channel with 4 legs down, the odds favored several days up.<p>Yesterday gapped up and formed a 2 day island bottom. The rally was a Small Pullback Bull Trend. The Emini will probably be sideways to up for at least another day or two. If it forms several bull days, then the rally could continue up to the all-time high.<p>However, the month-long bear channel it tight. Therefore it is more likely that the bears will get a test of Monday’s low and a closure of the February 11 gap before there is a new all-time high.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 8 points in the Globex session. Today therefore might gap up again.<p>However, yesterday was a buy climax. There is therefore a 50% chance of some follow-through buying in the 1st 2 hours, but only a 25% chance of another strong bull trend. Additionally, there is a 75% chance of at least a couple hours of sideways to down trading beginning by the end of the 2nd hour.<p>Yesterday was strong enough to make higher prices likely for a few days. Therefore day traders will look to buy 1 – 3 hours selloffs.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-small-pullback-bull-trend-and-test-2800-big-round-number.png\"><img src=\"2019-6-5.png\" alt=\"Emini small pullback bull trend and test 2800 big round number\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/EURUSD-Forex-breakout-above-trading-range.png\"><img loading=\"lazy\" src=\"2019-6-5-1.png\" alt=\"EURUSD Forex breakout above trading range\"></a></figure><p>The EURUSD daily Forex chart broke above the month-long trading range this week. The bulls want today to close far above yesterday’s high. That would increase the chance of a continued rally up to the March 20 major lower high.<p>Every breakout up and down over the past year has reversed within a few weeks. Consequently, the bears expect this breakout to fail before it gets much above the May or April highs.<p>If the rally breaks above the March high, traders will conclude that the yearlong bear channel has ended. They will then believe that the chart had either evolved into a trading range or reversed into a bull trend.<p>Since a bear channel is a bull flag, the odds are that the bulls will get a break above the yearlong bear channel at some point this year.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart rallied sharply in the past 10 minutes and is at the high of the day. The rally is strong enough to make follow-through buying likely. As a result, traders will probably buy the 1st 20 – 30 pip selloff and bet on a 2nd leg up.<p>In addition, traders will expect a bull channel for the next couple of hours. Bulls will buy pullbacks.<p>The bears will not sell until there is at least a micro double top. Even then, unless they get a strong reversal down, it will be easier to make money as a bull day trader today. This increases the chance that the bulls will get a close near the high of the day. If so, today will close above the May high and increase the chance of higher prices tomorrow.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-opening-reversal-up-from-wedge-bottom.png\"><img loading=\"lazy\" src=\"2019-6-5-2.png\" alt=\"Emini opening reversal up from wedge bottom\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>After an early selloff, the Emini formed a wedge bottom. This led to an opening reversal up from a test of the May 13 low. The day closed near the open and formed a doji bar on the daily chart.<p>The bulls want the week to close on its high. Furthermore, they would like it to close above last week’s high. This week would then be an outside up bar and a better buy signal bar on the weekly chart for next week.<p>Today was a trading range day after yesterday’s buy climax. It increases the chance of more trading range price action tomorrow. But, the odds favor at least slightly higher prices over the next few days after the 3 day rally.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-6-5"
    }
  ],
  "6": [
    {
      "data": [
        "<article class=\"post-90305 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini possible outside up buy signal bar on weekly chart\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini possible outside up buy signal bar on weekly chart</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-06-06T06:20:12-07:00\">June 6, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Thursday June 6, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini sold off and then rallied yesterday from an Opening Reversal up from the May 13 low. It was a trading range day.<p>There are only 2 trading days left to the week. The bulls want the week to close on its high. They therefore only need to keep the Emini sideways today and tomorrow.<p>They would prefer it to break above last week’s high. This week would then be an outside up bar on the weekly chart. It would therefore be a buy signal bar for next week.<p>However, the weekly chart has a 5 bar bear micro channel. Consequently, the 1st reversal back up will probably be minor. That means the Emini will probably be mostly sideways for another week or two. This is true even though it will probably go at least a little higher over the next week.<p>The bears want the rally to form a lower high on the daily chart. But there is no top yet. Also, after the strong 3 day reversal, there will probably be buyers below yesterday’s low.<p>Since Tuesday was a buy climax, the bulls are exhausted. Yesterday was a trading range day. That increases the chance that today will also be a trading range day. This is especially true since there is not much incentive for the bulls to do more this week. Also, most traders will not sell aggressively after a strong 3 day rally.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 8 points in the Globex session. It might gap up again for the 3rd consecutive day. However, strong rallies on the 5 minute chart typically have a pullback by the end of the 3rd day. Consequently, the odds of bull trend day are less. Day traders will be more willing to look for tops on the 5 minute chart, expecting at least a couple hours of sideways to down trading.<p>This rally is testing the late 2019 triple top of 2828. That area has been important support and resistance for 18 months. Therefore, the Emini will probably begin to stall here for at least several days.<p>Can today break far above that resistance today? Probably not. The Small Pullback Bull Trend on the 60 minute chart now has 15 bars. That is relatively unusual and therefore climactic. It will begin to attract profit takers and some shorts. The odds of a pullback are increasing.<p>Since the June 19 FOMC announcement is more important than usual, the Emini will probably begin to enter a trading range for the next 2 weeks.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-opening-reversal-up-from-wedge-bottom.png\"><img src=\"2019-6-6.png\" alt=\"Emini opening reversal up from wedge bottom\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/EURUSD-Forex-breakout-above-trading-range-in-bear-channel-2.png\"><img loading=\"lazy\" src=\"2019-6-6-1.png\" alt=\"EURUSD Forex breakout above trading range in bear channel\"></a></figure><p>The EURUSD daily Forex chart reversed down yesterday from its break above the month-long trading range. However, it is reversing back up today. Traders are deciding if yesterday is a reversal or a pullback.<p>Yesterday was an outside down day. But today is now an outside up day. This is a consecutive outside day pattern, which is a reliable buy signal for tomorrow. It will be stronger if today closes above yesterday’s high.<p>Because of the yearlong bear channel, the bears want a reversal down. Every prior rally has reversed down within 2 – 3 weeks.<p>However, a bear channel has a 75% chance of an eventual successful bull breakout. Consequently, one of these breakout attempts will probably be the start of a bull trend that will last many months.<p>The bulls need consecutive closes above the March 20 major lower high to end the bear channel. Until then, the odds continue to favor bear rallies and reversals down after 2 – 3 weeks.<p>Legs in trading ranges tend to go beyond minor support and resistance before reversing. The April 12 minor lower high is just above. This rally might have to get above that high before the bears will sell aggressively.<p>Since the June 19 FOMC meeting is more important than usual, all financial markets might begin to go sideways into that report. Then, on the report, traders would decide on the direction of the next move.<h3>Overnight EURUSD Forex trading</h3><p>Yesterday was a bear sell signal bar on the daily chart for a failed breakout above a trading range. By today going below yesterday’s low, the sell signal triggered.<p>However, there were far more buyers than sellers below yesterday’s low. The EURUSD 5 minute Forex chart rallied 100 pips in the past hour. This increases the chance of higher prices today.<p>The bulls do not need higher prices today. Their goal will be to have today close near its high. Today is already an oo buy setup for tomorrow (consecutive outside bars). It will be more reliable if today closes above yesterday’s high and around today’s high. Traders tomorrow would then be more eager to buy above today’s high, looking for at least several days of higher prices.<p>The bears hope that today’s rally is simply a pullback from triggering the sell signal on the daily chart this morning. However, today’s rally is strong enough to make a reversal down on the 5 minute chart unlikely today. Traders will buy pullbacks and be more willing to hold part of their long positions overnight.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-outside-up-buy-signal-on-weekly-chart.png\"><img loading=\"lazy\" src=\"2019-6-6-2.png\" alt=\"Emini outside up buy signal on weekly chart\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>Today broke above yesterday’s high, but it was a small trading range day until late. It then broke strongly above last week’s high. This week is therefore an outside up week and a buy signal bar on the weekly chart for next week.<p>Because the buying is extreme, it is climactic. The odds therefore favor a 1 – 2 day pullback within the next few days. However, the 4 day rally is strong. Consequently, the bulls will buy the pullback.<p>Tomorrow is Friday. Therefore weekly support and resistance are important. The most important price is last week’s high. If the bulls close above that high tomorrow, this week will be stronger buy signal bar on the weekly chart for next week.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-6-6"
    }
  ],
  "7": [
    {
      "data": [
        "<article class=\"post-90308 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini bulls have outside up buy signal on weekly chart\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini bulls have outside up buy signal on weekly chart</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-06-07T06:20:50-07:00\">June 7, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Friday June 7, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini has rallied for 4 days from just above the gap above the February 11 high. The bulls hope this is a resumption of the 2019 bull trend.<p>Today is Friday. This week traded below last week’s low and above last week’s high. This week is therefore an outside up candlestick on the weekly chart. Traders see it as a buy signal bar for next week.<p>But, there has been no pullback in the bear channel on the weekly chart in 5 weeks. Therefore, the odds are that the first reversal up will not get far. Consequently, the buy signal will probably only lead to another week or two of higher prices. There will then likely be a test back down and an attempt to close the February 11 gap.<p>The bears want a lower high and then a selloff that will close that gap. After a strong 4 day rally, the bears will probably need at least a micro double top. Traders assume that the Emini will not pull back for more than a day or two before beginning at least a small 2nd leg up.<p>Today is Friday so weekly support and resistance are important, especially in the final hour. The most important price is last week’s high. The bulls want the week to close above last week’s high as a sign of strength. That would increase the chance of higher prices next week. The bears always want the opposite. However, even if today sells off, the week will still be a big bull trend bar on the weekly chart.<h3>Overnight Emini Globex trading</h3><p>The Emini was up ahead of today’s unemployment report, but sold off on the report. Ten minutes later, it rallied to a new high, and then pulled back again. These abrupt reversals increase the chance of trading range trading today.<p>The bulls want the week to close on its high. Because the daily chart is overbought, there is therefore an increased chance of profit taking today. However, the momentum up has been strong. The bulls might be able to get another bull trend day.<p>Last week’s high is a magnet, especially in the final hour. If today sells off early and gets back there, it might then oscillate around it for the rest of the day.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-outside-up-buy-signal-on-weekly-chart.png\"><img src=\"2019-6-7.png\" alt=\"Emini outside up buy signal on weekly chart\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><img alt=\"\"></figure><p>The EURUSD daily Forex chart formed an outside up day yesterday. Wednesday was an outside down day. An outside up day after an outside down day is a buy signal bar. The bulls want today to go above yesterday’s high because that would trigger the buy signal.<p>There are two problems with the setup. First, yesterday had a big tail on top. It did not close above Wednesday high. That is a sign of tentative bulls and it reduces the chance of a big rally.<p>The second problem is more important. The daily chart has been in a bear channel for a year. During every strong rally and every strong selloff, I have said that trends resist change and reversals are more common than breakouts. Consequently, the odds are that this buy setup will only lead to another lower high and be followed by another new low in the channel.<p>But the channel has lasted an unusually long time. Traders therefore expect a breakout to come at any time.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart was in a 30 pip range overnight ahead of today’s unemployment report. It rallied on the report and broke above yesterday’s high. That triggered the buy signal on the daily chart. It therefore increases the chance of higher prices over the next week.<p>Failed breakouts are common when the daily chart is in a channel or trading range. Consequently, it is too early to know if today will remain a bull trend day. It could still reverse into a bear trend. Remember, the bears want the buy signal to fail.<p>However, at the moment, the odds favor higher prices over the next several days. Also, if the bulls keep the market above the 1.1268 start of this morning’s rally, the odds will favor higher prices today. Traders will therefore look to buy pullbacks. If today closes above yesterday’s high, the odds of higher prices next week go up.<p>There is always a bear case. At a minimum, they will sell rallies and try to get today to close below yesterday’s high. They would prefer today to close on its low. Day traders should wait to sell until after they see a strong reversal down or at least an hour of sideways trading. Without that, the odds favor sideways to up trading today and follow-through buying next week.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><img loading=\"lazy\" src=\"2019-6-7-1.png\" alt=\"Emini bull trend from the open and then buy climax\"></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>Today had an extremely strong, climactic rally on the open and the Emini then entered a trading range.<p>This week was an outside up bar on the weekly chart. It is therefore a buy signal bar for next week. However, its range is huge and therefore the stop for the bulls is far below. Many bulls will prefer to buy a pullback than above last week’s high.<p>The daily chart has been in a trading range for 5 months. Traders know that there is an increased chance that the bulls will be disappointed by a lack of follow-through buying next week. For example, next week might be an inside bar on the weekly chart.<p>At the moment, the rally is strong enough to test the all-time high. However, trading ranges resist breaking out. Consequently, there is a 50% chance that this rally will form a lower high and simply be another leg in the 5 month trading range.<p>Because last week’s buying was unusually strong, the bulls will probably begin to take profits early next week. That will result in a 1 – 2 day pullback. However, there will be other bulls looking to buy the 1st pullback. Consequently, the downside risk early next week is small.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-6-7"
    }
  ],
  "8": [
    {
      "data": [
        "<article class=\"post-90314 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini outside up bar and double bottom weekly buy signal\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini outside up bar and double bottom weekly buy signal</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-06-08T00:30:06-07:00\">June 8, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Market Overview: Weekend Market Update</h2><p>The<strong>Emini</strong>rallied strongly this week and formed an outside up bar on the weekly chart. This week is therefore a buy signal bar for next week.<p>The<strong>crude oil futures</strong>market tested the January 14 low and $50 this week. Because of the parabolic wedge sell climax, there will probably be at least a couple weeks of profit taking soon.<p>The<strong>EURUSD</strong>daily Forex chart had a consecutive outside bar buy signal this week. It will probably lead to a test of the March 20 high of 1.1448.<h2><strong>Crude oil Futures market:</strong><br>Parabolic wedge sell climax at $50 support</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Crude-oil-futures-double-bottom-at-50-big-round-number-1.png\"><img loading=\"lazy\" src=\"2019-6-8.png\" alt=\"Crude oil futures double bottom at 50 big round number\"></a></figure><p>The crude oil futures is in a sell climax at support. In mid-April, I said that the bull trend would soon reverse and test support below $58 and possibly all of the way down to the January 14 low. This week poked below that low and bounced a little.<p>I chose that low as a target because it was the 1st pullback in the strong reversal up from the extreme sell climax of late 2018. That initial rally was the spike in a Spike and Channel bull trend. The channel began with that low.<p>Since 75% of bull channels have bear breakouts, traders should consider every bull channel to be a bear flag. Once there is a breakout below the bull trend line, the selloff often tests down to where the channel began. That is why I kept mentioning the January 14 low.<h3>Bull channel typically evolves into a trading range</h3><p>Yes, this selloff has been strong. However, during the bull channel, I said that the channel would have a bear breakout and a deep reversal down. I said that the rally would end up as a bull leg in a trading range that could last a year.<p>Now I am saying the opposite. The selloff since April 23 is probably just a bear leg in the developing yearlong trading range. It is a 2nd Leg Bear Trap. The 1st leg was the 3 bar selloff from the April 23 high. The 2nd leg down probably ended this week. It is a bear trap because the bears expect it to lead to a bear trend. More likely it is either the end or near the end of the selling.<p>Trading ranges have legs up and down. This leg down will end soon and it might have ended this week.<p>There are a few reasons for this. First, I already mentioned that it tested the start of the bull channel, and that often leads to a trading range.<p>Next look at the price action in the selloff on the daily chart (not shown). There was a collapse on May 23 and then a 2nd 2 day sell climax on May 31. A strong breakout typically has at least a small 2nd leg down. The one day selloff on Wednesday might be the 2nd leg down from that May 31 selloff.<p>It is also the 3rd leg down in the 3 week strong bear breakout. Three legs down in a tight bear channel is a parabolic wedge sell climax. It usually attracts profit takers, especially when the selloff is also a test of major support.<h3>Profit-taking likely soon</h3><p>If a bear takes profits in a big bear trend, he will not look to sell again a bar or two later. That does not make sense. If that was his thought, he would simply hold short. Therefore, if Thursday was the start of profit-taking, the bulls who take profits will wait to sell again near resistance, like around the 20 day EMA.<p>A profit taking rally often continues up to the top of the most recent sell climax. That is the May 30 high, which is just below the $60 Big Round Number.<p>The bears also want to give the bulls a couple chances to reverse the bear trend before selling again. Therefore a profit-taking rally typically has at least 2 legs and lasts about 10 bars or more.<p>Since profit-taking is likely soon, the odds favor at least a couple weeks of sideways to up trading. Furthermore, the downside from here is probably small after consecutive sell climaxes down to support.<h2><strong>EURUSD weekly Forex chart:</strong><br>1st break above the 20 week EMA in 9 months</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/EURUSD-weekly-Forex-chart-breakout-above-bear-trend-line.png\"><img loading=\"lazy\" src=\"2019-6-8-1.png\" alt=\"EURUSD weekly Forex chart breakout above bear trend line\"></a></figure><p>The EURUSD weekly Forex chart rallied this week after a micro double bottom. However, the bulls need 2 closes above the 20 week EMA before traders will conclude that there is a reversal underway. There have been many reversal attempts over the past year and each of the failed. The yearlong bear channel soon saw a new low.<p>Look at what has happened at the 20 week EMA over the past year. Every break above the average failed. In fact, September 20 is the only close above the 20 week EMA in over a year. The following week was a bear outside down week that closed below the EMA and near its low. The bulls need a bull bar next week to change the pattern and make traders believe the bull breakout will succeed.<h3>Bear channel is a bull flag</h3><p>Every week I write that the weekly chart is in a bear channel. That will not last forever. Channels end in either of two ways. There is a 25% chance of a strong break below the bear channel, and then an even stronger bear trend.<p>But there is a 75% chance of a successful break above the channel. There is often a brief strong break below that reverses up before the bull breakout.<p>Once there is a bull breakout, the bulls will try to continue the rally up to where the bear channel began. That is the June 2018 high above 1.18. It took a year to get down to 1.11. Traders should expect any rally up to 1.18 to take many months and possibly a year.<p>There is now credible evidence that the channel is ending. However, the bulls need follow-through buying over the next few weeks. In particular, if they have a 2nd strong bull trend bar on the weekly chart next week, the odds will be that the bear trend has ended.<p>It is important to remember that there have been many bull breakouts over the past year. Read my post during any of the breakout attempts. You will see that during every strong bull or bear breakout, I wrote that a reversal was more likely than a successful breakout. However, if the bulls get 2 closes above the March 20 high, the odds will shift in favor of a successful bull breakout.<h3>Daily EURUSD Forex chart has consecutive outside bars</h3><p>Wednesday was an outside down bar on the daily chart. However, Thursday was an outside up bar. Consecutive outside bars where the 2nd bar is a bull bar is a reliable buy setup. Friday’s breakout above Thursday’s high will probably lead to a test of the March 20 major lower high. The bulls will be more inclined to buy pullbacks and breakouts over the next few days, expecting higher prices for another week or more.<h2><strong>Monthly S&amp;P500 Emini futures chart:</strong><br>Failed breakout below outside down bar</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-monthly-chart-has-pullback-from-test-of-September-all-time-high.png\"><img loading=\"lazy\" src=\"2019-6-8-2.png\" alt=\"Emini monthly chart has pullback from test of September all time high\"></a></figure><p>The monthly S&amp;P500 Emini futures chart has a big bull bar so far in June. I have been saying for the past month that the selloff would probably only last 2 – 3 months. Traders are debating whether it has ended.<p>May was an outside down bar and it formed a perfect double top with the September high. When June traded below the May low, it triggered the monthly sell signal. At the end of May, I said that there could be more buyers than sellers below the May low because the 4 month rally was so strong. So far, that has been the case.<h3>Strong bull candlestick now, but 3 weeks left in June</h3><p>It is early in the month and the month could look very different when it ends. If there is a selloff, June could be a bear trend bar at the end of the month. Alternatively, it could rally above the May high and be an outside up month. Since May was an outside down month, this would create consecutive outside months. Traders in July would see June as a buy signal bar.<p>These are the 2 extremes and therefore neither is likely at the moment. More likely, June will have a bull body, but not break above the May high. Even a small bull body would reduce the chance of a big selloff in July.<p>Throughout the 4 month rally, I said repeatedly that the bulls would buy the 1st pullback and that the rally would have at least a small 2nd leg sideways to up. That is still the case, even if the pullback lasts another month or two.<h2><strong>Weekly S&amp;P500 Emini futures chart:</strong><br>Emini outside up bar and double bottom weekly buy signal</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-weekly-chart-has-outside-up-bar-for-buy-signal-bar.png\"><img loading=\"lazy\" src=\"2019-6-8-3.png\" alt=\"Emini weekly chart has outside up bar for buy signal bar\"></a></figure><p>The weekly S&amp;P500 Emini futures chart traded below last week’s low and then above its high. This week is therefore an outside up bar. It is also a double bottom with the March 8 low. This week is therefore a buy signal bar for next week.<p>It is important to pay attention to the context. The context is the appearance of the bars to the left. The 1st 4 bars down from the high had prominent tails. I wrote every week that a selloff that looks like that is usually going to be a bull flag or a bear leg in a trading range and not a bear trend. Those tails represent reversals. The selloff lacked sustained selling.<h3>Has the trading range price action ended?</h3><p>This past week reversed the week before. The prior 4 weeks all had reversals that lasted one week. This reversal up is now a 2 week reversal. It is therefore similar to the 4 week selloff except that the reversal was spread of 2 weeks.<p>Traders have to consider the possibility that these 2 weeks might be just a continuation of the price action of the 4 prior weeks. They will find out over the coming week. If next week is a big bull trend bar closing on its high, the Emini would have broken the pattern of quick reversals. That would increase the odds of the rally continuing up to the all-time high.<p>If it is anything less, traders will wonder if the correction will continue for several more weeks. If so, the Emini could be sideways to down before the bulls again try to test the all-time high.<h2><strong>Daily S&amp;P500 Emini futures chart:</strong><br>Strong reversal up from test of February 14 gap</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-daily-chart-double-bottom-bull-flag-1.png\"><img loading=\"lazy\" src=\"2019-6-8-4.png\" alt=\"Emini daily chart double bottom bull flag\"></a></figure><p>The daily S&amp;P500 Emini futures chart reversed up strongly this week from a test of the March 8 low and the February 14 gap. The bulls hope that this double bottom will lead to a resumption of the 2019 bull trend.<p>That gap was an important magnet below. The selloff not only did not close the gap, it reversed up extremely strongly from just above the gap. That reduces the chance of the gap getting filled within the next several weeks.<p>Traders see this strong reversal as similar to the one that began on December 26. It certainly is strong enough to have at least a small 2nd leg up. Consequently, the bulls will be eager to buy the 1st 1 – 3 day reversal down.<h3>5 month trading range within 18 month trading range</h3><p>It is important to realize that the Emini has been in a big trading range for 18 months and a smaller one since early February. Traders do not yet know if this reversal up is just a bull leg in the smaller trading range or a resumption of the early 2019 bull trend.<p>If the bull trend is resuming, the rally will have to close above the May 16 major lower high of 2894. Next, the bulls will want 2 closes above the September/May double top. Without this, traders have to assume that the 5 month trading range is intact.<p>In a trading range, traders buy low, sell high, and take quick profits. They expect reversals. Trading ranges resist breaking out. Most breakout attempts fail. For example, the break below the May 13 low failed, just as the attempt to break above the September high failed. Therefore, at the moment, there is still a 50% chance that this strong rally is simply a strong bull leg in the 5 month trading range.<h3>The bears want a bigger head and shoulders top</h3><p>The bears had a head and shoulders top with the March 21, May 1, and May 16 highs. I said that there was only a 40% chance of a strong selloff to around a measured move down. The selloff ended after only 3 days below the May 13 neck line.<p>If this rally turns down from below the May high, the bears will see the rally as a new right shoulder in a bigger head and shoulders top. The left shoulder would be the March 4 high. The lower high would also be a lower high major trend reversal.<p>Even if the bears get a good sell signal bar on a reversal down, there still will only be a 40% chance of a bear trend. This is true of all trend reversal patterns. Most do not lead to trend reversals. Instead, they usually lead to more sideways trading or a resumption of the bull trend.<h3>Test of the May 16 lower high</h3><p>When a rally is strong like this, it typically is racing up to test important resistance. The obvious target is the May 16 high of 2894.00 and the 2900 Big Round Number slightly above.<p>If the Emini reverses down, there would be a double top bear flag. It is important to note that the 2nd leg up in a double top is often very strong. Consequently, this week’s strong rally still could simply be the 2nd leg up in a double top. If the bears get a strong sell signal bar next week, they will have a 40% chance of a swing down below this week’s low.<p>But, because of the 5 month trading range, the rally will probably stall before breaking above the resistance. Consequently, traders should expect a 1 – 2 day pullback sometime next week. Furthermore, the Emini might begin to go sideways into the June 19 FOMC announcement.<p>The bulls want the rally to go continue above the May 16 high without a pullback. If the rally is actually a resumption of the early 2019 bull trend, it might.<h3>Possible bigger 2nd leg down from a lower high</h3><p>The Emini has already had 2 legs down from the high. However, the selloff was in a tight bear channel. When that is the case, the two legs are often just a subdivision of a larger 1st leg down.<p>This is what traders will find out over the next 2 weeks. If this rally turns down from a lower high, the new selloff might be the 2nd leg down from the May high.<p>One reasonable target would be a Leg 1 = Leg 2 measured move. We don’t know where the top of the lower high would be. However, the 2nd leg down would be below this week’s low. It would close the gap above the February high, and probably fall to around 2650. If so, the odds still would favor a rally to a new all-time high from there.<hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-6-8"
    }
  ],
  "10": [
    {
      "data": [
        "<article class=\"post-90310 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini weekly outside up buy signal at 2900 resistance\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weekly outside up buy signal at 2900 resistance</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-06-10T06:20:18-07:00\">June 10, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Monday June 10, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Last week formed an exceptionally big outside up bar on the weekly chart. It is a buy signal bar for this week. Because it is a big bar, the stop for the bulls is far below. Many bulls want smaller risk and will wait to buy a pullback.<p>Also, the daily chart has been in a trading range for 5 months. The Emini is now back to the middle of the range. In a trading range, traders prefer to buy low. Consequently, there might be a lack of buyers around last week’s high.<p>The bears want a double top with the May 16 high. But the 5 day rally is so strong that the bears will need at least a micro double top. The bulls will buy the 1st pullback. This means that there will probably be buyers below Friday’s low.<p>Can today be another big bull trend day? The rally is more likely to stall around the May 16 high and the 2900 Big Round Number. Also, Thursday’s and Friday’s buying was extreme. As a result, there will probably be some profit taking today or within the next few days. That increases the chance of trading range price action today and tomorrow.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 14 points in the Globex session. It might therefore gap up on the daily and weekly charts today. However, a small gap typically closes in the 1st hour.<p>This strong rally is testing the May 16 major lower high. The Emini should reach that target and the 2900 Big Round Number early this week.<p>However, if a strong rally tests a prior high, it can still lead to a deep pullback or a reversal. Just look at the week chart for an example. The 2019 rally was extremely strong, yet reversed down from a perfect double top with the September high.<p>As strong as last week’s rally was, it is still a test of resistance. Consequently, some hesitation is likely for a few day. It could last up to next week’s FOMC announcement. As a result, there is an increased chance of a trading range over the next week.<p>That increases the probability of intraday trading range price action. Therefore, day traders will look for 2 – 3 hour trends to reverse and lead to 2 – 3 hour opposite swings. This is true even if a trend is strong.<p>Can today be a strong bull or bear trend day? Yes, but the odds of trading range price action this week are higher.<h2>Friday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-bull-trend-from-the-open-and-then-buy-climax.png\"><img src=\"2019-6-10.png\" alt=\"Emini bull trend from the open and then buy climax\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/EURUSD-Forex-double-top-and-pullback-from-consecutive-outside-bar-buy-signal.png\"><img loading=\"lazy\" src=\"2019-6-10-1.png\" alt=\"EURUSD Forex double top and pullback from consecutive outside bar buy signal\"></a></figure><p>The EURUSD daily Forex chart triggered a buy signal on Friday by going above Thursday’s high. Thursday was the 2nd consecutive outside bar and therefore an oo (outside-outside) buy setup.<p>This is a high probability pattern and traders should expect a test of the March 20 high over the next 2 weeks. But the tails on Thursday’s and Friday’s high indicate hesitation. Therefore, a 1 – 5 day pullback is likely this week.<p>The bears want the buy setup and breakout above the April 12 high to fail. They see the 3 week rally as a wedge buy climax and the 2nd leg up in a double top with the April 12 high. They therefore want a reversal down and a new low, not just a pullback from a rally. The bears know that every breakout over the past year has failed. Each led to a new low within 2 – 3 weeks in the yearlong bear channel.<p>However, because of the oo buy signal, the bears will probably need at least a small double top if they are to succeed. At the moment, a 1 – 5 day pullback is more likely than a trend reversal back down.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart so far has failed to break above Friday’s high. The bulls want immediate follow-through buying. That would increase the chance of a test of the March 20 and January 10 highs.<p>However, traders know that every 2 – 3 week rally over the past year failed. This will make some bulls take profits and bears sell this rally. Therefore, there is an increased chance that today will be a bear day on the daily chart.<p>The 5 minute chart has sold off 35 pips from the overnight high. But the bars have been small and have prominent tails. Also, there are no consecutive big bear bars closing on their lows. Traders therefore see the selloff as weak. A weak selloff or rally is usually part of a trading range. Consequently, day traders will look to buy reversals up, sell rallies, and take quick profits.<p>The bears will try to get today to close on its low. It would therefore be a stronger sell signal bar on the daily chart.<p>If the bulls can get today to close near its high, it will be a High 1 buy signal bar for tomorrow. Since higher prices over the next 2 weeks are probable, there is a slightly higher chance of today closing near its high. But the lack of energy so far today make a trading range likely.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Bear-trend-reversal-day-at-2900.png\"><img loading=\"lazy\" src=\"2019-6-10-2.png\" alt=\"Bear trend reversal day at 2900\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini rallied on the open but reversed down from above the May 16 high and the 2900 Big Round Number. Today is a sell signal bar on the daily chart for a double top with that high. Traders expect a pullback and then a trading range ahead of next week’s FOMC announcement.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-6-10"
    }
  ],
  "11": [
    {
      "data": [
        "<article class=\"post-90312 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini double top with May 16 high ahead of FOMC\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini double top with May 16 high ahead of FOMC</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-06-11T06:20:59-07:00\">June 11, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Tuesday June 11, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini reversed down yesterday from above the May 16 high and 2900. There is now a double top bear flag on the daily chart. Yesterday is the sell signal bar for today.<p>But after a 6 day rally, most bears will want a micro double top before selling. Furthermore, yesterday was a doji bar on the daily chart and therefore a weak sell signal bar. Consequently, if today is the start of a pullback, the selloff will probably just last a few days. A trading range is more likely than a bear trend.<p>When a market races up to resistance and then stops, it usually enters a tight trading range. It needs time to decide if it will break out or reverse. That is what is happening on the daily chart. The Emini will probably begin to pull back this week. It will likely be sideways into next week’s FOMC announcement.<p>Yesterday sold off in a bear channel on the 5 minute chart. Since 75% of bear channels have bull breakouts, yesterday is a bull flag. Today will probably break above the bear channel.<p>The bears will try to create a double top with yesterday’s high. That would create a micro double top on the daily chart. This is especially important since the daily chart is testing important resistance at the May 16 high.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 17 points in the Globex session. It will therefore open far above the bear trend line on the 5 minute chart. In addition, it might gap up above yesterday’s high, like each of the past 4 days.<p>However, the daily chart is at resistance and it is overbought. In addition, there is a parabolic wedge bull channel on the 60 minute chart. There is therefore an increased chance of a reversal down today from around yesterday’s high. That would create a double top on the 5 minute chart, which would be a micro double top on the daily chart.<p>Can today rally far above the May 16 high today? Yes, but that is less likely than either a mostly sideways day or at least a small reversal down. But if there are several consecutive big bull trend bars, traders will conclude that today could be a strong bull trend day. They would then expect a test of the all-time high ahead of next week’s FOMC meeting.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Bear-trend-reversal-day-at-2900.png\"><img src=\"2019-6-11.png\" alt=\"Bear trend reversal day at 2900\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/EURUSD-Forex-wedge-rally-and-double-top-after-breakout.png\"><img loading=\"lazy\" src=\"2019-6-11-1.png\" alt=\"EURUSD Forex wedge rally and double top after breakout\"></a></figure><p>The EURUSD daily Forex chart formed an inside day yesterday. It is therefore a buy signal bar for today. Because it had a bear body, it is a weak buy setup. There might be more sellers than buyers above its high.<p>Furthermore, the 3 week rally is a wedge bull channel. That is a buy climax pattern. In addition, it might be forming a double top with the April 12 high.<p>Traders can see that Thursday’s consecutive outside bar had a big tail on top. That increases the chance of a pullback before rallying further. The low the outside bar is a higher low and therefore a magnet below. Also, a test of that low would be around a 50% pullback and a test of the 20 day EMA.<p>Most importantly, the chart has been in a bear channel for a year. Every rally and selloff reversed after a few weeks. There are probably enough traders expecting a continuation of this tendency to lead to a pullback over the next week.<p>This is especially true since all financial markets will be prone to getting neutral ahead of next week’s FOMC announcement.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute chart has been in a 30 pip range overnight. Since yesterday is a weak buy signal bar on the daily chart, there will probably be more sellers than buyers above yesterday’s high.<p>This is especially true in light of all of the issues that I mentioned above. Consequently, day traders will look to sell rallies to around yesterday’s high.<p>Where will they buy? Many will buy around yesterday’s low, but Friday’s higher low on the 240 minute chart is more important support at around 1.1250.<p>So far, traders have been looking for scalps on reversals near the top and bottom of the overnight range. However, the rally on the 240 minute chart over the past 3 days has had 3 legs up. It is therefore a wedge and it is nested within a bigger wedge on the daily chart. Since a wedge is a buy climax, traders expect at least a couple legs down over the next few days. Day traders will be more willing to sell than buy today, unless the bulls get a surprising big bull breakout. But that is unlikely.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-outside-down-day.png\"><img loading=\"lazy\" src=\"2019-6-11-2.png\" alt=\"Emini outside down day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>Today reversed down from above yesterday’s high and then broke below its low. Today is now a sell signal bar for a double top with the May 16 high. But after a 6 day rally, this is a minor sell signal. The bulls will buy the 1st 1 – 3 day selloff.<p>By trading back below Friday’s high, the Emini closed the gap up on the weekly and daily charts. While not particularly bearish, this erases a sign of a strong rally.<p>I have been writing for several days that the Emini would stall around the May 16 high and probably pull back for 1 – 3 days. Nothing has changed. Most financial markets might become quiet ahead of next week’s FOMC announcement.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-6-11"
    }
  ],
  "12": [
    {
      "data": [
        "<article class=\"post-90484 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini outside down sell signal bar for double top with May 16 high\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini outside down sell signal bar for double top with May 16 high</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-06-12T06:20:00-07:00\">June 12, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Wednesday June 12, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>I have been saying since the weekend that there would be a pullback this week. This is because the Emini was testing the major May 16 lower high. Furthermore, there was a parabolic wedge buy climax on the 60 minute chart. Finally, all financial markets will probably pause ahead of next week’s FOMC announcement.<p>Yesterday was an outside down day. Since there is now a double top with the May 16 high, yesterday is a sell signal bar for today. But after a 6 day rally, the odds are that there will be buyers not far below yesterday’s low. If today triggers the sell signal, the selloff will probably last only 1 – 3 days before the bulls buy again.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 5 points in the Globex session. Today therefore might gap below yesterday’s low and the 60 minute EMA.<p>By trading below yesterday’s low, the Emini would trigger a minor sell signal on the daily chart. Yes, there is a double top with the May 16 high. But the 6 days without a pullback make the 1st reversal down likely to be brief. The bulls will probably buy a 1 – 3 day pullback and try again to work to above the all-time high.<p>While yesterday was an outside down day, the final 4 hours were in a trading range. In addition, the 60 minute chart has been above its 20 bar moving average for far more than 20 bars. The bulls have been willing to buy far above the average price. There will be many bulls happy to finally get to buy around the average price. This 20 Gap Bar buy signal reduces the chance of a strong reversal down over the next few days.<p>Since there is a sell signal on the daily chart and a buy signal on the 60 minute chart, the Emini will probably be mostly sideways for a few days. That increases the chance of trading range price action on the daily chart. Traders will therefore look to buy for reversals up after 2 – 3 hour selloffs and sell reversals down from 2 – 3 hour rallies.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-outside-down-day.png\"><img src=\"2019-6-12.png\" alt=\"Emini outside down day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/EURUSD-Forex-micro-double-top-and-wedge-top-after-outside-up-bar.png\"><img loading=\"lazy\" src=\"2019-6-12-1.png\" alt=\"EURUSD Forex micro double top and wedge top after outside up bar\"></a></figure><p>The EURUSD daily Forex chart is still on Friday’s consecutive outside bar buy signal. The odds favor at least a small 2nd leg sideways to up after a pullback.<p>But, there is now a micro double top with Monday’s high, a double top with the April 12 high, and a wedge bull channel. The odds favor a 3 – 5 day pullback. This is especially true ahead of next Wednesday’s unusually important FOMC announcement.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart tested Monday’s high and reversed down from a perfect double top. This is a micro double top on the daily chart. While the reversal down has only been about 40 pips, it is enough to increase the odds of lower prices over the next few days.<p>The bears want today to close below the open. Today would then be a stronger sell signal bar on the daily chart. It would increase the chance of a test down to the June 6 low. That is the bottom of the consecutive outside up bars. They will therefore sell 20 – 30 pip rallies today, especially when the rallies are above the 1.1326 open of the day. Furthermore, they would like the day to close on the low. Today would then be a stronger sell signal bar.<p>Because the bulls have been unable to break strongly above the April 12 high, they know a pullback is likely. They want to minimize the size of the pullback. They especially do not want traders to see the pullback as a resumption of the bear trend on the weekly chart. Consequently, they will buy selloffs and try to prevent today from closing near its low.<h3>Importance of Friday’s close</h3><p>The bulls want this week to close above the 1.1322 open of the week. This week would then have a bull body on the weekly chart. That would confirm last week’s bull breakout and increase the chance of higher prices over the next few weeks. Consequently, they will buy dips below 1.1322 all week.<p>The bears always want the opposite. They therefore want this week’s candlestick to have a bear body. That would increase the chance that last week’s bull breakout will fail. There have been no consecutive closes above the 20 week EMA in over a year. Each test above the average has failed. The bears want their bear channel to continue.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-trading-range-day.png\"><img loading=\"lazy\" src=\"2019-6-12-2.png\" alt=\"Emini trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>By breaking below yesterday’s low, the Emini today triggered a sell signal on the daily chart. But that chart has a 6 bar bull micro channel. The sell signal is therefore minor. Traders expect it to last 1 – 3 days.<p>Today sold off for the 1st half of the day. It then reversed up from a wedge bottom at the 60 minute EMA. The rally was weak and the day remained a trading range day.<p>It is a pullback in a bull trend. Today therefore is a High 1 buy signal bar for tomorrow.<p>However, it was a bear bar. In addition, yesterday’s outside down bar will probably get more of a pullback. Finally, the parabolic wedge buy climax on the 60 minute chart will probably get more of a 2nd leg down. Consequently, there will probably be more sellers than buyers tomorrow above today’s high.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-6-12"
    }
  ],
  "13": [
    {
      "data": [
        "<article class=\"post-90488 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini weak entry bar after weekly outside up buy signal\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weak entry bar after weekly outside up buy signal</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-06-13T06:20:55-07:00\">June 13, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Thursday June 13, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Tuesday was an outside down bar on the daily chart. It is a sell signal bar for a double top with the May 16 high. Yesterday triggered the sell signal by trading below Tuesday’s low. But after a 6 bar bull micro channel, the reversal down will probably be minor. That means that the pullback will likely last only 1 – 3 days.<p>Because yesterday was a pullback in a bull trend, it is a High 1 buy signal bar for today. But it had a bear body and it followed a big outside down bar. This is a weak buy setup so there may be more sellers than buyers above its high.<p>This week triggered a buy signal on the weekly chart. But I said over the weekend that there might be a shortage of buyers above last week’s high. Last week was an exceptionally big bar on the weekly chart. The bulls who buy above its high would put a stop below its low. That is too much risk for many traders, especially at the top of an 18 month trading range. Many traders are hoping for a pullback so that they can buy and have a tighter stop.<p>With next Wednesday’s FOMC announcement being more important than usual, the Emini might simply go sideways until then. The past 3 days had a lot of trading range price action. That makes trading range price action likely again today.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 7 points in the Globex session. However, the past 3 days had a lot of trading range price action. Also, yesterday is a weak buy setup for today. As a result, there might be more sellers than buyers above yesterday’s high. This reduces the chance of a big bull trend day today.<p>Yesterday ended with a double bottom higher low major trend reversal setup on the 5 minute chart. A gap above yesterday’s trading range today would be a continuation of the reversal up. Also, today will probably open near yesterday’s high. These factors reduce the chance of a big trend day today.<p>Next Wednesday’s FOMC meeting is more important than usual. This increases the chance that the 3 days of trading range price action will continue today.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-trading-range-day.png\"><img src=\"2019-6-13.png\" alt=\"Emini trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/EURUSD-Forex-outside-down-bar-sell-signal-for-minor-trend-reversal-down.png\"><img loading=\"lazy\" src=\"2019-6-13-1.png\" alt=\"EURUSD Forex outside down bar sell signal for minor trend reversal down\"></a></figure><p>The EURUSD daily Forex chart formed an outside down bar yesterday. There is now a double top, a 4 day micro double top, and a wedge rally in a yearlong bear channel. Yesterday is therefore a sell signal bar for today.<p>But last week’s consecutive outside bar buy signal is more important. Consequently, the selloff over the next few days will probably be minor. This means that a bull flag is more likely than a breakout to a new low in the bear channel.<p>The pullback could last a week or more and test the June 6 outside bar low. However, at the moment, the odds still favor at least one more leg up to above yesterday’s high within a couple weeks.<h3>The importance of 1.1322</h3><p>The most important price through tomorrow is the 1.1322 open of the week. If the bulls get the week to close above it, this week will have a bull body on the weekly chart. It would therefore confirm last week’s bull breakout on the weekly chart. That would increase the chance of higher prices over the next couple weeks.<p>Because it is so important, the bears will keep selling every time there is a rally above it. They want a bear body on the weekly chart. Traders would then suspect that last week’s bull breakout above the 20 week EMA and bear channel will fail.<p>The bulls will keep buying below, trying to stay near this week’s open. Then, tomorrow, they will try hard to get the week to close at or above this week’s open.<h3>Overnight EURUSD Forex trading</h3><p>Even though yesterday is a sell signal bar on the daily chart, today so far has not traded below its low. Therefore the bears have been unable to trigger the sell signal.<p>Even if they succeed during the US session today, the small overnight range represents a lack of enthusiasm. It reduces the chance of a big bear trend today. Day traders have been scalping for 10 pips.<p>If today’s low remains above yesterday’s low, today will be an inside day on the daily chart. Since yesterday was an outside day, today would be a buy signal bar for an ioi (inside-outside-inside) buy setup.<p>But after 5 sideways days, there is now a tight trading range. That resists breaking out. The chart might therefore stay sideways into Wednesday’s FOMC meeting.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-wedge-bottoms-and-tops.png\"><img loading=\"lazy\" src=\"2019-6-13-2.png\" alt=\"Emini wedge bottoms and tops\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini triggered a buy signal today by going above yesterday’s high. However, yesterday was a bear day and it followed a big outside down day on Tuesday. This is a weak buy setup. The result was a trading range day.<p>Tomorrow is Friday and therefore weekly support and resistance are important. The most important price is the 2894.75 open of the week. This is because this week is the entry bar for a weekly buy signal. The bulls want a bull body this week. However, the bears always want the opposite. If the Emini is within about 5 points of the open in the final hour tomorrow, it will probably test it.<p>Unless tomorrow is a big trend day up or down, it does not matter much if the weekly candlestick has a small bull or bear body. This is especially true when next Wednesday has an unusually important FOMC meeting. That will override anything that takes place between now and then.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-6-13"
    }
  ],
  "14": [
    {
      "data": [
        "<article class=\"post-90492 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini weak buy setup ahead of June FOMC\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weak buy setup ahead of June FOMC</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-06-14T06:20:48-07:00\">June 14, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Friday June 14, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday traded above Wednesday’s high and triggered a buy signal. However, Wednesday had a bear body and Tuesday was a big outside down day. This is a weak buy setup.<p>Furthermore, the 6 day rally was a parabolic wedge buy climax on the 60 minute chart. The odds therefore favor at least a small 2nd leg down.<p>Finally, next Wednesday’s FOMC meeting is unusually important. It will override everything that happens between now and then. Consequently, the Emini might be waiting until then before resuming up or reversing down.<p>After 4 mostly sideways days, the odds favor more trading range price action again today.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 7 points in the Globex session. It has been sideways for 4 days with lots of trading range price action. Consequently, day traders will expect at least one swing up and one swing down again today.<p>Unless the Emini breaks above Tuesday’s sell signal bar high, the odds slightly favor at least a small 2nd leg down over the next few days. This is because there is a parabolic wedge buy climax on the 60 minute chart, and that usually leads to at least a couple legs sideways to down.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-wedge-bottoms-and-tops.png\"><img src=\"2019-6-14.png\" alt=\"Emini wedge bottoms and tops\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/EURUSD-Forex-pullback-to-higher-low-major-trend-reversal.jpg\"><img loading=\"lazy\" src=\"2019-6-14-1.jpg\" alt=\"EURUSD Forex pullback to higher low major trend reversal\"></a></figure><p>The EURUSD daily Forex chart has sold off for 3 days from a double top with the March 20 high. It has been in a bear channel for a year. Every reversal down led to a new low within a few weeks.<p>What is different this time is that an oo (consecutive outside bars) buy signal triggered last week. That typically has 2 legs up. Consequently, this pullback will probably form a higher low.<p>If it does, traders will wonder if a head and shoulders bottom will trigger. A higher low around the April 2 low and the May 27 high will have a 40% chance of a swing up if the bulls get a good buy signal bar. Furthermore, it would probably convert the yearlong bear channel into either a trading range or a bull trend.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been stair-stepping down in a bear channel for 3 days. It weakly breaks to the down side for a few hours and then enters a trading range for many hours.<p>On the 60 minute chart, there is now a wedge bear channel. That typically evolves into a trading range. Traders should therefore expect small legs up and down today.<p>Since all financial markets will probably not have big moves until after Wednesday’s FOMC report, day traders will look to scalp 10 – 20 pips up and down today.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-doji-bar-on-weekly-chart.jpg\"><img loading=\"lazy\" src=\"2019-6-14-2.jpg\" alt=\"Emini doji bar on weekly chart\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini formed a triangle for 5 hours and then rallied to a new high. It reversed down from just above yesterday’s high and closed exactly at the open of the week. This week’s candlestick is a perfect doji bar on the weekly chart, which is neutral.<p>This is the 5th consecutive day in a tight range. Many traders are waiting for Wednesday’s FOMC announcement. That will probably lead to either a reversal down or a move up to a new all-time high.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-6-14"
    }
  ],
  "15": [
    {
      "data": [
        "<article class=\"post-90498 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini testing all time high ahead of June FOMC meeting\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini testing all time high ahead of June FOMC meeting</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-06-15T00:30:39-07:00\">June 15, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Market Overview: Weekend Market Update</h2><p>The<strong>Emini</strong>, like all financial markets, is waiting for Wednesday’s FOMC announcement. While the June rally has been strong, it still has not yet broken above the May all-time high. Wednesday’s report could lead to a breakout or a reversal down.<p>The<strong>crude oil</strong>futures market sold off strongly for 2 months. However, that selloff is probably only a bear leg in developing trading range between $50 and $60. It should begin a rally up to 60 within the next 2 weeks.<p>The<strong>EURUSD</strong>daily Forex chart is still on a consecutive outside bar buy signal. Even though it sold off this week, traders should expect at least a small 2nd leg up beginning within 2 weeks.<h2><strong>Crude oil Futures market:</strong><br>Sell climax should reverse up soon from around $50</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Crude-oil-double-bottom-at-50-.png\"><img loading=\"lazy\" src=\"2019-6-15.png\" alt=\"Crude oil double bottom at $50 \"></a></figure><p>The crude oil futures market triggered a minor buy signal on the weekly this week by going above last week’s high. Last week was a bull doji reversal bar after a 2 week sell climax. The selloff was in a 3 year trading range and it tested the support of the January low.<p>In addition, it was the 2nd leg down from the April high. A strong 2nd leg down in a trading range is often a 2nd Leg Bear Trap. It can be simply a sell vacuum test of support that reverses back up.<p>If so, it traps bears into a bad short. They are assuming that the selloff is a breakout and will have at least one more leg down. But under the current circumstances, a 2nd Leg Bear Trap is more likely.<p>There might be a 2 – 3 week new low to below $50, but the odds favor a rally back up to the top of the most recent sell climax over the next 1 – 2 months. That is the May 30 high just below $60.<p>I have been saying since October that the huge selloff might test the June 2017 low, but then lead to a trading range that could last a year. That is still what is most likely.<p>Traders are now deciding if this past week will form a micro double bottom with the prior week and then rally to $60. The other option is another week or two of selling and then begin a month-long rally to around $60. Less likely is a continued selloff back to the December low of 43.59<h2><strong>EURUSD weekly Forex chart:</strong><br>Possible failed oo buy signal on daily chart</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/EURUSD-Forex-failed-breakout-above-bear-trend-line.png\"><img loading=\"lazy\" src=\"2019-6-15-1.png\" alt=\"EURUSD Forex failed breakout above bear trend line\"></a></figure><p>The weekly chart has been in a tight bear channel for a year. Every move up and down reversed within a few weeks. However, two weeks ago was the 1st time since September that the bulls got a close above the 20 week EMA. They also got a close above the bear trend line. But traders want to see consecutive closes above resistance before they believe a breakout will succeed.<p>The bulls were disappointed by the the strong reversal down this week. They wanted a 2nd big bull trend bar closing on its high. The probability now favors a failed breakout and a test of the May low.<p>The bulls, however, still have hope. Wednesday’s FOMC report has the potential to create big moves in all financial markets. If the bulls are lucky, they will get a surprisingly big rally after Wednesday’s report. Sometimes follow-through buying after a breakout comes a week or two later. They are hoping that will be the case this time.<h3>Weak sell signal on the weekly chart</h3><p>Since this week was a bear bar closing near its low, it is a sell signal bar for next week. The bears see the 3 week rally as just another bear rally in the yearlong bear channel. This past week’s bear body represents a failed breakout and the start of a reversal back down to below the May low.<p>The bears need a strong entry bar this coming week. If instead this coming week reverses back up, then the probability will again shift in favor of a successful breakout above the bear channel.<h3>Daily chart pulling back from oo buy signal</h3><p>The EURUSD daily Forex chart formed a consecutive outside bar buy signal (oo buy signal) 2 weeks ago. I have been saying for the past week that there might be a test back down to the June 6 low. That is about a 50% pullback and a test of the April 2 higher low as well.<p>Friday’s selloff could be that test. However, after 3 bear days, the bulls need to stop the selling. They then need a reversal back up from a higher low. If they get their reversal up within the next 2 weeks, there will be a head and shoulders bottom on the daily chart. The left shoulder is the April 2 higher low and the head is the April 26/May 23 double bottom.<p>The bears are hoping that the 3 day selloff is a resumption of the yearlong bear trend. However, they need a close below the May low. Without that, the bulls will buy and try to create a higher low major trend reversal up (here, also a head and shoulders bottom).<p>Traders expect all financial markets to be in limbo ahead of next Wednesday’s FOMC announcement. The uncertainty is greater than usual, which increases the chance of a big move up or down after the report.<h2><strong>Monthly S&amp;P500 Emini futures chart:</strong><br>Strong reversal up from below May’s outside down bar</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-monthly-candlestick-chart-in-pullback-from-test-of-all-time-high.png\"><img loading=\"lazy\" src=\"2019-6-15-2.png\" alt=\"Emini monthly candlestick chart in pullback from test of all time high\"></a></figure><p>The monthly S&amp;P500 Emini futures chart&nbsp;had an outside down bar in May. There is also a double top with the May and September highs. Therefore May was a sell signal bar. When June traded below the May low, it triggered the monthly sell signal. However, the Emini immediately reversed up strongly.<p>June so far is a big bull trend bar and it has reversed much of the May selloff. If June breaks above the May high, it will be a 2nd consecutive outside bar. When an outside up bar follows an outside down bar, it is a reliable buy signal bar for the next month.<p>There is plenty of time remaining in June to accomplish this. Next Wednesday’s FOMC announcement is especially important because there is more uncertainty than usual about what the Fed will do. This means the report is a potential catalyst for a surprisingly big move up or down.<p>For example, a strong rally could break above the May high. That would create consecutive outside bars and make a new all-time high likely within a month.<p>Alternatively, the report could lead to a reversal back down to below the May low. If so, the Emini will probably be sideways to down for another month or two.<h2><strong>Weekly S&amp;P500 Emini futures chart:</strong><br>Perfect doji is weak follow-through after big outside up bar</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-weekly-candlestick-chart-perfect-doji-candlestick-pattern.png\"><img loading=\"lazy\" src=\"2019-6-15-3.png\" alt=\"Emini weekly candlestick chart perfect doji candlestick pattern\"></a></figure><p>The weekly S&amp;P500 Emini futures chart had a big outside up bar 2 weeks ago. While that is a buy signal bar in a bull trend, I wrote last week that there were problems with the setup. When a buy signal bar is especially big, the stop is far below. That increased risk makes many bulls wait for a pullback to buy.<p>Furthermore, the top of the bar is just below the resistance of the September/May double top. That reduces the probability of a big move up.<p>This increased risk and reduced probability reduced the number of bulls willing to buy above the high of the buy signal bar. The result was that this week was small and it closed exactly at the open. Last week was a perfect doji candlestick pattern, which is neutral. Traders see it as a weak entry bar. Consequently, it increases the chance that the buy signal will fail and the Emini will trade back down.<p>This week closed at its open in the middle of the week’s range. Traders do not see it as a compelling sell signal bar for next week. There will probably be buyers than sellers below its low. Any reversal down will probably only be a 1 – 2 week pullback rather than than a trend reversal.<h3>Technical factors usually are more important to traders</h3><p>Fundamentals control what a market will do over the next many months. But technical factors are usually more important than the fundamentals for traders, who look for short-term moves.<p>This upcoming week is different. Because of the high degree of uncertainty about next Wednesday’s FOMC meeting, there is a greater potential for a surprisingly big move up or down. It could briefly overwhelm the technical considerations.<p>Technical traders will evaluate the price action after the report to formulate opinions about what will follow. The choices are a new all-time high, a reversal down, or sideways trading for at least a couple weeks.<p>Sideways is always more likely, especially since the Emini has been in a trading range for 18 months. However, there is an increased potential of a big move up or down.<h2><strong>Daily S&amp;P500 Emini futures chart:</strong><br>Strong rally again testing all-time high ahead of FOMC</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-daily-candlestick-chart-in-tight-trading-range-ahead-of-FOMC.png\"><img loading=\"lazy\" src=\"2019-6-15-4.png\" alt=\"Emini daily candlestick chart in tight trading range ahead of FOMC\"></a></figure><p>The daily S&amp;P500 Emini futures chart traded sideways in a tight range this week. While it broke above the May 16 major lower high, it stalled. The bears formed a micro double top this week in addition to a potential double top with that May high. They hope for a reversal down below the June 3 neckline and then a 150+ point measured move down. However, they need a strong sell signal bar or a strong reversal down before traders will conclude that the June rally is failing.<p>The bulls had an exceptionally strong rally in early June. They hope that the momentum is enough for the rally to continue up to a new all-time high.<h3>Wednesday’s FOMC announcement is a potentially strong catalyst</h3><p>Trades believe that Wednesday’s FOMC announcement is exceptionally important. Many institutions will place big bets after the report. It is impossible to know in advance if more dollars will buy or sell the news.<p>Because the Emini is again testing its all-time high, there is an increased chance that Wednesday’s move could be the start of a trend up or down that could last several weeks.<p>It is important to know that in a Breakout Mode situation, the initial breakout has a 50% chance of reversing. In addition, there is often no breakout and the market simply continues sideways.<p>Traders should be open to anything following the report. However, if a clear breakout begins, traders should look to enter in the direction of the breakout.<hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-6-15"
    }
  ],
  "17": [
    {
      "data": [
        "<article class=\"post-90495 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini tight trading range ahead of June FOMC meeting\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini tight trading range ahead of June FOMC meeting</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-06-17T06:20:13-07:00\">June 17, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Monday June 17, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini has been sideways in a tight trading range. Last week’s candlestick pattern was a perfect doji bar on the weekly chart. That is neutral. Traders are waiting for Wednesday’s FOMC announcement before heavily committing one way or the other.<p>The bulls see the strong momentum up in June and hope for a break to a new all-time high. If they get it in June, June will be an oo buy signal bar for July on the monthly chart. May was outside down and June would be outside up. That is a reliable buy setup.<p>The bears hope that the rally fails here. They would then have a double top with the May 16 lower high. They would like a break below the June low and a measured move down to around 2650.<p>The math is about the same for the bulls and bears. Because of the strong momentum, the bulls have higher probability. The risk for the bears is less and the reward might be greater. They, then, have better risk/reward.<p>Both are adequate reasons to be in a position. However, with Wednesday’s report being unusually important, most traders are waiting. The result is 5 sideways days. Day traders expect it to continue up to the report. But if there is a strong breakout in the meantime, they will swing trade.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 2 points in the Globex session. The daily chart has been in a tight trading range for 5 days. Today will therefore open within that range. That increases the chance of more trading range price action again today.<p>Traders know that whenever something is likely, the opposite has an increased probability as well. Therefore, because everyone expects a trading range today, there is an increased chance of a big trend.<p>When there is a trading range, the most common type of trend is a Small Pullback Trend. This is because it looks like a leg in a trading range for the 1st hour or two. If the 5 minute chart begins to create gaps or body gaps, the odds of a trend day will go up. The trend can be up or down.<h2>Friday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-doji-bar-on-weekly-chart.jpg\"><img src=\"2019-6-17.jpg\" alt=\"Emini doji bar on weekly chart\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/EURUSD-Forex-head-and-shoulders-bottom-and-double-top-in-bear-channel.png\"><img loading=\"lazy\" src=\"2019-6-17-1.png\" alt=\"EURUSD Forex head and shoulders bottom and double top  in bear channel\"></a></figure><p>The EURUSD daily Forex chart has been in a trading range for 4 months and in a bear channel for a year. A trading range always has both a reasonable buy setup and a reasonable sell setup. The bears have a 3 day selloff from a double top with the April 12 top of the range.<p>However, the bulls see that selloff as a test of the May low. They have a double bottom with the April and May lows. They will try to stop the selloff this week at around 1.12. That is the bottom of the June 6 consecutive outside bar (oo) buy setup. If they can create a reversal up, they will have a higher low major trend reversal and a head and shoulders bottom.<h3>Weekly chart might be reversing up</h3><p>It is important to note that the weekly chart 2 weeks ago closed above the 20 week EMA last week and above the bear trend line for the 1st time in 9 months. The bears formed a big bear bar last week. That is a sell signal bar for this week. The bears want another failed rally, like all of the other rallies over the past year.<p>But if there are buyers around last week’s low, last week might be simply a pullback from the breakout in a new bull trend, and not a resumption of the bear trend. Consequently, what the EURUSD Forex market does over the next 2 weeks is unusually important. It will determine if the bear trend has finally ended or if will will continue for at least a few more weeks.<h3>Bull Trend needs higher lows and highs</h3><p>If a bull trend on the daily chart began with the May 30 higher low after the April 26/May 23 double bottom, there will be many more bull days than bear days over the next few months. The bulls will begin to form a series of higher highs and lows, which defines a bull trend.<p>June 6 broke above April 12 so they additionally have one higher high after the May 30 and June 14 higher lows. If they get 2 closes above the June high, the rally will then test the March major lower high. Traders will conclude that the bear trend has ended.<p>When a bear trend ends, the chart is either in a trading range or a bull trend. If the rally gets 2 closes above the January high, traders will conclude that the chart is now in a bull trend on the daily chart.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart reversed up 40 pips last night exactly from last week’s low. The bulls prevented the weekly sell signal from triggering.<p>Some of the bulls are swing bulls on the daily chart. They are hoping that today is the start of a bull trend that will continue up for many months and test last June’s high around 1.18. Because the daily and weekly charts have credible bottom patterns, there is an increased chance of a bull trend day today.<p>The bulls need to keep today from falling below last week’s low, which is also the overnight low. Consequently, they will buy 10 – 20 pip selloffs.<p>The bears need a break below the overnight low to make the bulls give up. However, the rally over the past 2 hours is in a tight bull channel. The bears therefore cannot even make a 10 pip scalp. If they can stop the rally and create a trading range, bear day traders will scalp. Without that, most day traders will focus on buying pullbacks today.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-trading-range-and-double-top-at-2900-Big-Round-Number-1.png\"><img loading=\"lazy\" src=\"2019-6-17-2.png\" alt=\"Emini trading range and double top at 2900 Big Round Number\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>Today was the 4th consecutive small trading range day in a tight trading range. Traders are waiting for Wednesday’s FOMC announcement.<p>Traders do not care if the Fed cuts rates or not. All they care about is the direction and strength of the breakout.<p>While the breakout can come ahead of the announcement, what comes after the breakout is far more important. Until then, traders will continue to scalp as long as there is trading range price action.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-6-17"
    }
  ],
  "18": [
    {
      "data": [
        "<article class=\"post-90645 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini tight trading range before June FOMC meeting\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini tight trading range before June FOMC meeting</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-06-18T06:20:20-07:00\">June 18, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Tuesday June 18, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini formed a 4th consecutive doji bar in a tight trading range. The daily chart is in Breakout Mode ahead of Wednesday’s FOMC meeting. Consequently, the odds of a bull breakout and of a bear breakout are 50%.<p>The news keeps saying that the market is pricing in only a 20% chance of a rate cut on Wednesday. I suspect that it is higher than that because the chart is now in a 50-50 mode.<p>But, the 50-50 has to do with the direction of the breakout and not the rate cut. The breakout can be up or down whether or not there is a rate. No one knows how many dollars are ready to buy or sell. We will find out at 11 am PST on Wednesday.<p>The breakout can come before the report, but whatever happens after the report will overwhelm what happens before. At the moment, day traders are scalping, betting on more sideways price action.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 17 points in the Globex session. It will therefore probably gap above the 4 day tight trading range and test last week’s high.<p>Is this the start of a rally to a new all-time high? It might be if the bulls get a trend day after the gap up. However, if the rally reverses down from the gap up, then traders will see a double top with last week’s high.<p>Whenever there is a big gap up, there is an increased chance of a trend day. Up is slightly more likely than down. However, there is an 80% chance of at least one reversal in the 1st hour. The chart typically enters a trading range until it gets near the EMA. The bears want a double top or wedge top and an early high of the day. But the bulls will try to create a wedge bottom or double bottom around the EMA. If there is a trend, day traders will swing at least part of their positions.<p>The bears want a double top or wedge top and an early high of the day. But the bulls will try to create a wedge bottom or double bottom around the EMA. If there is a trend, day traders will swing at least part of their positions.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-trading-range-and-double-top-at-2900-Big-Round-Number-1.png\"><img src=\"2019-6-18.png\" alt=\"Emini trading range and double top at 2900 Big Round Number\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/EURUSD-Forex-head-and-shoulders-bottom-and-doublle-top-in-trading-range.png\"><img loading=\"lazy\" src=\"2019-6-18-1.png\" alt=\"EURUSD Forex head and shoulders bottom and double top in trading range\"></a></figure><p>The EURUSD daily Forex chart has been in a bear channel for a year. Channels spend a lot of time in trading ranges. The daily chart has been in a trading range for 4 months. Every trading range has both a buy and sell signal. Furthermore, traders expect reversals instead of successful breakouts.<p>Every leg up and down over the past year has reversed within about 3 weeks. The bears have had a leg down since last week. By going below last week’s low overnight, the weekly chart triggered a weekly sell signal.<p>However, unless the selloff continues to below the May low, the bulls still have a possible buy setup. A reversal up from a higher low would be a head and shoulders bottom, a double bottom pullback, and a higher low major trend reversal.<p>What will happen if the bears break to a new 52 week low? Probably nothing different from all of the other new lows over the past year. The bears will take profits and the bulls will buy. Both will expect a 2 – 3 week leg up.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute chart sold of sharply in Europe last night. It has been in a trading range since. Because of the trading range, both the bulls and bears have been scalping for 10 pips.<p>The bears want trend resumption down today. However, they are now exhausted, as evidenced by the 5 hour tight trading range. But if they begin to form a series of 3 or more bear bars closing near their lows with bigger than average bodies, day traders will expect at least a small 2nd leg down today.<p>Because of the possible buy setup on the daily chart, the bulls want a reversal up today or tomorrow. They will probably have to wait until after tomorrow’s FOMC report. The bars are currently small. There is very little buying pressure, and therefore a significant reversal up today is unlikely.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-gap-up-and-bull-trend-from-the-open-and-then-trading-range.png\"><img loading=\"lazy\" src=\"2019-6-18-2.png\" alt=\"Emini gap up and bull trend from the open and then trading range\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini rallied strongly on the open, but then entered a trading range. The past 4 days had mostly trading range price action.<p>Traders are waiting for tomorrow’s 11 am PST FOMC interest rate announcement. It is more important than usual. There is therefore an increased chance of a big move up or down after the report.<p>Prior to the report, day traders will trade like on any other day. But, they should exit their positions ahead of the report. Since the initial move reverses more than half of the time, day traders should wait at least 10 minutes after the report before resuming trading.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-6-18"
    }
  ],
  "19": [
    {
      "data": [
        "<article class=\"post-90648 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini awaiting today’s FOMC June interest rate decision\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini awaiting today’s FOMC June interest rate decision</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-06-19T06:20:16-07:00\">June 19, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Wednesday June 19, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Today’s 11 am PST FOMC announcement is unusually important. It could quickly lead to a new all-time high this week or a sharp reversal down.<p>Traders should trade today in 2 pieces. What takes place before the report will probably be overwhelmed by the report.<p>The bulls want follow-through buying after yesterday’s strong rally on the open. Despite that rally, yesterday spent most of the time in a trading range. This is just like the prior 4 days. It increases the chance of mostly trading range trading ahead of today’s report.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 1 point in the Globex session. In addition, the overnight range has been small. Furthermore, most of the trading over the past 5 days has been within trading ranges. That will probably be true again today.<p>Since today is an unusual day, day traders have to be ready for anything. While a strong trend is unlikely ahead of the report, if one begins, they will swing part or all of their positions.<p>Day traders should exit their trades before the 11 am PST report. Since the initial move on the report reverses more than half of the time, day traders should wait for at least 10 minute after the report before resuming trading.<p>In addition, they should be open to anything. That includes a strong trend up or down, an abrupt reversal, or a trading range. Because this report is unusually important and the daily chart is at major resistance, there is an increased chance of a big trend up or down.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-gap-up-and-bull-trend-from-the-open-and-then-trading-range.png\"><img src=\"2019-6-19.png\" alt=\"Emini gap up and bull trend from the open and then trading range\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/EURUSD-Forex-head-and-shoulders-bottom-in-bear-channel-ahead-of-FOMC.png\"><img loading=\"lazy\" src=\"2019-6-19-1.png\" alt=\"EURUSD Forex head and shoulders bottom in bear channel ahead of FOMC\"></a></figure><p>The EURUSD daily Forex chart has been in a bear channel for a year and a trading range for 5 months. A trading range always has both a reasonable buy and sell setup. The bears have a double top with the April and June highs. But they need another new low to continue the bear channel.<p>The bulls hope the 2 week selloff will form a higher low. If so, they will have a higher low major trend reversal. It would also be a head and shoulders bottom and a double bottom pullback.<p>A major trend reversal with a good buy signal bar typically has a 40% chance of actually leading to a reversal to a bull trend from a bear trend. But since every reversal up and down reversed again within a few weeks, this buy setup has less than a 40% chance of success. The bulls need 2 closes above the June high to make traders think that the rally will test the March and January highs.<p>Today’s 11 am PST FOMC announcement is a potential catalyst for a big move up or down. That move could break to a new low and continue the yearlong bear channel. Or, it could break above the June high and make traders believe that a trend reversal might be underway.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 30 pip range overnight. It is within yesterday’s range. The bars are small and have prominent tails. Day traders have been scalping for 10 pips and this will probably continue up to the 11 am report.<p>Day traders should exit positions before the report. There is usually a big move up or down on the report that reverses within the 1st few minutes. Day traders therefore should wait at least 10 minutes after the report before resuming trading.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-after-FOMC-formed-spike-and-channel-bull-trend.png\"><img loading=\"lazy\" src=\"2019-6-19-2.png\" alt=\"Emini after FOMC formed spike and channel bull trend\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini was extremely quiet ahead of the FOMC report. On the report, it formed a huge bull bar and then a big bear bar. Big Up, Big Down creates Big Confusion. This typically results in a trading range, and it did today. There was a weak Spike and Channel Bull Trend and the day closed near the high.<p>The Emini is still deciding if the momentum up is enough to make a new high within the next week. Since today had a lot of trading range price action, like each of the past 4 days, the odds favor more tomorrow. But, because the chart is testing major resistance, there is an increased chance of a big breakout up or down at any point.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-6-19"
    }
  ],
  "20": [
    {
      "data": [
        "<article class=\"post-90651 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini June FOMC gap up to new all time high\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini June FOMC gap up to new all time high</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-06-20T06:20:17-07:00\">June 20, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Thursday June 20, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday had a huge, brief rally on yesterday’s FOMC report, but then entered a broad bull channel. Yesterday as an inside bar on the daily chart and a buy signal bar for today. The bulls want a new all-time high today.<p>I mentioned several times since early June that June might be an outside up month on the monthly chart. Since May was an outside down month, this would create consecutive outside months.<p>This is a reliable buy signal, especially if June closes above the May high. June would then be a buy signal bar for July. If July then goes above the June high to trigger the signal, the odds would favor several more months of higher prices.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 29 points in the Globex session. There will therefore be a big gap up today. Additionally, today might gap up to a new all-time high. A big gap increases the chance of a bull or bear trend from the open.<p>However, there is an 80% chance of at least one reversal in the 1st hour or so. Traders know that there is only a 20% chance of a strong trend up or down on the open that lasts all day.<p>Whenever there is a big gap up, the Emini is far above its average price. Many traders prefer to buy closer the 20 bar EMA. Consequently, the Emini usually enters a trading range over the 60 – 90 minutes. The bulls look to buy a wedge bull flag or double bottom around the EMA.<p>There is also an increased chance of a bear trend. The bears want a wedge top of double top in the 1st hour. They then hope for a bear trend day.<p>When there is a early trading range, the day tends to again have trading range price action late in the day. The result is that most big gap days do not lead to the strongest trends up or down.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-after-FOMC-formed-spike-and-channel-bull-trend.png\"><img src=\"2019-6-20.png\" alt=\"Emini after FOMC formed spike and channel bull trend\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/EURUSD-Forex-head-and-shoulders-bottom-major-trend-reversal.png\"><img loading=\"lazy\" src=\"2019-6-20-1.png\" alt=\"EURUSD Forex head and shoulders bottom major trend reversal\"></a></figure><p>The EURUSD daily Forex chart is reversing up from the right shoulder of a head and shoulders bottom. This is a higher low major trend reversal. A major trend reversal up has a 40% chance of about a 200 pip measured move up to around the January high.<p>That means there is a 60% chance that the rally will not lead to a bull trend. When a rally is not the start of a bull trend, it is either a bull leg in a bear channel or in a trading range.<p>Traders will become more confident of a bull trend if the rally begins to form many bull bars closing near their highs over the next few weeks and consecutive closes above the April/June neck line of the head and shoulders bottom.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart rallied 100 pips overnight in a tight bull channel. This makes a bear trend unlikely today. Furthermore, it has been difficult for the bears to make even a profitable scalp. Consequently, day traders will continue to buy pullbacks.<p>At some point, the tight bull channel will begin to enter a trading range. When it does, bear scalpers will look for 10 pip scalps. However, the bulls will buy 20 – 30 pip pullbacks for swing trades and scalps. It probably will be easier to make money as a bull all day.<p>Today might be the start of a bull trend on the weekly chart. Therefore, traders who trade the daily and weekly charts will also be buying, especially if this rally starts to go above prior highs on those charts over the next few weeks.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-bull-trend-reversal-and-all-time-high-1.png\"><img loading=\"lazy\" src=\"2019-6-20-2.png\" alt=\"Emini bull trend reversal and all time high\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>After gapping up to a new all-time high, the Emini sold off and closed the gap. It then reversed back up and formed a trading range day. This hesitation at the old high is a sign of uncertainty. It therefore increases the chance of 2 – 3 more days with trading range price action.<p>Since June went above May and May was an outside down month, there are now consecutive outside bars on the monthly chart. This is a buy signal for July. If July trades above the June high, there will probably be at least a few more months of higher prices.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-6-20"
    }
  ],
  "21": [
    {
      "data": [
        "<article class=\"post-90654 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini all-time high after June FOMC report\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini all-time high after June FOMC report</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-06-21T06:20:12-07:00\">June 21, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Friday June 21, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday opened at a new all-time high, but then sold off and closed its big gap up. It then reversed back up and closed at a new all-time high.<p>There are now consecutive outside bars on the monthly chart. June will therefore be a buy signal bar for July.<p>On the daily chart, the bears want the breakout to fail. Since the bull trend over the past month has been strong, the bears will need at least a micro double top to attract sellers. Consequently, there probably will be buyers below yesterday’s low.<p>Since yesterday was a doji bar on the daily chart, there is hesitation at major resistance. This increases the chance of 2 – 3 sideways days.<p>Today is Friday. The only nearby weekly support or resistance is the May all-time high. The bulls want the week to close above the September/May double top. That would increase the chance of higher prices next week.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 5 points in the Globex session. Since yesterday ended with a 4 hour buy climax, the bulls will probably be exhausted. Therefore, there is a 75% chance of at least a couple hours of sideways to down trading that begins by the end of the 2nd hour. Also, there is only a 25% chance of a strong bull trend day today. However, the bulls have a 50% chance of follow-through buying in the 1st 2 hours.<p>While yesterday reversed up strongly, the selloff was strong enough to close a big gap up. Most reversal days are simply trading range days. The bears owned the 1st half and the bulls controlled the 2nd half. That early strength by the bears means they are will to sell aggressively around this price. It increases the chance of trading range price action for the next day or two.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-bull-trend-reversal-and-all-time-high-1.png\"><img src=\"2019-6-21.png\" alt=\"Emini bull trend reversal and all time high\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/EURUSD-Forex-head-and-shoulders-bottom-but-no-breakout-yet.png\"><img loading=\"lazy\" src=\"2019-6-21-1.png\" alt=\"EURUSD Forex head and shoulders bottom but no breakout yet\"></a></figure><p>The EURUSD daily Forex chart is reversing up from a head and shoulders bottom. Yesterday was a big bull trend day. However, it had a prominent tail on top. In addition, the rally is still below the June high.<p>Two weeks ago, I mentioned that the weekly chart had its 1st close above the 20 week EMA in 9 months and a break above the yearlong bear trend line. This bottom on the daily chart further increases the chance that the bear trend is ending.<p>A bear trend ends once there are breakouts above major lower highs. The January 10 high of 1.1570 is the most important. Once a bear trend ends, the market has evolved into a trading range. There is also a 40% chance that it has reversed into a bull trend.<p>Every reversal attempt over the past year has failed. However, this one is stronger. The bulls have a 50% chance of a break above the March high and a test of the January high.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart rallied strongly yesterday. After a brief rally in today’s European session, it pulled back and resumed up in a broad spike and channel bull trend. That typically evolves into a trading range. Consequently, the rally will probably not go much higher today.<p>The bulls have already accomplished their objective. They reversed last week’s selloff on the weekly chart. There is a small chance that today could rally to above last week’s high and form an outside up week on the weekly chart.<p>If they simply close the week within 20 pips of the week’s high, they will have a good buy signal bar on the weekly chart for next week. Therefore, day traders will look to buy 20 – 30 pip selloffs, expecting the week to close strong.<p>Since the 5 minute chart will probably enter a trading range, the bears will sell rallies for scalps. But, the odds of a strong bear trend are small.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-bear-trend-reversal-day-from-all-time-high.png\"><img loading=\"lazy\" src=\"2019-6-21-2.png\" alt=\"Emini bear trend reversal day from all time high\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>Yesterday crashed down and reversed up. Today crashed up and reversed down. The Emini then entered a trading range, but the bears got trend resumption down at the end. The bulls tried all day to get far above the May high but failed. Because today closed on its low, it is a sell signal bar for Monday for a failed breakout to a new high.<p>The fight next week will be over the close of the monthly chart. June is outside up after May being outside down. June is therefore a buy signal bar on the monthly chart. If the month closes near its high, the odds of higher prices over the next couple months go up. Consequently, all the bulls have to do next week is keep the price around where it is. It is already good for them.<p>The bears want a selloff next week. This would put a tail on the top of June on the monthly chart. That would lower the probability of much higher prices in July and August. However, the June rally was strong, as was the January to April rally. The odds favor sideways to up next week and then higher in July and August.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-6-21"
    }
  ],
  "22": [
    {
      "data": [
        "<article class=\"post-90660 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini consecutive outside bars forming July monthly oo buy signal\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini consecutive outside bars forming July monthly oo buy signal</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-06-22T00:30:20-07:00\">June 22, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Market Overview: Weekend Market Update</h2><p>The<strong>Emini</strong>broke to a new all-time high this week. June is now a buy signal bar for July on the monthly chart. If July trades above June, the Emini will probably trade up for at least a couple more months.<p>The<strong>crude oil</strong>futures market broke above the neck line of a small double bottom this week. It will probably test 60 and then enter a trading range between 50 and 60 for a couple months.<p>The<strong>EURUSD</strong>weekly Forex chart had another close above the 20 week EMA. Therefore, the price action is becoming more bullish.<h2><strong>Crude oil Futures market:</strong><br>Breakout above neck line of a double bottom</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Crude-oil-breakout-above-small-double-bottom-1.png\"><img loading=\"lazy\" src=\"2019-6-22.png\" alt=\"Crude oil breakout above small double bottom\"></a></figure><p>The crude oil futures rallied strongly this week. For the past 3 weeks, I have been saying that either the low of the next couple months was in or there would be one more brief push down and then a reversal up.<p>Furthermore, I said that the 1st target is the top of the most recent sell climax. That is the May 30 high just below 60. Also, I said that the daily chart might enter a 2 month trading range between 50 and 60.<p>Finally, I have been saying since November that crude oil had a Big Up, Big Down pattern and that creates Big Confusion. I therefore said it will probably be in a trading range for the rest of the year.<p>This week broke above the June 10 high around 55. That is the neck line of the June 6/June 12 double bottom. A measured move up would be around 60.<p>After a breakout, there is often a pullback. Consequently, the daily chart might sell down the June 10 high within a week or two. Even if it does, the odds still favor a test of 60 within a few weeks.<h2><strong>EURUSD weekly Forex chart:</strong><br>Buy signal bar after close above 20 week EMA</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/EURUSD-Forex-outside-up-week-and-breakout-above-bear-channel.png\"><img loading=\"lazy\" src=\"2019-6-22-1.png\" alt=\"EURUSD Forex outside up week and breakout above bear channel\"></a></figure><p>The EURUSD weekly Forex chart broke above the yearlong bear trend line 2 weeks ago. In addition, it closed above the 20 week EMA for the 1st time in 9 months.<p>Despite the bear reversal bar last week, this week traded below the low and above the high of that bar. This week is therefore an outside up bar and a buy signal bar for next week. The odds favor higher prices.<h3>Price action is transitioning out of bear mode</h3><p>The bulls have a 50% chance of ending the bear trend over the next few weeks. If they get consecutive bull trend bars closing near their highs and above the EMA, the odds will favor a test of the March 20 high and possibly the January 10 major lower highs. At that point, traders will conclude that the bear trend is over.<p>The end of a bear trend can mean either the start of a bull trend or an evolution into a trading range. There is often a trading range lasting many bars before there is a clear bull trend. However, the bulls are becoming increasing willing to hold onto their longs.<p>For the past year, every leg up and down reversed within about 3 weeks. Traders did not believe that any leg would last very long. If they begin to see 2 – 3 consecutive bull bars, many will hold onto their longs, and others will buy as the rally continues.<p>This is unlike every rally over the past year. The bulls took profits and the bears sold every time there was a 2 – 3 week rally. Traders will watch carefully to see if the price action is becoming bullish.<h2><strong>Monthly S&amp;P500 Emini futures chart:</strong>Consecutive outside month buy signal</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-monthly-chart-has-consecutive-outside-bars.png\"><img loading=\"lazy\" src=\"2019-6-22-2.png\" alt=\"Emini monthly chart has consecutive outside bars\"></a></figure><p>The monthly S&amp;P500 Emini futures chart&nbsp;in May traded above the April high and then below its low. May was therefore an outside down month.<p>June did the opposite. It traded below the May low and then above the May high. June is now an outside up month. June is now a buy signal for July. If it closes near its high and above the May high, the probability of higher prices will be even greater. At the moment, if July trades above the June high, the Emini will probably trade mostly higher for at least a few months.<h3>Why do consecutive outside bars create a setup?</h3><p>When May traded below the April low, it was a sell signal bar for June. Why? Because May formed a double top with September and it closed near its low.<p>June triggered the sell. The bears theoretically put their stops above the May high. When June traded above the May high, it hit those stops and it ended the sell signal. Many bears will wait for at least another bar (month) or two before selling again. There are therefore relatively fewer bears at the moment. That increases the chance of higher prices if July triggers the buy signal.<p>If June closes near its high, it will be a strong bull trend bar on the monthly chart. Since it is in a strong bull trend, it is a buy signal bar. Many traders like to buy above strong bull trend bars when the market is in a bull trend.<h3>What happens if July does not trade above the June high?</h3><p>If July does not trade above the June high, it will not trigger a monthly buy signal. For example, let’s say July trades down without going above the June high and forms an inside bar on the monthly chart. The bar before the outside bar is “inside” of the outside bar. That is why an inside bar after an outside bar is an ioi pattern (inside-outside-inside).<p>July would then be both a buy signal bar and a sell signal bar for August. If it closes near its low, it would be better for the bears. If it has a bull body and closes near its high, the bulls will be more willing to buy above July in August. Since an ioi pattern is both a buy and a sell signal bar, it is a Breakout Mode setup.<h2><strong>Weekly S&amp;P500 Emini futures chart:</strong><br>Breakout above the May/September double top</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-weekly-chart-testing-top-of-expanding-triangle.png\"><img loading=\"lazy\" src=\"2019-6-22-3.png\" alt=\"Emini weekly chart testing top of expanding triangle\"></a></figure><p>The weekly S&amp;P500 Emini futures chart broke to a new all-time high this week. Any breakout can fail. When one does, it usually does so quickly. Consequently, the next few weeks are important. If next week is a 2nd big bull bar closing near its high, traders will expect at least a small 2nd leg up after the 1st 1 – 2 week pullback.<p>At the other extreme, if next week forms a big bear trend bar closing near its low, traders will conclude that this week’s breakout will have failed. The bulls would exit and the bears would short below the low of that bear bar.<p>The more bullish next week’s bar is, the more likely the Emini will trade higher for at least a few more weeks. A bearish bar next week will result in either a pullback or even a reversal back down to the June low and 2750.<h3>Possible Expanding Triangle top</h3><p>I mentioned above that the breakout to a new all-time high can fail. If it does, it will trigger a sell signal on the daily and weekly charts before it does on the monthly chart.<p>What happens if the bears get a big bear bar closing near its low on the weekly chart within the next few weeks? There would then be an expanding triangle top on the weekly and monthly charts.<p>This is a pattern where there are 2 higher highs and one lower low. September went above January 2018 and reversed down. Then this month traded above September. June and September are the higher highs.<p>Since December fell below the February 2018 low, it formed a lower low. A reversal down in July or August would then create an expanding triangle top.<p>When an expanding triangle reverses, the 1st target is the bottom of the triangle. That is the December low of 2350.<h3>Is a bear trend possible within a couple months?</h3><p>While it seems impossible at the moment, there is always a bear case. Also, its probability is typically higher than you might think. While there is currently only a 30% chance at the moment, if the Emini begins to sell off strongly for several weeks, that probability would increase.<h3>What are reasonable targets when there is an expanding triangle?</h3><p>If the rally continues, where can traders expect profit taking? Where will a pullback or reversal begin?<p>The most obvious target is the 3,000 Big Round Number. The bulls might reach that next week. This is especially true since there is a seasonally bullish tendency from June 26 to July 5. This is probably due to a combination of factors, including end of the quarter buying by funds (window dressing). They want their quarterly reports to show that they own all of the strong stocks. In addition, there is some euphoria going into the summer and ahead of a holiday.<p>The top of the expanding triangle is the trend line drawn across the prior two highs. That line is rising and it is now just below 3030. Since strong trends tend to overshoot before reversing, traders should expect this rally to continue up to maybe 1 – 2% above the line before reversing. That means around 3050 – 3150.<h3>Measured move targets are less likely</h3><p>Measured moves are often reliable, but less so in an expanding triangle. Remember, an expanding triangle means that the last 4 strong legs up and down reversed. Traders should expect a reversal down to at least to around the middle of the expanding triangle. It probably will begin within the next few months. Less often, the selloff reaches the bottom of the triangle, which is the December low.<p>The bulls are hoping for a measured move up based on the March 8/June 3 double bottom at around 2730. The neck line for the double bottom is the May 1 high of 2960.00. A 230 point measured move up is 3190. That is above what most pundits are predicting. Also, it would be unusual when there is an expanding triangle.<p>Can the rally reach a measured move up based on the 600 point height of the 18 month trading range? Probably not, because of the expanding triangle’s strong tendency to reverse shortly after every new high or low. That measured move target is around 3550.<h2><strong>Daily S&amp;P500 Emini futures chart:</strong><br>Failed breakout above September/May double top</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-daily-chart-has-failed-breakout-above-double-top.png\"><img loading=\"lazy\" src=\"2019-6-22-4.png\" alt=\"Emini daily chart has failed breakout above double top\"></a></figure><p>The daily S&amp;P500 Emini futures chart broke above the September/May double top this week. Traders know that any breakout has at least a 40% chance of failing. Therefore, the bulls will exit and the bears will sell if this breakout reverses down within the next couple of weeks.<p>Since Friday closed on its low, it is a sell signal bar for Monday. The tight trading range from 2 weeks ago is a magnet and a potential Final Bull Flag. It is therefore a target if this week trades down.<p>But even if it does, the odds still favor higher prices in July. This is because the June rally has been very strong, as was the January to April rally. Also, the trend line at the top of the expanding triangle is a magnet above.<p>In addition to Friday being a sell signal for a failed breakout above a double top, the rally is also a wedge. The May 16 and June 11 highs would be the 1st two highs in a wedge and Friday was the 3rd. The reversal down would be from a wedge rally and a higher high major trend reversal.<p>It is important to note that even the best looking major trend reversal has only a 40% chance of reversing a trend into an opposite trend. More often, the reversal either forms a trading range or a bull flag. Therefore, the downside risk next week is small.<hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-6-22"
    }
  ],
  "24": [
    {
      "data": [
        "<article class=\"post-90656 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini weak breakout above May all time high\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weak breakout above May all time high</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-06-24T06:20:59-07:00\">June 24, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Monday June 24, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini made 2 new all-time highs last week. Additionally, June is now a buy signal bar for July on the monthly chart. The bulls will try to have June close near its high to increase the chance of higher prices over the next couple months.<p>On the daily chart, Friday was a small bear reversal day. It is therefore a sell signal bar for today. But the June rally was strong and the 2 week bull channel has been tight. Traders expect the 1st reversal to be minor.<p>The tight trading range from 2 weeks ago is a potential Final Bull Flag and therefore a magnet below. However, the odds continue to favor higher prices over the next couple months, even if there is a pullback to 2900 1st.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 6 points in the Globex session. Friday is a sell signal bar for a failed breakout to a new all-time high. Its low is not far below. Consequently, today will probably trade below Friday’s low and trigger the sell signal. Traders want to know if there will be more buyers or sellers below. Will a 1 – 3 day pullback begin today, or will the bears need a micro double top first?<p>Because the past 2 days were sideways, today will likely have a lot of trading range price action again. This is especially true ahead of the G20 Summit and China talks at the end of the week.<p>Since the breakout to a new high has been small, the odds favor a pullback this week. It might test back down to the tight trading around just below 2900 on the daily chart.<h2>Friday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-bear-trend-reversal-day-from-all-time-high.png\"><img src=\"2019-6-24.png\" alt=\"Emini bear trend reversal day from all time high\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/EURUSD-Forex-trend-reversal-up-from-head-and-shoulders-bottom.png\"><img loading=\"lazy\" src=\"2019-6-24-1.png\" alt=\"EURUSD Forex trend reversal up from head and shoulders bottom\"></a></figure><p>The EURUSD daily Forex chart is reversing up strongly from a head and shoulders bottom. It now has higher lows and highs and therefore is in a bull trend. But, that trend is still within a yearlong bear trend. If the bulls can get consecutive closes above the January high, traders will conclude that the bear trend has ended.<p>This is the strongest rally in over a year. The bulls will buy the 1st reversal down. A breakout typically pulls back to test a prior high, which is a breakout point. Here, the choices are the April 12/June 12 double top around 1.13 and the May 1/May 13 double top around 1.1250.<p>After 4 bull days, the bears will probably need a micro double top before they can get a 3 – 5 day pullback. Therefore the best they probably can get over the next few days is a pause in the bull trend.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart rallied 30 pips overnight and broke above last week’s high. It has been in a small spike and channel bull trend for 5 hours. That usually evolves into a trading range. Therefore day traders will look for 10 – 20 pip scalps up and down today.<p>Traders expect more 2-sided trading over the next few days after a 200 pip rally with only small pullbacks. However, they will look to buy the 1st 50 – 100 pip selloff and expect a test of the rally’s high.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-bear-trending-trading-range-day.png\"><img loading=\"lazy\" src=\"2019-6-24-2.png\" alt=\"Emini bear trending trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini was in a small bear trending trading range day. This is the 3rd consecutive sideways day at the all-time high. It might continue mostly sideways until the China trade talks at the end of the week.<p>Because the breakout above the September/May double top was not big, there is an increased chance of a pullback over the next week. Friday was a sell signal bar. Today triggered the sell signal at the end of the day, but the breakout was small. In addition, it was a pullback to the 60 minute EMA. So far, this is a minor sell setup.<p>The tight trading range around 2900 is a possible Final Bull Flag and therefore a magnet below. But even if the bears get their pullback, the odds still favor higher prices over the next couple months.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-6-24"
    }
  ],
  "25": [
    {
      "data": [
        "<article class=\"post-90826 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini sideways at all-time high ahead of China talks\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini sideways at all-time high ahead of China talks</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-06-25T06:20:27-07:00\">June 25, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Tuesday June 25, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>By trading below Friday’s low, the Emini triggered a minor sell signal yesterday. The downside is small because the bull channel is tight. It could pull back to the tight trading range around 2900 over the next week.<p>However, the Emini has been sideways for a 3rd consecutive day. It might continue sideways into the China trade talks at the end of the week.<p>There are only 4 trading days left in June. The bulls have already achieved their goal of creating a buy signal bar on the monthly chart. This is because June is now the 2nd consecutive outside bar in a bull trend. The bulls would like June to close at a new all-time high on the monthly chart. If it closes near the high of the month, it will be a higher probability buy signal bar for July.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 4 points in the Globex session. Traders are deciding if the Emini will pull back from here or have 3rd leg up on the 60 minute chart before pulling back. Because the month-long bull channel is tight, sideways to up is still more likely than down. Consequently, today will probably be another trading range day rather than a bear trend day. This is true even though yesterday triggered a sell signal on the daily chart.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-bear-trending-trading-range-day.png\"><img src=\"2019-6-25.png\" alt=\"Emini bear trending trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/EURUSD-Forex-head-and-shoulders-bottom-and-minor-double-top.png\"><img loading=\"lazy\" src=\"2019-6-25-1.png\" alt=\"EURUSD Forex head and shoulders bottom and minor double top\"></a></figure><p>The EURUSD daily Forex chart has rallied strongly above the neck line of its head and shoulders bottom. I said that it would probably test the March 20 lower high and then pull back to below the 1.13 neck line.<p>It is now in the vicinity of that high. It should pull back to below the April 12/June 12 double top within the next week to test the 1.13 breakout point. Since the chart is still in a trading range, traders expect overshoots and undershoots. Therefore, the chart will likely close the gap above that double top.<p>In addition, it will probably break above the March 20 high within a couple weeks as well. It can do that before or after the pullback to 1.13.<p>I continue to make the point that the chart is still in a trading range. While it is now also in an early bull trend, that bull trend still has a 50% chance of being only a bull leg in the 4 month range and not the start of a move up to the September 1.18 start of the yearlong bear channel.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart sold off 30 pips overnight from above yesterday’s high. After a 200 pip rally to near resistance, the bulls are taking some profits.<p>Because the bull trend was so strong, the bulls will probably buy the 1st 50 – 100 pip selloff. Consequently, the best the bears can probably get over the next couple days is a trading range.<p>But the overnight selloff was big enough so that bear day traders now can finally begin to scalp. Furthermore, the rally was climactic and now near resistance. As a result, the bulls will switch to buying pullbacks and scalping for 10 – 20 pips. Traders expect a trading range for a couple days.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-bear-channel.png\"><img loading=\"lazy\" src=\"2019-6-25-2.png\" alt=\"Emini bear channel\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini sold off in a Bear Trend From The Open. This is the 3rd day in its reversal down from above the September/May double top. It might continue down to below 2900 because there was a tight trading range there. That is a potential Final Bull Flag and therefore a magnet below.<p>A bear channel has a 75% chance of a bull breakout. Therefore, it is a bull flag. Traders should expect a break above the bear trend line at some point tomorrow and at least a couple hours of sideways to up trading.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-6-25"
    }
  ],
  "26": [
    {
      "data": [
        "<article class=\"post-90828 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini pullback from June breakout above double top\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini pullback from June breakout above double top</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-06-26T06:20:16-07:00\">June 26, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Wednesday June 26, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday was a Bear Trend From The Open day. It was also a bear channel. A bear channel typically has a bull breakout. Consequently, there is a 75% chance of at least a couple hours of sideways to up trading at some point today.<p>The 3 day selloff did not have a lot of panic selling. For example, despite yesterday’s bear trend, bulls could make money all day buying new lows. It is therefore more likely going to be a pullback than the start of a bear trend. However, the tight trading range below 2900 from 2 weeks ago is a potential Final Bull Flag. Traders know that this 3 day pullback might test it over the next week.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 10 points in the Globex session. It will therefore probably gap above yesterday’s bear trend line. A breakout above a bear channel usually leads to a trading range. The top of the range is often around the start of the channel. That is the top of the 1st lower high yesterday around 2945.<p>The bears would like a continuation of the 3 day pullback. But traders know that a pullback in an strong trend usually ends after a few days. Since this selloff is more likely a pullback than the start of a bear trend, today will probably not be a strong bear trend day.<p>Although the bulls want a bull trend day, Friday’s Big Up and yesterday’s Big Down create Big Confusion. That usually results in a trading range. Traders expect at least one swing up and one swing down today.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-bear-channel.png\"><img src=\"2019-6-26.png\" alt=\"Emini bear channel\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/EURUSD-Forex-pullback-in-head-and-shoulders-bottom.png\"><img loading=\"lazy\" src=\"2019-6-26-1.png\" alt=\"EURUSD Forex pullback in head and shoulders bottom\"></a></figure><p>The EURUSD daily Forex chart has been sideways for 3 days after breaking above the April/June double top. That is the neck line of a 4 month head and shoulders bottom.<p>There is room to the March major lower high above. Since that is an important magnet and it is nearby, the rally probably cannot escape its magnetic pull. Consequently, the odds favor higher prices within 2 weeks. This is true even if yesterday’s pullback continues down to below 1.13 and the neck line of the head and shoulders bottom.<p>The bears need a surprising strong reversal down to make traders believe that the rally is turning down from a double top with the March high. A pullback and another leg up are more likely.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 25 pip range overnight. Furthermore, it is within yesterday’s range. If today remains an inside day and closes above its midpoint, it will be a buy signal bar for tomorrow. It would be stronger if today closes near its high. The bulls will therefore buy selloffs to try to get a bull body on the daily chart.<p>An inside day can also be a sell signal bar for a failed breakout on the daily chart. Consequently, the bears will sell rallies to try to get today to close near its low. However, even if they are successful, traders believe that a pullback will only last a few days. There will probably be strong buyers around 1.13.<p>Traders expect that the overnight trading range will continue all day. Both the bulls and bears will look for 10 pip scalps from reversals.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-bear-channel-1.png\"><img loading=\"lazy\" src=\"2019-6-26-2.png\" alt=\"Emini bear channel\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini gapped above yesterday’s bear channel, but then sold off in a Bear Trending Trading Range Day. Today was the 4th consecutive bear on the daily chart and it closed on its low. The 20 day EMA is a magnet below, as is the tight trading range just below 2900. Since the past 2 days have big bear bodies and closed on their lows, the momentum down is strong. The Emini should test below 2900 this week.<p>It is important to realize that this weekend’s China trade talks could lead to a big move up or down. In addition, that move can even happen this week before the talks begin.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-6-26"
    }
  ],
  "27": [
    {
      "data": [
        "<article class=\"post-90830 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini 4 day pullback ahead of China trade talks\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini 4 day pullback ahead of China trade talks</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-06-27T06:20:40-07:00\">June 27, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Thursday June 27, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini yesterday broke above Tuesday’s bear channel, which was likely. It then sold off in a bear channel and closed on its low.<p>It was the 4th consecutive bear day in a reversal down from above the September/May double top. The 20 day EMA and the tight trading range just below 2900 are magnets below. Since the momentum down is strong, the Emini should get there within a week. However, this selloff is still more likely a pullback in a bull trend than the start of a bear trend.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 5 points in the Globex session. Consequently, there is a 75% chance of a bull breakout above a bear channel and then at least a couple hours of sideways to up trading. I said that yesterday after Tuesday’s bear channel. Yesterday broke above the bear trend line and entered a triangle for 3 hours. However, the bears then got trend resumption down.<p>The odds of today selling off all day again are less. This is true even though the Emini is close to the 20 day EMA, which is a magnet below. It is because the Emini has had 4 consecutive bear bars on the daily chart. Traders believe that this selloff is a pullback from the new all-time high and not the start of a bear trend. Pullbacks typically only last a few days before bouncing. Therefore today will probably have at least one stronger rally. Furthermore, the Emini will likely close above the open and not form a 5th consecutive bear day.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-bear-channel-1.png\"><img src=\"2019-6-27.png\" alt=\"Emini bear channel\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/EURUSD-Forex-bull-flag-after-head-and-shoulders-bottom.png\"><img loading=\"lazy\" src=\"2019-6-27-1.png\" alt=\"EURUSD Forex bull flag after head and shoulders bottom\"></a></figure><p>The EURUSD daily Forex chart formed an inside day yesterday and today so far is a 2nd consecutive inside day. That is an ii (inside-inside) Breakout Mode pattern, which means it is both a buy and a sell setup.<p>The bears see it and yesterday as a sell setup for a failed breakout above the April/June double top. They also see a wedge rally with the May 27 and June 12 highs as the 1st 2 legs up. Finally, they think the rally is forming a lower high double top with the March high.<p>Most traders, however, believe that this rally will go above the March high and possibly the January high. They know that a bear break below yesterday’s low will probably simply be a test of the 1.13 neck line of the head and shoulders bottom.<p>But they also know that the bears still have a 40% chance of being right. The probability for the bears will go up if they get a micro double top with a strong bear reversal bar or a huge bear Surprise Bar within the next week.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 30 pip range overnight. Furthermore, its low did not go below yesterday’s low and its high is below yesterday’s high. Today therefore so far is an inside day.<p>The range over the past 5 hours has been only 15 pips. That is too small even for scalpers to make money. However, day traders will continue to scalp, expecting the range to expand at least a little.<p>Today is the 4th day in a tight trading range. That makes more trading range price action likely again today.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-trading-range-day-and-inside-day.png\"><img loading=\"lazy\" src=\"2019-6-27-2.png\" alt=\"Emini trading range day and inside day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>After an early trading range, the bears got a downside breakout. But unlike the past 2 days, the bear breakout failed and the Emini reversed up. The trend was not strong, but the bulls finally got a bull bar on the daily chart.<p>After 4 bear days on the daily chart, this 1st reversal attempt will probably only last a day or two. However, this weekend’s China trade talks can be an important catalyst for a big move up or down next week.<p>Tomorrow is Friday so weekly support and resistance can be important. The bulls would like to get back up to the open of the week. That would turn the week into a doji bar instead of a bear inside bar.<p>The bears want the week to close on its low. It would then be a sell signal bar for next week. However, after a strong 3 week rally, it would be a minor sell setup.<p>Tomorrow is also the last day of the month. There are no nearby significant monthly targets. June already will be an oo (consecutive outside bars) buy signal bar for July.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-6-27"
    }
  ],
  "28": [
    {
      "data": [
        "<article class=\"post-90833 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini weak bull flag ahead of G20 China talks\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weak bull flag ahead of G20 China talks</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-06-28T06:20:01-07:00\">June 28, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Friday June 28, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini yesterday formed the 1st bull body on the daily chart in 5 days. After 4 consecutive bear bars, the odds are that this 1st rally attempt will fail within a couple days. Consequently, the upside is small. If the bulls are lucky, they will get back to the open of the week and create a doji bar on the weekly chart.<p>This weekend’s China trade talks could be an important catalyst. The result could be a big move up or down next week.<p>I have been writing all year that the Emini would probably get above the September high. The next target is around 3100 at the top of the expanding triangle on the monthly chart. But, the 4 day selloff still might test the tight trading range below 2900 1st.<p>Today is Friday and the last day of the month. There only nearby monthly target is the September high. June is already a buy signal bar for July because of the consecutive outside bars (oo buy setup).<p>The weekly targets are the open and low of the week. The bulls want a close above the open to prevent a bear bar on he weekly chart. If the bears can get the week to close on its low, this week will be a sell signal bar for next week.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 7 points in the Globex session. It will therefore probably gap above yesterday’s high.<p>Because the daily and weekly charts are in strong bull trends, the bulls will try to resume the rally today. The 2956.00 open of the week is a magnet above. Today is Friday and therefore traders will pay attention to weekly support and resistance, especially in the final hour.<p>Since the week’s open is less than 20 points above the Globex price, it is within reach today. Because it is a magnet, it could pull the Emini up there by the close. Consequently, there is an increased chance of a bull trend today. This is especially true since the 4 day selloff made the daily chart oversold.<p>Most days over the past 3 weeks have had a lot of trading range price action. Even if today rallies, the rally will probably not be strong.<p>Just because there is an increased chance of a rally does not eliminate the chance of a bear trend day. If there is a strong early selloff, day traders will look to swing shorts.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-trading-range-day-and-inside-day.png\"><img src=\"2019-6-28.png\" alt=\"Emini trading range day and inside day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/EURUSD-Forex-ii-bull-flag-after-head-and-shoulders-bottom.png\"><img loading=\"lazy\" src=\"2019-6-28-1.png\" alt=\"EURUSD Forex ii bull flag after head and shoulders bottom\"></a></figure><p>The EURUSD daily Forex chart has rallied for 6 weeks and it is now just below the March 20 major lower high. The past 2 days were consecutive inside days. They therefore formed an ii bull flag.<p>Today broke above yesterday’s high and therefore triggered the buy signal. The odds are that this rally will reach the target above.<p>However, the pullback from the breakout above the neck line of the head and shoulders top lasted only 1 day (Tuesday). That is probably not enough. Consequently, the daily chart might pull back more over the next week before testing the 1.1450 level. This is especially true because the ii bull flag is made of 2 dojis. They are a sign of a loss of momentum.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute chart broke slightly above yesterday’s high, and it sold off 25 pips over the past 5 hours. This is therefore not a strong resumption of last week’s bull trend. It increases the chance of more sideways to down trading next week.<p>Because the daily chart triggered a buy signal by going above yesterday’s high, the bulls will try to get today to close near its high and above yesterday’s high. They will therefore buy pullbacks. But after 2 days in a tight trading range and now with a weak breakout, the bulls will probably only scalp.<p>The bears were able to prevent the formation of a strong buy signal bar on the daily chart and a big breakout above yesterday’s high. They therefore are willing to sell rallies. But the 5 hour selloff has been weak. Furthermore, the 3 sideways days will encourage them to continue to sell rallies and scalp for 10 pips.<p>With the bars small, the range tight, and bulls and bears both scalping, today will likely be another trading range day. This is especially true ahead of the uncertainty of the G20 meeting and the China trade talks this weekend.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p>I will post chart after the close.<figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-end-of-quarter-window-dressing-rally.png\"><img loading=\"lazy\" src=\"2019-6-28-2.png\" alt=\"Emini end of quarter window dressing rally\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>Today was the last day of the week, month and quarter. That combination increased the chance of a big move at the end of the day. It resulted in a strong window dressing rally that reached to just below the open of the week and the May high.<p>The monthly bar closed near its high and June is a buy signal bar for July. The odds are that the buy signal will trigger next week. However, there is a risk of weekend surprise from the China trade talks. It could result in a big gap up or down on Monday.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-6-28"
    }
  ],
  "29": [
    {
      "data": [
        "<article class=\"post-90839 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini’s June oo buy signal and expanding triangle top\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini’s June oo buy signal and expanding triangle top</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-06-29T00:30:15-07:00\">June 29, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Market Overview: Weekend Market Update</h2><p>The June bar on the<strong>Emini’s</strong>monthly candlestick chart has created an oo bull flag with May. However, if July does not go above the June high to trigger the buy signal, July will be both a buy and sell signal bar for August.<p>The month-long rally in the<strong>crude oil</strong>futures market is testing resistance. It will probably stall over the coming week. The chart will probably remain in a trading range for the rest of the year.<p>The<strong>EURUSD</strong>weekly Forex chart has rallied for 6 weeks and is now above the 20 week EMA. The lack of consecutive strong bull trend bars make the rally more likely a leg in a trading range than the start of a bull trend.<h2><strong>Crude oil Futures market:</strong><br>Bull leg in trading range is now testing resistance</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Crude-oil-pullback-from-test-of-60.png\"><img loading=\"lazy\" src=\"2019-6-29.png\" alt=\"Crude oil pullback from test of 60\"></a></figure><p>The crude oil futures market has rallied for several weeks. It is now testing the May 30 high, which is the top of the final sell climax on the daily chart. That is the 1st target when there is a reversal up. It is also testing the May 6 low, which is the neck line of the April/May double top.<p>Because the rally is now testing resistance, the rally has slowed over the past 6 trading days. The bodies and ranges are becoming smaller and the tails are getting bigger. This is 2 sided price action and it will probably lead to a tight trading range next week.<p>I have been writing for the past month that this rally will probably evolve into a trading range between 50 and 60 over the next month. It should remain in a trading range for the rest of the year.<p>The top of the range could be around the May 20 high of 64.20 because that is the top of the sell climax on the weekly chart. Even if it continues up to the May high at around 67, the several big legs up and down over the past year are a sign of a trading range price action.<p>There is nothing to indicate that this is about to change. Traders will continue to sell rallies to resistance, buy selloffs to support, and take profits every 2 – 3 weeks.<h2><strong>EURUSD weekly Forex chart:</strong><br>Alternating bull and bear bars</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/EURUSD-Forex-wedge-bear-flag-but-in-trading-range.png\"><img loading=\"lazy\" src=\"2019-6-29-1.png\" alt=\"EURUSD Forex wedge bear flag but in trading range\"></a></figure><p>The EURUSD weekly Forex chart has had 2 big bull trend bars in the past 4 weeks. Both closed above the 20 week EMA, and they are the 1st closes above the EMA since September. However, there is no follow-through. Where are consecutive big bull trend bars?<p>If this rally is the start of a bull trend, the bulls should be able to control the market for more than one week at a time. Because they have not, this rally is more likely a bull leg in a trading range.<h3>End of bear trend does not mean start of bull trend</h3><p>Yes, the rally might have ended the yearlong bear channel. That does not mean that there is now a bull trend. Instead, this rally is behaving like a leg in a trading range.<p>Trading ranges have legs that go up and they alternate with legs that go down. If the bulls are unable to get a strong bull bar within the next 2 weeks, the weekly chart will likely go sideways to down for a few weeks.<p>If so, the bulls will want the pullback to hold above the 20 week EMA. That was resistance for a year. The bulls hope it is now support. If so, the rally will resume up to test the major lower highs of the past year.<p>The bulls want the rally to continue up to the start of the bear channel. That is the September 24 high at around 1.18. It took 8 months to fall from there to the April low. If it gets back there, it will probably take several months. This is especially true given the lack of consecutive big bull trend bars on the weekly chart.<h3>Possible small wedge rally</h3><p>The month-long rally began with a small bull bar that closed on May 24. The 2nd leg up was 2 weeks later. Last week might be the start of a small 3rd leg up. Three legs up is often a wedge rally, which is a buy climax. If so, it often leads to a couple legs sideways to down.<p>This week might be the end of a 3rd week up. The March 20 major lower high of 1.1448 is just above. The rally might have to get there before the bulls will take profits.<p>But will the bears sell aggressively enough to resume the bear trend? At the moment, a sideways to down leg in a trading range and then a resumption of the rally is more likely. At a minimum, the rally will probably reach the January 10 lower high at 1.1570. That was the start of the most recent leg down and its high is therefore an important magnet above.<h2><strong>Monthly S&amp;P500 Emini futures chart:</strong><br>Emini’s June oo buy signal and expanding triangle top</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-monthly-candlestick-chart-oo-bull-flag-and-expanding-triangle.png\"><img loading=\"lazy\" src=\"2019-6-29-2.png\" alt=\"Emini monthly candlestick chart oo bull flag and expanding triangle\"></a></figure><p>The monthly S&amp;P500 Emini futures chart&nbsp;is currently the most interesting because it has 2 fairly unusual patterns. There is both an oo buy setup (consecutive outside bars) and an expanding triangle top.<h3>oo bull flag</h3><p>When the market is in bull trend and forms an outside down bar and then an outside up bar, that is a set of consecutive outside bars. I call that an oo bull flag. May traded above the April high and then below its low. May was therefore an outside down month and a sell signal bar for a top in a bull trend.<p>June traded below May to trigger the monthly sell signal, but then rallied to go above the May high. It therefore hit the protective stops of the bears who sold below May’s low.<p>June is now a buy signal bar. If July goes above the June high, it will trigger the oo bull flag buy signal. There would then be a 60% chance of higher prices over the next few months.<h3>ioi top</h3><p>If July does not go above the June high, July will probably be an inside bar. This is because the June low is so far below that the odds are against July falling that far. An inside bar after an outside bar in an ioi setup (inside-outside-inside). The bar before an outside bar is inside of the outside bar. That is why I call it an ioi pattern.<p>An inside bar in a bull trend is a buy signal bar. Consequently, if July does not trigger the buy signal above the June high, July will be a buy signal bar for August.<p>Remember, when June traded below May, it triggered a sell signal, even though it failed. If August trades below July, it would be a 2nd reversal down from the top of the 18 month trading range. That is a higher probability sell signal than a 1st reversal down. Therefore, an ioi is also a sell signal as well as a buy signal.<p>When a bar is both a buy and sell signal bar, there is a Breakout Mode pattern. In general, traders assume that a Breakout Mode pattern has a 50% chance of a successful bull breakout and a 50% chance of a successful bear breakout. Furthermore, there is a 50% chance that the 1st breakout up or down will fail.<h3>Expanding Triangle Top</h3><p>When many traders think of a triangle, they see a pattern that is constricting, getting ever tighter, with a series of lower highs and higher lows. The theory is that the tension is building up and that there will be a breakout that will go about the same distance as the height of the triangle. This contracting triangle is the most common type of triangle.<p>But the mirror image of that is a triangle as well. If a market makes a sideways series of higher highs and lower lows, it is a triangle that is expanding instead of contracting. This is a reversal pattern and not a breakout pattern. Traders expect each new high to reverse and then make a new low, and then reverse up to a new high. At some point, the pattern stops and market moves onto some other pattern.<p>The monthly chart made a high in January 2018 and then a low in February 2018. That was followed by a new high in September and a lower low in December. The June rally went above the September high (which was a double top with the May 2019 high).<p>If the Emini reverses down from here, that would be the 5th reversal and it would create an expanding triangle top. The goal for the bears is a new low in the pattern, which means a break below the December low. If the bears get a good sell signal bar in the next few months, they will have a 40% chance of a break below the December low.<p>That means that even with a good sell signal, there is a 60% chance of something else. The most likely possibility is a continuation of the 18 month trading range.<h3>How far will the rally go?</h3><p>The Emini has been in a trading range for 18 months. When there is a breakout of a trading range, traders look for a measured move that is based on the height of the trading range. Since this range is 600 points tall, the bulls want a rally to 3,500 and the bears want a selloff to 1,700.<p>But both are currently unrealistic. This is because this trading range is an expanding triangle. That means breakouts are more likely to reverse than to lead to a measured move.<p>When a market is in an expanding triangle, traders can extend the lines above and below. The rising line above is resistance and the falling line below is support. If the bulls trigger their buy signal in July, the top of the triangle is currently around 3,040 and it is rising.<p>Expanding triangles typically go beyond the lines before reversing. These are overshoots and 1 – 2% overshoots are common in the stock market. That means that the Emini might reach 3,100 before reversing. Therefore traders should look for a reversal down from between 3,000 and 3,100.<p>The 1st reversal down typically targets the most recent major higher low. That is the June 3 low of 2732.75.<h2><strong>Weekly S&amp;P500 Emini futures chart:</strong><br>Bear inside bar but minor sell signal</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-weekly-candle-stick-chart-pullback-in-bull-trend.png\"><img loading=\"lazy\" src=\"2019-6-29-3.png\" alt=\"Emini weekly candle stick chart pullback in bull trend\"></a></figure><p>The weekly S&amp;P500 Emini futures chart formed a bear inside bar this week. It is therefore a sell signal bar for next week for a failed breakout above the May high.<p>However, the 3 week rally has been strong. In addition, the 2019 bull trend has also been strong. Consequently, there probably will be more bulls looking to buy below this week’s low than bears eager to sell there. This is therefore a low probability sell setup.<p>If next week triggers the sell signal by going below this week’s low, it will probably form a bull flag over the next few weeks instead of beginning a bear trend. The odds continue to favor a new all-time high in July.<h2><strong>Daily S&amp;P500 Emini futures chart:</strong><br>Should test 20 day EMA and June 17 tight trading range around 2,900</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/06/Emini-daily-candle-stick-chart-bull-flag-1.png\"><img loading=\"lazy\" src=\"2019-6-29-4.png\" alt=\"Emini daily candle stick chart bull flag\"></a></figure><p>The daily S&amp;P500 Emini futures chart bounced on Thursday and Friday after 4 bear days. Since the 20 day EMA is always support, it is a magnet. Wednesday’s low got to within 20 points. It is therefore within the magnetic field. That makes it unlikely to go back to the all-time high without 1st getting down to the EMA.<p>The tight trading range that ended on June 17 is an area of agreement. It, too, is therefore a magnet. The selloff got halfway there.<p>A 50% pullback is common. The market often pauses halfway to a target as it decides between continuing down to the target or resuming up to a new high.<p>While traders assume that every reversal attempt will fail and form a bull flag, the EMA and tight trading range are strong magnets below. Many bulls will not want to buy until they see the Emini fall to that support and reverse up. As a result, it is likely that the Emini will test 2900 before making a new high.<p>The China trade talks are unusually important this weekend. Most traders correctly assume that there will be no surprise. That means the technical factors will remain in control and there will not be a big news-related move on Monday. But if there is a surprise, it could overwhelm everything that I wrote today. The Emini could make a huge move up or down on the news.<hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-6-29"
    }
  ]
}