{
  "6": [
    {
      "data": [
        "<article class=\"post-93682 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini October bear trap sell climax and bull trend reversal\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini October bear trap sell climax and bull trend reversal</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-10-06T18:00:15-07:00\">October 6, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Market Overview: Weekend Market Update</h2><p>The<strong>Emini</strong>reversed up from a bear trap last week. It should test the top of last week’s sell climax at a minimum.<p><strong>Bond futures</strong>reversed most of the September pullback and are likely to go at least a little higher.<p><strong>Bitcoin</strong>has a minor bottom but should fall below 7,500 within a month.<h2><strong>30 year Treasury Bond Futures market:</strong><br>ii bull flag</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Treasury-Bond-futures-monthly-chart-has-ii-bull-flag-so-possible-final-bull-flag.png\"><img loading=\"lazy\" src=\"2019-10-6.png\" alt=\"Treasury Bond futures monthly chart has ii bull flag so possible final bull flag\"></a></figure><p>The 30 year Treasury bond futures monthly chart has an inside bar so far in October. September’s low was above the August low and its high was below the August high. September is therefore also an inside month.<p>Consecutive inside bars (an ii pattern) is a Breakout Mode pattern. When they form in a strong bull trend, there is usually a bull breakout.<p>However, they represent balance. Consequently, the upside is frequently small. They therefore often form a Final Bull Flag.<p>That makes sense because the sideways trading indicates that both the bulls and bears believe the price is fair. A breakout above usually gets pulled back into the ii within a couple months.<p>What happens if October goes above September instead of remaining an inside bar? The same result. September is a bear bar in a buy climax. It is therefore a weak buy signal bar. Traders will expect more sellers than buyers above its high.<p>Consequently, the upside is probably small over the next couple months. This is true whether October goes above September or if there is an ii bull flag.<h3>Interest rates will not hit zero</h3><p>Wall St. often likes catchy phrases. Most have a small element of truth. However, most end up as not true. A recent example is, “Gold to infinity and interest rates to zero.”<p>Interest rates to zero requires bond prices to go to infinity. No one expects that, but some expect gold and bonds to go much higher.<p>I have written many times that I doubt interest rates will ever be negative in the US. Americans would not let it happen. We see ourselves as the leader of the economic world and that would represent an unacceptable level of failure and embarrassment. The Fed has many tools to prevent it.<p>Since Americans will never accept it, it will not happen. Think about it. What would the seniors and AARP do if seniors on fixed incomes had to pay interest to a bank for the right to have a savings account?<h2><strong>Bitcoin daily chart:</strong><br>Weak bottom with the magnetic pull of support below</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Bitcoin-breakout-below-10000-testing-bottom-of-parabolic-buy-climax.png\"><img loading=\"lazy\" src=\"2019-10-6-1.png\" alt=\"Bitcoin breakout below 10,000 testing bottom of parabolic buy climax\"></a></figure><p>The Bitcoin cash index daily chart collapsed below 10,000 two weeks ago. I<a href=\"https://www.brookstradingcourse.com/analysis/emini-weekly-sell-signal-bar-august-trading-range/#bitcoin\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"wrote on August 24 (opens in a new tab)\">wrote on August 24</a>that 10,000 was fake support and that Bitcoin would probably have to test 7,500 before strong buyers would look to buy. It was way too easy to buy with limit orders at 10,000 for 3 months.<p>Traders should always assume that an institution is taking the other side of every trade. Why? Because they are 95% of the volume in most markets. That is not yet true in Bitcoin, but it is true enough.<p>Whenever you find it easy to do something, then institutions are eager to do the opposite. The result is that you will typically lose money. “Good fill, bad trade.” This is a good example.<h3>Ledge at 10,000</h3><p>Whenever a market hits a price 4 or more times in a trading range, that price is a ledge. When there is a ledge on the daily or weekly charts, there is a high probability of 2 things. First, there is a 70% chance of a break beyond the ledge. Next, there is a 70% chance of a pullback through the ledge breakout point. That pullback usually comes within 10 – 20 bars, but it can come sooner or much later.<p>There was a ledge bottom at the 10,000 Big Round Number, which was psychological support. That is now resistance, but resistance is a magnet. Traders should expect at least a small test above 10,000. It will probably come within a couple months, but it might take many months.<p>Once the market gets back above 10,000, traders will then decide if there will be a continued bear trend or a resumption of the 2019 rally. If there is a rally, traders will see the break below 10,000 as a bear trap in a bull trend.<h3>Support between 6,400 and 7,500</h3><p>Whenever there is a reversal down from a buy climax (like in June), traders expect a test of the bottom of the most recent leg up. That began with the June 4 low of 7,442 and that is why I said that Bitcoin was going to fall below 7,500. This is despite the pundits claiming that the 4 sideways months was forming a base that would lead to 20,000, 50,000 or even a million.<p>Additionally, I said that the selloff might close the gap above the May 10 high. Also, the bulls might wait for it to test the April 25 low, which is the bottom of the 2nd leg up in the parabolic wedge rally. The gap above the May 10 high of 6,427 is another magnet within reach.<h3>Pullback in bull trend more likely than bear trend</h3><p>Reversals from wedges often go to the start of the wedge, which is the December low of 3,135. While possible, that would indicate that the bull trend is over. Unless it falls there, the selloff is still more likely a pullback from the 2018 rally. Therefore, there will probably be at least one more rally to above 10,000 within 3 – 6 months.<p>The bulls want the rally to be the resumption of the bull trend. However, that rally would be almost as likely to be a bull leg in a trading range that could last for years.<p>The bears want the June rally to be a lower high in a bear trend. They therefore want a selloff to below the bottom of the bull trend. That is the December 14, 2018 low of 3,135. If the bears achieve their goal, then Bitcoin will probably be in a trading range between 3,000 and 10,000 – 14,000 for several years.<h2><strong>Monthly S&amp;P500 Emini futures chart:</strong><br>Weak bull flag at top of 22 month trading range</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-SP500-monthly-candlestick-chart-with-weak-bull-flag.png\"><img loading=\"lazy\" src=\"2019-10-6-2.png\" alt=\"Emini S&amp;P500 monthly candlestick chart with weak bull flag\"></a></figure><p>The monthly S&amp;P500 Emini futures chart&nbsp;so far has a bear doji in October. This is now the 4th month in a tight trading range. That range is within a 7 month tight trading range and at the top of a 22 month trading range.<p>But these trading ranges are within a 10 year bull trend. Consequently, the odds still favor at least slightly higher prices.<p>Trading ranges represent an area of agreement. Therefore, breakouts usually do not get far before there is a reversal back into the range.<p>The bulls hope that the past 2 years will be like 2014-5. The breakout above that trading range had many consecutive bull bodies. When that happens, the odds favor another leg up.<p>Will there be a similar breakout this time? Probably not. The past 4 months have had small bodies and prominent tails. That is not how strong trends usually begin.<p>Furthermore, I have written many times about the oo (consecutive outside bars) in June and May. May was an outside down bar and then June went outside up. That was an oo bull flag. The breakout above an oo bull flag usually last at least 3 months, as this one has. But it typically does not begin a strong leg up. Therefore, if the bull trend resumes from here, the rally will probably fail within a few months.<h2><strong>Weekly S&amp;P500 Emini futures chart:</strong><br>Weak double bottom in bull channel</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-SP500-weekly-candlestick-chart-with-bull-flag.png\"><img loading=\"lazy\" src=\"2019-10-6-3.png\" alt=\"Emini S&amp;P500 weekly candlestick chart with bull flag\"></a></figure><p>The weekly S&amp;P500 Emini futures chart reversed up last week, but the candlestick had a bear body. That is a weak buy signal bar for this week. In addition, it was the 3rd consecutive bear bar and its high is at the top of a 4 month range within a 22 month range. That is not a strong context for a big rally.<p>I have been saying since June that there would probably be a new all-time high in September or October. Because of the nested trading ranges, it might take longer.<p>The past 2 months now have a lower high double top and a higher low double bottom. Traders now will wonder if there will be one more lower high over the next week or two, which would convert the 2 month range into a triangle.<p>Because the current trading range is also a bull channel after the 2019 strong rally, traders still expect higher prices. But unless the bulls get several consecutive bull bars, the upside breakout will probably not get very far.<h3>Weak head and shoulders top major trend reversal setup</h3><p>The bears see the September lower high as the right shoulder of a head and shoulders top. The May lower high is the left shoulder. They hope for a break below the 4 month range and then a measured move down to around the Christmas low.<p>When there is a strong sell signal bar, the bears have a 40% chance of a swing down. However, the sell signal bar 3 weeks ago was a doji, not a bear bar closing on its low. Also, the entry bar 2 weeks ago had a small body. Last week was the follow-through bar. While it had a bear body, it closed above its midpoint. It is therefore a reversal bar and a buy signal bar for next week.<p>As a result of these factors, the bears currently have only a 30% chance of a swing down. Their odds will go up if they can suddenly get one or two big bear bars closing near their lows. Without that, the odds favor a bull breakout. But there might be more sideways trading 1st.<h2><strong>Daily S&amp;P500 Emini futures chart:</strong><br>Strong reversal up from bear trap</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-SP500-daily-candlestick-chart-with-bear-trap-and-sell-climax.png\"><img loading=\"lazy\" src=\"2019-10-6-4.png\" alt=\"Emini S&amp;P500 daily candlestick chart with bear trap and sell climax\"></a></figure><p>The daily S&amp;P500 Emini futures chart sold off with 2 big bear bars this past week. However, it also reversed up sharply. Both bull bars had big bodies and closed near their highs.<p>The selloff was therefore a bear trap. A trap typically has at least 2 legs up. In addition, the reversal usually tests the top of the sell climax, which is the October 1 high of 2994.00. Consequently, the odds favor higher prices over the next week or two. Also, traders expect the 1st reversal down to last only 1 – 3 days. They will buy the pullback. Until then, most bears will not sell until they see at least a micro double top.<p>Since the weekly and monthly charts are in bull trends, the odds favor higher prices. Remember, on the daily chart, at least a small 2nd leg sideways to up is likely after the bear trap. But with the bull trends on the weekly and monthly charts, the Emini will probably make a new all-time high within a couple months.<h3>Ledge top was support</h3><p>Traders might remember that on September 3, I said that there was a 70% chance of a break above the 2946.00 ledge top. Also, I said that there was a 70% chance of a pullback after that breakout to below the top of that ledge. I expected the pullback within a few weeks. It came last week.<p>Friday closed on its high and back above the top of the August ledge. The Emini did what it typically does after a wedge top. It breaks out and then pulls back below the top of the ledge. Traders then look for the next pattern.<p>Because of the bear trap, the odds favor higher prices. But the daily chart has been sideways for 4 months. It might continue sideways for many more weeks before the bulls get their new high. It is important to understand that the new high is still likely within a month or two.<h3>October begins bullish season</h3><p>There is often a selloff in October. Extreme examples are the stock market crashes in 1929 and 1987. However, when there is a strong selloff in October, there is often a sharp reversal up, and it often lasts for many months. There is an adage, “Sell in May and go away.” What is unsaid is that you eventually look to buy again. Traders often look for a selloff in October to buy theoretically into the next May.<p>Is this folklore? There is some reality to it. This month’s reversal up is earlier than what is typical, but it is strong enough to be the likely bottom for at least the next month or two. It could last for many months.<hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-10-6"
    }
  ],
  "7": [
    {
      "data": [
        "<article class=\"post-93820 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini bear trap and bull trend reversal above ledge\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini bear trap and bull trend reversal above ledge</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-10-07T06:20:35-07:00\">October 7, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Monday October 7, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini sold off strongly below the top of the August ledge last week. It then reversed up strongly, as it often does after an October selloff. The bull trend reversal had 2 big bull bars closing near their highs. That means the selloff was a bear trap. A bear trap typically has at least a small 2nd leg sideways to up. Consequently, the bulls will look to buy the 1st – 3 day pullback.<p>Furthermore, a reversal up from a sell climax usually tests the top of the sell climax. Therefore, last Tuesday’s high of 2994.00 is a magnet above.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 8 points in the Globex session. Since Friday was a buy climax, there is only a 25% chance of another strong bull day today. Day traders should expect at least a couple hours of sideways to down trading that begins by the end of the 2nd hour.<p>Friday’s high was just above the 2946.00 top of the August ledge on the daily and weekly charts. Since that is such an important price, there is an increased chance of the Emini oscillating around it for a few days. This is especially true after a climactic 2 day rally.<h2>Friday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-small-pullback-bull-trend.png\"><img src=\"2019-10-7.png\" alt=\"Emini bear trap and bull trend reversal above ledge\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/EURUSD-weekly-Forex-chart-has-nested-wedge-bottom-and-buy-signal-bar.png\"><img loading=\"lazy\" src=\"2019-10-7-1.png\" alt=\"EURUSD weekly Forex chart has nested wedge bottom and buy signal bar\"></a></figure><p>The EURUSD weekly Forex chart has been in a bear channel for almost 2 years. There have been many reversal attempts, which always happens in trends. As expected, each was minor.<p>There is now a nested wedge bottom and a good buy signal bar. This will probably result in at least a few weeks of sideways to up trading. Since the channel down since June is tight, the reversal will probably be minor, like all of the others.<p>With the good buy signal bar last week, there will probably be enough short covering and bull scalping for a couple legs sideways to up trading. This week will probably go above last week’s high to trigger the buy signal.<p>The 1st targets are the 20 week EMA, the top of the smallest wedge bear channel, and the August 6 high of 1.1250, which is the start of the smallest wedge. All 3 are around the same price.<p>Can the weekly chart continue down to the measured move targets and the April 2017 gap without going above last week’s high? Probably not. The bears have not been strong enough to stop minor reversals up. Traders expect at least a 2 – 3 week bounce here or soon.<h3>Overnight EURUSD Forex trading</h3><p>There have been 4 consecutive bull days on the daily chart (not shown). So far, today is the 5th.<p>On the 5 minute chart, there was an early selloff overnight and then a bull trend reversal. But the rally has only been 35 pips. While the bars in the reversal up look good, they are relatively small.<p>There is enough momentum up for day traders to expect higher prices. At a minimum, they are trying to get above last week’s high of 1.0999. That is only 4 pips above today’s current high. The bulls will probably trigger the weekly buy signal today or tomorrow.<p>But will they get a strong surge above last week’s high and then a quick move up to the 1.1250 resistance? Since this reversal will probably be minor, like all of the others over the past 2 years, the bulls should expect to be disappointed. Many will take quick profits and the bears will scale in as the rally continues. Consequently, any rally over the next few weeks will probably look like a bear leg in s 2 year bear channel than the start of a bull trend on the daily chart.<p>Since higher prices are likely over the next 2 – 3 weeks, bulls will be more willing to buy selloffs. Also, the bear day traders will prefer to sell reversals down and take 10 – 20 pip profits.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-bear-trend-reversal.png\"><img loading=\"lazy\" src=\"2019-10-7-2.png\" alt=\"Emini bear trend reversal\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>While the Emini rallied on the open, the rally had many tails and bear bars. It was likely a bear leg in a trading range day. The Emini reversed down from above Friday’s high and tested the August ledge top and the open of the day.<p>Today is a sell signal bar for tomorrow. But after last week’s reversal up, there will probably be buyers below. The Emini might oscillate around the August ledge top for another day or two.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-10-7"
    }
  ],
  "8": [
    {
      "data": [
        "<article class=\"post-93822 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini stalled at August ledge top after bear trap\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini stalled at August ledge top after bear trap</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-10-08T06:20:50-07:00\">October 8, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Tuesday October 8, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>After 2 buy climax days, yesterday was likely to have a lot of trading range price action. The Emini rallied for a few hours and then reversed down below the open. Yesterday is therefore a sell signal bar for today. But after last week’s 2 strong bull days, there will probably be more buyers than sellers below yesterday’s low.<p>The Emini oscillated around the August ledge top today. That means it is still important. It might oscillate more around it for a few days. However, the odds favor at least a small 2nd leg up after last week’s bear trap and strong reversal up.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 18 points in the Globex session. Today will probably gap down. Since Friday gapped up, there would then be a 2 day island top after last week’s 2 day island bottom. Island tops and bottoms are minor reversal patterns. This is especially true when they come in the middle of a trading range, like the one on the daily chart.<p>With all of the trading range price action on the daily chart, day traders expect continued trading range price action on the 5 minute chart. That means that there will likely be at least one swing up and one swing down today. Also, there is an increased chance of several swings and a trading range day.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-bear-trend-reversal.png\"><img src=\"2019-10-8.png\" alt=\"Emini bear trend reversal\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/EURUSD-Forex-reversal-up-from-wedge-bear-channel.png\"><img loading=\"lazy\" src=\"2019-10-8-1.png\" alt=\"EURUSD Forex reversal up from wedge bear channel\"></a></figure><p>The EURUSD daily Forex chart has reversed up for 6 days from the bottom of a wedge bear channel. The rally so far lacks consecutive big bull bars closing near their highs. Consequently, the reversal is weak.<p>The EURUSD is now testing the 20 day EMA. The bears expect the rally to be like all of the other rallies over the past 2 years and form a lower high and then lead to a new low.<p>While they are probably right, there is no top yet. Furthermore, the prior lower highs are magnets above. Also, sometimes a 200 – 300 pip rally begins slowly like this and suddenly accelerates up.<p>Finally, the rally is so close to the top of the channel that the EURUSD will probably get there. It can get there by going sideways or up. The next resistance is the September 13 lower high, which is only about 100 pips above. It is therefore within reach.<p>Unless the bears get a strong sell signal bar or a big reversal down, the odds favor at least a test of the top of the bear channel. But even if the rally continues up to the September or August highs, traders expect the pattern of lower highs and lows to continue.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute chart has been in a 50 pip range for 4 days. Day traders are therefore looking for small reversals and scalping for 10 pips.<p>There is no sign that this is about to end. But 4 days is a long time for a tight trading range. Consequently, traders expect a breakout this week.<p>The bars on the daily chart are small and have prominent tails. Also, there have been many reversals over the past month. Therefore, a breakout on the 5 minute chart will probably not get very far. Until there is a strong breakout up or down, day traders will continue to scalp.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><img loading=\"lazy\" src=\"2019-10-8-2.png\" alt=\"Emini bear trend reversal day and wedge top\"></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini gapped down and created a 2 day island top. After a reversal up to a new high today, the Emini reversed down to a new low. It closed on its low, erasing much of last week’s rally.<p>The bulls need a reversal up and a buy signal bar tomorrow. If not, then the 2 day rally will have been simply a pullback from last week’s selloff.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-10-8"
    }
  ],
  "9": [
    {
      "data": [
        "<article class=\"post-93824 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini October island top after island bottom\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini October island top after island bottom</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-10-09T06:20:06-07:00\">October 9, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Wednesday October 9, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday gapped down and formed a 2 day island top on the daily chart. It closed on its low and therefore erased much of last week’s island bottom and rally.<p>The bulls need a rally today to create a strong buy signal bar. If the bears instead get another bear day, traders will see last week’s rally as simply a pullback from last week’s selloff.<p>It is important to pay attention to context. On the daily chart, look to the left. The Emini is now in the August trading range where there were many big legs up and down. The past 2 weeks are duplicating this price action. Traders see the Emini as again in Breakout Mode.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 26 points in the Globex session. It will therefore gap far above yesterday’s close and erase much of yesterday’s late selloff.<p>Since the odds favor a 2nd leg up on the daily chart, there is an increased chance of a bull trend day today. Also, a big gap up today would reduce the chance of a big bear day, which the bears need to regain control.<p>The Emini has had several big moves up and down over the past week. That is trading range price action. It increases the chance of reversals on the 5 minute chart. Monday and yesterday had rallies that reversed down, and yesterday had an early selloff that reversed up. Day traders will be ready for more reversals again today.<p>However, the legs up and down have been big enough for swing trading on the 5 minute chart, and the odds still favor a test of Monday’s high within a few days.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-bear-trend-reversal-day-and-wedge-top.png\"><img src=\"2019-10-9.png\" alt=\"Emini bear trend reversal day and wedge top\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/EURUSD-Forex-weak-bull-trend-reversal-at-bottom-of-wedge-bear-channel.png\"><img loading=\"lazy\" src=\"2019-10-9-1.png\" alt=\"EURUSD Forex weak bull trend reversal at bottom of wedge bear channel\"></a></figure><p>The EURUSD daily Forex chart has been sideways in a tight trading range for 5 days. The bulls want a 2nd leg up from last week’s reversal up from the bottom of the bear channel. Their minimum goal is a test of the top of the channel.<p>Since that is only 30 pips above today’s high, the should achieve that goal this week. When the market gets close to an important magnet, it usually cannot escape the magnetic pull. The test can come from either a small rally or by another couple days of sideways trading.<p>Because the EURUSD daily and weekly charts have been in a weak bear channel for about 2 years, traders expect a lot of trading range price action. That means markets typically go beyond support or resistance before reversing. Also, this 2 week rally has been smaller than most other rallies. Traders should expect a test of higher resistance, like the September 3 lower high of 1.1110 before there is another new low.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart rallied 35 pips early in the European session. It has been sideways for 5 hours. This is probably going to be a bull flag. Traders should expect at least a small 2nd leg up.<p>However, it is now near the top of the 5 day tight trading range. That means it is around a price level where it has turned down many times over the past week. Consequently, the 2nd leg up might be small. This is true even though the two week weak rally will likely go at least another 30 pips above today’s high within a few days.<p>When a rally tests resistance and there is other resistance not far above, it usually breaks through the 1st level. As a result, the rally will probably continue up for another 100 pips at some point in the next couple weeks.<p>But the bulls need a strong breakout above the 5 day tight trading range. Until they get it, day traders will continue to scalp. Since the biggest pullback in the past 10 hours has only been 15 pips, day traders are mostly only looking to buy. They will not sell until there is a clear top or a strong reversal down.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Trending-Trading-range-day.png\"><img loading=\"lazy\" src=\"2019-10-9-2.png\" alt=\"Trending Trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini formed a bull trending trading range today. It sold off into the close and formed a bull doji bar on the daily chart. Today is therefore a weak buy signal bar for tomorrow.<p>The bulls see the 2 day selloff as a pullback from last week’s reversal up from a bear trap. But this week’s selloff was deep enough to make traders wonder if the rally was a trap as well. The bulls argument is still slightly stronger.<p>The past 3 days were trading range days. Also, the Emini is back within the August trading range where there were many abrupt reversals. Until there is a clear buy or sell setup or strong breakout up or down, traders will continue to take quick profits and bet on more trading range price action.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-10-9"
    }
  ],
  "10": [
    {
      "data": [
        "<article class=\"post-93826 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini in Breakout Mode and back in August trading range\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini in Breakout Mode and back in August trading range</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-10-10T06:20:33-07:00\">October 10, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Thursday October 10, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini is back in the August trading range and it is again having abrupt big reversals up and down. Yesterday reversed Tuesday’s selloff. But since it was only a bull doji bar, it is a weak buy signal bar for today.<p>After 2 big down days and 3 trading range days, traders expect more uncertainty. That means more trading range price action on the daily and 5 minute charts.<p>This is a Breakout Mode situation, which means that the bulls and bears are balanced. When that is the case, there are always both reasonable buy and sell setups, and each has about the same probability.<p>The bears see last week’s rally as a pullback from last week’s selloff. The bulls see this week’s selloff as a pullback from last week’s rally. Until there is a sustained move up or down, traders will take quick profits and look for reversals.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 5 points in the Globex session. However, it sold off 40 points at the start of the session and then reversed up strongly over the next couple of hours. It has been going sideways over the past 10 hours.<p>This is consistent with what I have been saying all week. The Emini is back in the August trading range where there were many violent reversals. It is now at the same price and behaving the same way. Traders are looking for reversals, even when there is a strong move up or down.<p>The day session will probably open in the middle of yesterday’s range. Less likely, there will be a gap up. That would create a 2 day island bottom.<p>It does not matter. Day traders have been looking for an early trend and then a late reversal over the past week. The tails above and below the bars on the daily chart are a reflection of that.<p>The trends up and down have been big enough for swing trading. But each of the past 3 days had at least one reversal.<p>Day traders today will again be quick to exit a trend and take an opposite position on a reversal. This is a musical chairs situation. Everyone knows that one of these days, there will not be a reversal and the trend will last all day. Until then, day traders will be ready for a 2nd, opposite trend every day.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Trending-Trading-range-day.png\"><img src=\"2019-10-10.png\" alt=\"Trending Trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/EURUSD-Forex-breakout-above-top-of-wedge-bear-channel.png\"><img loading=\"lazy\" src=\"2019-10-10-1.png\" alt=\"EURUSD Forex breakout above top of wedge bear channel\"></a></figure><p>The EURUSD daily Forex chart broke above the top of the wedge bear channel overnight. This was likely since it was not far above the October 1 low. The rally will probably continue up to the September 13 high.<p>The wedge bottom on the daily chart is a micro wedge bottom on the weekly chart (not shown). That will probably lead to at least 2 small legs up on that timeframe. Consequently, the small 2 legs up on the daily chart will probably be a complex 1st leg up. That makes the rally likely to last at least a few more weeks. Traders expect sideways to up to at least the September 13 high.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute chart broke out to the upside early in the European session. While it has spent a lot of time going sideways since then, the pullbacks have only been 10 pips. Therefore, day traders are only looking to buy.<p>The lack of progress to the upside means that they are now buying and scalping. This is a Small Pullback Bull Trend. Day traders will only look to buy until there is a 20 – 30 pip pullback.<p>At that point, they will also start to sell for scalps. They will look to sell reversals down for 10 pip scalps. But since the daily and weekly chart will probably work higher over the next few weeks, it will be easier for day traders to make money buying pullbacks than selling rallies.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p>I will post chart after the close.<figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-bull-trend-from-the-open-then-final-bull-flag.png\"><img loading=\"lazy\" src=\"2019-10-10-2.png\" alt=\"Emini bull trend from the open then final bull flag\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini rallied strongly on the open in a Bull Trend From The Open. The buy climax reversed down to the Final Bull Flag and the Emini entered a trading range for the rest of the day.<p>This was the 4th day this week with a strong reversal. Traders therefore will expect at least one reversal tomorrow. With all of the reversals this week, the odds are against a strong trend day up or down tomorrow.<p>After 3 weeks with bear bodies on the weekly chart, this week will probably have a bull body. That is because the weekly chart is in a trading range, and 3 consecutive bear bars is a little extreme.<p>The Emini tomorrow will probably get drawn to the 2941.50 open of the week after 11 am PST tomorrow, and both tomorrow and the week will likely close at least 1 tick above the week’s open.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-10-10"
    }
  ],
  "11": [
    {
      "data": [
        "<article class=\"post-93828 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini breaking above 4 week bear channel after bear trap\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini breaking above 4 week bear channel after bear trap</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-10-11T06:20:43-07:00\">October 11, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Friday October 11, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini in the Globex session is up 28 points. Today will gap above the 4 week bear channel and possibly above the earlier high of the week.<p>Last week’s reversal up from a bear trap made at least a small 2nd leg up likely. Today is that 2nd leg. The bulls want the rally to continue up to a new high. Their minimum goal was a test of the top of the first leg up. That was last Monday’s high and they will likely achieve that on the open. Next, the want a test of last week’s sell climax high. That is the October 1st high of 2994.00.<h3>Overnight Emini Globex trading</h3><p>The Emini today will gap above yesterday’s high and possibly Monday’s high. A big gap up increases the chance of a trend day. The trend could be up or down, but a big gap up makes a bull trend more likely than a bear trend.<p>When there is a big gap up, the Emini is far above the EMA. Traders do not like to pay a lot more than the average price. Consequently, a big gap up usually has a trading range open for the first hour or so.<p>The bears want a double top or wedge rally, hoping for an early high of the day. However, the bulls will look to buy a reversal up from a double bottom or wedge bottom near the EMA.<p>It is important to remember that every day this week had at least one reversal. While there is an increased chance of a trend day, day traders will be prepared for reversal in the middle of the day or late in the day.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><img src=\"2019-10-11.png\" alt=\"Emini bull trend from the open then final bull flag\"></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/EURUSD-Forex-breakout-above-wedge-bottom-bear-channel.png\"><img loading=\"lazy\" src=\"2019-10-11-1.png\" alt=\"EURUSD Forex breakout above wedge bottom bear channel\"></a></figure><p>The EURUSD daily Forex chart broke above the 4 month wedge bear channel yesterday, but closed below the bear trend line. The bull breakout continued overnight. Since there is a micro wedge bottom with a good buy signal bar on the weekly chart (not shown), the EURUSD will probably continue sideways to up for a few weeks. This is true even if there is a pullback to the October 8 minor higher low first<p>On the daily chart, the bars are not big and most have tails on top. This is not how a bull trend typically looks. Therefore, the rally is probably going to be a bull leg in the bear channel, like all of the other rallies over the past year. Traders will look for it to last a few weeks, test one of the prior lower highs, and then reverse down to a new low. Since they expect it to continue through October, they will buy pullbacks.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart rallied 60 pips over the past 4 hours. It broke above yesterday’s high, and today will probably close above the 4 month bear trend line. The bulls would like today to close on its high. That would increase the chance of higher prices next week.<p>Also, today is Friday and this week is the entry bar for the wedge bottom on the weekly chart (not shown). A close on the high of this week’s candle would further help the bulls. Their minimum target is the 20 week EMA, which is about 50 pips above today’s current high.<p>The overnight rally was parabolic, and the bears got a 25 pip pullback over the past hour. That profit taking by the bulls will probably lead to a trading range for the remainder of the day.<p>The bulls will buy pullbacks and take profits near the high. They want the day and week to close on the high.<p>However, the bears will sell rallies to around the day’s high. They would like the day to close below the support of yesterday’s high. To weaken this week’s bar on the weekly chart, the bears would need today to close on its low. That is not likely.<p>Consequently, today will either be in a trading range for the remainder of the day, or, less likely, it continue the overnight bull trend up to the 20 week EMA at above 1.1110.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-trading-range-day.png\"><img loading=\"lazy\" src=\"2019-10-11-2.png\" alt=\"Emini trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini gapped up and rallied in a Bull Trend From The Open. However, the rally stopped exactly at last week’s high, which was the top of the sell climax on the daily chart. After reversing down to a new low, the Emini then entered a trading range for the remainder of the day. With the collapse into the close, the day closed near the open. Like every day this week, it had at least one reversal (today had 3).<p>This week is a buy signal bar on the weekly chart, but after 3 bear bars, it is a weak setup. Also, the Emini is at the top of a 4 month trading range within a 22 month trading range. This is weak context for a rally, even though the odds favor an eventual new high.<p>Today had a couple instances when the Emini moved 5 or more points in 1 second. There were many other examples this week. This is very unusual behavior and it increases the chance of a big sustained move within the next week or two. If so, down is more likely than up. It increases the chance of a test of the 2700 – 2800 area by the end of the month.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-10-11"
    }
  ],
  "12": [
    {
      "data": [
        "<article class=\"post-93832 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini extreme intraday volatility increases chance of October big move\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini extreme intraday volatility increases chance of October big move</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-10-12T00:30:32-07:00\">October 12, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Market Overview: Weekend Market Update</h2><p>The<strong>Emini</strong>has been sideways for 4 months. Traders expect an eventual bull breakout because of the bull trends on the weekly and monthly charts.<p>The 30 year Treasury<strong>bond futures</strong>market had a buy climax in August. It will probably be sideways for at least several more weeks.<p>The<strong>EURUSD</strong>weekly Forex chart is reversing up from the bottom of nested wedge bear channels. This should continue for several more weeks, but the rally will probably lead to another lower high.<h2><strong>30 year Treasury bond futures market:</strong><br>Developing trading range after extreme buy climax</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/30-year-treasury-bond-futures-weekly-candlestick-chart-has-buy-climax-and-double-top.png\"><img loading=\"lazy\" src=\"2019-10-12.png\" alt=\"30 year treasury bond futures weekly candlestick chart has buy climax and double top\"></a></figure><p>The 30 year Treasury bond futures weekly chart reversed down strongly in September after a buy climax in August. Big Up, Big Down typically creates Big Confusion. Since confusion is a hallmark of a trading range, traders should expect more sideways trading. The rally of the past 3 weeks tested the August high, but failed. This week reversed back down.<p>While the bulls regained most of the August loss, they have been unable to break to a new high. When there is a surprising strong selloff from a buy climax, traders expect at least a small 2nd leg sideways to down. This week is the start of that leg.<h3>Surprises trap traders in and out</h3><p>Why do surprises trap traders? Because a surprise means a low probably event took place. That means many traders were on the wrong side. They used this rally to fix their positions.<p>The trapped bulls who bought at the August high were relieved to be able to exit around breakeven. That means there were bulls selling the rally. Other bulls bought the selloff in early September, expecting the reversal down to be minor. They now expect a trading range and therefore took profits around the top of the range (currently, the August high).<p>Bears are always looking to sell. Many missed the August 28 short and therefore were trapped out. They know that bulls would sell a bounce to around the August high. Consequently, the bears expected at least a small pullback from the bulls exiting near the August high. They sold as well.<h3>Buy zone is near the September low</h3><p>There are probably enough bulls and bears selling around the August high to limit the upside near-term. The bulls want to buy again, but since the weekly chart is now probably evolving into a trading range, the bulls want to buy at support. Support is around the September 13 low and the July 12 low at the bottom of the August buy climax.<p>The September 13 low is the neckline of the August/September double top. But since a trading range is likely, the bears will probably not get a measured move down. Instead, there will probably be another bounce from the support zone.<h2><strong>EURUSD weekly Forex chart:</strong><br>Weak reversal up from bottom of nested wedge bear channels</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/EURUSD-weekly-Forex-candlestick-chart-has-minor-wedge-bottom.png\"><img loading=\"lazy\" src=\"2019-10-12-1.png\" alt=\"EURUSD weekly Forex candlestick chart has minor wedge bottom\"></a></figure><p>There is a nested wedge bottom on the EURUSD weekly Forex chart. Also, last week was a bull bar closing near its high, making it a buy signal bar. It was a reversal up from the bottom of the wedge bear channels.<p>This week triggered the buy signal by trading above last week’s high. This week was the entry bar and it had a bull body. The bear rally should reach the 20 week EMA and possibly the top of the bear channel over the next few weeks.<h3>Reversal up in tight bear channel is usually minor</h3><p>Even if a strong reversal up develops over the next few weeks, it will probably be minor. There are several reasons for this. First, the 2 year bear channel is tight. Traders expect that the 1st breakout above a tight bear channel will be minor. That means it would form a bear flag or lead to a small trading range, and not a bull trend.<p>Next, look to the left. All of the many prior reversals over the past 2 years formed lower highs and led to new lows.<p>Finally, there are 2 measured move targets near 1.08. Also, there is a gap there as well. That makes 1.08 a magnet below.<h2><strong>Monthly S&amp;P500 Emini futures chart:</strong><br>4 month tight trading range at top of 22 month trading range</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-monthly-candlestick-chart-has-bear-doji-in-tight-trading-range.png\"><img loading=\"lazy\" src=\"2019-10-12-2.png\" alt=\"Emini monthly candlestick chart has bear doji in tight trading range\"></a></figure><p>The candlestick on the monthly S&amp;P500 Emini futures chart&nbsp;so far this month is a small bear doji. With the strong reversal up over the past 2 weeks, this month might go above last month’s high. This month would then be an outside up month. That would increase the chance of higher prices in November.<p>But the Emini is at the top of its 22 month trading range. It has been in a tight trading range for 7 months. That range has been particularly tight for 4 months. This is a Breakout Mode pattern. Since these nested trading ranges are within a 10 year bull trend, the odds eventually favor at least slightly higher prices.<p>Will the bull breakout reach a 700 point measured move up based on the height of the 22 month range? Probably not. Ten years is more than 100 bars and that is a long time for a strong bull trend. When there is a trading range late in a bull trend, it typically becomes the Final Bull Flag. That means the bull breakout usually fails after 5 – 10 bars (here, months), and then the Emini returns to the trading range. Traders would then expect the selloff to test the bottom of the range. A Final Bull Flag reversal has a 40% chance of leading to a bear trend and not just a test of the bottom of the bull flag.<p>The 22 month trading range is also an Expanding Triangle top. But there is no good sell signal bar nor strong reversal down yet. Consequently, traders correctly continue to expect a new high within a few months.<h2><strong>Weekly S&amp;P500 Emini futures chart:</strong><br>Small bull bar after 3 bear bars</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-weekly-candlestick-chart-in-breakout-mode-1.png\"><img loading=\"lazy\" src=\"2019-10-12-3.png\" alt=\"Emini weekly candlestick chart in breakout mode\"></a></figure><p>The weekly S&amp;P500 Emini futures chart is in the middle of 4 month trading range. September formed a lower high double top with July. Last week’s low is a higher low double bottom with the early August low.<p>When there is both a double bottom and a double top in a trading range, the chart is in Breakout Mode. Traders typically expect that the chance of a bear breakout to be about the same as for a bull breakout.<p>Here, there have been higher lows all year and no lower lows. Also, there have been conspicuous tails below the bars over the past month. Traders are buying selloffs. These factors make a bull breakout more likely.<p>While this week was a bull candlestick, it followed 3 consecutive bear bars. That reduces the chance that this week’s rally will continue straight up to a new high. But if next week is also a bull bar closing on its high, the bulls will probably get their new high by the end of the month.<h2><strong>Daily S&amp;P500 Emini futures chart:</strong><br>Emini 2nd leg up from October bear trap</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-daily-candlestick-chart-in-breakout-mode.png\"><img loading=\"lazy\" src=\"2019-10-12-4.png\" alt=\"Emini daily candlestick chart in breakout mode\"></a></figure><p>The daily S&amp;P500 Emini futures chart on Friday broke above the 4 week bear channel. But the close near the low and the double top with last week’s sell climax high reduce the chance of an immediate strong breakout to a new high. This is trading range price action and it makes some sideways trading likely next week.<p>There have been several reversals over the past 2 weeks. The Emini has been back in the August trading range for the past 2 weeks. In August, there were dramatic reversals for almost the entire month. Ultimately, the bulls got a breakout above that range.<p>On Friday, the bulls again broke above that August trading range. If the bulls get more bull trend bars next week, the breakout will be successful. They they will try for a new all-time high.<p>Since June, I have been saying that the bulls would probably get their new high in September or October. They are now trying again.<p>However, the Emini is still in a 4 month trading range between 2800 and 3000. Until there is a breakout, there is no breakout. The bull trend on the higher time frames helps the bulls. Also, the strong reversal up from the bear trap last week helps as well.<p>But the lower high in September is good for the bears. So is the expanding triangle top on the weekly chart. They will try to stop this rally around the September lower high just above 3000.<p>If the bulls get several bull bars closing near their highs next week, the rally will probably continue up to a new high. If instead the bull bars have prominent tails or there are 2 or more bear bars, the Emini will probably stay sideways for at least another week.<h3>What about China?</h3><p>I trade based on chart patterns and not news. However, sometimes the news can overwhelm the patterns and create a surprisingly strong breakout up or down.<p>The market has been waiting a long time for a trade deal with China. A partial agreement might come over the weekend. That could lead to a big gap up or down next week.<p>No one knows how much has already been priced into the market. It is also impossible to know if the market will see a deal as bullish or bearish. Finally, the initial reaction could be wrong. A big gap up or down could quickly reverse.<p>Traders have to be ready for anything, and they should trade in the direction of strength. Do not waste time trying to analyze the news. Just trade what the charts are doing. They show the consensus opinion of the institutions. Your opinion or the opinion of some TV scholar is irrelevant.<h3>Emini extreme intraday volatility increases chance of October big move</h3><figure class=\"wp-block-image\"><img loading=\"lazy\" src=\"2019-10-12-5.png\" alt=\"Emini extreme volatility\"></figure><p>Anyone watching the Emini intraday this week was struck by several unusually big, fast moves. The chart above shows 2 examples from Friday. That is a 5 minute chart of the Emini. The 2 inserts are 1 minute charts that show what took place during the two 5 minute bars that I highlighted.<p>It is extremely unusual for the Emini to move 5 or more points in 1 second. Yet, this happened many times this week.<p>What does it mean? First, it means some firms quickly made a lot of money and others lost. The losing firms will change their algorithms to prevent this from continuing to happen. That will prevent more of these moves near-term.<p>However, surprises breed other surprises. Each of the huge moves this week reversed. Traders therefore expect future ones to reverse as well.<p>Whenever something is obviously likely, it is not as likely as it appears. What would happen if the 5 point selloff in 1 second was followed by another and then another? We could see a Flash Crash, like on May 6, 2010. The Emini fell almost 9% in 23 minutes. That would be about 250 points today.<p>While the odds are against it, traders should not dismiss something unusual as an irrelevant outlier. Everything matters, and the market might be telling us to expect something big in the next few weeks.<hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-10-12"
    }
  ],
  "14": [
    {
      "data": [
        "<article class=\"post-93830 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini weekly buy signal bar but top of trading range\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weekly buy signal bar but top of trading range</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-10-14T06:20:52-07:00\">October 14, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Monday October 14, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Last week was a bull candlestick on the weekly chart. It is therefore a buy signal bar for this week. But the prior 3 weeks had bear bodies and the chart has been sideways for months. Also, Friday sold off into the close. Consequently, the context is not strong for the bulls.<p>The Emini had a bull trend reversal 2 weeks ago after a bear trap. Friday was the 2nd leg up, which was the minimum goal for the bulls.<p>Friday formed a perfect double top with the high from the week before. That high was the top of the sell climax, which means it was a logical target.<p>Where does the Emini go from here? We need more information. The Emini is in the top half of a 4 month trading range between 2800 and just above 3000. Since the monthly charts is in a bull trend, the probability favors an eventual bull breakout. But until there is a breakout, there is no breakout. Traders are continuing to bet on reversals.<p>It is important to not discount the extreme brief moves up and down last week. There were several times when the Emini moved 5 or more points in 1 second. This increases the chance of a quick move down to 2700 – 2800 in October.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 7 points in the Globex session. It is near Friday’s low. Friday was a reversal bar down and a 2nd leg up. It is therefore a Low 2 sell signal bar. If today trades below Friday’s low, it will trigger the sell signal.<p>However, Friday had a bull body and it is still in the reversal up from the sell climax 2 weeks ago. There might be more buyers than sellers below Friday’s low.<p>This is especially true since last week is a buy signal bar for this week on the weekly chart. But last week had a prominent tail on top. There might be more sellers than buyers above last week’s high. Also, last week’s range was big and it was an inside bar. That increases the chance that this week will stay within last week’s range.<p>When there is a buy signal on the daily chart, a sell signal on the weekly chart, and lots of reversal days, there is confusion. That increases the chance of at least one trend reversal today and more trading range price action. Remember, every day last week had at least one swing up and one swing down.<h2>Friday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-trading-range-day.png\"><img src=\"2019-10-14.png\" alt=\"Emini trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/EURUSD-Forex-bull-leg-in-bear-channel.png\"><img loading=\"lazy\" src=\"2019-10-14-1.png\" alt=\"EURUSD Forex bull leg in bear channel\"></a></figure><p>The EURUSD daily Forex chart has rallied for the past 2 weeks from the bottom of its 2 yearlong bear channel. The rally lacks consecutive big bull bars closing on their highs. In additions, the bars have prominent tails. Consequently, this rally is similar to all the other reversals up. Traders assume that it will be like the others and ultimately fail.<p>Bear channels often spend 20 – 50 bars within trading ranges. The past 7 weeks is an example. The top of the current trading range is the September 13 high. This rally will probably get there within a couple weeks, even if it tests the September 3 and 12 lows first. The rally might even continue up to the August or June highs.<p>But unless the bulls begin to get consecutive big bull bars closing on their highs, there will probably be at least one more new low in the channel. That is especially true since there is a gap and 2 measured move targets down around 1.08, which is below the October low.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 30 pip range overnight. Today’s range so far is within Friday’s range. The market has lacked energy for over a month. Big moves up and down have been brief and not particularly big. As a result, day traders continue to look for 10 – 20 pip scalps.<p>That is what they have been doing overnight. Unless there is a surprisingly big breakout up or down today, they will continue to do that all day.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-tight-trading-range-day.png\"><img loading=\"lazy\" src=\"2019-10-14-2.png\" alt=\"Emini tight trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini traded below Friday’s low on the open. That triggered a minor sell signal on the daily chart. However, it then formed a small trading range day. The day closed near the open and formed a 2nd consecutive doji bar on the daily chart.<p>Every day for the past 6 days has had at least one reversal. There is no sign that this trading range price action is about to change.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-10-14"
    }
  ],
  "15": [
    {
      "data": [
        "<article class=\"post-93990 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini trading range price action in October so far\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini trading range price action in October so far</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-10-15T06:20:24-07:00\">October 15, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Tuesday October 15, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday traded below Friday’s low, which triggered a minor sell signal on the daily chart. Since yesterday was a small trading range day, it was a weak entry bar for the bears.<p>It was the 2nd consecutive doji bar on the daily chart. The bears need follow-through selling today to convince traders that last week’s rally has ended.<p>Yesterday was a pullback in a 2 week bull trend. It is therefore a buy signal bar for today. Since it was only a small bull doji and Friday was a doji, it is a weak buy setup.<p>The bulls also have a weak buy signal bar last week on the weekly chart. The bulls need a rally above last week’s high to trigger the buy. But after 3 bear weeks, there will probably be sellers not far above last week’s high.<p>The Emini is in the middle of a 4 month trading range. Every day for over a week has had at least one reversal. Yesterday was a small trading range day. Traders expect more trading range price action again today.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 8 points in the Globex session. It might gap above yesterday’s high on today’s open. That would trigger the High 1 bull flag buy signal on the daily chart.<p>But a small gap up after a day-long tight trading range is not especially bullish. The bulls need consecutive big bull bars closing near their highs to make traders believe that today will be a bull trend day.<p>If today goes above yesterday’s high, the bears will try to get an early reversal down. Since yesterday’s range was small, they will try to create an outside down day. That would increase the chance of lower prices later this week.<p>After a 2 week rally and without a clear top, the odds favor at least slightly higher prices. But the past 6 days all have had at least one reversal. Therefore day traders will expect more trading range price action again today unless they see a strong move up or down in the 1st hour or so.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-tight-trading-range-day.png\"><img src=\"2019-10-15.png\" alt=\"Emini tight trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/EURUSD-Forex-pullback-in-weak-rally.png\"><img loading=\"lazy\" src=\"2019-10-15-1.png\" alt=\"EURUSD Forex pullback in weak rally\"></a></figure><p>The EURUSD daily Forex chart had a bear inside bar yesterday in a weak rally. It was a Low 2 sell signal bar and a High 1 buy signal bar. Since it had a bear body and the rally was weak, there were likely to be sellers above its high.<p>Today traded above yesterday’s high and reversed down to below yesterday’s low. As a result, it triggered the buy signal, which so far has failed. In addition, it now has triggered the sell signal.<p>The daily chart has been in a bear channel for almost 2 years. Bear channels typically have occasional 20 – 50 bar trading ranges as the bear trend continues. The EURUSD daily Forex chart has been in a trading range for a month.<p>The bears hope that this 3 week rally has ended and the bear trend is resuming. But there is still room to the top of the trading range at the September high. It is therefore more likely that any selloff from here will last only a few days and form a higher low. Traders should expect a test above 1.1100 before the bears will consider aggressively selling again.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart went above yesterday’s high and then reversed down 50 pips to below yesterday’s low. Today is therefore an outside down day.<p>The selloff was a Bear Spike and Channel pattern. That typically converts into a trading range after 3 – 4 legs down. Fifteen minutes ago, there was a small reversal up from a 3rd leg down. The bulls have been unwilling to buy for 6 hours. If the small reversal up grows to 20 or more pips, the bulls will begin to buy pullbacks. They need some sign that the selling has ended and that the bear channel is evolving into a trading range.<p>However, the pattern and the day’s range are small. Consequently, today will probably not be a big trend day, despite selling off for 6 hours. More likely, the bear channel will stall, bulls will buy reversals up for 10 – 20 pip scalps, and the bears will sell 20 – 30 pip rallies for 10 – 20 pip scalps.<p>The key price today is yesterday’s low. If the bears can get today to close below yesterday’s low, the odds will favor lower prices over the next few days. Alternatively, if today closes near the open, the EURUSD will probably trade sideways for at least another day.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-bull-trend-from-the-open-and-then-parabolic-wedge-buy-climax-top.png\"><img loading=\"lazy\" src=\"2019-10-15-2.png\" alt=\"Emini bull trend from the open and then parabolic wedge buy climax top\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini rallied in a bull trend from the open today. It broke above the open of the month, last week’s high, and the 3,000 Big Round Number. It then formed a parabolic wedge buy climax and went sideways of the remainder of the day.<p>This area has been resistance for months. Therefore, the bulls will need several bull bars on the daily chart to convince traders that the bull trend is resuming. Without that, traders will expect limited upside and more sideways price action.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Intraday Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-10-15"
    }
  ],
  "16": [
    {
      "data": [
        "<article class=\"post-93992 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini triggered weak October High 1 bull flag buy signal\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini triggered weak October High 1 bull flag buy signal</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-10-16T06:20:20-07:00\">October 16, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Wednesday October 16, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini began yesterday with a bull trend from the open. This then evolved into a trading range after testing above 3,000, last week’s high, and the open of the month.<p>By going above last week’s high, the Emini triggered a weekly buy signal. However, there were 3 bear bars and then a tail on top of last week’s bar. This is a weak buy setup. Since the Emini is at the top of a 4 month range, the context is not strong either. Therefore, the upside will probably be limited over the next week.<p>Nothing has changed from what I have been saying since June. The odds still favor a new high, but it might not come in October. Currently, the Emini is stuck in a trading range and the bulls on the daily chart need several bull bars before traders will conclude that the bull trend is resuming.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 6 points on the Globex chart. By going above last week’s high, the Emini triggered a buy signal on the weekly chart.<p>Since the signal was weak, traders expect a pullback below last week’s high. If the Emini opens where it is currently trading, it will open very close to last week’s high. It might oscillate here today as traders decide whether the weekly buy signal will succeed or fail.<p>Yesterday was the 1st strong trend day in 7 days. Yet, the Emini spent most of yesterday in a trading range. Today will likely open within yesterday’s range. If so, day traders will expect at least some continuation of that range.<p>The 60 minute chart has not touched its 20 bar EMA in more than 20 bars and its 3 day rally is not particularly strong. That is somewhat unusual and it makes a touch likely today or tomorrow. That will probably limit the upside today.<p>Yesterday’s early rally was strong enough to make a big bear day unlikely today. That leaves trading range price action. Day traders will expect at least one swing up and one swing down today, like the Emini has been creating for the 6 days prior to yesterday.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-bull-trend-from-the-open-and-then-parabolic-wedge-buy-climax-top.png\"><img src=\"2019-10-16.png\" alt=\"Emini bull trend from the open and then parabolic wedge buy climax top\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/EURUSD-Forex-weak-High-1-bull-flag-in-bear-channel.png\"><img loading=\"lazy\" src=\"2019-10-16-1.png\" alt=\"EURUSD Forex weak High 1 bull flag in bear channel\"></a></figure><p>The EURUSD daily Forex chart had a pullback on Monday in a weak rally. When yesterday traded above Monday’s high, it triggered a weak High 1 bull flag buy signal.<p>The 3 week rally has lacked consecutive big bull bars closing near their highs. Most bars overlapped prior bars and had prominent tails. This looks like a bull leg in a month-long trading range and not the start of a bull trend.<p>The daily chart is still in its 2 year bear channel. Bear channels often have 1 – 2 month trading ranges like this. However, every prior trading range led to a new low. Because there are magnets below at around 1.08, this rally will probably be another bear rally.<p>Since there is a small wedge bottom on the weekly chart, the rally will probably have at least one more leg up after the 1st 1 – 2 week pullback. Consequently, traders expect a test of the September 13 high or even the August high within a month. This is true even if there is a test of the September double bottom first.<h3>Overnight EURUSD Forex trading</h3><p>Yesterday was an outside up day on the daily chart. But it was a doji bar in a 3 day tight trading range. That is not a strong buy setup.<p>Today traded above yesterday’s high and pulled back. The 5 minute chart has been in a 30 pip trading range around yesterday’s high. Since yesterday is not a strong buy setup on the daily chart, today will probably not be a big bull day.<p>Also, there is no sell setup and therefore today will probably not sell off. Day traders are expecting a continuation of the 3 day tight trading range. They will continue to look for small reversals and 10 pip scalps until there is a strong breakout up or down.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-trading-range-day-1.png\"><img loading=\"lazy\" src=\"2019-10-16-2.png\" alt=\"Emini trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>Today was a trading range day. The Emini rallied after a small double bottom on the open. It then sold off from a double top. The 60 minute chart had not touched its 20 bar EMA for about 25 bars, even though the 60 minute rally has not been strong. That EMA was a magnet below that limited today’s upside potential. The Emini will probably trade below it at some point tomorrow.<p>Today is an inside bar on the daily chart. It is therefore both a buy and sell signal bar. The bulls see a High 1 bull flag and the bears see a 3 week wedge rally. With 6 of the past 7 days having reversals, traders are not expecting a strong trend tomorrow.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\">Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-10-16"
    }
  ],
  "17": [
    {
      "data": [
        "<article class=\"post-93994 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini inside bar at top of 4 month trading range\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini inside bar at top of 4 month trading range</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-10-17T06:20:03-07:00\">October 17, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Thursday October 17, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday was a trading range day and a small inside day. The bulls see it as a High 1 bull flag buy signal bar. But the 3 week rally has had 3 pushes up. Consequently, yesterday is also a sell signal bar for a wedge rally.<p>With the Emini in a trading range for 4 months, neither signal will likely lead to a trend on the daily chart. Also, 6 of the past 7 days have had at least one reversal. Day traders will assume that today will be like those days and bet that any 2 – 3 hour trend will reverse.<p>The 3 week rally on the 60 minute chart has not been particularly strong. Yet, the Emini has not touched its 20 bar EMA in 30 bars. That is unusual. The Emini will probably pull back to the 60 minute EMA today or tomorrow. When the price action is not far above average, the price typically has to get back to average, at least briefly.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 9 points in the Globex session. It might therefore gap above yesterday’s high. The bulls want trend resumption up after Tuesday’s rally.<p>But 3,000 has been resistance for 6 months. Whenever it has been there, it has gone sideways. Also, most days over the past week have had trading range price action. Finally, today is the 3rd leg up in the past 5 days. There is therefore a small wedge rally, which usually attracts profit-takers. Consequently, today will probably not be a big trend day up or down. However, if there is a trend, up is more likely than down.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-trading-range-day-1.png\"><img src=\"2019-10-17.png\" alt=\"Emini trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/EURUSD-Forex-wedge-rally-in-trading-range.png\"><img loading=\"lazy\" src=\"2019-10-17-1.png\" alt=\"EURUSD Forex wedge rally in trading range\"></a></figure><p>The EURUSD daily Forex chart broke above the September 13 minor lower high overnight. It will likely test the August 6 lower high within a few weeks. The rally might continue up to the June 25 major lower high within a couple months.<p>Since the rally has 3 legs up and is testing resistance, traders expect a 2 week pullback to begin within a couple weeks. The bull channel is tight and therefore the 1st reversal down will probably form a higher low. Traders expect a 2nd leg up.<p>The bulls hope that the October rally is the end of the 2 year bear trend. That bear channel has gone on for a long time. Most bear channels end with a bull breakout.<p>However, there have been many rallies over the past 2 years. Each reversed down and led to a new low. Also, there is a gap and there are 2 measured move targets about 80 pips below the October low. Unless this rally gets a couple closes above the June 25 high, the odds are that this rally will fail before the end of the year and test that support. Traders will change their minds if the bulls get 2 closes above the June high.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart rallied in a parabolic wedge buy climax overnight to above the September 13 minor lower high. The rally is a buy vacuum test of resistance, which typically attracts profit takers. The 5 minute chart has been in a trading range for 4 hours around that September 13 high.<p>The bulls want the day to close on its high and far above that high. Traders would then expect higher prices tomorrow and next week. But after 3 legs up on the daily chart and a buy climax at resistance, the rally will probably stall for a few days. That means trading range price action.<p>Can the overnight bull trend resume? It might, but the 2 day rally has been extreme. The bulls will probably wait for more sideways bars before buying again.<p>What about a failed breakout above resistance and a reversal down from the 3 week wedge rally? Strong rallies usually have to go sideways for a few days before they can reverse. Therefore the probability of a bear trend reversal today is small.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-wedge-top-and-then-nested-wedge-bottom.png\"><img loading=\"lazy\" src=\"2019-10-17-2.png\" alt=\"Emini wedge top and then nested wedge bottom\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini gapped above yesterday’s high and 3000, but reversed down on the open. After a nested wedge bottom, it reversed up midday. It closed in the middle and was another trading range day.<p>There is now a 5 day wedge top on the daily chart. However, this week triggered a buy signal on the weekly chart. Conflicting signals typically result in sideways price action. Also, the Emini went sideways in July and September at this level. Consequently, it will probably be mostly sideways again tomorrow.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-10-17"
    }
  ],
  "18": [
    {
      "data": [
        "<article class=\"post-93996 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini small wedge top but weak weekly buy signal\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini small wedge top but weak weekly buy signal</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-10-18T06:20:09-07:00\">October 18, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Friday October 18, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini reversed down from above Tuesday’s high yesterday and formed a bear doji bar on the daily chart. It is now a weak sell signal bar for a 5 day wedge top. It is nested within a 2 week wedge top. However, the Emini is back in the July and September trading ranges around 3,000. That reduces the chance of a strong move up or down.<p>Today is Friday so weekly support and resistance can be important. This is especially true in the final hour. The most important prices are the all-time high, last week’s high, and the 3,000 Big Round Number.<p>Last week was a buy signal bar on the weekly chart. The bulls want this week to close far above last week’s high. That would increase the chance of higher prices next week.<p>The bears always want the opposite. They want a close below last week’s high. There are now 2 big bull bars on the weekly chart. The bears do not expect a selloff next week. However, if they can stop the rally for a week or two, they would then have a better chance of lower prices in November.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 2 points in the Globex session. It will therefore probably open within yesterday’s trading range. The minimum goals for the bulls are to have today’s weekly close be above last week’s high and above 3,000.<p>Even though there is a wedge top on the 60 minute chart, there has been very little energy for 3 days. That reduces the chance of a big bear day today.<p>I mentioned yesterday that the 60 minute chart has been above its EMA for a lot of bars. That makes it unusual, climactic, and unsustainable. Yet, the price action is not particularly strong. Either the price action has to get stronger or the price has to get weaker. More likely, the price will go sideways to down to the 60 minute EMA today or Monday. That limits the upside today.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-wedge-top-and-then-nested-wedge-bottom.png\"><img src=\"2019-10-18.png\" alt=\"Emini wedge top and then nested wedge bottom\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/EURUSD-Forex-Brexit-rally-to-bear-trend-line-and-lower-highs.png\"><img loading=\"lazy\" src=\"2019-10-18-1.png\" alt=\"EURUSD Forex Brexit rally to bear trend line and lower highs\"></a></figure><p>The EURUSD daily Forex chart rallied strongly this week to above the June bear trend line. It is now testing the bear trend line that began with the March 2018 high at the top of the bear trend. The rally is strong enough to continue up to the final bear trend line, which began a year ago. However, there might be a 2 week pullback first.<p>In addition to the bear trend lines, each of the lower highs in the 21 month bear trend are resistance. That makes them magnets. The June 25 1.1413 high is a major high and this trend reversal might get there in a few months.<p>However, the 1st reversal up from a tight bear channel typically is minor. The bulls need a test down and then a 2nd reversal up to make traders believe that the bear trend has ended.<p>The rally has had 3 pushes up and is therefore a wedge. That usually will attract profit takers. But there is no top yet. The bears will probably need at least a micro double top before there is a 2 week pullback.<p>Even though this rally might fail and the bear trend could continue down, it probably will not fall much below the April 2017 gap at around 1.08<h3>Overnight EURUSD Forex trading</h3><p>The 2 day rally continued overnight, but so far it has been weaker than it was over the past 2 days. The bulls would like the week to close in its high. That would increase the chance of higher prices next week.<p>They would also like the week to close above the 21 month bear trend line and above the August 26 high of 1.1164. However, just reaching the bear trend line is a major accomplishment. The bulls might be exhausted and wait for a pullback before buying aggressively again. A climactic rally usually attracts profit taking. That will probably limit today’s upside.<p>The overnight rally has been in s Small Pullback Bull trend. That reduces the chance of a strong selloff today. The best the bears will probably get is a transition into a trading range and then a few 10 pip scalps.<p>But since the overnight rally has had many small bars and it is at the bear trend line and just below the August 26 high, there might not be much more buying today. The bull trend will probably transition into a quiet trading range today. The bulls will probably begin to look to buy pullbacks instead of continuing to buy at the market.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-nested-wedge-sell-climax-in-broad-bear-channel.png\"><img loading=\"lazy\" src=\"2019-10-18-2.png\" alt=\"Emini nested wedge sell climax in broad bear channel\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini triggered a sell signal on the daily chart by trading below yesterday’s low. But like 8 of the past 9 days, it revered. It closed near the open. Today is now a buy signal bar for Monday.<p>However, it is the 3rd consecutive doji bar and therefore not a strong buy signal bar. Furthermore, 9 of the past 10 days have had at least one reversal. Consequently, traders will expect at least one reversal on Monday.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-10-18"
    }
  ],
  "19": [
    {
      "data": [
        "<article class=\"post-94000 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini October wedge rally testing July all time high\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini October wedge rally testing July all time high</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-10-19T00:30:12-07:00\">October 19, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Market Overview: Weekend Market Update</h2><p>The<strong>Emini</strong>is again stalling around 3,000, just below the all-time high. Traders need more information before they decide between a new high and a pullback. That increases the chance of more sideways trading next week.<p>The 30 year Treasury<strong>bond futures</strong>chart is near the bottom of a developing trading range after the August buy climax. It should bounce here or soon.<p>The<strong>EURUSD</strong>weekly chart is having its strongest rally since the bear trend began in February 2018. Traders expect higher prices and will buy the 1st 2 – 3 week pullback.<h2><strong>30 year Treasury bond weekly futures market:</strong><br>2nd leg down in developing trading range</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/30-year-treasury-bond-futures-chart-has-double-top-and-double-bottom.png\"><img loading=\"lazy\" src=\"2019-10-19.png\" alt=\"30 year treasury bond futures chart has double top and double bottom\"></a></figure><p>The 30 year Treasury bond weekly futures chart formed a doji bar this week after last week’s big bear bar. This is a lack of follow-through selling and it is consistent with a developing trading range.<p>There have been 2 reversals down and 1 up since the August parabolic wedge buy climax. The bears have a double top and the bulls now have a double bottom. That is a trading range.<p>While the chart is trying to reverse up, this week’s doji bar is a weak buy signal bar for next week. Therefore, there will probably be sellers not too far above this week’s high.<h3>Trading range after August parabolic wedge buy climax</h3><p>Traders expect the 2 month trading range to continue for at least a few more weeks. On the daily chart (not shown), there is a micro wedge bottom over the past 6 days. The bulls expect a bounce next week.<p>If the rally stalls over the next couple weeks, which is likely, there will be a triangle on the daily chart. That is a Breakout Mode pattern. That means that there is about a 50% chance of either a successful bull or bear breakout. Furthermore, there is a 50% chance that the 1st breakout up or down will fail and reverse.<p>Traders expect limited movement up or down and more trading range price action over the next few weeks. They are buying around the current level, betting on at least a 50% retracement of the 2 week selloff. Many will use a wide stop and scale in lower.<p>What about that double top and buy climax? The yearlong bull channel is tight. Also, the 3 week rally into early October was surprisingly strong. Most traders believe that the bears will need at least one more test up before they have a reasonable chance of a bear trend on the weekly chart. But if there are consecutive bear bars closing below the September low, the odds of a bear trend will go up.<h2><strong>EURUSD weekly Forex chart:</strong><br>Strong reversal up from nested wedge bottom</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/EURUSD-weekly-Forex-chart-has-strong-reversal-up-from-nested-wedge-bottom.png\"><img loading=\"lazy\" src=\"2019-10-19-1.png\" alt=\"EURUSD weekly Forex chart has strong reversal up from nested wedge bottom\"></a></figure><p>The EURUSD weekly Forex chart had a buy signal bar 3 weeks ago for a nested wedge bottom. This week was the 3rd week up and the size of the bodies has been increasing. The bulls are becoming more confident.<p>The bears want the rally to fail at the 20 week EMA. But the momentum up is strong. The rally will probably continue up to test the bear trend line. That is the top of the yearlong bear channel. It currently is around 1.1250. That is also around the August 6 minor lower high. Lower highs in a bear channel are resistance. They are therefore magnets when there is a reversal up.<p>A reversal up from a wedge bottom typically has at least 2 legs sideways to up. As a result, the bulls will buy the 1st 1 – 2 week pullback. Traders expect the weekly chart to be sideways to up for at least a few more weeks.<h3>Is this the start of a bull trend?</h3><p>Is this the end of the 2 year bear trend? The nested wedge bottom and reasonably strong reversal up are good for the bulls. This rally is a credible candidate for the start of an evolution into a trading range for a couple months.<p>But the bulls need to do more before traders believe that the bear trend has ended. At a minimum, they need a couple closes above the June 25 major lower high. If they achieve that, traders will conclude that the bear trend has evolved into either a trading range or a bull trend.<h3>What should traders expect over the next couple months?</h3><p>What happens in the meantime? Until the bulls clearly end the bear channel, the weekly chart is still in a bear trend. There are magnets below the October low at around 1.08. These are the gap above the April 21, 2017 high and 2 double top measured move projections in that area.<p>This rally is the 1st one since the 2018 high when the bulls have had 3 consecutive bull bars with big bodies and closing near their highs. That means the bulls are the strongest that they have been in 2 years.<p>But until there is a break above the June high, traders will assume that this rally is minor. That means either a bull leg in the bear trend or in a developing trading range. Because the 2 year bear channel is tight, the weekly chart will likely have to go sideways for several months before the bulls can create a bull trend reversal.<h3>A bear channel is a bull flag</h3><p>It is important to note that 75% of bear channels have bull breakouts. Traders should view every bear channel as a bull flag because that is how most behave. Consequently, traders are confident of a bull breakout at some point.<p>If the bulls finally succeed this time, the rally should continue up to the June 2019 major lower high of 1.1413. It might even reach the June 14, 2018 high of 1.1851 over the next several months. That was the start of the bear channel in the Spike and Channel bear trend that began on February 16, 2018. The spike was the 2 month bear breakout down to the May 29, 2018 low. The channel began with the 1st pullback up to the June 14, 2018 high.<p>When there is a breakout above the bear channel in a Spike and Channel bear trend, the rally typically tests the start of the channel. The market then usually pulls back then enters a trading range.<h2><strong>Monthly S&amp;P500 Emini futures chart:</strong><br>Testing all-time high</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-SP500-monthly-candlestick-chart-has-doji-bar-in-tight-trading-range-1.png\"><img loading=\"lazy\" src=\"2019-10-19-2.png\" alt=\"Emini S&amp;P500 monthly candlestick chart has doji bar in tight trading range\"></a></figure><p>The monthly S&amp;P500 Emini futures chart&nbsp;has a bull doji bar so far in October. It is at the top of its 4 month trading range, just below the all-time high. After trading below the September low, October reversed up and is now at the high of the month.<p>It is just below the September high. There are 2 weeks left to the month. If October goes above the September high, October will be an outside up month. That would increase the chance of higher prices in November. This is especially true if October closes above the September high.<h3>Probably only nominal new high</h3><p>Even though October is bullish and the monthly chart is in a bull trend, there will probably not be a big breakout from here. The past 4 months have been sideways around 3,000. That means the bulls and bears think 3,000 is a fair price. If the bulls break above, the rally might get pulled back to the fair price within a few bars (months).<p>Additionally, when July traded above June, it triggered an oo buy signal. May was an outside bar and June was a bigger outside bar. When a market breaks above consecutive outside bars (an oo pattern) late in a bull trend, the rally usually continues for a few months.<p>But the rally typically does not get very far before it gets drawn back to that area of agreement. The magnet is the 4 month tight trading range and the slightly lower April/May/June sideways bars. Consequently, traders will expect at least a minor reversal back to the tight trading range within a few months after breaking above it.<h3>Small chance of trading range for another year</h3><p>While the presidential election is more than a year away, the Emini might already be pricing in the result. If Trump remains president, traders might be relieved and feel more confident. That would make them more willing to buy stocks, which could lead to a rally.<p>Alternatively, if there is a new president, there will be uncertainty and some fear. There would probably be tax hikes and legislation that impedes business. The stock market might quickly sell off to the December 2018 bottom of the 22 month trading range.<p>Part of the reason for the 22 month trading range might be the uncertainty over the outcome of the 2020 election. If that is the case, the Emini might continue sideways up to the election, or until the outcome is more certain.<p>Since a new all-time high is likely within the next couple months, the top of the range would expand. But I gave several technical reasons why the breakout will probably not be big. If it is not big, all that the breakout would accomplish would be to nominally raise the top of the 22 month trading range.<h2><strong>Weekly S&amp;P500 Emini futures chart:</strong><br>Breaking above a weak High 1 bull flag</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-SP500-weekly-candlestick-chart-has-double-bottom-and-double-top-so-breakout-mode.png\"><img loading=\"lazy\" src=\"2019-10-19-3.png\" alt=\"Emini S&amp;P500 weekly candlestick chart has double bottom and double top so breakout mode\"></a></figure><p>The weekly S&amp;P500 Emini futures chart rallied strongly in 2019, but the breakout from January through May weakened and became a bull channel in June. The chart is still a bull trend and therefore traders expect higher prices. What traders do not know is how high.<p>This week rallied above last week’s high after a 4 week pullback. Last week was a High 1 bull flag buy signal bar. When this week went above last week’s high it triggered the buy signal.<p>I said last week that the setup was weak and that there might be more sellers than buyers above last week’s high. There were. This week closed below last week’s high.<h3>Bullish, but not yet very bullish</h3><p>There are several factors that reduced the bullishness of this week’s breakout. While last week had a bull body, it had a prominent tail on top. That hesitation made last week a less reliable buy signal bar.<p>That bar followed 3 weeks with bear bodies, which is a sign that the bears were in control for a long time. Those bear bars increase the chance that the bears will retake control within a couple weeks.<p>Also, the Emini is just below the all-time high. Ten of the past 14 weeks traded above the September 2018/July 2019 double top, but none has been able to break free. Until there is a breakout, there is no breakout.<p>The Emini has been sideways for 4 months and is now at the top of the range. If the bulls do not get a strong breakout to a new high within the next few weeks, many will be disappointed. Some will exit and look to buy again lower. If enough exit, there could be a test of the bottom of the 4 month range at around 2800.<p>Finally, I have written about the expanding triangle top many times. It is often a reversal pattern. There is still a 30% chance that the Emini will reverse down to the December low at some point the next 6 months<h2><strong>Daily S&amp;P500 Emini futures chart:</strong><br>Emini October wedge rally testing July all time high</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-SP500-daily-candlestick-chart-has-double-bottom-and-double-top-so-breakout-mode.png\"><img loading=\"lazy\" src=\"2019-10-19-4.png\" alt=\"Emini S&amp;P500 daily candlestick chart has double bottom and double top so breakout mode\"></a></figure><p>The daily S&amp;P500 Emini futures chart is in a 6 bar tight trading range. Five of the past 6 days were doji bars. Traders expect reversals every day or two. That lowers the probability for stop entry traders.<p>There is a 5 bar wedge top, but Friday’s reversal down was weak. Friday is now a High 1 bull flag buy signal bar for Monday. But it has a bear body and it is in a tight trading range. This is a weak buy setup.<p>The Emini will probably continue sideways early next week. Traders expect a new all-time high this month. If they do not get it, many bulls will exit and wait to buy again lower. As a result, if the rally continues to stall, traders will sell, expecting a leg down in the 4 month range.<p>If there is a selloff from here, there would be a 2nd lower high in the 4 month range. The pattern would then be a triangle. However, the chart is already in Breakout Mode, and creating a triangle will not changes things. Until there is a breakout, traders expect more sideways price action.<div id=\"InsiderTrading\"><h2>White House insider trading</h2></div><p>There is always going to be insider trading. William Cohan is a reporter for Vanity Fair and he wrote an article this week about some trading that he thinks might involve insider trading and the White House. He was on CNBC’s Fast Money on Thursday and discussed his findings.<p>He said that traders told him that there was a pattern of big orders being placed at the end of some days just before Trump made an announcement about the China trade deal. While not concluding that Trump or his people are trading illegally, he thinks that these trades need to be investigated. He gave 3 examples. I will discuss the 1st two.<p>He said that on June 28, “An investor or group of investors bought 420,000 S&amp;P Emini contracts minutes before the close.” He concluded that they probably made about $1.8 billion in profit over the next few days.<p>He also said that in the last 10 minutes of trading on August 23, “386,000 S&amp;P Emini contracts crossed the wire.” He said the profit was likely about $1.5 billion over the following days. His conclusion was that there might be a coordinated effort from illegally informed individuals to profit from Trump’s upcoming tweets.<h3>Fact check: Hyperbole</h3><p>I looked at the volume in the late rallies in his 1st two examples and I am unable to confirm his facts. He said that there were 420,000 contracts traded minutes before the close on June 28. But how many minutes? If you include the selloff and enough bars, you could get his 420,000 contracts. But if you only consider the rally into the close, there were considerably fewer contracts traded.<p>The same problem exists on August 23. If you count the volume for the bars in the rally, there were 338,000 contracts, not 386,000 contracts. And that is over 20 minutes, not 10 minutes.<p>There is another problem with his reporting. The average volume over the last 5 bars every day is 100,000 or more contracts. You have to assume that at least 100,000 contracts in both of his examples was from routine trading unrelated to insider trading. Also, maybe another 100,000 contracts was from algorithms reacting to the purported unusual trading volume. Therefore, the profit from the possible fraud is considerably less than he is saying. I assume he chose hyperbole to improve his brand. Maybe there will be a book or movie deal soon.<figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Vanity-Fair-William-Cohan-insider-trading.png\"><img loading=\"lazy\" src=\"2019-10-19-5.png\" alt=\"Vanity Fair William Cohan insider trading\"></a></figure><h3>Is insider trading possible?</h3><p>There might be 100 people who know that Trump will soon release a tweet on China and trade. Also, China knows what Trump will say as well. Are all of these people honest?<p>You know there is insider trading going on. There was under Obama and under every president. Take hundreds of very aggressive people with huge egos and inside information. Does anyone expect them all to be honest?<p>There are many ways someone can profit from insider trading. One common version is that the inside person sells the information to a trader. Another is that the inside person tells someone who places trades on the insider’s behalf.<p>These are sophisticated people and they do their insider trading in ways that are very difficult to discover. They can use shell corporations, overseas accounts, multiple middlemen, and related assets.<p>For example, a trader could use the information to buy a huge amount of stocks or futures on multiple foreign exchanges. That would immediately cause buying in the Emini from firms with algorithms that instantly arbitrage against moves around the world. The Emini volume would then be from firms simply arbitraging against some international move and not from insider trading.<h3>Conclusion: Yes, there is insider trading in the White House</h3><p>Cohan’s fundamental point is correct. People are probably illegally profiting from inside knowledge of Trump’s tweets before they are released. That type of illegal activity is true of every White House. And in Congress, and every governor’s office and every mayor’s office.<p>However, since he is not precise about his data and he is sensationalizing the obvious, I do not think that his examples are newsworthy. I am surprised that Vanity Fair and CNBC did not fact check his claims beforehand.<hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-10-19"
    }
  ],
  "21": [
    {
      "data": [
        "<article class=\"post-93998 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini weak High 1 bull flag buy signal bar\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weak High 1 bull flag buy signal bar</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-10-21T06:20:22-07:00\">October 21, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Monday October 21, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini traded below Thursday’s low on Friday and triggered a sell signal after a 5 day wedge top. Although the Emini sold off strongly, it reversed up midday and the day closed near the open. It is a High 1 bull flag buy signal bar for today.<p>It was also the 3rd consecutive doji bar on the daily chart. That increases the chance of more trading range price action today.<p>Finally, 9 of the past 10 days have had at least one reversal. Consequently, day traders will expect a reversal at some point today as well.<p>However, there are bull trends on all higher time frames and the Emini is just below the all-time high. There is at least a 50% chance of a new high within the next 1 – 3 weeks.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 13 points in the Globex session. It might gap above Friday’s high and the 3,000 Big Round Number. But if it does, the gap will probably be small. That lack of conviction is consistent with last week’s uncertainty and trading range price action.<p>Because the all-time high is always an important resistance level, there is an increased chance of either a strong rally or a strong reversal down. But most days for 2 weeks have had at least one reversal. Therefore, traders will expect at least one reversal at some point today.<h2>Friday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-nested-wedge-sell-climax-in-broad-bear-channel.png\"><img src=\"2019-10-21.png\" alt=\"Emini nested wedge sell climax in broad bear channel\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/EURUSD-Forex-strong-Brexit-rally-but-wedge-in-trading-range.png\"><img loading=\"lazy\" src=\"2019-10-21-1.png\" alt=\"EURUSD Forex strong Brexit rally but wedge in trading range\"></a></figure><p>The EURUSD daily Forex chart last week had 3 big bull trend days closing near their highs. This has been the strongest rally in the 21 month bear trend. It therefore has a 50% chance of ending the trend.<p>When a bear channel ends, the chart typically enters a protracted trading range. The first target is the June major lower high and then the September 2018 high, which was the start of the bear channel. If the bulls are successful at ending the bear trend, the chart will probably work sideways to up for many months.<p>As strong as last week was, the rally is now testing lower highs in the bear trend. Those are resistance levels. However, the EURUSD might the 13 month bear trend line before pulling back.<p>Also, the rally was surprisingly strong and has had 3 pushes up. It is therefore climactic. A buy climax usually begins to attract profit takers. Therefore, traders will expect a pullback within a week or two.<p>Because the rally has been so strong, the bears will probably need at least a micro double top before they can begin a 1 – 3 week pullback. But the bulls will buy again near the 20 day EMA, which would be about a 50% retracement. It would also be near last Wednesday’s buy climax low. A buy climax low is always a magnet.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart last night traded a little above Friday’s high, which was last week’s high, but pulled back. Since the daily and 60 minute charts are in buy climaxes and in a resistance zone, many bulls will soon take profits.<p>Last night’s rally to above last week’s high was only 30 pips tall. The EURUSD reversed down abruptly and it has been in a tight trading range for 4 hours. This will probably last all day. Day traders have been scalping and will probably continue to scalp for at least a couple days.<p>The bulls will then likely get one more brief push up. The bears expect it to fail and create a micro double top. Then traders will look for a 1 – 3 week pullback.<p>The buy climax makes a big bull day unlikely. But last week’s rally was strong and that makes a big bear day unlikely. Consequently, today will probably be a rest day for the exhausted bulls. Also, the bears typically will need a micro double top on the daily chart before they can get a pullback in a bull trend. That might come this week.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-weak-bull-channel.png\"><img loading=\"lazy\" src=\"2019-10-21-2.png\" alt=\"Emini weak bull channel\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>After a small wedge bull flag at the EMA on the open, the Emini rallied in a weak bull channel. Some channels spend most of the time sideways, and this was an example.<p>Today was a weak entry bar on the daily chart after Friday’s weak High 1 bull flag buy signal. The daily chart still has a lower high after the September lower high. Traders are deciding if the rally will continue up to a new all-time high, or pull back and form a triangle on the daily chart first. A new high within a couple weeks is more likely.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-10-21"
    }
  ],
  "22": [
    {
      "data": [
        "<article class=\"post-94300 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini weak High 1 bull flags on daily and weekly charts\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weak High 1 bull flags on daily and weekly charts</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-10-22T06:20:05-07:00\">October 22, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Tuesday October 22, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Friday was a High 1 bull flag buy signal bar on the daily chart. But Friday had a bear body and it was the 3rd consecutive doji bar. That is a weak buy setup.<p>Yesterday triggered the buy signal by going above Friday’s high. The Emini rallied in a weak bull channel on the 5 minute chart . Traders are deciding if it will continue up to the all-time high or pull back and then make a new high.<p>While yesterday’s rally was not strong, it was relentless. Unless there is some surprise news event, there will probably be a new high in October. If so, October would then become an outside up month on the monthly chart.<p>If the Emini reverses down, the 4 month trading range will then be a triangle. That does not change anything because the chart is in a trading range and therefore already in Breakout Mode.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 5 points in the Globex session. It might gap above yesterday’s high. Small gaps typically close in the 1st hour.<p>However, the daily chart is in a Small Pullback Bull Trend, and the weekly and monthly charts are in bull trends. Also, October often has a selloff that reverses up, and the rally can continue to the end of the year. The October 3 bear trap is a good candidate for the start of the yearend rally. This bullishness on the higher time frames increases the chance of bull trend days on the 5 minute chart.<p>There have been 3 pullbacks on the daily chart since the October 3 bull trend reversal. Each one lasted only a day. Therefore, traders are aggressively buying brief selloffs. If there is a selloff today, they will look for a midday reversal up or for a reversal up tomorrow.<p>The bears want a lower high on the daily chart. There is a small wedge top and therefore there is an increased chance of a several day pullback. However, unless the bears get a Bear Surprise Bar on the daily chart, traders expect this rally to continue to get vacuumed up to the September all-time high.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-weak-bull-channel.png\"><img src=\"2019-10-22.png\" alt=\"Emini weak bull channel\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/EURUSD-Forex-wedge-rally-at-bear-trend-line.png\"><img loading=\"lazy\" src=\"2019-10-22-1.png\" alt=\"EURUSD Forex wedge rally at bear trend line\"></a></figure><p>The EURUSD daily Forex chart rallied strongly to a bear trend line and the August 26 lower high. But the rally had 3 pushes up and the last leg was especially strong. This is a parabolic wedge buy climax and a buy vacuum test of resistance. The result typically is profit taking.<p>While a 1 – 3 week pullback might be underway, most traders expect at least a micro double top first. The 2 day selloff will probably only last another day or two. Traders then expect one more brief push up to test yesterday’s high, and then possibly a micro double top that leads to a deeper pullback. But if there are 3 or more consecutive bear days, then a 2 – 3 week pullback might already be starting.<p>Because the rally is the strongest one on the weekly chart since the bear trend began 21 months ago, the bulls will look to buy a 2 – 3 week pullback. Consequently, the 1st leg down will probably attract buyers around the 20 day EMA, the October 15 low, and a 50% retracement.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute chart continued yesterday’s selloff overnight. By trading below yesterday’s low, the EURUSD now has a pullback on the daily chart. Traders know that there will probably be a micro double top before a 2 – 3 week pullback. Consequently, many will buy around yesterday’s low, hoping for a test of yesterday’s high over the next few days.<p>Since the 3 week rally was unusually strong, the profit taking may continue for 2 – 3 weeks without a micro double top. As a result, there is an increased chance of a channel down on the 5 minute chart. Day traders will want to see if strong rallies on the 5 minute chart are brief and turn down from lower highs. If so, they will begin to swing trade part of their short positions.<p>Because of this uncertainty about whether the pullback has begun, bulls will buy selloffs and bears will sell rallies. Both will take quick profits until the 2 – 3 week pullback is clearly underway. This should create trading range price action today.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-trading-range-and-late-bear-breakout.png\"><img loading=\"lazy\" src=\"2019-10-22-2.png\" alt=\"Emini trading range and late bear breakout\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>Today gapped up but formed a trading range for the 1st 5 hours. The bears got a surprisingly big bear breakout late in the day. Today was an outside down day that closed near its low.<p>Today is a sell signal bar for tomorrow and the context is good for the bears. There are now 4 pushes up on the daily chart in the past 8 days. This is a wedge top or a failed breakout above a wedge top (the 3rd push up).<p>But the 3 week bull channel is tight and the all-time high is a magnet just above. Therefore, the selloff will probably be minor and last a couple days. However, if the bears get a big bear bar tomorrow, traders will expect a test of the gap above the October 10 high.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-10-22"
    }
  ],
  "23": [
    {
      "data": [
        "<article class=\"post-94302 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini outside down sell signal bar below September high\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini outside down sell signal bar below September high</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-10-23T06:20:47-07:00\">October 23, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Wednesday October 23, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday was an outside down day on the daily chart and it closed near its low. It broke above a 5 day wedge top and reversed down. It is therefore a sell signal bar for a failed breakout below a wedge top. In addition, it is the 2nd lower high since the July all-time high. As a result, it is a sell signal bar for a reversal down from the top of a 4 month triangle.<p>This is also a failed breakout above the 3000 Big Round Number. If the bears get a bear bar today, especially a big one, there will probably be a couple small legs down over the next week or two. An obvious target is the big gap above the October 10 high.<p>If instead today is a bull inside day or a bull reversal day, today will be a buy signal bar for tomorrow. The bulls would again have about a 50% chance of a new all-time high within a few weeks.<h3>Today will tell us what to expect next week</h3><p>Today is important because it will give a clue for what to expect over the next week. If today is an inside day or if it trades below yesterday’s low and reverses up, it will be a buy signal bar on the daily chart for tomorrow. Traders would then discount yesterday and assume that the rally will continue up to a new high. If there is a new high in October, there would be an outside up bar on the monthly chart.<p>On the other hand, if today goes below yesterday’s low, it will trigger the sell signal. This is likely. If today is a big bear day closing on its low, the selloff will probably continue down for at least another week and close the gap at 2948.25.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 1 point in the Globex session. The problems for both the bulls and bears are that most days over the past 2 weeks have had reversals and the chart has been sideways for 6 days. These factors reduce the chance of clarity today. Therefore, today will probably not be a big bear day closing on its low. In addition, it will probably not be a big bull day closing on its high.<p>Day traders expect confusion and at least one reversal today, like most recent days. But because of the increased chance of a trend day up or down, they will be willing to swing trade if they see 2 – 3 strong trend bars up or down with no significant tails. The odds favor more trading range price action instead of a relentless trend today.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-trading-range-and-late-bear-breakout.png\"><img src=\"2019-10-23.png\" alt=\"Emini trading range and late bear breakout\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/EURUSD-Forex-High-1-bull-flag-but-parabolic-wedge-buy-climax.png\"><img loading=\"lazy\" src=\"2019-10-23-1.png\" alt=\"EURUSD Forex High 1 bull flag but parabolic wedge buy climax\"></a></figure><p>The EURUSD daily Forex chart has pulled back for 3 days after a parabolic wedge rally to the 21 month bear trend line. The rally is the strongest one in over a year. Traders expect at least a small 2nd leg up after a 1 – 3 week pullback.<p>However, most reversals require a micro double top. Therefore, there will probably be a test of Monday’s high before the pullback begins.<p>The bears want the rally to be just another bull leg in the 21 month bear channel. But since the rally has been unusually strong, traders will buy the 1st 1 – 3 week pullback to around the EMA. Therefore, traders expect a higher low in a few weeks and then a 2nd leg sideways to up over the following several weeks. As a result, the downside over the next couple weeks is probably not lower than 1.10.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart traded below yesterday’s low overnight. This is now a 2 day pullback. There were buyers below yesterday’s low and the bulls so far have a small bull reversal day. But the range is small and therefore there is no energy. This reduces the chance of a trend day.<p>If today closes below the open, today will be the 3rd consecutive bear bar on the daily chart. That often is the start of a leg own. But because the bars are small, the bears will probably need a close on the low to increase the chance of more selling tomorrow.<p>More likely, today will close around the open. It will therefore be a small reversal day on the daily chart, making it a High 1 buy signal bar for tomorrow. But since there will probably be a micro double top within a few days, the upside over the next few days is small. With limited downside and upside, traders expect a continuation of 4 day tight trading range today.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-double-bottom-higher-low-major-trend-reversal.png\"><img loading=\"lazy\" src=\"2019-10-23-2.png\" alt=\"Emini double bottom higher low major trend reversal\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini reversed up strongly on the open from below yesterday’s low, but the day evolved into a trading range day. The bears wanted a big bear day for their entry bar on the daily chart. That would have increased the chance of filling the gap above the October 10 high.<p>Instead, the day closed near its high. Because today is a 1 day pullback in a bull trend, it is a High 1 Bull Flag buy signal bar for tomorrow. It therefore erased much of yesterday’s bearishness. The Emini once again has about a 50% chance of making a new high this month or within a few weeks.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-10-23"
    }
  ],
  "24": [
    {
      "data": [
        "<article class=\"post-94304 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini weak entry bar after outside down sell signal bar\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weak entry bar after outside down sell signal bar</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-10-24T06:20:33-07:00\">October 24, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Thursday October 24, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini had an outside down bar on Tuesday. Yesterday triggered the sell signal by going below Tuesday’s low. However, yesterday reversed up and closed on its high. It is therefore a High 1 bull flag buy signal bar for today. The bulls have a 50% chance of a new all-time high in October, and a 60% chance of one within a few weeks. October might form an outside up month on the monthly chart and make a new all-time high.<p>The reason the probability is not higher is that the Emini is just below the September high and all-time high, which is resistance. Furthermore, the Emini has been sideways for 7 days. That is not a strong environment for traders looking for a successful breakout. But, it is strong enough to make a new high likely soon.<p>Until there is a breakout, there is no breakout. Consequently, the bears have a 40% chance of reversing down and closing the gap above the October 10 high before there is a new all-time high.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 4 points in the Globex session. It might therefore gap up this morning. That would trigger the buy signal on the daily chart. But the Emini is still near the top of a 7 day tight trading range. While the bulls have a 50% chance of a new high this month, the tight trading range could easily continue for several more days.<p>After yesterday’s strong reversal up, today will probably be sideways to up, at least for the 1st couple hours. The 1st reversal down from a strong rally is typically minor. Therefore, the bears will probably need a double top before they can get a bear trend today. Because of the context on the daily chart, traders expect that the best the bears will get today is a trading range.<p>Since the Emini is at the top of a 21 month trading range and the momentum up on the daily chart is good, there is the potential for a strong breakout. If so, the bulls could soon create a series of bull trend days.<p>In the meantime, traders will buy reversals up from selloffs. They will continue to do that unless the bears get a strong reversal down with follow-through on the daily chart.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-double-bottom-higher-low-major-trend-reversal.png\"><img src=\"2019-10-24.png\" alt=\"Emini double bottom higher low major trend reversal\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/EURUSD-Forex-micro-double-top-at-bear-trend-line.png\"><img loading=\"lazy\" src=\"2019-10-24-1.png\" alt=\"EURUSD Forex micro double top at bear trend line\"></a></figure><p>The EURUSD daily Forex chart triggered a buy signal today by going above yesterday’s high. However, it then reversed down after testing near Monday’s buy climax high.<p>I have been saying that this would probably happen because most reversals down come from a micro double top. Also, a 1 – 3 week pullback is likely after a parabolic wedge buy climax to resistance. This is a good candidate for the start of the pullback. However, there might be one more brief new high before the profit-taking begins.<p>If today closes below its midpoint, it will be a credible sell signal bar for the pullback. Many bulls will exit below today’s low, expecting around a 50% pullback to below the EMA and possibly down to the October 15 low of 1.0991.<p>But the 3 week rally was the strongest one in the 21 month bear trend. And it came from a nested wedge bottom. Consequently, traders expect at least a small 2nd leg sideways to up after the pullback. The bulls will look to buy a reversal back up from around a 50% pullback after 1 – 3 weeks.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart broke above yesterday’s high overnight. This triggered a weak buy signal on the daily chart. But the breakout was small and there was a reversal down from around Friday’s close. That was the highest close in the 3 week buy climax.<p>Today is now a potential sell signal bar for tomorrow. If today closes near its low, the bears will have a credible micro double top after a buy climax on the daily chart.<p>The past 3 days were small and sideways. Today so far is also small. Even if today closes on its low, it will not be a strong sell setup. However, the daily chart is likely to begin to work down for a couple weeks.<p>The bears want a resumption of the 21 month bear trend and not just a pullback in a bull trend. Their odds would improve if today closes on its low. As a result, they will sell 20 pip rallies.<p>Since the bulls want at least one more new high in the rally, they will buy reversals up from the low of the day. They probably will not be successful. The best they probably can get over the next week is a brief new high.<p>Traders expect sideways to down trading for a couple weeks. The bulls will buy reversals up for small rallies and then take profits. The bears will sell reversals down from the rallies. Since they do not expect a bear trend, they will take profits around the most recent low.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p>I will post chart after the close.<figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-bear-trend-from-the-open-and-then-trading-range-day.png\"><img loading=\"lazy\" src=\"2019-10-24-2.png\" alt=\"Emini bear trend from the open and then trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini gapped up and triggered a buy signal on the daily chart. But it sold of sharply on the open. The day went sideways and formed a triangle. The bulls got a weak trend reversal up at the end of the day<p>For the bears, its another reversal down from above a prior high. In this case, it is a reversal down from above Tuesday’s high. But it closed around the middle and it is therefore a weak sell signal bar for tomorrow.<p>Since the daily chart has been sideways for a couple weeks, traders are looking for reversals. This might continue up to next Wednesday’s FOMC announcement.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-10-24"
    }
  ],
  "25": [
    {
      "data": [
        "<article class=\"post-94306 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini weak buy and sell signals ahead of October FOMC\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini weak buy and sell signals ahead of October FOMC</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-10-25T06:20:54-07:00\">October 25, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Friday October 25, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini yesterday triggered a buy signal on the daily chart. However, the day went sideways and formed another trading range day. It closed below its midpoint and it is therefore a sell signal bar for tomorrow.<p>But there have been several weak buy and sell signals on the daily and weekly chart for several weeks. None led to a successful breakout. The Emini is in an 8 day and an 8 week tight trading range. This is a Breakout Mode pattern.<p>The bulls want October to trade above September. It would then be an outside up month. Furthermore, they want the month to close above September’s high and at a new all-time high. Even if they do not get the new high next week, there will probably be a new high within a few weeks.<p>Part of the hesitation is due to next week’s FOMC announcement. While everyone agrees that the Fed will cut rates, traders are uncertain about what the Fed will say. Will they say that they plan more cuts or will this be the last one for a long time? In either case, the announcement will probably lead to a new all-time high or a quick reversal down to the gap above the October 19 high.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 2 points in the Globex session. Since yesterday was another sell signal bar on the daily chart, the bears will try to get today to trade below yesterday’s low to trigger the daily sell signal.<p>But all daily buy and sell signals over the past 2 weeks failed. In addition, yesterday’s bear bar on the daily chart had a prominent tail below. This is therefore a weak sell setup on the daily chart. That reduces the chance of a big bear trend day.<p>Today is Friday and therefore day traders will consider weekly support and resistance today. This is especially true in the final hour. The week so far is a small doji bar on the weekly chart.<p>The bulls want a bull body. They therefore will look to buy reversals up from below the open of the week. However, the bears would like a bear bar. This week would then be a better sell signal bar on the weekly chart. They want today to close below the open. In addition, they want as big a bear bar as possible on the weekly chart. There is therefore a slightly increased chance of a bear trend day.<p>With most days over the past 3 weeks having at least one reversal, day traders will expect at least one today.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-bear-trend-from-the-open-and-then-trading-range-day.png\"><img src=\"2019-10-25.png\" alt=\"Emini bear trend from the open and then trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/EURUSD-Forex-micro-double-top-after-buy-climax.png\"><img loading=\"lazy\" src=\"2019-10-25-1.png\" alt=\"EURUSD Forex micro double top after buy climax\"></a></figure><p>The EURUSD daily Forex chart formed an outside down day yesterday. There is now a micro double top after the parabolic wedge buy climax to the bear trend line. That is the minimum that the bears wanted to begin a 50% pullback to below the EMA.<p>However, yesterday dd not close on its low and it was not a particularly big bear bar. Consequently, many bulls have not yet given up.<p>Once there is a big bear bar, traders will see it as a sign that the bulls have given up. They will then expect at least a couple legs down over the next 1 – 2 weeks. The bulls might still be holding for one more push up before a 1 – 3 week pullback. Financial markets might go sideways into next Wednesday’s FOMC announcement, and then break out up or down.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has been in a 30 pip range overnight. In addition, it has not traded below yesterday’s low. Since yesterday was an outside down bar and a micro double top, it is a sell signal bar on the daily chart. Traders want to know if there will be more buyers or sellers below its low. Therefore, today might go below yesterday’s low.<p>But the past 4 days have been quiet and yesterday had a prominent tail below. As a result, today will probably not be a big trend day up or down.<p>This is Friday. Last week was a big bull bar on the weekly chart. This week went a little above last week’s high and is now trading at the low of the week. Traders see this week as a sell signal bar on the weekly chart. The more it closes on its low, the more traders will look to sell next week.<p>The bear day traders today will sell 20 pip bounces and try to keep the week near its low. They do not need a bigger bear bar than what they already have on the weekly chart so there is less incentive for them to keep selling and trying to create a big bear bar.<p>The bulls will probably not be able to create a trend up to put a bull body on the weekly chart. However, they will buy reversals up from the low to try to weaken the appearance of the weekly sell signal bar.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p>I will post chart after the close.<figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-bull-trend-from-the-open-and-then-trading-range.png\"><img loading=\"lazy\" src=\"2019-10-25-2.png\" alt=\"Emini bull trend from the open and then trading range\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini rallied strongly on the open in a Bull Trend From The Open. It broke above the September high and stalled. But by going above the September high, October is now an outside up month. That increases the chance of higher prices in November.<p>As often happens when the Emini breaks above higher time frame resistance, there was a pullback. But there is then usually a 2nd or 3rd attempt to break above that resistance within a couple days. Consequently, the downside is probably not big on Monday.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-10-25"
    }
  ],
  "26": [
    {
      "data": [
        "<article class=\"post-94310 post type-post status-publish format-standard category-analysis entry override\" aria-label=\"Emini outside up on monthly chart before October FOMC\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini outside up on monthly chart before October FOMC</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-10-26T00:30:22-07:00\">October 26, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Market Overview: Weekend Market Update</h2><p>The<strong>Emini</strong>monthly chart formed an outside up in October. Traders should expect a new all-time high within a few weeks and possibly next week.<p>The 30 year Treasury<strong>bond futures</strong>weekly chart will likely fall a little lower before its next bounce in its 3 month trading range.<p>The<strong>EURUSD</strong>monthly Forex chart will probably pull back from a strong one month rally in its 21 month bear trend.<h2>30 year Treasury bond futures weekly chart:<br>Micro wedge bottom but EMA magnet just below</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/US-Treasury-bond-futures-weekly-chart-should-test-EMA.png\"><img loading=\"lazy\" src=\"2019-10-26.png\" alt=\"US Treasury bond futures weekly chart should test EMA\"></a></figure><p>The 30 year Treasury bondfutures market has been sideways for 3 months after a buy climax to a new all-time high. The bears got a strong reversal down from a lower high double top 3 weeks ago.<p>However, the past 2 weeks have been small and have prominent tails in the weekly chart. This is an absence of strong follow-through selling. Also, these bars are forming a micro wedge bottom. This is a loss of momentum down just above the September sell climax low. Therefore traders see the 3 week selloff as a bear leg in a developing trading range rather than the start of a bear trend.<p>The September 13 low was the bottom of the 1st leg down from the August buy climax. The bulls would like a reversal up from here. That would be a higher low double bottom bull flag in a bull trend. They would then want a rally back up to a new high.<p>However, there have now been 2 strong reversals down over the past 7 weeks. A resumption of the bull trend up to a new high is not what bull trends typically do in this situation.<h3>The importance of the 20 week EMA</h3><p>Despite these reversals down, the chart has not pulled back to its 20 week EMA. In fact, it has been above it for more than 30 bars (weeks). That is unusual and therefore unsustainable. Consequently, the chart will probably go sideways to down over the next few weeks until it gets there. The price action cannot deviate from the price for too long. They correspond to one another over time.<p>Why will market get there? Because traders buying now are paying an above average price. Yet, those 2 big selloffs tell traders that the price action is no longer above average in terms of its bullishness. Many bulls now want to wait to buy at the average price.<p>Consequently, if there is a rally from here, it will probably be small and not last more than 1 – 2 weeks. Traders will sell above this week’s high because they sense that the bears are getting strong. The bulls will probably be hesitant&nbsp;to pay an above average price. Traders should expect at least slightly lower prices and a test of the EMA over the next few weeks.<h2><strong>EURUSD monthly Forex chart:</strong><br>Minor reversal up in tight bear channel on monthly chart</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/EURUSD-monthly-Forex-chart-has-weak-rally.png\"><img loading=\"lazy\" src=\"2019-10-26-1.png\" alt=\"EURUSD monthly Forex chart has weak rally\"></a></figure><p>The EURUSD monthly Forex chart has been trading down for 21 months after a strong reversal up in 2017. That low was a lower low major trend reversal. Traders therefore expect at least a small 2nd leg sideways to up after the current reversal down from the February 2018 high.<p>There have been several reversal attempts, but each one failed within a month. This selloff is therefore also probably a bounce in a 21 month Small Pullback Bear Trend. But as long as the selloff holds above the January 2017 bear trend low, traders still see it as a pullback from a 1st leg up in February 2018 and not a resumption of the 10 year bear trend.<p>Every bear channel behaves like a bull flag since there is a 75% chance of an eventual bull breakout. Traders expect a bull breakout and a rally before a drop below the 2017 low. The minimum goal is a retracement of about half of the 21 month selloff.<p>That would also correspond to around the June 2018 high. That was the top of the 1st pullback after the initial strong reversal down in April and May 2018. The start of a bear channel is always a magnet after a reversal up. But the bears took a year and a half to get down here. The bulls will probably need many months to get back up there.<h3>Reversal up from tight bear channel is usually minor</h3><p>A reversal up from a Small Pullback Bear Trend is typically minor. That means that the current rally might last a few bars (months), but there will then probably be a test back down.<p>A second reversal up at that point would be from a double bottom, which would be a major trend reversal setup. The bulls would have a better chance of a more sustained rally to the June 2018 high of 1.1851 at that point. That is a major lower high on the weekly chart (not shown). It is also the top of the 1st pullback after the early 2018 strong bear breakout.<h2><strong>Monthly S&amp;P500 Emini futures chart:</strong><br>Bull outside up bar in October ahead of October FOMC announcement</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-monthly-candlestick-chart-has-outside-up-month-ahead-of-FOMC-rate-cut.png\"><img loading=\"lazy\" src=\"2019-10-26-2.png\" alt=\"Emini monthly candlestick chart has outside up month ahead of FOMC rate cut\"></a></figure><p>The monthly S&amp;P500 Emini futures chart&nbsp;triggered an oo buy signal when July went above the June high. June and May were consecutive outside bars, which is an oo (outside-outside) bull flag. Rather than rallying, the Emini has stalled. It has been sideways in a tight trading range for 4 months and within a slightly bigger trading range for 7 months. However, it is still in a bull trend, and therefore traders expect higher prices.<p>October traded below the September low. On Friday, it traded above the September high, which is slightly below the July all-time high. October is now an outside up bar. That increases the chance of higher prices in November. The probability will increase if October closes above the September high and the all-time high. It would increase further if it closes on the high of the month and far above that resistance.<p>With the Emini within about 1% of the all-time high, it could easily get there next week. If it closes at a new all-time high, that would be an additional sign of strength and further increase the chance of higher prices in November.<p>There is always a bear case. The bears have a 40% chance of big bear bar in in November. If they get it, November would be a sell signal bar for December.<p>But it would also be the 5th bar in a tight trading range in a strong bull trend. That would make it a weak sell setup. The best the bears can probably achieve in November is another sideways month in the 5 month trading range.<h2><strong>Weekly S&amp;P500 Emini futures chart:</strong><br>Weak breakout above small bull flag, but just below all-time high</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-weekly-candlestick-chart-has-possible-double-top-lower-high-major-trend-reversal.png\"><img loading=\"lazy\" src=\"2019-10-26-3.png\" alt=\"\"></a></figure><p>The weekly S&amp;P500 Emini futures chart triggered a High 1 bull flag buy signal 2 weeks ago when that week traded above the high of the week before. Because the past 6 weeks have had prominent tails and had been sideways, traders are selling rallies and buying selloffs. Therefore, the buy signal was weak.<p>The entry bar 2 weeks ago was small and therefore not strong. This week was the follow-through bar. IT closed on its high, which is more bullish, but its range was small.<p>Nevertheless, the chart is forming higher lows and it is still in a bull trend. Traders believe that the Emini will make a new high within the next few weeks, and possibly next week.<p>The bears have a 30% chance of a strong reversal down next week. If they succeed, there would then be a double top with the September high. But because of the higher lows and strong yearlong bull trend, the reversal down would likely be minor. That means that the bears might get a 2 – 3 week pullback to the October low, which is the neck line of the small double top.<p>It is unlikely that they will get a strong breakout below that neck line and then a measured move down. The selloff would probably just be a brief leg down in the 4 month trading range.<h2><strong>Daily S&amp;P500 Emini futures chart:</strong><br>Many reversals over past 2 weeks ahead of October FOMC announcement</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-daily-candlestick-chart-in-bull-channel-ahead-of-FOMC-announcement.png\"><img loading=\"lazy\" src=\"2019-10-26-4.png\" alt=\"Emini daily candlestick chart in bull channel ahead of FOMC announcement\"></a></figure><p>The daily S&amp;P500 Emini futures chart has been in a weak bull channel for a couple of weeks. It is essentially in a small, tight trading range that is tilted slightly up. There have reversals every couple of days. Even though it is channeling up, this is still a type of Breakout Mode pattern.<p>When there is a horizontal Breakout Mode pattern, there is about a 50% chance of a successful bull breakout and a 50% chance of a successful bear breakout. Furthermore, there is a 50% chance that the 1st breakout up or down will fail and reverse.<p>But this is different because the tight range is tilted up. In this case, the chance of a successful bull breakout is 60%. The Emini might waiting for Wednesday’s 11 am PST FOMC announcement before it breaks out up or down.<hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed Emini price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-10-26"
    }
  ],
  "28": [
    {
      "data": [
        "<article class=\"post-94308 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini might go sideways into October FOMC\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini might go sideways into October FOMC</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-10-28T06:20:15-07:00\">October 28, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Monday October 28, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>On Friday, the Emini traded above the September high. Since it reversed up from below the September low early in the month, October is now an outside up bar on the monthly chart. That is bullish.<p>The Emini will probably make a new all-time high on the day session chart today. If it closes above the September high and the July all-time high, especially far above, the traders will expect it to go up into the end of the year.<p>Wednesday’s FOMC announcement can lead to a big move up or down. Because of the uncertainty, there is an increased chance that the Emini will be mostly sideways ahead of the report.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 12 points in the Globex session and currently above the July all-time high. Since June, I have been saying that there would probably be a new high in September or October. With 4 days left in October, the bulls should achieve their goal this month in the day session as well. The Emini might gap to a new high on today’s open.<p>Because the Emini is testing an important price, there is an increased chance of a trend day. If there is a trend day, up is slightly more likely than down.<h2>Friday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-bull-trend-from-the-open-and-then-trading-range.png\"><img src=\"2019-10-28.png\" alt=\"Emini bull trend from the open and then trading range\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from Friday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/EURUSD-Forex-pullback-to-EMA-ahead-of-FOMC.png\"><img loading=\"lazy\" src=\"2019-10-28-1.png\" alt=\"EURUSD Forex pullback to EMA ahead of FOMC\"></a></figure><p>The EURUSD daily Forex chart had 4 bear bars in the past 5 days. Since the bear channel is tight, the bulls will likely need a micro double bottom before they can get a 2nd leg up after the strong October rally.<p>The bears hope that the rally to the bear trend line will fail. Every rally over the past 21 months reversed down and there was then a new low. But this is perhaps the strongest minor reversal up in over a year. Consequently, many bulls will buy this pullback within a week or two. They expect at least a test of the October high and possibly the June high.<p>Wednesday’s FOMC announcement will create uncertainty in all financial markets. That often results in some neutrality beforehand. For the EURUSD, this 50% pullback to the EMA after last week’s rally is an example.<h3>Overnight EURUSD Forex trading</h3><p>Last week is a Low 1 bear flag sell signal bar on the EURUSD weekly Forex chart. This week opened just above last week’s low and immediately reversed up without going below last week’s low. The bulls do not want the sell signal to trigger. If it does, it will increase the chance of at least slightly lower prices this week.<p>The EURUSD 5 minute Forex chart has rallied relentlessly in a tight bull channel for the past 6 hours. However, the rally has only been 30 pips. Today so far is a small inside day. The rally over the past 4 hours has only been 15 pips. That is too small for day traders to trade. Most are waiting for bigger legs up and down.<p>Since last week’s low is still only 20 pips down, the bears will try to get there today. But with the overnight range small and with the uncertainty caused by the the upcoming FOMC announcement, today will probably remain small. Day traders will look for a few 10 pips scalps.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-all-time-high-and-trading-range-day.png\"><img loading=\"lazy\" src=\"2019-10-28-2.png\" alt=\"Emini all time high and trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini gapped up to a new high on the daily and weekly charts today. After a brief rally on the open, the day entered a tight trading range. The bulls are hoping for a measured move up over the next few weeks.<p>When there is a gap above major resistance, the Emini often goes sideways for 2 – 3 days. This is more likely because of Wednesday’s FOMC announcement.<p>The bears want the gap up to fail. If there is a gap down this week, there would be an island top. But with Wednesday’s FOMC news being so important, the Emini will probably not move much beforehand.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-10-28"
    }
  ],
  "29": [
    {
      "data": [
        "<article class=\"post-94530 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini gap up ahead of October FOMC announcement\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini gap up ahead of October FOMC announcement</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-10-29T06:20:53-07:00\">October 29, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Tuesday October 29, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini gapped up to a new all-time high yesterday. Since yesterday was a Monday, there is also a gap up on the weekly chart.<p>The bulls want a measured move up. Their minimum goal is based on the height of the 5 day bull channel from the October 18 low to the October 24 high. Since it was about 40 points, their 1st target is around 3055.<p>The bears want the gap to close this week. If there is a gap down, there would then be an island top.<p>When there is a gap above important resistance, the Emini often goes sideways for a day or two. It then decides if the breakout will succeed or fail.<p>Tomorrow’s FOMC announcement is a potential catalyst for a big up move up or down. Since traders may wait for the news before trading aggressively, there is an increased the chance of sideways trading today.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 2 points in the Globex session. It therefore might have a small gap down on the open. That would create a 1 day island top. Island tops and bottoms are typically minor reversal patterns. Also, a small gap usually closes in the 1st hour. It would not significantly increase the chance of a failed breakout above the July all-time high.<p>Yesterday was a small trading range day. Tomorrow’s FOMC rate cut announcement is a potential catalyst. Consequently, traders expect that today will probably be another mostly sideways day.<p>Sometimes traders front-run a major announcement. That means there is a slightly increased chance of a big trend up or down today. Unless there is a series of big trend bars, day traders will assume that today will again have a lot of trading range price action.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-all-time-high-and-trading-range-day.png\"><img src=\"2019-10-29.png\" alt=\"Emini all time high and trading range day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/EURUSD-Forex-pullback-from-buy-climax.png\"><img loading=\"lazy\" src=\"2019-10-29-1.png\" alt=\"EURUSD Forex pullback from buy climax\"></a></figure><p>The EURUSD daily Forex chart might be forming a higher low major trend reversal and a micro double bottom just above the EMA. Traders expect a 2nd leg sideways to up after the strong October rally. Tomorrow’s FOMC announcement could be the catalyst for the next leg up.<p>But the chart has been in a broad bear channel for over a year. Because of that, this selloff is probably not sufficient to convince traders that the EURUSD has tested low enough or long enough. Since most bulls think the 7 day pullback has more to go, a reversal up from here will probably only last 2 – 3 days.<p>The EURUSD will likely have to clearly dip below the EMA and probably test the October 15 buy climax low. If it then reverses up, the bulls will be more confident that the 2nd leg up is beginning.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart reversed up today from a perfect double bottom with Friday’s low. While a 2nd leg up on the daily chart might start today, the overnight range is only 30 pips. Also, today so far is the 3rd consecutive small day. In addition, all financial markets might remain quiet ahead of tomorrow’s 11 am PST FOMC announcement. Unless the bars on the 5 minute chart get bigger and there is a 30 – 50 pip breakout up or down, day traders will continue to look for 10 pip scalps today.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><p>I will post chart after the close.<figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-outside-up-day-and-then-outside-down-day.png\"><img loading=\"lazy\" src=\"2019-10-29-2.png\" alt=\"Emini outside up day and then outside down day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini traded below yesterday’s low and then above its high. Today was therefore an outside up day. However, at the end of the day, it traded back below yesterday’s low. At that point, the day was also an outside down day.<p>Today remained a trading range day ahead of tomorrow’s 11 am PST FOMC announcement. Since it closed on its low, it is a sell signal bar for tomorrow for a failed breakout above the 4 month range. There is now a micro double top on the daily chart, which slightly increases the odds for the bears.<p>If tomorrow gaps down, there will be a 2 day island top on the daily chart. While it could lead to a bear trend, the Emini will more likely continue the 2 days of trading range price action going into tomorrow’s 11 am announcement.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-10-29"
    }
  ],
  "30": [
    {
      "data": [
        "<article class=\"post-94533 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Traders awaiting today’s Emini reaction to October FOMC rate cut\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Traders awaiting today’s Emini reaction to October FOMC rate cut</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-10-30T06:20:01-07:00\">October 30, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/about-al-brooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Wednesday October 30, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini yesterday formed an outside up day and then an outside down day. It had several sharp moves up and down and formed a trading range day. But by closing below its midpoint, yesterday is now a sell signal bar for today.<p>The bears want a reversal down from a micro double top and a failed breakout above the July all-time high. However, unless reversal down is big and has follow-through selling, the bulls will buy it. They will bet it is simply a pullback in the 2019 bull trend.<p>Traders are waiting for the reaction to today’s 11 am PST FOMC announcement. They expect the Fed to cut the interest rate. But they don’t know what wording the Fed will use in its statement.<p>There is usually both a sharp move up and down immediately after the news. Day traders should get flat ahead of the announcement and not trade again for at least 10 minutes afterwards. Furthermore, they should be open to anything. There can be a big trend up or down or a reversal.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 1 point in the Globex session. It will probably open within the tight 2 day trading range.<p>While a strong trend up or down is possible before today’s 11 am PST Fed interest rate announcement, it is more likely that the trading range price action will continue until the report. Therefore, day traders will look for reversals after 1 – 2 hour moves up or down.<p>If the morning range is very tight, experienced day traders will scalp with limit orders. They will use relatively wide stops and scale in.<p>This is a losing strategy for most traders. If the Emini is very quiet ahead of the report, most traders should patiently wait for a clear signal or a strong breakout before trading.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-outside-up-day-and-then-outside-down-day.png\"><img loading=\"lazy\" src=\"2019-10-30.png\" alt=\"Emini outside up day and then outside down day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/EURUSD-Forex-pullback-from-buy-climax-ahead-of-FOMC.png\"><img loading=\"lazy\" src=\"2019-10-30-1.png\" alt=\"\"></a></figure><p>The EURUSD daily Forex chart has had a small 3 day rally after a 5 day pullback from the October parabolic wedge buy climax. This bounce is weak.<p>Furthermore, the pullback has probably not fallen far enough to convince traders that the selling is over. Consequently, most bulls will not yet buy. They would like to see a reversal up from stronger support before believing that the October rally is resuming.<p>For example, a pullback from a buy climax to resistance often retraces about 50% of the rally. Also, when the rally ends with a buy climax, the pullback often goes down to the bottom of that buy climax. That is the October 15 low.<p>Today’s FOMC announcement is a potential catalyst for a big move up or down. If there is a big enough rally, traders will conclude that the pullback has ended. More likely, this 3 day bounce will form a lower high and there will be a test down below 1.10 within a couple weeks.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has had a small overnight range. It is currently reversing down from above yesterday’s high. While the 2 hour selloff could be the start of a 2nd leg down on the daily chart, it so far is small. It looks more like a bear leg in the 3 day trading range.<p>Also, many traders will be hesitant to swing trade ahead of today’s FOMC announcement. This is because the Fed’s action often leads to a big move and it can be up or down. Traders will be unwilling to sell at the bottom of a selloff or buy at the top of a rally, betting on a trend, before the report is released.<p>While a 2nd leg down is likely on the daily chart before there is a test of the October high, most traders want to hear what the Fed will say before they will be willing to hold onto a position for hours to days. Therefore, most day traders will scalp ahead of the report.<p>Finally, there is usually both a sharp move up and down in the minutes after the report. Day traders should exit positions ahead of the 11 am PST report. They should then wait at least 10 minutes before resuming trading after the 11 am PST FOMC announcement.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-late-bull-breakout-after-FOMC-rate-cut.png\"><img loading=\"lazy\" src=\"2019-10-30-2.png\" alt=\"Emini late bull breakout after FOMC rate cut\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini sold off on the open and closed the gap above Friday’s high. That also closed the gap on the weekly chart. However, it rallied after the FOMC announcement and made a new all-time high.<p>Yesterday was an outside day and today was a bigger outside day. Consecutive outside days is a buy setup on the daily chart. Today is the buy signal bar. If tomorrow triggers the buy by going above today’s high, traders will expect at least a few more days of sideways to up trading. But when an oo buy setup occurs late in a bull trend like this, the upside is usually just a few bars before there is a pullback.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/blog/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-10-30"
    },
    {
      "data": [
        "<article class=\"post-94533 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Traders awaiting today’s Emini reaction to October FOMC rate cut\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Traders awaiting today’s Emini reaction to October FOMC rate cut</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-10-30T06:20:01-07:00\">October 30, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Wednesday October 30, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>The Emini yesterday formed an outside up day and then an outside down day. It had several sharp moves up and down and formed a trading range day. But by closing below its midpoint, yesterday is now a sell signal bar for today.<p>The bears want a reversal down from a micro double top and a failed breakout above the July all-time high. However, unless reversal down is big and has follow-through selling, the bulls will buy it. They will bet it is simply a pullback in the 2019 bull trend.<p>Traders are waiting for the reaction to today’s 11 am PST FOMC announcement. They expect the Fed to cut the interest rate. But they don’t know what wording the Fed will use in its statement.<p>There is usually both a sharp move up and down immediately after the news. Day traders should get flat ahead of the announcement and not trade again for at least 10 minutes afterwards. Furthermore, they should be open to anything. There can be a big trend up or down or a reversal.<h3>Overnight Emini Globex trading</h3><p>The Emini is up 1 point in the Globex session. It will probably open within the tight 2 day trading range.<p>While a strong trend up or down is possible before today’s 11 am PST Fed interest rate announcement, it is more likely that the trading range price action will continue until the report. Therefore, day traders will look for reversals after 1 – 2 hour moves up or down.<p>If the morning range is very tight, experienced day traders will scalp with limit orders. They will use relatively wide stops and scale in.<p>This is a losing strategy for most traders. If the Emini is very quiet ahead of the report, most traders should patiently wait for a clear signal or a strong breakout before trading.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-outside-up-day-and-then-outside-down-day.png\"><img src=\"2019-10-30.png\" alt=\"Emini outside up day and then outside down day\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/EURUSD-Forex-pullback-from-buy-climax-ahead-of-FOMC.png\"><img loading=\"lazy\" src=\"2019-10-30-1.png\" alt=\"\"></a></figure><p>The EURUSD daily Forex chart has had a small 3 day rally after a 5 day pullback from the October parabolic wedge buy climax. This bounce is weak.<p>Furthermore, the pullback has probably not fallen far enough to convince traders that the selling is over. Consequently, most bulls will not yet buy. They would like to see a reversal up from stronger support before believing that the October rally is resuming.<p>For example, a pullback from a buy climax to resistance often retraces about 50% of the rally. Also, when the rally ends with a buy climax, the pullback often goes down to the bottom of that buy climax. That is the October 15 low.<p>Today’s FOMC announcement is a potential catalyst for a big move up or down. If there is a big enough rally, traders will conclude that the pullback has ended. More likely, this 3 day bounce will form a lower high and there will be a test down below 1.10 within a couple weeks.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has had a small overnight range. It is currently reversing down from above yesterday’s high. While the 2 hour selloff could be the start of a 2nd leg down on the daily chart, it so far is small. It looks more like a bear leg in the 3 day trading range.<p>Also, many traders will be hesitant to swing trade ahead of today’s FOMC announcement. This is because the Fed’s action often leads to a big move and it can be up or down. Traders will be unwilling to sell at the bottom of a selloff or buy at the top of a rally, betting on a trend, before the report is released.<p>While a 2nd leg down is likely on the daily chart before there is a test of the October high, most traders want to hear what the Fed will say before they will be willing to hold onto a position for hours to days. Therefore, most day traders will scalp ahead of the report.<p>Finally, there is usually both a sharp move up and down in the minutes after the report. Day traders should exit positions ahead of the 11 am PST report. They should then wait at least 10 minutes before resuming trading after the 11 am PST FOMC announcement.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-late-bull-breakout-after-FOMC-rate-cut.png\"><img loading=\"lazy\" src=\"2019-10-30-2.png\" alt=\"Emini late bull breakout after FOMC rate cut\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini sold off on the open and closed the gap above Friday’s high. That also closed the gap on the weekly chart. However, it rallied after the FOMC announcement and made a new all-time high.<p>Yesterday was an outside day and today was a bigger outside day. Consecutive outside days is a buy setup on the daily chart. Today is the buy signal bar. If tomorrow triggers the buy by going above today’s high, traders will expect at least a few more days of sideways to up trading. But when an oo buy setup occurs late in a bull trend like this, the upside is usually just a few bars before there is a pullback.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-10-30- 1"
    }
  ],
  "31": [
    {
      "data": [
        "<article class=\"post-94536 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini rallied on October FOMC announcement of rate cut\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini rallied on October FOMC announcement of rate cut</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-10-31T06:20:18-07:00\">October 31, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/about-al-brooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Thursday October 31, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday sold off on the open and closed the gap above Friday’s high and last week’s high. The Emini was in a trading range day until the FOMC announcement.<p>After the 11 am PST report, the bulls rallied to a new high of the day. Furthermore, the rally went above Tuesday’s high. That means there are consecutive outside bars on the daily chart. Yesterday is therefore a buy signal bar for an oo bull flag. If today goes above yesterday’s high, it would trigger the buy signal. Traders would then expect sideways to up trading for several more days.<p>The bears want today to be a bear inside day. Today would then be an ioi (inside-outside-inside) sell signal bar for tomorrow. Traders would wonder if this week’s breakout to a new all-time high might fail.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 5 points in the Globex session. Since yesterday was a buy climax day, there will probably be some profit-taking today. Traders expect at least a couple hours of sideways to down trading to begin by the end of the 2nd hour. It might begin on the open.<p>Today is the last day in October. October is now an outside up month. The bulls would like October to close above the September high. That would be a sign of strong bulls and increase the chance of higher prices next month. In addition, they would like the month to close above the July high as a further sign of buying pressure.<p>The Emini is now about 11 points above the July old all-time high. That former all-time high is close enough to be a magnet today. That increases the chance of at least a small bear trend day today.<p>Since the bulls have already accomplished their goals, they do not need another big bull day today. Therefore, today will probably not be a strong follow-through buying day, despite yesterday’s late rally.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-late-bull-breakout-after-FOMC-rate-cut.png\"><img loading=\"lazy\" src=\"2019-10-31.png\" alt=\"Emini late bull breakout after FOMC rate cut\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/EURUSD-Forex-weak-rally-after-FOMC.png\"><img loading=\"lazy\" src=\"2019-10-31-1.png\" alt=\"EURUSD Forex weak rally after FOMC\"></a></figure><p>The EURUSD daily Forex chart has 4 bull bars, but only one is a big bull bar closing near its high. Furthermore, today so far is a small day and its high is near the October 21 high. This looks more like a test of that high rather than a resumption of a bull trend. Consequently, the rally will probably lead to another pullback from here, or from slightly above at the 13 month bear trend line.<p>The bears were expecting a 2nd leg up after the strong October rally. They want a double top with the October 21 high and then a resumption of the 21 month bear trend. But the 4 day rally has all bull bars. Also, there is room to the 13 month bull trend line magnet above. Therefore, the bears will probably need at least a couple bear bars before they can get a reversal down.<p>When the price action is not particularly strong for either the bulls or the bears, the chart typically has to go sideways for more bars. Traders expect sellers around the 13 month bear trend line and the October 21 high and buyers around the October 25th and 15th lows.<p>Today is the last day of October. October is an outside up month on the monthly chart. It will probably close above the September high. That would increase the chance of at least slightly higher prices in November.<h2>Weekly chart forming High 1 bull flag buy signal bar</h2><p>Tomorrow is Friday and therefore the price action today and tomorrow affects the appearance of the weekly chart. So far this week is a bull inside bar on the weekly chart after last week’s pullback.<p>If the bulls can get the week to close near its high, this week would be a good buy signal bar for next week. The 3 week rally in October on the weekly chart was strong enough to make at least slightly higher prices likely next week.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has had no follow-through buying so far today after yesterday’s strong rally. It has been in a 30 pip range and there have been several small reversals. Day traders have been scalping.<p>Traders are wondering if yesterday was a resumption of the bull trend or simply a buy vacuum test of resistance. They may need a few days to decide. This makes a small sideways day likely today.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-parabolic-wedge-sell-climax.png\"><img loading=\"lazy\" src=\"2019-10-31-2.png\" alt=\"Emini parabolic wedge sell climax\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini sold off in a parabolic wedge sell climax on the open. It reversed up from below yesterday’s low and the bottom of a 3 day expanding triangle. For the rest of the day, it was sideways. There was some short covering at the end of the day. October closed above the September and July highs. That strength increases the chance of higher prices in November.<p>Tomorrow is Friday and the Emini is near the open of the week. The bears want tomorrow to close below the open. This week would then be a sell signal bar on the weekly chart for a failed breakout above the July all-time high. But after 3 bull bars on the weekly chart, a 1 – 2 week pullback is more likely than a bear trend.<p>With mostly sideways price action for 4 days and the Emini oscillating around the open of the week, tomorrow will probably continue the trading range. The open of the week will be a magnet, especially in the final hour.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/blog/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-10-31"
    },
    {
      "data": [
        "<article class=\"post-94536 post type-post status-publish format-standard category-market-update entry override\" aria-label=\"Emini rallied on October FOMC announcement of rate cut\" itemscope=\"\" itemtype=\"https://schema.org/CreativeWork\"><header class=\"entry-header\"><h1 class=\"entry-title\" itemprop=\"headline\">Emini rallied on October FOMC announcement of rate cut</h1><p class=\"entry-meta\"><time class=\"entry-time\" itemprop=\"datePublished\" datetime=\"2019-10-31T06:20:18-07:00\">October 31, 2019</time>By<span class=\"entry-author\" itemprop=\"author\" itemscope=\"\" itemtype=\"https://schema.org/Person\"><a href=\"https://www.brookstradingcourse.com/author/albrooks/\" class=\"entry-author-link\" rel=\"author\" itemprop=\"url\"><span class=\"entry-author-name\" itemprop=\"name\">Al Brooks, MD</span></a></span></header><div class=\"entry-content\" itemprop=\"text\"><h2>Emini and Forex Trading Update:<br>Thursday October 31, 2019</h2><p>I will update again at the end of the day.<h2>Pre-Open market analysis</h2><p>Yesterday sold off on the open and closed the gap above Friday’s high and last week’s high. The Emini was in a trading range day until the FOMC announcement.<p>After the 11 am PST report, the bulls rallied to a new high of the day. Furthermore, the rally went above Tuesday’s high. That means there are consecutive outside bars on the daily chart. Yesterday is therefore a buy signal bar for an oo bull flag. If today goes above yesterday’s high, it would trigger the buy signal. Traders would then expect sideways to up trading for several more days.<p>The bears want today to be a bear inside day. Today would then be an ioi (inside-outside-inside) sell signal bar for tomorrow. Traders would wonder if this week’s breakout to a new all-time high might fail.<h3>Overnight Emini Globex trading</h3><p>The Emini is down 5 points in the Globex session. Since yesterday was a buy climax day, there will probably be some profit-taking today. Traders expect at least a couple hours of sideways to down trading to begin by the end of the 2nd hour. It might begin on the open.<p>Today is the last day in October. October is now an outside up month. The bulls would like October to close above the September high. That would be a sign of strong bulls and increase the chance of higher prices next month. In addition, they would like the month to close above the July high as a further sign of buying pressure.<p>The Emini is now about 11 points above the July old all-time high. That former all-time high is close enough to be a magnet today. That increases the chance of at least a small bear trend day today.<p>Since the bulls have already accomplished their goals, they do not need another big bull day today. Therefore, today will probably not be a strong follow-through buying day, despite yesterday’s late rally.<h2>Yesterday’s setups</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-late-bull-breakout-after-FOMC-rate-cut.png\"><img src=\"2019-10-31.png\" alt=\"Emini late bull breakout after FOMC rate cut\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups from yesterday. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h2>EURUSD Forex market trading strategies</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/EURUSD-Forex-weak-rally-after-FOMC.png\"><img loading=\"lazy\" src=\"2019-10-31-1.png\" alt=\"EURUSD Forex weak rally after FOMC\"></a></figure><p>The EURUSD daily Forex chart has 4 bull bars, but only one is a big bull bar closing near its high. Furthermore, today so far is a small day and its high is near the October 21 high. This looks more like a test of that high rather than a resumption of a bull trend. Consequently, the rally will probably lead to another pullback from here, or from slightly above at the 13 month bear trend line.<p>The bears were expecting a 2nd leg up after the strong October rally. They want a double top with the October 21 high and then a resumption of the 21 month bear trend. But the 4 day rally has all bull bars. Also, there is room to the 13 month bull trend line magnet above. Therefore, the bears will probably need at least a couple bear bars before they can get a reversal down.<p>When the price action is not particularly strong for either the bulls or the bears, the chart typically has to go sideways for more bars. Traders expect sellers around the 13 month bear trend line and the October 21 high and buyers around the October 25th and 15th lows.<p>Today is the last day of October. October is an outside up month on the monthly chart. It will probably close above the September high. That would increase the chance of at least slightly higher prices in November.<h2>Weekly chart forming High 1 bull flag buy signal bar</h2><p>Tomorrow is Friday and therefore the price action today and tomorrow affects the appearance of the weekly chart. So far this week is a bull inside bar on the weekly chart after last week’s pullback.<p>If the bulls can get the week to close near its high, this week would be a good buy signal bar for next week. The 3 week rally in October on the weekly chart was strong enough to make at least slightly higher prices likely next week.<h3>Overnight EURUSD Forex trading</h3><p>The EURUSD 5 minute Forex chart has had no follow-through buying so far today after yesterday’s strong rally. It has been in a 30 pip range and there have been several small reversals. Day traders have been scalping.<p>Traders are wondering if yesterday was a resumption of the bull trend or simply a buy vacuum test of resistance. They may need a few days to decide. This makes a small sideways day likely today.<h2>Summary of today’s S&amp;P Emini futures price action and what to expect tomorrow</h2><figure class=\"wp-block-image\"><a href=\"https://www.brookstradingcourse.com/wp-content/uploads/2019/10/Emini-parabolic-wedge-sell-climax.png\"><img loading=\"lazy\" src=\"2019-10-31-2.png\" alt=\"Emini parabolic wedge sell climax\"></a></figure><p class=\"caption\">Here are several reasonable stop entry setups for today. I show each buy entry with a green rectangle and each sell entry with a red rectangle. I rarely also show limit order entries and entries on the close of bars. Buyers of the Brooks Trading Course and Encyclopedia of Chart Patterns have access to a much more detailed explanation of the swing trades for each day.<p class=\"caption\">My goal with these charts is to present an Always In perspective. If a trader was trying to be Always In or nearly Always In a position all day, and he was not currently in the market, these entries would be logical times for him to enter.<h3>End of day summary</h3><p>The Emini sold off in a parabolic wedge sell climax on the open. It reversed up from below yesterday’s low and the bottom of a 3 day expanding triangle. For the rest of the day, it was sideways. There was some short covering at the end of the day. October closed above the September and July highs. That strength increases the chance of higher prices in November.<p>Tomorrow is Friday and the Emini is near the open of the week. The bears want tomorrow to close below the open. This week would then be a sell signal bar on the weekly chart for a failed breakout above the July all-time high. But after 3 bull bars on the weekly chart, a 1 – 2 week pullback is more likely than a bear trend.<p>With mostly sideways price action for 4 days and the Emini oscillating around the open of the week, tomorrow will probably continue the trading range. The open of the week will be a magnet, especially in the final hour.<p><em>See the<a rel=\"noreferrer noopener\" href=\"https://www.brookstradingcourse.com/tag/market-analysis/\" target=\"_blank\">weekly update</a>for a discussion of the price action on the weekly chart and for what to expect going into next week.</em><hr class=\"wp-block-separator\"><h2>Trading Room</h2><p>Traders can see the end of the day<a href=\"http://www.brookspriceaction.com/profile.php?mode=profil&amp;sub=profile_prefer&amp;mod=0\" target=\"_blank\" rel=\"noreferrer noopener\">bar-by-bar price action report by signing up</a>for free at BrooksPriceAction.com. I talk about the detailed S&amp;P Emini futures price action real-time throughout the day in the BrooksPriceAction.com<a href=\"https://www.brookstradingcourse.com/online-day-trading-room/\" target=\"_blank\" rel=\"noreferrer noopener\">trading room</a>. We offer a<a href=\"http://www.brookspriceaction.com/portal.php?page=11\" target=\"_blank\" rel=\"noreferrer noopener\">2 day free trial</a>.<hr class=\"wp-block-separator\"><h3>Charts use Pacific Standard Time</h3><p>When I mention time, it is USA Pacific Standard Time (the Emini day session opens at 6:30 am PST, and closes at 1:15 pm PST). You can read background information on the intraday market reports on the<a href=\"https://www.brookstradingcourse.com/blog/market-update/\" target=\"_blank\" rel=\"noreferrer noopener\">Market Update</a>page.<hr class=\"wp-block-separator\"></div></article>"
      ],
      "dateId": "2019-10-31- 1"
    }
  ]
}