{
  "2": [
    {
      "barNumber": "1",
      "description": "1st day of August after 6 CC bull bars on monthly chart. August should have\nbear body, but might go above July H 1st. 6 day TTR on daily above July 14 high\nso bull flag, but also possible ET since July 7. BT HOY, but tails, PS TRO, HPW"
    },
    {
      "barNumber": "3",
      "description": "II, BOM, F BO HOY, PH, but tail. H2 but 2 BRB far above MA,. weak B and S so\nPP more SW, TRO. ATH and GXH MGA. MGB are 60ma, MA, 4400 BRN, COY, GX L"
    },
    {
      "barNumber": "4",
      "description": "OU, but still on 3 II S, stop above 1"
    },
    {
      "barNumber": "5",
      "description": "OO so BOM. TTR so LP B and S, but OK swing, still should close G above HOY,\nbut if reverses up again, PP will get swing up"
    },
    {
      "barNumber": "6",
      "description": "BLB, H2 3, but tail, far above EMA, still on 3 S, room to MA, B2"
    },
    {
      "barNumber": "7",
      "description": "BO TR, BRB, MGB, but tail so not strong STC"
    },
    {
      "barNumber": "8",
      "description": "BLBC, H2 3, F BO below HOY, test 4400 BRN and MA, PL, BRE"
    },
    {
      "barNumber": "9",
      "description": "BLBC, CCBLB, BTC, but still in TRO, BLE4"
    },
    {
      "barNumber": "10",
      "description": "BTC, BLE4. BR want DT LH MTR 4. BL want BO OO 5 and HOD"
    },
    {
      "barNumber": "11",
      "description": "OD, DT 4, DT LH MTR, but tail, only went 2t below 10 so still SPBL and still\nBTC, but ok to exit below or 1 - 2 pts below. SS2"
    },
    {
      "barNumber": "12",
      "description": "MDT, BLE below 11. still BTC but BL need BO above 12 and HOD, else either\nmore TRO or DT and swing down, PS ODD"
    },
    {
      "barNumber": "14",
      "description": "COL, DT LH MTR, NS"
    },
    {
      "barNumber": "16",
      "description": "HL at MA, BRE4, but DD, 5 BRB, B2. still on 14 S, but still TRO, BOM"
    },
    {
      "barNumber": "18",
      "description": "BBRBC, still on 14 S, PS early STC, but need strong BO below MA. BL want HL 8"
    },
    {
      "barNumber": "19",
      "description": "H2 16, HL PB 8, C neaer H and above MA, BRE, PL, but still TRO, wiht DT 1 12\nand DB 8 19, BOM, NS"
    },
    {
      "barNumber": "20",
      "description": "BLBC, good EB but need BO 17 H, else PS DTBF in SPBR"
    },
    {
      "barNumber": "21",
      "description": "DTBF 17, BLE, but tail, S2. TRI 1 12 21, still BOM"
    },
    {
      "barNumber": "23",
      "description": "OU, HL at MA, C above 22, but apex TRI 1 12 21, tail, ok to wait for CC BLB\nand BL 21"
    },
    {
      "barNumber": "24",
      "description": "LH but big tail, still on 19 and 8 B, S2. BLE below 23 or 19 or 8. apex of\nTRI, ok to wait for BO UD"
    },
    {
      "barNumber": "26",
      "description": "BBRBC, 1st C below MA, but PS BTC since TRO. S2"
    },
    {
      "barNumber": "27",
      "description": "3 CC BRBC, PS TTRD, BR want ODD"
    },
    {
      "barNumber": "30",
      "description": "BBRBC, SBD, might test LOY, PS ODD"
    },
    {
      "barNumber": "33",
      "description": "MDB 31, BRE, but PP MRV, LOY MGB, NS, B2. IB so L1, LOY MGB, but BLB, MDB, PS\nBB, NS"
    },
    {
      "barNumber": "34",
      "description": "II, BOM. L1, but DD, BBLB, MDB, NS, PS BB, and PP BB 32"
    },
    {
      "barNumber": "36",
      "description": "MDB, COH, PL, but PP MRV"
    },
    {
      "barNumber": "37",
      "description": "SBU, PP MRV and LTR in TTR, but BL hope it will grow into TRVU"
    },
    {
      "barNumber": "39",
      "description": "L2 34 at MA, AIS, but SBU, NWS, PS BB"
    },
    {
      "barNumber": "41",
      "description": "L1 near EMA, AIS, LOY MGB for ODD, but PS LTR in TTRD so PS HL, NS"
    },
    {
      "barNumber": "42",
      "description": "HL MTR, but more likely LTR in TTRD. BL want MDRU. BR want ODD and more BRT."
    },
    {
      "barNumber": "47",
      "description": "W 33 38 at MA, but DD, PP LTR in TTRD, PP MBO and more TR. BR want ODD"
    },
    {
      "barNumber": "53",
      "description": "LL MTR, BRE4, but 7 BRB, PP MRV, PP SA and around MA. LOY MGB for PS ODD"
    },
    {
      "barNumber": "55",
      "description": "H1 but BRB, just below MA, PP SA and at MA, B2"
    },
    {
      "barNumber": "57",
      "description": "BO above MA, but more likely BLTR than LL MTR. PP still AIS, BLN1"
    },
    {
      "barNumber": "60",
      "description": "HL MTR but only 2 bars down so PP MRV and more LTR in TTRD"
    },
    {
      "barNumber": "62",
      "description": "C above MA, 3 CC BLB, but small, PP still AIS. apex of TR, BOM. BL want TRVU\nto 29 SX H, BR want TRSD to below LOY for ODD. most likely will stay SW or only\nget small BO UD"
    },
    {
      "barNumber": "64",
      "description": "F BO TRI 46 53 58 60, but BRD, NS, B2"
    },
    {
      "barNumber": "65",
      "description": "F BL BO Tri, but 3 DD at apex of TRI, still BOM, S2, B2"
    },
    {
      "barNumber": "67",
      "description": "4 CC DD at apex of TRI. BOM, BR want ODD, BL want BL RV day, but PP will stay\nmostly in LTR"
    },
    {
      "barNumber": "81",
      "description": "End of Day"
    }
  ],
  "4": [
    {
      "barNumber": "1",
      "description": "GD to 60ma and near 36 L at start of Y BL CH. Y was SCU so expect TR. Y also\nwas OO on daily so increased chance today will be ID or at least mostly OL Y, so\nPP will not go far above HOY. LOY is far below so PP will not go below LOY. DD\nat 60ma, TR likely, PS TRO, B2"
    },
    {
      "barNumber": "2",
      "description": "L1 but 2 DD at 60ma, PP BB and TRO, LOM, S2"
    },
    {
      "barNumber": "3",
      "description": "H2 at 60ma, HL DB 35, PL, but 3 DD, CC BRB, NS. might get bounce to MA and\n50P, but PP LH and TR"
    },
    {
      "barNumber": "4",
      "description": "BLB but tail, 3 DD, PP MRVU to MA and OOM and 50P, NS, B2. MGB is GXL"
    },
    {
      "barNumber": "5",
      "description": "OD, GXL MGA, but 5 BTTR, LOM, B2, S2"
    },
    {
      "barNumber": "6",
      "description": "BLBC, 3rd attempt up from 60ma, PL, but NS since TTR, just below MA, and GXL\nMGB"
    },
    {
      "barNumber": "7",
      "description": "CCBLBC, C above MA, MGA are COY and HOY, but not far above MA, and at OOM.\nAIL, but need FT, else LH MTR"
    },
    {
      "barNumber": "8",
      "description": "CC C above MA, H1, MGA, but BRD, just above MA, NS, BLE4. W 2 5 at MA, but\nonly BRD and after CCBLBC, S2"
    },
    {
      "barNumber": "9",
      "description": "OD at MA, W, but tail, weak SSB 8, S2. BL want BB and SBL, but weak rally,\nstill PP TRO, but might test GXH and COY"
    },
    {
      "barNumber": "10",
      "description": "CCBRBC, CC C below MA, PS AIS, MGB 60MA, GXL, Y 36 L at bottom of CH, but TRO"
    },
    {
      "barNumber": "13",
      "description": "BO LOD 60ma and GXL, but C at 1 L and not on L of bar, not strong STC. 6 CC\nBRB, PP MRV and SA 13. BL want F BO and LOD, B2"
    },
    {
      "barNumber": "16",
      "description": "LH at MA, PS BR CH, BLE. MDT, PP 2LSD after 6 BRB so might test 13 C and 60ma\nand 1 L, might get new LOD in BR CH, but PP BB13 for W, and PS HL after big\nbounce to 14. NS, TR still likely"
    },
    {
      "barNumber": "17",
      "description": "BBRB, but tail and at 13 C so DBR might buy back short, still on 16 S but at\nSP"
    },
    {
      "barNumber": "19",
      "description": "HL but DD after 3 BRB, LRP so NS. BRE, PS HL MTR"
    },
    {
      "barNumber": "20",
      "description": "BBLBC but at MA in PS BRC so PS STC, but PP AIL. BL need BO above MA since\nstill BRCH"
    },
    {
      "barNumber": "21",
      "description": "LH at MA in BRCH, COL, BLE. PS BTC since BL do not want S to trigger below\n21. they wand 19 HL MTR to lead to BLT. BOM. BL need BO above MA, BR need BO\nbelow 21 SSB. TRI 7 16"
    },
    {
      "barNumber": "22",
      "description": "BRB, TRI S signal, BRCH, but apex of TRI, NS"
    },
    {
      "barNumber": "23",
      "description": "SBD, BO below 60ma, but PP BB around 13 L, if below, then PS W 1 13. BR want\nBO below 13 and MMD and continued BRCH. lots of TR PA so REVU soon is more\nlikely than BRT"
    },
    {
      "barNumber": "24",
      "description": "TW 1 13, but 4 BRB, B2. BRE4, PS SA for BO below LOD"
    },
    {
      "barNumber": "25",
      "description": "HL MTR, H2 19, OU, COH, PL, BRE, but just below MA, 4 CC BRB, LP, NS. BR\nwilll STC hoping to prevent BO above 25"
    },
    {
      "barNumber": "26",
      "description": "BO, new LOD, OO. BR want MMD to below 50P from Y rally and BL want W 1 13.\nAIS, BRCH, but so far, weak BRT"
    },
    {
      "barNumber": "27",
      "description": "W 1 13, 50P from Y, PL, BRE, but CC BRB, TC 21, PP MRV, B2"
    },
    {
      "barNumber": "28",
      "description": "L1 in BRCH, but BLB, weak BRT, PS BB, S2"
    },
    {
      "barNumber": "29",
      "description": "OU, W, but DD, just below MA, LOM, B2"
    },
    {
      "barNumber": "30",
      "description": "BBLBC at MA in BRCH so BL take profits and BR STC. but W at 50P 27 so HRP\nthat this is start of swing up. BL need BO above MA to end BRCH"
    },
    {
      "barNumber": "31",
      "description": "H1, BLB, PS AIL, but NS. L2 28 at MA in BRCH but BLB, S2. BL need BO above MA"
    },
    {
      "barNumber": "32",
      "description": "BO above MA, but still LH and BRCH, BL need FT. BLE4, S2"
    },
    {
      "barNumber": "33",
      "description": "FT after BO above MA, should test 20 LH. 6 CC BLB and CC C above MA so PP\n2LSU and BB. OOD might be MGN all day if stays TRD"
    },
    {
      "barNumber": "34",
      "description": "LH at MA in BRCH, but 6 CC BLB after W bottom, PP MRV and BB. BLE4. L2 but PP\nBB, S2"
    },
    {
      "barNumber": "35",
      "description": "SBD but PP MRV and LH after 6 BLB and W 27, S2"
    },
    {
      "barNumber": "36",
      "description": "HL MTR after W bottom but DD and 2 BRB, NWS. IB so L1 in BRCH, but DD, and PP\nBB and 2LSU after W bottom, NS, S2. PP will remain TRD and OOD might be MGN at\nEOD"
    },
    {
      "barNumber": "39",
      "description": "LL DB, HL MTR, 50P, but BRB, NS"
    },
    {
      "barNumber": "43",
      "description": "BO above OOD, still on HL MTR B, MGN HOD and HOY. SBU"
    },
    {
      "barNumber": "45",
      "description": "BX at OOD, L2 34, but PP MRV. still TRD. S2"
    },
    {
      "barNumber": "47",
      "description": "L2, W 34 44, BLE4, but PP MRV and BB around MA"
    },
    {
      "barNumber": "48",
      "description": "BRBC, but PP MRV to MA. should fall below 34 H since TRD and expect PB below\nSP"
    },
    {
      "barNumber": "51",
      "description": "ii. L1, but at MA, PP MRV, but might test 39 HL. LP S, PP will OSC around OOD\nfor rest of day. BL want HL and more BL CH, MGA are HOD and HOD, bu PP will not\nget above HOY"
    },
    {
      "barNumber": "52",
      "description": "OU at MA, F II, but 4 BRB, TRD, LPB, NS, migth test OOD and 39 L"
    },
    {
      "barNumber": "54",
      "description": "LH, PS TRI 7 47, but PP MRV, PS TTR 46, S2. BL want new HOD, but BLE4"
    },
    {
      "barNumber": "55",
      "description": "II, AIL, MGB but TTR 45, LRP, PS SA, NS"
    },
    {
      "barNumber": "59",
      "description": "W 34 47 but BLB, S2. BLE4. Still BLT, but not clear top"
    },
    {
      "barNumber": "60",
      "description": "H1, HOD and HOY MGA, but 3LU, top of TTR 45, LP, NS, PS SA 57, PP SA HOD, PP\nwill remain ID"
    },
    {
      "barNumber": "63",
      "description": "NW 53 57 and 34 47, OOD and 60ma MGN, but big tail, LRP NS"
    },
    {
      "barNumber": "64",
      "description": "SBD, MGB 4400 and 60ma and 39 L. PP will tremain TRD"
    },
    {
      "barNumber": "67",
      "description": "LL DB 52, HL MTR, but 4 BRB, PP SA for 2LSD from W, BRE, B2 or NWS"
    },
    {
      "barNumber": "81",
      "description": "End of Day"
    }
  ],
  "6": [
    {
      "barNumber": "1",
      "description": "LDW. SGU. BBLBC, PS T1BU, but need FT. TR, better to wait for breakout or 2nd\nsignal. Low probability, bad for stop entries.\">BBBR. if FT, then CC BLB and\nT1BU, and gap will PP not close. BR want BLT and BRB for FT 2"
    },
    {
      "barNumber": "2",
      "description": "BRB but tails. H1 but BRB and PS 3LU for PW 78 1, NS. F BO HOY but tail, S2"
    },
    {
      "barNumber": "3",
      "description": "II, BOM. HOY MGB, but BLB and strong BLT so LP, but great RR so OK S, NS. H1\nbut PS SA for PW 78 1 so NS."
    },
    {
      "barNumber": "4",
      "description": "BRB, PH. tail,. should close G above HOY. but 12 bar strong rally so PP MRV,\neven if HOD. BR need strong FT 5 for T1BD"
    },
    {
      "barNumber": "6",
      "description": "L1 but tail, at MA, 50P, PP TRO, PP BB, S2. H2 but 3 BRB, 6 BBRMC, MRV, PP SA\naround 3 L since BSSB. PP TRO"
    },
    {
      "barNumber": "7",
      "description": "OU, LLDB 1. MDB at MA, W 1 6, PL, but 6 BBRMC, PP MRV and TRO"
    },
    {
      "barNumber": "9",
      "description": "COL but AIL, just above MA, SBU 7, BL FT 8, PP BB, PS SPBL and DB 1 7 at MA.\nstill TRO, B2, S2"
    },
    {
      "barNumber": "10",
      "description": "H1, AIL, PS SPBL, but tail, NS, B2"
    },
    {
      "barNumber": "12",
      "description": "LH MTR, L2 COL, PH, but 4 BLB 7, PS SPBL, NS, PS BB, S2"
    },
    {
      "barNumber": "13",
      "description": "C above 12 so BO, but small bar and tail, need FT. BLE4, testing 3 L."
    },
    {
      "barNumber": "14",
      "description": "LH MTR, W 8 11, COL, PH, but PP MRV, still PS SPBL, NS. BLE"
    },
    {
      "barNumber": "15",
      "description": "BR EB, still on 14 S but need more and bigger BRB, else still TRO and PS SPBL"
    },
    {
      "barNumber": "16",
      "description": "SBD, but BR need FT. BL want HL DB 7 and BRTP."
    },
    {
      "barNumber": "17",
      "description": "HL DB, C at MA, still AIL, PL, but SBD 16, NS. still on 14 S, but BRE"
    },
    {
      "barNumber": "18",
      "description": "OU, DB 7 aat MA, MDB 16, BRE, PL, AIL, but NS, need strong REVU, else BL will\nexit quickly and BR will S again"
    },
    {
      "barNumber": "19",
      "description": "L1 but DD and still on 18 DB B, S2. BLE below 18"
    },
    {
      "barNumber": "20",
      "description": "DB 7 2EB, but NS since PS PB from 16 for BO below 7 and then MMD to OOW and\n60ma"
    },
    {
      "barNumber": "21",
      "description": "L2 19 but tail, AIL, and still on DB B 18 and 20, NS, HPW for BO below 7 18\nDB, PS BB"
    },
    {
      "barNumber": "22",
      "description": "TRI 18 20, DB 7, AIL, but DD, NS"
    },
    {
      "barNumber": "24",
      "description": "H1 but BRD, NS. BLT, FBO 23, but DD, S2. BLE4 or below 18 DB. TRI 1 13, BOM,\nbut AIL"
    },
    {
      "barNumber": "27",
      "description": "DBPB but DD and 3 BRB, on 25 S, B2. BLE4. still AIL but on 25 TRI S, TRI 1 13\n23"
    },
    {
      "barNumber": "28",
      "description": "DBPB, AIL, but apex TRI, BOM, tail, B2. 25 BRE above BLB"
    },
    {
      "barNumber": "31",
      "description": "BL FT, but still PS DT 13, W 19 23, BLE4, PS swing up. still in TRD but SBU\n30 and BLFT"
    },
    {
      "barNumber": "32",
      "description": "W and DT, COL, BLE, ok swing S, but still likely 2LSU after SBU 30"
    },
    {
      "barNumber": "34",
      "description": "H1, COH, AIL, but top of TR, NS"
    },
    {
      "barNumber": "36",
      "description": "DT 32, LH DT 13, PH, but BRD, NS, S2. BLE4"
    },
    {
      "barNumber": "38",
      "description": "W 23 30 37, HH DT 13, IOI, COL, PH, but TTR, holding above MA, still in SPBL,\nNS, PS BB"
    },
    {
      "barNumber": "39",
      "description": "H1 at MA, AIL, but CC BRB, TTR 31, B2. BRE above 37 or BLB"
    },
    {
      "barNumber": "40",
      "description": "H1, BLB, but TTR"
    },
    {
      "barNumber": "43",
      "description": "BO 13, CCBLBC, BTC, but top of BLCH 19, PS DT 1, BLE4"
    },
    {
      "barNumber": "44",
      "description": "LH DT 1, W 23 30, PH, but 4 BLB, PS BB, S2 or NS"
    },
    {
      "barNumber": "45",
      "description": "H1, but top of BRCH and at HOD so PS DT, NS, OK to wait to B PB to MA"
    },
    {
      "barNumber": "46",
      "description": "LH DT 1, L2, top of CH, MA MGB, but DD, NS. BLE4"
    },
    {
      "barNumber": "47",
      "description": "SBD, but still AIL"
    },
    {
      "barNumber": "48",
      "description": "H1 at MA in BLCH, but W top and SBD, PP SA for 2LSD, B2"
    },
    {
      "barNumber": "49",
      "description": "H1, BLB, BLCH, but PP MRVU after W and LH DT 1, and then TR. PST to 11:30\noften enters tight trading range and becomes Limit Order Market so failed\nbreakouts are common\">MTD"
    },
    {
      "barNumber": "50",
      "description": "LH, 2LSD likely, but at MA. TR more likely than BRT so PS BB at MA and PP at\n34 L, MRV, PS LOM and tight TR"
    },
    {
      "barNumber": "52",
      "description": "L1 but BLD, TTR, PS LOM and BB, S2. MGN below are OOD and 27 apex of Tri,\nwhich is near OOD"
    },
    {
      "barNumber": "54",
      "description": "W 48 51 BLF at EMA, but TTR 48, OOD and apex of TRI MGN, NS"
    },
    {
      "barNumber": "58",
      "description": "DB 51 at MA, but TTR and ledge bottom, NS"
    },
    {
      "barNumber": "61",
      "description": "3 CC BRB, TCH, OOD MGB, but tails, not strong enough to S near L. still on S\nbelow 46 and 50, becoming AIS but need BRBC"
    },
    {
      "barNumber": "63",
      "description": "BO, C below 62, OOD MGB, but weak BRT. BL want DB 39 but 5 CC BRB, should go\nLR"
    },
    {
      "barNumber": "64",
      "description": "CC BBLBC, AIS, OOD MGB, but bad FT after every BO UD today so PS BTC. even if\nbounces 1 - 2 bars, still should reach OOD since TRD. BR want big BRT so that\nthere would be good SSB on dail chart for FF top, but more likely will remain\nTRD and PP will C around OOD."
    },
    {
      "barNumber": "66",
      "description": "COL, LOD MGB, but might get PTG at OOD"
    },
    {
      "barNumber": "67",
      "description": "CCBBRBC, but OOD MG so PP bounce soon. BRE4"
    },
    {
      "barNumber": "81",
      "description": "End of Day"
    }
  ],
  "9": [
    {
      "barNumber": "1",
      "description": "Y was TRI so MGN if BOUD. BBRBC, OD< F BO above TRI, PH, but TR, better to\nwait for breakout or 2nd signal. Low probability, bad for stop entries.\">BBBR,\n60ma SP not far below, NS"
    },
    {
      "barNumber": "2",
      "description": "CCBRBC, STC, SBDM, but at 60ma so LP, and TR, better to wait for breakout or\n2nd signal. Low probability, bad for stop entries.\">BBBR, NS, S2"
    },
    {
      "barNumber": "3",
      "description": "F BO Tri, SV test 60ma, PL, but BBR, after SBD so LP, B2. BDUC, HPW"
    },
    {
      "barNumber": "4",
      "description": "BBLB but tail at MA, not BTC. still on S below 1 but BDUC, most should wait.\nL1 but CCBBLB, PS BB, S2"
    },
    {
      "barNumber": "6",
      "description": "H2, but DD and just below MA, LP, B2. On L1 S 4, but 2 BBLB, S2. HPW"
    },
    {
      "barNumber": "7",
      "description": "L1 but TRO, PP BB, NS. H1 but BRB just below MA, TRO, PP SA. LOM"
    },
    {
      "barNumber": "9",
      "description": "5 CCBRB, test 2 C and 60ma. BR want BO ,and BL want DB and LOD"
    },
    {
      "barNumber": "10",
      "description": "HL DB at 60ma, BRE, PL, but tail, 5 BRB, LP so NS. ok to wait for BO above\nMA. still AIS"
    },
    {
      "barNumber": "11",
      "description": "CCBRB, COH, but small bar and just below MA< still PS SPBR. BL need BO above\nMA"
    },
    {
      "barNumber": "13",
      "description": "L1, DTBF 8, but DD, CC BLB, TRO, NS, S2. BLE4"
    },
    {
      "barNumber": "14",
      "description": "OU, BO DT 1 3, BO MA, still on 10 DB B, but not big BO, C below 13 H and MA,\nstill AIS"
    },
    {
      "barNumber": "15",
      "description": "Y was small day and today reversed up from below LOY so PS OUD. C above MA\nand 14 H, but tail, small body, not yet BLT, PS still AIS. BR want DT 4."
    },
    {
      "barNumber": "17",
      "description": "F BO 4, HH DT, PW 12 15, BLE, still TRO, but DD, TC, LOM, S2"
    },
    {
      "barNumber": "18",
      "description": "EB for DT, PP still AIS, but tail, DT and DB, middle of TRO, S2"
    },
    {
      "barNumber": "19",
      "description": "L1, COL, below MA, DT, AIS, PH, ok swing but middle of TRO, just above 60ma,\nLP, NS, S2"
    },
    {
      "barNumber": "20",
      "description": "OU but tail, C below MA, still on 19 L1S, BRE4."
    },
    {
      "barNumber": "22",
      "description": "BO, C above MA and 21 but still TRO, and BL need BBLBC and EMA and closing\nnear their highs so probably will go higher and possible Buy The\nClose\">CCBLBCMA. BR want F BO, BRB, L2 19"
    },
    {
      "barNumber": "24",
      "description": "II, Apex of TRO, COL and above MA, PL, but TTR, NS. DT PB, but BLBC above MA\nso S2"
    },
    {
      "barNumber": "25",
      "description": "BLB, but DD. still on 24 II B, but BR want F BO and WBRF 20 22. BL want OUD,\nwhich would be new ATH"
    },
    {
      "barNumber": "26",
      "description": "WBRF, LH, but DD, 7 BBRMC, S2, BLE4. still in TRO, but PS AIL after 24 25\nEMA, but bulls need big bull bars closing near their highs to significantly\nincrease the chance of much higher prices.\">CCAMA"
    },
    {
      "barNumber": "31",
      "description": "W 4 17, SBD, but 10 BBLMC, PP MRV, BLE. still AIL, S2"
    },
    {
      "barNumber": "32",
      "description": "W, IOI, but TCL, HOY MGA, BLB, S2. BLE below BRB 31 or below 18"
    },
    {
      "barNumber": "33",
      "description": "II, but TC, S2. H1 but W, NS"
    },
    {
      "barNumber": "34",
      "description": "BRD, but PP MRVD to MA and 50P, NS"
    },
    {
      "barNumber": "35",
      "description": "SBD, but C above MA, PP MRV"
    },
    {
      "barNumber": "36",
      "description": "PB to EMA, F BO II, 50P, AIL, but 3 BRB, 7 BBRMC, PS SA and more SD, B2.\nstill AIL so most BR who sold below MA will be DBR and will scalp out"
    },
    {
      "barNumber": "38",
      "description": "H2 36 above MA, COH, AIL, but TC 36, W 31, PP MBO, PS TTR, NWS, B2, S2"
    },
    {
      "barNumber": "45",
      "description": "COH, above MA, but PS BRF after 31 SBD. TTR, LOM, BTW"
    },
    {
      "barNumber": "46",
      "description": "OO, but TTR, NS, HPW"
    },
    {
      "barNumber": "47",
      "description": "F BO II and EMA, AIL, but TTR, LOM, NS, B2"
    },
    {
      "barNumber": "50",
      "description": "OU, DB 36, most bars in TTR are above MA, C above MA, but TTR, LOM, B2, S2"
    },
    {
      "barNumber": "55",
      "description": "Trending closes since 49 so BGP, increase chance of HR, but many DD, NS, B2"
    },
    {
      "barNumber": "60",
      "description": "BO, BR giving up after trending closes"
    },
    {
      "barNumber": "61",
      "description": "CCBBLBC, PS EG, but still trending closes, TCH, S2, still BTC, but near HOD\nand HOY so PS PB soon"
    },
    {
      "barNumber": "62",
      "description": "BRB, BLE or BLE4. BX, DT 1, PS PTG"
    },
    {
      "barNumber": "63",
      "description": "SBD, but PP MRV. SBD after BX so PP 2LSD, B2"
    },
    {
      "barNumber": "64",
      "description": "L1 but BLB just above MA, PP BB and at MA and 50P, LPS, S2. H2 but SBD 63,\nBX, B2. PS BB and SA so PS TTR"
    },
    {
      "barNumber": "66",
      "description": "III after BX, but just above MA, PP BB. BX so PP 2LSD and PP SA. NS"
    },
    {
      "barNumber": "67",
      "description": "BO below III, but tail, just above MA, NS. H1 but 3 BRB, PP SA"
    },
    {
      "barNumber": "81",
      "description": "End of Day"
    }
  ],
  "11": [
    {
      "barNumber": "1",
      "description": "SGU to new ATH. BRBC, PH, but NS. Y was small range so PS ODD."
    },
    {
      "barNumber": "2",
      "description": "BBLBC, H1, BRE, PL, but still on S 1. NMI"
    },
    {
      "barNumber": "3",
      "description": "H1, AIL, MDB 1, but DD, PS TTR, NS"
    },
    {
      "barNumber": "4",
      "description": "BLBC, BO 1, AIL, but not yet BTC since not yet CCBLBC. still PS TRO"
    },
    {
      "barNumber": "5",
      "description": "H1, but BRB. L2 1 but after 3 BLBC. PS TRO, NS. BLE or BLE4"
    },
    {
      "barNumber": "6",
      "description": "CCBRBC,MDT, PH, but still PS SPBL, NS"
    },
    {
      "barNumber": "7",
      "description": "L1, but BLD, AIL, PS BB and SPBL, N2. H1 but DD after 2 BRB, NS. still on B\nabove 3 and S below 5, BOM, HPW"
    },
    {
      "barNumber": "8",
      "description": "HL DB 2, H1, but TR, better to wait for breakout or 2nd signal. Low\nprobability, bad for stop entries.\">BBBR, top of TRO so LP, PS SA and more LOM.\nNS, B2, S2"
    },
    {
      "barNumber": "9",
      "description": "OO, but TTR so LOM, even though BOM"
    },
    {
      "barNumber": "10",
      "description": "H2, but DD, top of TRO, NS. still on 5 L2. BOM, HPW"
    },
    {
      "barNumber": "11",
      "description": "still H2, BOM"
    },
    {
      "barNumber": "12",
      "description": "II, apex TRI, BOM. MGA GXH, MGB MA"
    },
    {
      "barNumber": "13",
      "description": "SBD, BO below TRI, but still above L of 1 and at MA, 50% chance BRTP"
    },
    {
      "barNumber": "14",
      "description": "DB 2 at MA, still AIL, PL, but DD, NS. BRE"
    },
    {
      "barNumber": "15",
      "description": "BBLBC, AIL, GXH MGA, PS early BTC, but still in TR, 14 is BBSB so might test\nH of 14. still in TRO"
    },
    {
      "barNumber": "16",
      "description": "H1 but BRB, still TRO, PS SA. AIL, GXH MGA, but still BOM"
    },
    {
      "barNumber": "17",
      "description": "DT 10, but DD, just above MA, stil TRO, S2. still PS PB from 15"
    },
    {
      "barNumber": "18",
      "description": "SBD, but still in TRO. BR want ODD. BOM"
    },
    {
      "barNumber": "19",
      "description": "Big BO. EMA. Lower prices likely. Always In Short and Sell The Close bear\ntrend.\">CCBBRBCMA but tail. PS MMD and TTR, PS ODD"
    },
    {
      "barNumber": "20",
      "description": "L1, but tail 19, and near MMD so PS BB 19. still AIS, MGB COY, 60ma, GXL, and\nLOY, PS ODD"
    },
    {
      "barNumber": "21",
      "description": "MDB, PW 14 19, but BRB, 6 BRB, B2. BRE4"
    },
    {
      "barNumber": "22",
      "description": "MW 19 21, PL, but 7 CC BRB, PP MRV, PS SA"
    },
    {
      "barNumber": "24",
      "description": "L1, COL, AIS, but TR, better to wait for breakout or 2nd signal. Low\nprobability, bad for stop entries.\">BBBR, PS TTR 20, NS, PS BB"
    },
    {
      "barNumber": "25",
      "description": "MDB 22, BRE, but tail, top of TTR, just below MA, still on 24 L1 S, B2"
    },
    {
      "barNumber": "26",
      "description": "L2 just below MA, MGB, but middle of TTR, LP, NS, PS LOM"
    },
    {
      "barNumber": "27",
      "description": "SBD, MGB are COY,, 60MA, LOY, GXL. weak selloff so PS REVU at some point, PS\nW 2 22"
    },
    {
      "barNumber": "29",
      "description": "W 2 22, W 19 22, BLB, BRE, but tail, MGB, NS, B2. BL need BLBC, else will PP\nreach MGB"
    },
    {
      "barNumber": "31",
      "description": "SBU, 3 CC BLB, C above MA, PS LOD, but PS DTt 23 and STC and BRCH at MA, NS"
    },
    {
      "barNumber": "32",
      "description": "LH at MA in BRCH, DT 23, MGB, but SBU, 3 BLB, PS BB, NS"
    },
    {
      "barNumber": "33",
      "description": "H1 31, but CCBRB just below MA in BRCH and LTR in TTRD, B2. BRE4. weak\nselloff and weak reversal so PS TR. MGB and weak REV so might have to reach MGB"
    },
    {
      "barNumber": "35",
      "description": "HL, BLB, but 3 BRB and just below MA, still PS BRCH, NS, top of LTR, MGB, B2"
    },
    {
      "barNumber": "36",
      "description": "TRI 23 32, but BLB, C above MA, CCBLB, still on 35 B, PS BB, S2. LTR, BOM.\nBLE4. deciding if 29 will remain LOD or if willl test LOY. weak BRT so PP will\nnot become strong BRT. More likely, continued TR, or BB around COY or LOY"
    },
    {
      "barNumber": "37",
      "description": "BO, C above 36, but need EMA, but bulls need big bull bars closing near their\nhighs to significantly increase the chance of much higher prices.\">CCAMA for\nMMU, else PS F BO DT, which is type of W top, and BVT 2 L bottom of UTR"
    },
    {
      "barNumber": "40",
      "description": "MDT, BT 2 L, F BO DT 23 32m but 4 BLB, BLD, PS TRVU from W bottom, PS SPBL,\nBLE4, S2"
    },
    {
      "barNumber": "41",
      "description": "II, SPBL, BL want BO above 2 L at bottom of UTR and then BO GXH, but weak\nrally, ledge, PS FF and W 32 38, then test 35 L, NS"
    },
    {
      "barNumber": "44",
      "description": "BO and FT, getting back in UTR. but PS W 32 39, PS II FF 41. TC, MRV. GX H\nMGA"
    },
    {
      "barNumber": "45",
      "description": "W 32 39, BLE4, but TC, MRV, GXH MGA"
    },
    {
      "barNumber": "47",
      "description": "H1, but PP 2LSD after W so NWS"
    },
    {
      "barNumber": "49",
      "description": "OD, MDT 45, but PP MRV, might test 41 HL or 35 HL. might form TTR around MA"
    },
    {
      "barNumber": "50",
      "description": "SBD, might test 35 L, but PP MRV, PS BRTP"
    },
    {
      "barNumber": "51",
      "description": "H2 47, DB 41 II, but tail, NWS. PS TR might continue until 11:30 AMPT"
    },
    {
      "barNumber": "53",
      "description": "H1, but top of TTR, NS, NWS, B2. PS LOM"
    },
    {
      "barNumber": "55",
      "description": "H1, AIL, but BRB, top of TTR, NS, PS LOM"
    },
    {
      "barNumber": "57",
      "description": "DT 45. top of TR, but tail, just above MA, GXH MGA, S2"
    },
    {
      "barNumber": "58",
      "description": "SBD but still in TTR, PS BTC, S2"
    },
    {
      "barNumber": "59",
      "description": "3 CCBBRBC, PS AIS, but bottom of TR, PS BTC, S2"
    },
    {
      "barNumber": "60",
      "description": "DB 50 but 3 BRB, TTR 38"
    },
    {
      "barNumber": "63",
      "description": "DT 56 at top of TTR38, still did not test below ledge 41 so MGB, but DD, AIL,\nLPS, PS BB, S2"
    },
    {
      "barNumber": "65",
      "description": "H1, but top of TTR, B2"
    },
    {
      "barNumber": "67",
      "description": "BO 56, but PS DT 45, BL need 1 more strong bar. BR will STC, expecting REVD\nto 60 L at ledge"
    },
    {
      "barNumber": "81",
      "description": "End of Day"
    }
  ],
  "13": [
    {
      "barNumber": "1",
      "description": "LDW. YBX. BRB, but tail. PP STC for closure of gap, but TCH so PP MRV. MGB\nHOY, COY, MA, GXL"
    },
    {
      "barNumber": "2",
      "description": "H1, test of MA and COY, PL, but CC BRB, PP MBO, NS, PP SA and above 1. 50%\nchance of rally for about an hour, but 75% chance of SD for at least a couple\nhours starting by end of 2nd hour. TR might have already begun"
    },
    {
      "barNumber": "3",
      "description": "BLB, but tail. 50% chance FT BG after Y BX. top of BL CH on daily chart is\nMGA, around 4466"
    },
    {
      "barNumber": "4",
      "description": "CCBLBC, but tail, far above MA, TR likely witihn couple hours, NS"
    },
    {
      "barNumber": "5",
      "description": "L2 top but tail. H1 but BRB, PS W 1 4, PS SA, N2, B2. LBRM and LBLM so PS TRO.\nS2,"
    },
    {
      "barNumber": "6",
      "description": "L2, II, COL, PH, but TC, NS"
    },
    {
      "barNumber": "7",
      "description": "BBRB but tail. PS AIS since good SSB 6 and L2 top after SX Y, but TR more\nlikely than BRT. LLDB 1, but 3 BLB, PP MRV"
    },
    {
      "barNumber": "9",
      "description": "DB at MA, but DD, still on 6 S, ok to exit short, ok to keep stop above 4. So\nfar, TRO, but holding above MA"
    },
    {
      "barNumber": "10",
      "description": "SBU, but still below 4 H. PP AIL, ok BTC, but NS. PS SA 4 for ET 1 4. top of\nBL CH on daily cnart is MGA, around 4465"
    },
    {
      "barNumber": "11",
      "description": "LH DT, still on 6 S, but BLB, TRO, SBU 10, NS"
    },
    {
      "barNumber": "12",
      "description": "BBRB, but TRO, BL BTC of BRB and BR STC of BLB. still on 6 S and 9 B, but BR\ncase is slightly more likely"
    },
    {
      "barNumber": "13",
      "description": "L1, still on 6 S, but BLB just above MA. No C below MA in 70 bars so should\nget one soon. MGB 77 L at bottom of Y FF. TRO so BOM and PS MM UD"
    },
    {
      "barNumber": "14",
      "description": "1st C below MA in 70 bars. Still TRO, S below 6 is HRP than B abovve 9. BOM.\nH1 after 10 SBU, but 5 BBRMC, TRO, MRV"
    },
    {
      "barNumber": "17",
      "description": "COL, apex of TRI 4 11, still on 6 S, but middle of TRO so only slightly\nbetter for BR and PS BB. H1, but BRB. LOM"
    },
    {
      "barNumber": "18",
      "description": "H2 at MA, but TRO, NS. still ok to be short, stop above 4"
    },
    {
      "barNumber": "20",
      "description": "H1, PS SPBL, but BRB, TRO."
    },
    {
      "barNumber": "21",
      "description": "C above 19 so BO and PS MMU to new HOD, near top of BLCH on daily. still TRO,\nPS W LH 16 18, BL need FT, BR need SSB 22"
    },
    {
      "barNumber": "22",
      "description": "W but 1t BRB, SPBL 15, NS, PS BB. TRI 4 11, BOM"
    },
    {
      "barNumber": "23",
      "description": "small BRB, but TRO so PS BTC. BL want BO above W 22 and then MMU. BR want\nreversal down from W LH. apex of TRI, BOM and so far, no strong BO UD"
    },
    {
      "barNumber": "24",
      "description": "H1, SPBL, but still in BOM, NS"
    },
    {
      "barNumber": "25",
      "description": "LH DT 22, but just above MA, apex TRI, BOM, HPW or use wide stop and be long\nor short"
    },
    {
      "barNumber": "30",
      "description": "MDB 26, COH, C above MA, but apex ot TRI, LOM, NS, HPW"
    },
    {
      "barNumber": "37",
      "description": "BO below TRI and MA, but need F, else BRTP at bottom of TR"
    },
    {
      "barNumber": "39",
      "description": "bull IB so weak follow-through after small breakout so many bears will exit.\nL1 but bull bar so LP S. F BO, but just below MA, tail, B2. BR hope SA and then\nL1, BL want FBO . small bars, no energy, not strong B or S, still in TR"
    },
    {
      "barNumber": "42",
      "description": "CC BLB, FT after 41 REVU, but still small bars and in TR, weak BTC. DT 31 but\n4 BWBRB and SBU 41, PP BB, S2."
    },
    {
      "barNumber": "46",
      "description": "SBU, but at top of TRI so PS STC. B2, NS. C at OOD, top of TTR 31"
    },
    {
      "barNumber": "48",
      "description": "II, AIL, but top of TRI, BOM, NS"
    },
    {
      "barNumber": "50",
      "description": "BO above TTR 31, but need FT since still in TR. NS. BL want TRSU from Y, BR\nwant F BO"
    },
    {
      "barNumber": "51",
      "description": "BO, but tail and still below 4 HOD, not reliable BTC, B2. Still AIL"
    },
    {
      "barNumber": "54",
      "description": "III, H1 but 3 DD, PS SA, NS, B2. DT LH 11 but 3 DD, S2. AIL, BOM, but BRB at\ntop of TR, PS LOM, BTW"
    },
    {
      "barNumber": "55",
      "description": "H1, ledge, but 4 BB, top of TRD"
    },
    {
      "barNumber": "57",
      "description": "F BO ledge, top of TRD, but TTR, 7 DD, LOM, S2"
    },
    {
      "barNumber": "62",
      "description": "EMA and closing near their lows so probably will go lower and possible Sell\nThe Close\">CCBRBCMA, but not big bars. PP AIS"
    },
    {
      "barNumber": "63",
      "description": "BBRB, but bottom of TRD, tail, PS BRTP"
    },
    {
      "barNumber": "64",
      "description": "DB 8, BRE, but tail, B2. L1 but BLB at bottom of TR, NS, PS BB"
    },
    {
      "barNumber": "65",
      "description": "II, 2 BLB, DB 9, PL, BRE, but tails, TRD, NS"
    },
    {
      "barNumber": "67",
      "description": "4 CC BLB, but C not above 66 or MA so not yet BTC. L1 but 4 BLB, PP BB"
    }
  ],
  "17": [
    {
      "barNumber": "1",
      "description": "Y BX. BGD. today will PP mostly OL Y so PP BB around LOY and SA around HOY. PS\nID. BLB, HL, PL, but DD, B2"
    },
    {
      "barNumber": "4",
      "description": "L1 at 60ma and OOW, PH, but PP BB 1 and LOY, NS. BR want big BRT after Y big\nBLT, which could be start of correction on daily chart.."
    },
    {
      "barNumber": "5",
      "description": "SBD, CCBRB1C, but PP BB around LOY, NS, PS BB 1 for H2"
    },
    {
      "barNumber": "7",
      "description": "H2 1, MDB, test LOY, PL, but BRB, 4 BRB, SBD 5, BRE4, B2"
    },
    {
      "barNumber": "8",
      "description": "BLB, PL, but tail, BRE, B2. L1 but BBLB, PP BB for W 1 6"
    },
    {
      "barNumber": "9",
      "description": "BLB but tail, PS DT3, TR, better to wait for breakout or 2nd signal. Low\nprobability, bad for stop entries.\">BBBR, B2, TRO"
    },
    {
      "barNumber": "10",
      "description": "DT 3 near MA, PH, but CCBBLB, LP, SBU 8 9, S2. 7 H MGB since BBSB"
    },
    {
      "barNumber": "13",
      "description": "1t F BO HOD 3, DT 3 at MA and 60ma, PH but still on 7 B. might have to test 7\nH since BSB. TRO"
    },
    {
      "barNumber": "15",
      "description": "OU but top of TRO and just below MA and 60ma, still BOM, LOM. DB 11 15, DT 12\n15"
    },
    {
      "barNumber": "17",
      "description": "W 3 13 at MA, PH, but tail, TTR 10, TRO, S2"
    },
    {
      "barNumber": "18",
      "description": "BBRBC, but TRO so PS BTC, HPW S CCBRBC"
    },
    {
      "barNumber": "19",
      "description": "CCBRB1C, but bottom of TTR 10, NS"
    },
    {
      "barNumber": "20",
      "description": "BO below 11 HL, 4 BRB, but bottom of TTR 10, tail, not strong STC, NS"
    },
    {
      "barNumber": "21",
      "description": "LL DB 11, bottom of TTR 10, OU, but 4 BRB, PS SA, B2, NS"
    },
    {
      "barNumber": "22",
      "description": "CCBLBC, but small bodies, just below MA, NS, B2. L1 but CC BLB bottom of TTR\n10, S2. still LOM, BOM"
    },
    {
      "barNumber": "23",
      "description": "LH at MA in BRCH, but bottom of TTR 10, NS, HPW. PS BB 21 for W 11 21. BOM"
    },
    {
      "barNumber": "25",
      "description": "HL MTR, W 11 21, OU, PL, but TR, better to wait for breakout or 2nd signal.\nLow probability, bad for stop entries.\">BBBR so NS, just below MA in BRCH so LP,\nPS SA, HPW to B after BO above MA since PS STC like 9 12 15 16 22"
    },
    {
      "barNumber": "26",
      "description": "IOI in BRCH, AIS 19, but near bottom of TRO, NS"
    },
    {
      "barNumber": "28",
      "description": "L1, AIS, BRCH, LOY MGB, but DD, NS. BR want MMD below W 21 25 27 and BL want\nF BO"
    },
    {
      "barNumber": "30",
      "description": "CCBBRBC, STC, testing LOY. BR want BO and BL wat REVU"
    },
    {
      "barNumber": "31",
      "description": "L1 but BLB, PS DSTC BR 31 and BB for MDB"
    },
    {
      "barNumber": "33",
      "description": "F BO LOY, MDB, BRE, PL, but TC and tail so PP MRV, PS LTR in TTRD. BRE, but\nB2. MDT 32 but 2 BLB, PS BB, NS. PS LTR in TTRD. LLW and OOM MGB"
    },
    {
      "barNumber": "34",
      "description": "MDB 31, LBLM, but BRB, NS, B2, BRE4. PS SA and LTR in TTRD"
    },
    {
      "barNumber": "35",
      "description": "F BO LOY, MDB, but tail, B2. MDT 32, LLW MGB, but BLB, PS LOM and LTR, S2"
    },
    {
      "barNumber": "36",
      "description": "DTBF 32 bur 2 BLB, PS LTR, PS BB, S2"
    },
    {
      "barNumber": "38",
      "description": "CCBBRBC, SBD, should test LLW, but TR, better to wait for breakout or 2nd\nsignal. Low probability, bad for stop entries.\">BBBR"
    },
    {
      "barNumber": "43",
      "description": "F BO LLW, PW39 40, 41M, PL, SX, BRE, but PP tail, OOM MGB, MRV"
    },
    {
      "barNumber": "44",
      "description": "CCBRB1C, PP swing SU, but PS TR"
    },
    {
      "barNumber": "45",
      "description": "L1, OOM MGB, but 3 BLB and SX, PP 2LSU, S2"
    },
    {
      "barNumber": "46",
      "description": "HL, but BRD, NWS, B2. L1 45, but S2. PP TR"
    },
    {
      "barNumber": "48",
      "description": "SBU but at MA, so PS STC for L2"
    },
    {
      "barNumber": "49",
      "description": "20GBS, L2, but 4 BBLBC, PP MBO and TR, NS"
    },
    {
      "barNumber": "50",
      "description": "BBRB, but PS BTC and TR, NS. OOM MGB"
    },
    {
      "barNumber": "52",
      "description": "HL MTR, but 4 BRB after SBD, OOM MGB, MRV"
    },
    {
      "barNumber": "53",
      "description": "BLB but tail. only 3 bars with H above EMA today and most BRTD have more so\nshould get back above EMA"
    },
    {
      "barNumber": "54",
      "description": "BO above MA, but need FT, else DT 48 and ET 45 48. MGA 37 H SX H and LOY and\nMMU. LOY is also 50P"
    },
    {
      "barNumber": "55",
      "description": "EMA. Higher prices likely. Always In Long and Buy The Close bull\ntrend\">CCBBLBCMA, SBU, MGA. PP BB around MA. 49 H BOP MGB"
    },
    {
      "barNumber": "56",
      "description": "ET 45 49, but SBU, 4 BLB, MGA, PP BB around MA and 49 H and 50P, S2"
    },
    {
      "barNumber": "58",
      "description": "F BO LOY and 50P, PP MRV, 49 H BOP and 50P MGB"
    },
    {
      "barNumber": "59",
      "description": "H1, but BRD, CC BRB, at RS, did not reach 48 H MGB, NWS, B2"
    },
    {
      "barNumber": "63",
      "description": "HL, AIL, COH, but 5 BRB, NWS"
    },
    {
      "barNumber": "64",
      "description": "CCBBLBC, might stay around MP of day for rest of day. it is exactly at LOY"
    },
    {
      "barNumber": "65",
      "description": "LH DT 58, TW 49 58, but CCBLBC, PP MRV and BB, NS. PP TR around OOD for rest\nof day. AIL, but PP TR. 37 SXH MGA"
    },
    {
      "barNumber": "66",
      "description": "SBU, BO 58, PS MG, MGA OOD and 60ma, but BL meed FT. If no FT, then PP TR\narould LOD"
    },
    {
      "barNumber": "67",
      "description": "FT, but tail, and PS TR around LOY. BL want BTR and COD above OOD, but TR\nmore likely. W 49 58, BLE4, but 4 BBLB, S2"
    },
    {
      "barNumber": "81",
      "description": "End of Day"
    }
  ],
  "19": [
    {
      "barNumber": "1",
      "description": "YSX. BGD. After 2 big bear days, increased chance of bull day. If early bear\ntrend, increased chance of bull trend reversal. SBUM, PL, but TR, better to wait\nfor breakout or 2nd signal. Low probability, bad for stop entries.\">BBBR"
    },
    {
      "barNumber": "2",
      "description": "L1 but tail, PP BB"
    },
    {
      "barNumber": "3",
      "description": "H1 and H2, PL"
    },
    {
      "barNumber": "4",
      "description": "DD but BLB, still AIL since 1, still PP LOD so either BLT or TRD, and BRT\nunlikely"
    },
    {
      "barNumber": "5",
      "description": "BBLBC, but at LOY. still AIL, but NWS since TR, better to wait for breakout or\n2nd signal. Low probability, bad for stop entries.\">BBBR"
    },
    {
      "barNumber": "6",
      "description": "BRB so bad FT, but still AIL, MA and GXH MGA. PS PW 1 5"
    },
    {
      "barNumber": "7",
      "description": "BLB, but PS PW 1 5 at MA and GXH. BL want MG 7 but at RS so PP PB soon"
    },
    {
      "barNumber": "8",
      "description": "PW 1 5 7, BRB, BLE4, but tail, 6 BBLMC, GXH MGA, PS BB, PS MG 7, S2. H1, but\nGXH and MA just above, BRB, PS PW, PS SA, NS. strong rally, but weak FT, Y TCH,\nPP PB soon"
    },
    {
      "barNumber": "10",
      "description": "BO GX H, MA, 4400 BRN, OOM MGA, but tail, PW, Y tight BR CH, PP PB soon"
    },
    {
      "barNumber": "11",
      "description": "PW 5 7 at MA and GXH, BBRBC, BLE. strong BLT so PP MRV. might get 2LSD but\nTR, better to wait for breakout or 2nd signal. Low probability, bad for stop\nentries.\">BBBR"
    },
    {
      "barNumber": "12",
      "description": "H1 but DD, PP 2LSD after PW, PP SA"
    },
    {
      "barNumber": "13",
      "description": "BBRBC, closed BDG 5, PS MMD"
    },
    {
      "barNumber": "14",
      "description": "CCBBRBC, AIS, but TR more likely than new LOD"
    },
    {
      "barNumber": "15",
      "description": "smaller BRB, PP bounce and TR soon, BRE4"
    },
    {
      "barNumber": "16",
      "description": "HL MTR, TR likely, BRE4, but 4 BRB, 7 BBRMC, PP MRV, B2 or NWS"
    },
    {
      "barNumber": "18",
      "description": "SBU 17 18, but TR, better to wait for breakout or 2nd signal. Low\nprobability, bad for stop entries.\">BBBR. BR want LH and TRI 1 10 16, but S2"
    },
    {
      "barNumber": "19",
      "description": "BRD so DBTCBL 18. LH DT 10, but DD after SBU, S2. PS TR. BRTD unlikely today"
    },
    {
      "barNumber": "20",
      "description": "BBRBC, MDT 18 19, LH DT 10, but SBU 17 18, PP MRV, NS. might go SW for\nseveral bars and then H1 with BLB"
    },
    {
      "barNumber": "21",
      "description": "H1, AIL, but tail, TTR 18, NWS. L1 but BLB, AIL, PP BB, S2"
    },
    {
      "barNumber": "22",
      "description": "OU, OOM MGA, AIL, but TTR 19, NS"
    },
    {
      "barNumber": "24",
      "description": "SBD, but still in TTR and AIL, PS LOM. MDT 19, but LPS, S2. MDB 20 but BBRBC,\ntop of TTR, B2"
    },
    {
      "barNumber": "26",
      "description": "II, AIL, BLF, but DD, top of TTR, NS"
    },
    {
      "barNumber": "27",
      "description": "BBLBC, PS BTC, BO above 4400 BRN and HOD, MGA OOM and LLW and 76 SX H"
    },
    {
      "barNumber": "28",
      "description": "SBU 27 28, BTC, but in RSZ at OOM and just below LLW and 60ma."
    },
    {
      "barNumber": "29",
      "description": "BRB so PB and H1 B, LLW and 60ma MGB, but PS SA, NS"
    },
    {
      "barNumber": "30",
      "description": "MDT, PW 19 28, 4400 BRN MGB, but BLB, S2. BLE4. LLW and 60ma MGA"
    },
    {
      "barNumber": "31",
      "description": "MW, PW, but BLB, PP MRV, BLE, BR NWS, S2"
    },
    {
      "barNumber": "32",
      "description": "SBD, but PS BRTP and BT 4400 BRN and MA, S2"
    },
    {
      "barNumber": "36",
      "description": "IOI, H2, just above MA, but NWS since MA and 4400 BRN MGB. B2"
    },
    {
      "barNumber": "39",
      "description": "LH, MGB are MA and 4400 BRN, and 23 H BOP, but 3 BLB, still AIL, TR 29, PP\nMRV"
    },
    {
      "barNumber": "40",
      "description": "H1, AIL, LLW MGA, but DD, top of TR 29, NS. if get new H, then PS W 10 31"
    },
    {
      "barNumber": "42",
      "description": "DT, top of TR, W 35 39, TW 10 31 or 19 21, MGB, but PP MRV"
    },
    {
      "barNumber": "43",
      "description": "SBD, migt test 24 HL"
    },
    {
      "barNumber": "45",
      "description": "H2 35 at MA, but SBD 43, MGB, B2. L1, MDB, but BLB, bottom of TR 29, PP BB\nand more TR"
    },
    {
      "barNumber": "47",
      "description": "L2, 24 L and TTR MGB, but doji, NS, MBO"
    },
    {
      "barNumber": "49",
      "description": "H2 44, F BO DB 35 44, but DD, SBD, MGB COY, 24 TTR L, B2"
    },
    {
      "barNumber": "50",
      "description": "MW 44 49, H2 44, HL DB 24, but SBD 48, MGB, TC 42, NWS, B2"
    },
    {
      "barNumber": "51",
      "description": "L1, MGB, but 2 BLB, near bottom of TR 24, PP BB and below 50, NS"
    },
    {
      "barNumber": "52",
      "description": "H1 but 4 DD just below MA, MGB, LOM, B2"
    },
    {
      "barNumber": "55",
      "description": "CCBBRBC, might test 15 C, but middle of TR and PS W 44 50, PS BTC, NS"
    },
    {
      "barNumber": "56",
      "description": "W 44 50, PL, BRE, but tail, room to 15 HL, 3 BBRB, NS. also, might wait for\n11:30 before trying to REV"
    },
    {
      "barNumber": "57",
      "description": "L1 but DD after BLB and W bottom, PS BB and around 15 L, NS, S2"
    },
    {
      "barNumber": "58",
      "description": "H2, W, nit TC, just below MA, 16 L MGB, might not REVU until 11:30 AMPT, NS"
    },
    {
      "barNumber": "60",
      "description": "OD after L2 59 at MA in BRCH, 16 HL MGB, but BBRB, and PS F BO W, NS"
    },
    {
      "barNumber": "61",
      "description": "F BO W, LL DB 16, PL, but TR, better to wait for breakout or 2nd signal. Low\nprobability, bad for stop entries.\">BBBR"
    },
    {
      "barNumber": "62",
      "description": "L1, BLE4, but 2 BLB, F BO, NS, PS BB"
    },
    {
      "barNumber": "64",
      "description": "L2 at MA in BRCH, but DD, 4 BLB, PS BB, still on 61 B, S2"
    },
    {
      "barNumber": "65",
      "description": "OU, BO MA, COH, but need FT for test OOM. 4400 BRN next MGA. BR want DT 60\nand BLT"
    },
    {
      "barNumber": "66",
      "description": "BLB so FT. 6 CC BLB, MGA OOM and HOD and 60MA, but near top of TRD, NS"
    },
    {
      "barNumber": "67",
      "description": "BBLBC, 7 CC BLB, just below OOM, still BTC, but TR, better to wait for\nbreakout or 2nd signal. Low probability, bad for stop entries.\">BBBR, PS PB here"
    },
    {
      "barNumber": "81",
      "description": "End of Day"
    }
  ],
  "20": [
    {
      "barNumber": "1",
      "description": "TSC. LDW. OU but just below HOY and LLW and 60ma. BP want FT BG after Y DB\nwith Aug 3 L. BR want TR for several days. top of Y TR at RS, B2"
    },
    {
      "barNumber": "2",
      "description": "CCBLB but tails, not big, top of Y TR, not BTC, PS TRO. L2 81 but 6 BWBRB, S2"
    },
    {
      "barNumber": "4",
      "description": "BO HOY, LLW, 60MA, PS MG from Y DB 16 61, MMT is just above OOW. this week is\nOD with BRB and BL want BLB. BBLB so BX, but 8 BWBRB, S2. BTC but tail and big\nbar so might get PB soon. BR want F BO and BX, but need at least MDT"
    },
    {
      "barNumber": "5",
      "description": "H1 but DD, tail on 4, PS SA and then PB. F BO, L2 81 but 9 BWBRB, PP BB, S2.\nBLE4"
    },
    {
      "barNumber": "7",
      "description": "BO, BBLB, 11 BWBRB, extreme streak so BX, P PW 2 4, but need BRB to S. still\nBTC, but extreme BX, BBPB. BLE4"
    },
    {
      "barNumber": "8",
      "description": "PW 2 4, PH, BLE, but 12 BWBRB, PP MRV. might test 60MA and 7 BX L. S2"
    },
    {
      "barNumber": "9",
      "description": "BBRBC so PP BTC after streak of 12 BLB"
    },
    {
      "barNumber": "10",
      "description": "OO, AIL, SPBL, MMT just above. BL want BO OOW for BLB on weekly chart, but PB\nTR soon after BX"
    },
    {
      "barNumber": "11",
      "description": "F BO OO, BLE4, but 2 BLB, SPBL, S2, PS BB. BX on open so increased chance of\nEBL"
    },
    {
      "barNumber": "13",
      "description": "H1 but PS W 7 11, NS"
    },
    {
      "barNumber": "14",
      "description": "W, BX, PH, but TTR, and strong rally so TR more likely than BRT. PP MRV.\nstill SPBL, but BLE and can B again above BLBC"
    },
    {
      "barNumber": "16",
      "description": "H1 but DD, PP SA for 2LSD from W, B2. BRE4"
    },
    {
      "barNumber": "17",
      "description": "H1, but 2 DD after W top so PS SA, B2"
    },
    {
      "barNumber": "18",
      "description": "L1 in PS SPBR, but TR more likely, PP BB around MA and 10 L, NS"
    },
    {
      "barNumber": "20",
      "description": "WBLF 15 17, OB, BLBC, but not quite to MA, middle of TR, NS. PP more TR"
    },
    {
      "barNumber": "21",
      "description": "BLB but small, middle of TR. BR want DTBF 18. not BTC. DT but 2 BLB, PS BB,\nS2"
    },
    {
      "barNumber": "23",
      "description": "H1, AIL, but middle TR, PP MBO"
    },
    {
      "barNumber": "24",
      "description": "OD but TTR just above MA, LOM"
    },
    {
      "barNumber": "81",
      "description": "End of Day"
    }
  ],
  "24": [
    {
      "barNumber": "1",
      "description": "YBX. Y TR for 50 bars and today opened in that TR. BOM. BR want MTR and TRVD\nand BL want TRSU. LH, BBRBC, but bottom of TR so PS BTC, S2"
    },
    {
      "barNumber": "2",
      "description": "H1 in early SPBL 79, but tail, top of TR, LH 74, B2, so far, TRO, LOM"
    },
    {
      "barNumber": "3",
      "description": "H1, CCBLB1C, but top of TR. should go above 73 and maybe 65 for DBR, PL, but\ntop of TR, NS. PS SA, HPW"
    },
    {
      "barNumber": "4",
      "description": "3 CC BLB, but top of TR, NS"
    },
    {
      "barNumber": "6",
      "description": "OU but DD, top of TR, N@, HPW"
    },
    {
      "barNumber": "7",
      "description": "OO, but TR, better to wait for breakout or 2nd signal. Low probability, bad\nfor stop entries.\">BBBR, tails, top of TR, LOM, NS"
    },
    {
      "barNumber": "8",
      "description": "IOI after 7 OO, but BRD, TTR, tails, top of TR Y 24, LOM, NS, HPW"
    },
    {
      "barNumber": "9",
      "description": "BLB, AIL 3, only 1 C below MA, on 8 B, but still in TR and Y TR, NS"
    },
    {
      "barNumber": "10",
      "description": "BO, COH, but only slightly above HOY. OK BTC, but HPW to B 2nd CC BLB since\nPS F BO"
    },
    {
      "barNumber": "11",
      "description": "H1, but BRB. PH, PW 1 7, but TC, NS. BLE. still BDG 7"
    },
    {
      "barNumber": "12",
      "description": "II so MDT and PH for F BO HOY, but BRB. AIL. II late in BLT is PS FF. BLE or\nBLE4. still SPBL so PS BB, S2"
    },
    {
      "barNumber": "13",
      "description": "MDB 11, ledge top so should get new HOD. still BDG 10 so PS MMU. 12 II is PS\nFF"
    },
    {
      "barNumber": "14",
      "description": "ledge, IOI, AIL, but weak BLT, PS FF, NS. still on II S 12"
    },
    {
      "barNumber": "15",
      "description": "6 bar ledge so unusual. BOM. II. still on 12 S but should get above ledge top\ntoday and PP within an hour. L2 12, PH, but NS"
    },
    {
      "barNumber": "17",
      "description": "OO, FF 16 ledge, PH, but tail, still SPBL, NS"
    },
    {
      "barNumber": "18",
      "description": "3 CC BRB, but C above MA and 7 C so still BDG and AIL, SPBL. still on 17 S..\nBOM, OK to be short, but BRE4. BL want BLBC to B"
    },
    {
      "barNumber": "20",
      "description": "H1, IOI, COH, AIL, still BDG 10, but TTR, 3 BRB, still on 17 S, NS, BRE, but\nstill on17 S so can hold short with stop above 17. BOM, HPW"
    },
    {
      "barNumber": "21",
      "description": "CC BLB, AIL, but middle of TTR, still on 17 S, PS LH, NS. BOM"
    },
    {
      "barNumber": "23",
      "description": "LH MTR, still on 17 S, top of TR since Y 23, PH, but TTR 10, NS. still AIL\nand on 20 H1, but BLE4. BOM so P about same for BL and BR, but top of 2 day TR\nso RR better for BR"
    },
    {
      "barNumber": "24",
      "description": "SBD, Closed BDG 7, C below 19, PS MMD"
    },
    {
      "barNumber": "25",
      "description": "CCBBRBC below MA, AIS, SBD, but LBL might BTC and bet on TRD"
    },
    {
      "barNumber": "26",
      "description": "LBLM Bg below 19 and BTC 24 25 so not strong BRT. L1 but BLB, PS BB, NS"
    },
    {
      "barNumber": "27",
      "description": "H2, BRTP 25, PL, BRE, but DD, PS MMD below 19, AIS, B2,"
    },
    {
      "barNumber": "28",
      "description": "L1, MDT, but 2 DD, TTR, NS, PS BB. still on 27 H2, but just below MA, AIS,\nDD, B2"
    },
    {
      "barNumber": "30",
      "description": "L1 at MA, AIS, PS MMD below 19, GXL and LOD MGB, but CC BLB, 6 BBLMC, NS, PS\nBB. BL want SPBL and BO GXH."
    },
    {
      "barNumber": "33",
      "description": "II just below MA, COL, L1, AIS, but PS MBO since TRD. LOD and GXL MGB"
    },
    {
      "barNumber": "37",
      "description": "H2 25, W 19 25, OU, COH, but 4 BRB, just below MA, GXL MGB, 4 BRB, PS PS, NS,\nB2"
    },
    {
      "barNumber": "38",
      "description": "L1, AIS, MGA, but BLD, still on 37 B, NS. AIS so should go LR, PP to GXL,\nunless get strong BO above MA. might get 3LD from 25 BR spike"
    },
    {
      "barNumber": "41",
      "description": "L1 at MA, but 5 BBLMC, PS BB, S2. H1 but at MA and not above, B2 or NWS 37 L"
    },
    {
      "barNumber": "43",
      "description": "BO above MA, COH, PS AIL, but need FT, else DT 30"
    },
    {
      "barNumber": "45",
      "description": "II, BRB, DT 30, bad FT, BLE4. DT 30, but 8 BBLMC, S2"
    },
    {
      "barNumber": "47",
      "description": "ledge bottom, TTR, middle of TRD, HPW"
    },
    {
      "barNumber": "48",
      "description": "H1, ledge top MGA, but middle of TRD, LOM, B2"
    },
    {
      "barNumber": "50",
      "description": "EMA and closing near their highs so probably will go higher and possible Buy\nThe Close\">CCBLBCMA, but small, tail, TRD. should get BO GXH or GXL, and now GXH\nmore likely"
    },
    {
      "barNumber": "51",
      "description": "DT 24 SXH, FF 47 TTRm vyt 4 BWBRB, LPS, PS BB, GXH MGA, S2"
    },
    {
      "barNumber": "53",
      "description": "OU, AIL, GXH MGA, PS MG 50, but top of TRD, NS, HPW"
    },
    {
      "barNumber": "56",
      "description": "OO, top of TRD, but still AIL, GXH MGA,. BLE4"
    },
    {
      "barNumber": "59",
      "description": "DT LHMTR 23, PH, but TC, PP MRV, PS BB since GXH MGA"
    },
    {
      "barNumber": "62",
      "description": "OOOO"
    },
    {
      "barNumber": "63",
      "description": "IB, AIL, GXH MGA, but TTR, top of TRD, PS FF, NS"
    },
    {
      "barNumber": "64",
      "description": "BO, GXH MGA, but small bar, PS F BO above TTR, BPE4"
    },
    {
      "barNumber": "67",
      "description": "F BO TTR 63, PH, but NS. SPBL, PS BB for MMU 50. 50-50 bet, BTW."
    },
    {
      "barNumber": "81",
      "description": "End of Day"
    }
  ],
  "26": [
    {
      "barNumber": "1",
      "description": "5 day rally to 4500 BRN so might stall and get 1 - 3 day PB soon. Most recent\ndays have had a lot of TR PA, even though they were big bull bars on daily\nchart. BBLBC, W 62 70, PL, but just below MA, B2"
    },
    {
      "barNumber": "2",
      "description": "big OD, PS T1BD, but need FT since might be BRTP after 1 BLTP"
    },
    {
      "barNumber": "3",
      "description": "BLB so bad FT, but still might get 2LSD to LOY and 60ma after 2 SBD. H2 but\ntail, B2"
    },
    {
      "barNumber": "4",
      "description": "L1, BRCH, below MA, LOY MGB, but CC BLB, LOM, S2"
    },
    {
      "barNumber": "5",
      "description": "MDB 3 but BRD just below MA, LOM, B2. still on S below 2, but stop above 2.\nHPW"
    },
    {
      "barNumber": "6",
      "description": "BO, C below 3, PS MG, MGB are LOY and 60ma, but need FT, else H3 1 3"
    },
    {
      "barNumber": "7",
      "description": "H3 1 3, PL, BRE, but TC and MGB LOY and 60MA, NS"
    },
    {
      "barNumber": "9",
      "description": "L1 in BRCH, just below MA, but BLB, H3 7, PS BB, S2"
    },
    {
      "barNumber": "11",
      "description": "BO, PS MMD"
    },
    {
      "barNumber": "12",
      "description": "SBDM, BO GXL and LOY and 60ma but big tail so BDUC, might go SW around 60ma"
    },
    {
      "barNumber": "13",
      "description": "BR IB, L1, AIS. either BRT or TR after SBDM 12"
    },
    {
      "barNumber": "15",
      "description": "MDB 12 but 6 BRB, AIS, PP SA"
    },
    {
      "barNumber": "16",
      "description": "L1 but BLD, NS"
    },
    {
      "barNumber": "18",
      "description": "L1 but BLB, PS W 12 17, NS, PS BB"
    },
    {
      "barNumber": "19",
      "description": "tail, LBLM, PP TR soon, BRE. MGA 60ma, which is near 13 H at start of BRCH.\nTR more likely than big BRT and more likely than TRVU"
    },
    {
      "barNumber": "20",
      "description": "18BODF, TR , likely, PL"
    },
    {
      "barNumber": "21",
      "description": "CCBBLC, AIL, 2LSU likely, but TR more likely than BLT after SBDM 12"
    },
    {
      "barNumber": "23",
      "description": "DT 13 at MA and 60MA, BLE, but PP CHU and PP BB and 2LSU, S2. MGB 19 BBSBH.\nshould get 2LSU."
    },
    {
      "barNumber": "25",
      "description": "HL MTR, CHB, but BRB just below 60ma and LOY, tails, PS SA, NS. TR more\nlikely than BLT"
    },
    {
      "barNumber": "26",
      "description": "BLBC, but just below 60ma and LOY and PS top of TR 13, NS, B2, PS SA for test\n19 H of BBSB"
    },
    {
      "barNumber": "27",
      "description": "MDT 23, but TTR 22, PS LOM, S2"
    },
    {
      "barNumber": "28",
      "description": "H2, HL MTR but BRB,BBRB 27, PS SA, MG 19 H so might go LR before HL MTR. AIL,\nbut NWS or B2. BRCH 23 27, but AIL, PP MRV, but might test 19 H"
    },
    {
      "barNumber": "31",
      "description": "SBU, BO DT 13 23, still AIL, but BL need FT for MMU to HOD and PS HOY for\nOUD. BR might STC for F BO"
    },
    {
      "barNumber": "32",
      "description": "H1, AIL, but BRB, PS F BO TR 13, PS SA, B2. F BO, PS top of TR, but 3 BLB, PS\nBB, S2"
    },
    {
      "barNumber": "34",
      "description": "F BO DT 13 23, MDT, 19 H MGB, but 3 DD, PP MRV, NS, S2, PS BB for MMU to HOD\nand PS HOY. BLE4"
    },
    {
      "barNumber": "35",
      "description": "MDB 33, AIL, but TTR, NS, NWS since small BSB. still PS F BO, but S2"
    },
    {
      "barNumber": "37",
      "description": "H1 at MA, AIL, but DD, top of TTR 32, NS, HPW"
    },
    {
      "barNumber": "42",
      "description": "H1, but tail, 4 BRB, 28 H BBSB and 38 HL MGB, B2"
    },
    {
      "barNumber": "43",
      "description": "HL, II but at both MA, middle of TR 23, NS, PP MBO"
    },
    {
      "barNumber": "46",
      "description": "OD, LH, 28 L MGB, but TTR 32, NS, PS BB 42"
    },
    {
      "barNumber": "47",
      "description": "SBD, but bottom of TR 28, PS F BO and HL DB 28, NWS. BL want F BO and H2 42"
    },
    {
      "barNumber": "48",
      "description": "H2 42, 42 L MGA since TR, but PS SA and 2LSD after 47 SBD, NS. MGB 28 L for\nPS DB"
    },
    {
      "barNumber": "51",
      "description": "LH in BR CH 34, but 4 BLB, 46 SX H MGA, PP BB, S2. IB so H1, 46 SX H MGA, but\nat both MA, middle of TR, NS"
    },
    {
      "barNumber": "52",
      "description": "SBD, but more likely PB from 51, S2. Tri 28"
    },
    {
      "barNumber": "53",
      "description": "Tri 28 48, but DD after SBD, NS, B2. FT after 52, but HL, TRI, S2. TRI is BOM"
    },
    {
      "barNumber": "56",
      "description": "EMA. Lower prices likely. Always In Short and Sell The Close bear\ntrend.\">CCBBRBCMA, BO 28 HL, STC, but OO MDB since TR 13. and PS BT for DB LL\nMTR 28"
    },
    {
      "barNumber": "57",
      "description": "W 42 48, LL DB 28, bottom of TR, but BRD after CCBBRBCm B2, PS SA"
    },
    {
      "barNumber": "60",
      "description": "L1 but 3 BLB, bottom of TR, PS BB, S2"
    },
    {
      "barNumber": "62",
      "description": "BL want F BO HST 23 34 51 and LL DB MTR, and BR want PB from 56 BO HST. 5\nBWBRB, but just below MA, so LP B, B2. BLB, 5 BLB, LP S, S2. TTR 57, BOM,"
    },
    {
      "barNumber": "64",
      "description": "CC BRB, but BSSB 62, bottom of TR12, NS, PS BB. TTR 57, LOM. S2. BL need good\nBSB"
    },
    {
      "barNumber": "65",
      "description": "H2 57, but 12 L MGB so NWS or exit below 64 and B if reverses up again\nafterwards. Still BRCH 34, but BLB, S2"
    },
    {
      "barNumber": "66",
      "description": "OD, MGA 12 L and LOD, but NS since PS bottom of TR"
    },
    {
      "barNumber": "67",
      "description": "CC BRB, but tail, bottom of TR, LP STC, S2. HL MTR, but 2 BRB, B2"
    },
    {
      "barNumber": "81",
      "description": "End of Day"
    }
  ],
  "30": [
    {
      "barNumber": "1",
      "description": "2 days left in August so might get 50 point pullback today and tomorrow to\ncreate tail on monthly bar. alternatively, today and tomorrow can stay near the\nhigh of the month and then September gaps up on Wednesday. No need for bulls to\ntry to get big bull day today. Y BX. SGU. BRB but tail below so LRP S, S2, PS BB\ntrying to keep G open."
    },
    {
      "barNumber": "2",
      "description": "H1, PL, but tail, far above MA, SGU, B2. MDT 1 but BLB, PS BB and LOM, S2"
    },
    {
      "barNumber": "3",
      "description": "BBRBm but tail, G still open. BOM, 4 BTTR. 1 is PS HOD, 3 is PS LOD. BB2, SS2"
    },
    {
      "barNumber": "4",
      "description": "H1, G staying open, PL, but TTR, 4 BBRMC, tail NS, PS LOM, B2"
    },
    {
      "barNumber": "5",
      "description": "CCBLB, but tail, C below 1, NS, HPWBL"
    },
    {
      "barNumber": "6",
      "description": "3 CC BLBC, still BTC 5, but small bar. BLE4. HOY still MGB. L2 1 but 3 BLB,\nS2, PP BB"
    },
    {
      "barNumber": "7",
      "description": "FF 4 TTR, but tail, 3 BLB, S2. BLE4"
    },
    {
      "barNumber": "8",
      "description": "H1, but PS W 1 7, NS. L2 1, BLE4, but 6 BBLMC, S2"
    },
    {
      "barNumber": "9",
      "description": "H1, SPBL, but PS W 1 7, NS, BRB, PS SA"
    },
    {
      "barNumber": "11",
      "description": "CCBLBC, but BBLL. SBU so PP at least a little 2LSU likely. 2LT 8, but 3 BLBC,\nS2, PP BB"
    },
    {
      "barNumber": "12",
      "description": "3 CC BLBC, SBU. H1, but BX, NWS. BLE4, S2"
    },
    {
      "barNumber": "13",
      "description": "4 CCBLB, MMT on weekly chart from pandemic low is 4537, MGA.. also, MMU from\n10 BO MGA"
    },
    {
      "barNumber": "14",
      "description": "bigger bar so 2LU from 11, at MMT, but still BTC and weekly MM MGA"
    },
    {
      "barNumber": "16",
      "description": "still BTC but tail so PS PB soon. BLE4, SS2"
    },
    {
      "barNumber": "18",
      "description": "H1, 9 CC BLB, but BX, tails 16 17 18, PP PTG soon, NWS. BLE4, SS2"
    },
    {
      "barNumber": "19",
      "description": "II, PS FF, PS SA, but 9 CC BLB, S2. II late in BX so PS top, BLE, but S2"
    },
    {
      "barNumber": "20",
      "description": "BLB, just below 4537.00 MM on weekly chart, MGA. if gets there, PP PTG around\nthere. BLE4"
    },
    {
      "barNumber": "22",
      "description": "OD, SBD, within 2 ticks of weekly MM G, II FF 19, BX, PH, BLE, but 13 BBLMC,\nS2. PS BB 21 and BTC for scalp, but SBD, B2"
    },
    {
      "barNumber": "23",
      "description": "BR FT, but PP MRD after 13 BBLMC, not STC, but PP SA for 2LSD"
    },
    {
      "barNumber": "24",
      "description": "H1, AIL, MMTA, but 3 BRB, SBD 22, NS. PS SA and LOM. PP TR for next hour"
    },
    {
      "barNumber": "25",
      "description": "BBLBC, still BTC, but NS, PP TR, PS STC for 2LSD after 22 SBD. TR likely"
    },
    {
      "barNumber": "26",
      "description": "LH DT 22, but PB from 25, PP MRV, PS BB and PP below 24 and at MA, NS, PS LOM"
    },
    {
      "barNumber": "27",
      "description": "H1, BL want SPBL, but TR more likely"
    },
    {
      "barNumber": "30",
      "description": "LH, PS MTR, but 2 BLB, TR more likely, S2. PP BB around MA and 24 L"
    },
    {
      "barNumber": "34",
      "description": "SBD, C below 24 and MA, PS MG, but need FT, still AIL, and PS 20GBB and H2\n24, S2"
    },
    {
      "barNumber": "35",
      "description": "CC BRB C beow MA, but not big BRB. PS AIS, but not yet STC, PS H2 24 and\n20GBB, but need BLBC"
    },
    {
      "barNumber": "37",
      "description": "H2 24, but 3 CC C below MA, NWS. might be AIS, but need bigger BRB. TR more\nlikely than BRT"
    },
    {
      "barNumber": "38",
      "description": "C above MA, TR likely, but BR want LH and BRCH. BLB, PP BB, S2"
    },
    {
      "barNumber": "43",
      "description": "LH in BRCH, but TTR 38, just above MA, NS, HPWS2, still AIL and TR more\nlikely"
    },
    {
      "barNumber": "45",
      "description": "W 38 42, LH in BR CH 22, but TC, just above MA, AIL,MGA, BLB PP BB, S2"
    },
    {
      "barNumber": "47",
      "description": "HL at MA in BLCH, but TTR 38, middle of TR 18, NWS, PS SA for small 2LD from\n45 W, HPW"
    },
    {
      "barNumber": "50",
      "description": "IOI above MA, BLB, AIL, MGA< but TTR 39 and in middle of TR 18, might test 36\nL, NWS, HPW"
    },
    {
      "barNumber": "53",
      "description": "LH DT 30, DT LH MTR, but 7 BWBRB, AIL, SPBL 36, MMTA, S2, MRV"
    },
    {
      "barNumber": "55",
      "description": "H1, SPBL, MGA, but just below 30 LH and top of TR 18, BRB, NS, PP MRV, B2, PS\nSA"
    },
    {
      "barNumber": "58",
      "description": "DT LH MTR 30, but DD, just above MA, middle of TTR, NS, S2"
    },
    {
      "barNumber": "59",
      "description": "H1 at MA, no C below MA for 22 bars, AIL, but TTR, 2 BRD, PP MRV"
    },
    {
      "barNumber": "63",
      "description": "EMA and closing near their lows so probably will go lower and possible Sell\nThe Close\">CCBRBCMA, PS AIS, but bottom of TR 18, tail, PS BTC, S2. H2 59, DB,\nand a measured move up\">DBBF 49, but 3 BRB, PS SA, B2. Apex of TTR 18, more LOM"
    },
    {
      "barNumber": "64",
      "description": "H2 59, H2 36, DB 36, AIL, MGA, COH, but TR, better to wait for breakout or\n2nd signal. Low probability, bad for stop entries.\">BBBR, middle of TR 18, so\nLP, NS"
    },
    {
      "barNumber": "66",
      "description": "DTBF 61, but CCBLBC 65, AIL,more likely BB for PB from 65 than REVD from DT,\nS2"
    },
    {
      "barNumber": "67",
      "description": "HH DT 61 but 4 BLB, AIL, PP BB, S2. near top of TR 18 tail, not strong BTC,\neven though weekly MMTA"
    },
    {
      "barNumber": "81",
      "description": "End of Day"
    }
  ]
}